{
    "status": "ok",
    "total_articles": 167,
    "articles": [
        {
            "published_date": "2025-01-22T23:54:00",
            "title": "Here is Sen. Chuck Grassley's full response to Trump pardons of January 6th attackers",
            "author": "",
            "url": "https://www.dakotanewsnow.com/video/2025/01/22/here-is-sen-chuck-grassleys-full-response-trump-pardons-january-6th-attackers",
            "url_media": "https://gray-ksfy-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F01-22-2025%2Ft_0f0fbfbfe07245c4a8feae5d63a44a9e_name_file_1280x720_2000_v3_1_.jpg?auth=d232cb8956531e9b1e6185148c2d83bc83d1174bfba54cd4ff93a9a6c78f13a5&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Winter weather is still impacting flights at the Myrtle Beach International Airport. Heavy snow and sleet has led to snow covered roads and impressive snow totals in the area. A local organization is working to make existing properties safer and healthier. Viewers submitted photos of their snow day by the hundreds."
        },
        {
            "published_date": "2025-01-22T23:50:18",
            "title": "A liveable planet must remain on the agenda",
            "author": "Siddharth Sharma",
            "url": "https://www.livemint.com/budget/expectations/liveable-planet-budget-2025-clean-energy-research-vulnerable-population-climate-change-health-gdp-un-cop29-11737398431164.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/01/20/1600x900/Image_2_1736501492179_1737398574975.jpg",
            "country": "IN",
            "language": "en",
            "summary": "There are climate and health crises in India. Half of India's population are highly vulnerable to the health effects of climate change. The World Health Organization's emphasis on embedding health into conversations at UN COP29 was an encouraging step forward. The upcoming budget presents an opportunity to spearhead the focus on climate action and health equity."
        },
        {
            "published_date": "2025-01-22T23:35:53",
            "title": "Vermont sees warmest year on record in 2024",
            "author": "Jordan Barbour",
            "url": "https://www.yahoo.com/news/vermont-sees-warmest-record-2024-233553981.html",
            "url_media": "https://media.zenfs.com/en/wfff_burlington_articles_537/a546612236302cd16c6f4db2db5fe05f",
            "country": "US",
            "language": "en",
            "summary": "The mean temperature for 2024 was 50.9 degrees, making it Burlington's warmest year on record. Eight of the top 10 warmest years have occurred since 1998. Bolton Valley has had to increase the number of snow guns and pumps to keep up with the snowfall this winter."
        },
        {
            "published_date": "2025-01-22T23:25:31",
            "title": "Weather agency on why country will experience low rainfall next quarter",
            "author": "Michel Nkurunziza",
            "url": "https://www.newtimes.co.rw/article/23468/news/environment/weather-agency-on-why-country-will-experience-low-rainfall-next-quarter",
            "url_media": "https://www.newtimes.co.rw/thenewtimes/uploads/images/2025/01/23/68914.jpg",
            "country": "RW",
            "language": "en",
            "summary": "Rainfall from March to May in 2025 in Rwanda is expected to be slightly below the levels observed in the same period in previous years. La Niña in the Pacific Ocean and neutral conditions in the Indian Ocean Dipole (IOD) are the main factors behind low rainfall. The weather agency advised public institutions, NGOs, the private sector and the general public to use the seasonal forecast in their planning and decision-making."
        },
        {
            "published_date": "2025-01-22T23:18:00",
            "title": "Dutton signals a Coalition would not pull Australia from Paris Climate Accords",
            "author": "Joseph Olbrycht-Palmer",
            "url": "https://www.news.com.au/breaking-news/dutton-signals-a-coalition-would-not-pull-australia-from-paris-climate-accords/news-story/8bfeeeec9c7e525cd3af9b4c049080ab",
            "url_media": "https://content.api.news/v3/images/bin/64f32d40c02a1767a3968f2e2de1ac5e",
            "country": "AU",
            "language": "en",
            "summary": "Peter Dutton says Australia will not follow Donald Trump in withdrawing from the Paris Climate Accords despite internal pressure to do so. Mr Dutton believes honouring Australia's commitments under the Paris Agreement is important for the country's economic future. He also supports the Coalition's plan to add nuclear energy to Australia's power grid."
        },
        {
            "published_date": "2025-01-22T22:47:02",
            "title": "La Niña Could Arrive In January 2025 to Lower Global Temperatures ⋆ The Costa Rica News",
            "author": "Tcrn Staff",
            "url": "https://thecostaricanews.com/la-nina-could-arrive-in-january-2025-to-lower-global-temperatures",
            "url_media": "https://thecostaricanews.com/wp-content/uploads/2025/01/portadaclima.jpg",
            "country": "CR",
            "language": "en",
            "summary": "2024 was the hottest year in history. The global average temperature was 0.13°C warmer than the previous record, corresponding to 2016. There is a 60% chance that La Niña will occur at the end of December or January 2025 and that it will persist until March of the same year. The last ten years have been the warmest on record and sea temperatures are rising."
        },
        {
            "published_date": "2025-01-22T22:43:15",
            "title": "Permafrost Thaw and Wildfires Are Raising CO2 Emissions in Arctic Tundras",
            "author": "",
            "url": "https://www.discovermagazine.com/environment/permafrost-thaw-and-wildfires-are-raising-co2-emissions-in-arctic-tundras",
            "url_media": "https://images.ctfassets.net/cnu0m8re1exe/3LZDf060V4dQi4RKYsvYDZ/2d15ee1d93fcae2399c18d4952ef70ff/alaska-tundra.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a shift in the flow of carbon in the Arctic-boreal zone (ABZ) from 1990 to 2020. 34% of the ABZ is now a source of carbon to the atmosphere, and this percentage goes up to 40% when considering emissions from wildfires. Siberia will be a crucial area to watch as it stores more than half of the permafrost region's carbon stocks and is warming."
        },
        {
            "published_date": "2025-01-22T22:30:57",
            "title": "Climate change and AI dominate World Economic Forum",
            "author": "Finance",
            "url": "https://article.wn.com/view/2025/01/22/Climate_change_and_AI_dominate_World_Economic_Forum",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "The U.N. chief ratcheted up his warning about climate change and said the world's thirst is getting worse. He said: \"There is no solution to climate change. There is no end to the problem. There's no cure for the problem.\""
        },
        {
            "published_date": "2025-01-22T22:00:57",
            "title": "Climate Minute. Volcanic Eruption Immediate and Massive Effect",
            "author": "Lawyer Lisa",
            "url": "https://lawyerlisa.substack.com/p/climate-minute-volcanic-eruption",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7bb04210-d15d-46b0-a928-00858aa011e9_800x376.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The Zavaritskii volcano on the uninhabited island of Simushir erupted in 1831, leading to a global cooling of approximately 1degC. The eruption caused famines and crop failures around the world, almost 200 years ago. Scientists need to consider how to coordinate an international response when the next large eruption happens."
        },
        {
            "published_date": "2025-01-22T21:19:40",
            "title": "Birds and climate change: Are Scrub Jays the ultimate survivor?",
            "author": "Justine Frederiksen",
            "url": "https://www.ukiahdailyjournal.com/2025/01/22/birds-and-climate-change-are-scrub-jays-the-ultimate-survivor",
            "url_media": "https://www.ukiahdailyjournal.com/wp-content/uploads/2025/01/BIRDSCLIMATE.jpg?w=1024&h=698",
            "country": "US",
            "language": "en",
            "summary": "Birds are moving north due to climate change. Steve Hampton grew up in Southern California and spent 30 years in Davis before moving to the Pacific Northwest. California Scrub Jays moved to Port Townsend the same year as he did. The Pacific Northwest is gaining numbers of birds, but the deserts are losing them."
        },
        {
            "published_date": "2025-01-22T21:16:28",
            "title": "Brisbane news live: LNP government to hand down appraisal of the budget",
            "author": "",
            "url": "https://www.watoday.com.au/national/queensland/brisbane-news-live-lnp-government-to-hand-down-appraisal-of-the-budget-20250122-p5l6f7.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.8300600325600325%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_258%2C$y_246/t_crop_custom/q_86%2Cf_auto/t_watoday_live_no_age_social_wm/b9eddc9e7831daef7dc3fb6203113bfbb6d316f4",
            "country": "AU",
            "language": "en",
            "summary": "46 per cent of voters expect their real wages to fall this year. Drinking water providers call for a ban on 'forever chemicals' in Australian consumer goods. Donald Trump's executive orders have been met with lawsuits across multiple states and left migrants in limbo at the Mexican border. The former home of prominent Jewish Australian Executive Council of Australian Jewry co-chief executive Alex Ryvchin was targeted in a firebombing. Nine people were arrested after a spate of antisemitic attacks in Sydney's Jewish community. Qantas has unveiled a suite of changes to its loyalty program that will increase the points earned on flights and raise the points needed for seat redemptions and upgrades."
        },
        {
            "published_date": "2025-01-22T20:55:23",
            "title": "Notice of Race update for Gulf of Mexico?",
            "author": "Editor",
            "url": "https://www.sailingscuttlebutt.com/2025/01/22/notice-of-race-update-for-gulf-of-mexico",
            "url_media": "https://www.sailingscuttlebutt.com/wp-content/uploads/2025/01/2025-01-22_12-47-31.jpg",
            "country": "US",
            "language": "en",
            "summary": "On his first day in office, President Trump signed an executive order to change the name of the Gulf of Mexico to the 'Gulf of America' on official maps. The legislation supporting the renaming is expected to be submitted by January 23, 2025. The name change is theoretically possible, but it cannot be made unilaterally."
        },
        {
            "published_date": "2025-01-22T20:53:41",
            "title": "Restricted Fire Season For Taranaki District",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/01/22/Restricted_Fire_Season_For_Taranaki_District",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "This restricted fire season, anyone wanting to light an open-air fire will have to apply for a permit. You can apply for the permit at www.checkitsalright.org.nz. It's free and easy to apply on the website. "
        },
        {
            "published_date": "2025-01-22T20:41:52",
            "title": "Icy conditions shut down Folly Beach bridges, officials work to reopen them soon",
            "author": "Ian Kayanja",
            "url": "https://abcnews4.com/news/local/icy-conditions-shut-down-folly-beach-bridges-officials-work-to-reopen-them-soon-01-22-2025-wciv-abc-news-4",
            "url_media": "https://abcnews4.com/resources/media2/16x9/801/986/0x103/90/b78b070c-82c5-423b-b673-71b277774c92-fbed604888c745af8f86afee09ec1059.jpg",
            "country": "US",
            "language": "en",
            "summary": "The bridges leading on and off Folly Beach are shut down due to icy conditions. The public safety department is working with Charleston County to have the bridges reopened as soon as possible. The slush and ice are now frozen solid due to the cold temperatures outside."
        },
        {
            "published_date": "2025-01-22T20:22:00",
            "title": "Restricted Fire Season For Taranaki District",
            "author": "New Zealand Government",
            "url": "https://www.scoop.co.nz/stories/AK2501/S00461/restricted-fire-season-for-taranaki-district.htm",
            "url_media": "http://img.scoop.co.nz/stories/images/1908/scoop_image.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "All of the Taranaki District has moved to a restricted fire season as of 9am Thursday 23 January, until further notice. Anyone wanting to light an open-air fire will have to apply for a permit. The continued warm and dry weather has seen the fire danger increase across the District."
        },
        {
            "published_date": "2025-01-22T20:05:52",
            "title": "Minnesota's extreme weather year again fueled by record ocean temperatures",
            "author": "Greg Stanley",
            "url": "https://www.startribune.com/minnesotas-extreme-weather-year-again-fueled-by-record-ocean-temperatures/601209429",
            "url_media": "https://arc.stimg.co/startribunemedia/ZEOYWD446ZFI3N2WQ6SVTAJVOU.JPG?&w=1200&ar=1.91:1&fit=crop",
            "country": "US",
            "language": "en",
            "summary": "The world's oceans set a new heat record in 2024, according to a study published this month from an international team of scientists. The Pacific Ocean is especially important to Minnesota because it transfers heat and humidity to the atmosphere. The climate of 2024 was one of extremes with thawed lakes and no snow across the state during the warmest January to February stretch in more than 130 years of recorded data."
        },
        {
            "published_date": "2025-01-22T19:53:00",
            "title": "Leicester Library temporarily closed due to frozen pipes",
            "author": "FOX Carolina News Staff",
            "url": "https://www.foxcarolina.com/2025/01/22/leicester-library-temporarily-closed-due-frozen-pipes",
            "url_media": "https://gray-whns-prod.gtv-cdn.com/resizer/v2/XTF276NONRD7JA7VU2CQKW4FAA.png?auth=1191d5d9d861ec81c801a353acc9729eab1b6f9c71ba2ebdeaa7d98a1a5c9287&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Leicester Library in Buncombe county is closed due to frozen and burst pipes. There is no word on when the library will re-open at this time. Stay with FOX Carolina as we work to learn more details about the library's closure.   "
        },
        {
            "published_date": "2025-01-22T19:52:13",
            "title": "Residents of Kessewokan Urge Government to Prioritize Sea Defense Amid Rising Tides",
            "author": "News Ghana",
            "url": "https://newsghana.com.gh/residents-of-kessewokan-urge-government-to-prioritize-sea-defense-amid-rising-tides",
            "url_media": "https://newsghana.com.gh/wp-content/uploads/2025/01/WhatsApp-Image-2025-01-21-at-22.30.24.jpeg",
            "country": "GH",
            "language": "en",
            "summary": "The long-awaited sea defense project, stretching from Aboadze to Shama, remains unfinished. It has left Kessewokan, a suburb of Abuesi in the Shama District, vulnerable to high tides and coastal erosion. The situation has already caused significant damage, with at least 15 homes affected by the encroaching sea. The rising tides have claimed three lives and many residents are now left homeless."
        },
        {
            "published_date": "2025-01-22T19:35:48",
            "title": "U.S. WITHDRAWS FROM PARIS CLIMATE AGREEMENT AND REMOVES ALL CLIMATE CHANGE REFERENCES FROM FEDERAL WEBSITES",
            "author": "Henri Migala",
            "url": "https://www.eastcountymagazine.org/us-withdraws-paris-climate-agreement-%E2%80%93-again",
            "url_media": "https://www.eastcountymagazine.org/sites/eastcountymagazine.org/files/favicon_0.ico",
            "country": "US",
            "language": "en",
            "summary": "On January 20, President Trump ordered the U.S. to withdraw from the Paris Climate Agreement for the second time. Iran, Libya and Yemen are the only countries which have not ratified the 2015 Paris Climate. The agreement holds countries accountable to reduce global greenhouse gas emissions in an effort to limit the global temperature increase in this century to 2 degrees Celsius above preindustrial levels. It entered into force on 4 November 2016. President Obama signed the Paris Agreement in 2016, committing the US to reduce emissions by 26-28% below 2005 levels by 2025. The formal withdrawal process took effect in November 2020. President Biden notified the UN of the US' intent to rejoin the Agreement on February 19"
        },
        {
            "published_date": "2025-01-22T19:35:00",
            "title": "Threat of floods in Gal Oya valley",
            "author": "malinga",
            "url": "https://www.dailynews.lk/2025/01/23/local/709488/threat-of-floods-in-gal-oya-valley",
            "url_media": "https://www.dailynews.lk/wp-content/uploads/2025/01/4-1-9.jpg",
            "country": "LK",
            "language": "en",
            "summary": "The water level of the Senanayake Samudra in Inginiyagala, Ampara and Moneragala has risen to 109.20 ft. (754,000 acre ft) against the total capacity of 110 ft (770,000 acres ft). There is a high possibility of floods in the low-lying areas of the Gal Oya valley situated in Addalaichenai, Akkaraipattu, AmPara, Damana, Eragama, Alayadivembu, Nintavur, Karaitivu and Sammanthurai DS Divisions. Flood warning has been issued by Irrigation Director L."
        },
        {
            "published_date": "2025-01-22T19:33:23",
            "title": "Snow in Florida! When was the last time it snowed in Brevard? Could it happen this year?",
            "author": "Michelle Spitzer",
            "url": "https://www.floridatoday.com/story/news/local/2025/01/22/snowing-in-brevard-not-this-week-happened-heres-when-flurries/77875376007",
            "url_media": "https://www.floridatoday.com/gcdn/presto/2021/01/15/PBRE/fdef99fb-47c7-4b0c-b372-b75891ebacf7-Snow_Flurries.jpg?crop=2442,1374,x0,y0&width=2442&height=1374&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "An Arctic blast blanketed the area this week dropping more than 7 inches of snow in the Panhandle. It hasn't snowed in Brevard County since 1977. Even colder temperatures are expected late this week, but a warming trend begins Sunday into next week."
        },
        {
            "published_date": "2025-01-22T19:21:31",
            "title": "Rita Ora Shows Off Body in Skimpy Green Bikini on Vacation in Australia",
            "author": "TMZ",
            "url": "https://www.latestnigeriannews.com/p/4064427/rita-ora-shows-off-body-in-skimpy-green-bikini-on-vacation-in-australia.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Rita Ora is in Australia to escape the cold winter. She's on the Gold Coast and she's showing off her bikini body.      ...  .   in the video below. The British pop singer and actor is in the Southern Hemisphere. "
        },
        {
            "published_date": "2025-01-22T19:14:53",
            "title": "Low temperatures continue in Central Mississippi",
            "author": "Barbara Gauntt",
            "url": "https://www.clarionledger.com/picture-gallery/news/2025/01/22/frigid-temperatures-continue-in-mississippi/77877732007",
            "url_media": "https://www.clarionledger.com/gcdn/authoring/authoring-images/2025/01/22/PJAM/77878138007-tcl-weather-01.jpg?crop=1693,952,x0,y1155&width=1693&height=952&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "Frigid temperatures continued Wednesday after a cold front moved into Central and South Mississippi on Tuesday. A fountain in Strawberry Patch Park in Madison, Miss., continues to flow Wednesday, Jan. 22, 2025, dripping over chunks of ice that have formed during recent below-freezing temperatures."
        },
        {
            "published_date": "2025-01-22T19:00:00",
            "title": "Greener remedies: Innovations that could help the healthcare system shrink its carbon footprint",
            "author": "Caitlin Stall-Paquet",
            "url": "https://www.thestar.com/business/greener-remedies-innovations-that-could-help-the-healthcare-system-shrink-its-carbon-footprint/article_2fe5d2cc-d75a-11ef-8d5b-779baf6171ab.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/e4/de456a57-7687-594f-b5b0-d15dab6a5497/67913a1bd5e88.image.jpg?crop=1661%2C872%2C3%2C0&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "If global healthcare were a country, it would be the fifth largest greenhouse gas emitter in the world, according to the Canadian Medical Association. The sector's presumed focus on good health might not be the first thing that comes to mind when people think of climate change."
        },
        {
            "published_date": "2025-01-22T18:55:00",
            "title": "Davos 2025: Trade, tariffs, AI and UN chief Guterres dominate World Economic Forum agenda",
            "author": "JAMEY KEATEN",
            "url": "https://www.pinalcentral.com/business_and_technology/davos-2025-trade-tariffs-ai-and-un-chief-guterres-dominate-world-economic-forum-agenda/article_4d4262c2-680f-5d2b-96f6-4b2443452296.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/pinalcentral.com/content/tncms/assets/v3/editorial/d/aa/daabf618-481a-5e7f-b2ce-2e389ae8b8ee/67916ea96ed78.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "António Guterres ratchets up his warning about climate change. He also calls for greater attention to the risks posed by artificial intelligence if its ascent goes ungoverned. Some leaders have played up its promise.      ."
        },
        {
            "published_date": "2025-01-22T18:23:48",
            "title": "Weather update: Environment Canada warns of snow squalls for Sudbury area",
            "author": "Star Staff",
            "url": "https://www.saultstar.com/news/local-news/weather-update-environment-canada-warns-of-snow-squalls-for-sudbury-area",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2024/12/LFP20210128MH007_82352568-scaled-e1643403523318-1.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The Greater Sudbury area remains under a snow squall warning. People can expect heavy lake effect snow with accumulations of 20 to 30 cm and reduced visibility in heavy snow and local blowing snow. Travel is expected to be hazardous due to reduced visibility. People should continue to monitor alerts and forecasts issued by Environment Canada."
        },
        {
            "published_date": "2025-01-22T18:17:50",
            "title": "We are releasing the monsters",
            "author": "Barry Saxifrage",
            "url": "https://www.nationalobserver.com/2025/01/28/analysis/megafires-weather-California",
            "url_media": "https://www.nationalobserver.com/sites/default/files/img/2025/01/22/ca-wildfires-2024-topjpg.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Global warming is increasing the number of megafires in California. The January 2025 firestorm involved more than 30 fires burning across the Los Angeles region. The two biggest and most destructive were the Eaton and Palisades fires. They destroyed homes, businesses, schools, churches and nearly everything else in their path."
        },
        {
            "published_date": "2025-01-22T18:09:13",
            "title": "Our Better Nature: Where's Global Warming When You Need It?",
            "author": "Paul Hetzler",
            "url": "https://www.saturdayeveningpost.com/2025/01/our-better-nature-wheres-global-warming-when-you-need-it",
            "url_media": "https://www.saturdayeveningpost.com/wp-content/uploads/satevepost/thermometer-shutterstock_2413567227.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to a 2019 Gallup poll, fewer than six percent of American adults have a good understanding of world geography. The U.S. comprises less than two percent of the surface of Planet Earth. Most people don't think about the scale of our planet. Gall-Peters Projection is soon to be the world standard."
        },
        {
            "published_date": "2025-01-22T18:00:00",
            "title": "‘Like nothing you've ever seen': Perth Australia Day skyshow ramps up as ‘public appetite' for event returns",
            "author": "Claire Ottaviano",
            "url": "https://www.smh.com.au/national/western-australia/like-nothing-you-ve-ever-seen-perth-australia-day-skyshow-ramps-up-as-public-appetite-for-event-returns-20250122-p5l6ic.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.467%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_70%2C$y_0/t_crop_custom/q_62%2Cf_auto/500bf492f5ec09aede1a6f18260c47747c2697c7",
            "country": "AU",
            "language": "en",
            "summary": "Two tonnes of fireworks are being loaded onto nine barges on the Swan River in preparation for this year's Australia Day Perth skyshow. More than 100,000 people are expected to line more than one kilometre of foreshore from Langley Park for the annual half-hour fireworks and drone show on January 26."
        },
        {
            "published_date": "2025-01-22T18:00:00",
            "title": "‘Like nothing you've ever seen': Perth Australia Day skyshow ramps up as ‘public appetite' for event returns",
            "author": "Claire Ottaviano",
            "url": "https://www.theage.com.au/national/western-australia/like-nothing-you-ve-ever-seen-perth-australia-day-skyshow-ramps-up-as-public-appetite-for-event-returns-20250122-p5l6ic.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.467%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_70%2C$y_0/t_crop_custom/q_62%2Cf_auto/500bf492f5ec09aede1a6f18260c47747c2697c7",
            "country": "AU",
            "language": "en",
            "summary": "Two tonnes of fireworks are being loaded onto nine barges on the Swan River in preparation for this year's Australia Day Perth skyshow. More than 100,000 people are expected to line more than one kilometre of foreshore from Langley Park for the annual half-hour fireworks and drone show on January 26."
        },
        {
            "published_date": "2025-01-22T18:00:00",
            "title": "Reader letter: I'm tired of climate change lecturers",
            "author": "Reader letter",
            "url": "https://www.thetelegraphandargus.co.uk/news/ilkleynews/24876803.reader-letter-tired-climate-change-lecturers",
            "url_media": "https://www.thetelegraphandargus.co.uk/resources/images/19001925.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Bob Connell didn't address the main point of SIR's letter about climate change. SIR is tired of people who fly around in planes, have kids and drive cars, telling him not to eat meat and criticising climate deniers. If you believe in the climate catastrophe, just stop contributing to it."
        },
        {
            "published_date": "2025-01-22T17:44:03",
            "title": "2 people are killed in a knife attack in Germany. Scholz says there must be consequences",
            "author": "The Associated Press",
            "url": "https://regina.ctvnews.ca/world/article/2-people-are-killed-in-a-knife-attack-in-germany-scholz-says-there-must-be-consequences",
            "url_media": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fstatic.themebuilder.aws.arc.pub%2Fbellmediainc%2F1730923620854.svg?auth=f1cf09be30d79f3fc423ee797e5d40ba62b742439525848fa3215fac178a9980&width=1200",
            "country": "CA",
            "language": "en",
            "summary": "Some parts of Canada are under severe weather alerts. Trump is withdrawing the U.S. from the Paris climate agreement again. The weather in Canada is very cold and blizzards are very dangerous. The temperature is expected to drop to minus 20 degrees Celsius."
        },
        {
            "published_date": "2025-01-22T17:40:46",
            "title": "Global Warming? Well, Weather Isn't Climate, But...",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/global-warming-well-weather-isnt",
            "url_media": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fenergysecurityfreedom.substack.com%2Fapi%2Fv1%2Fpost_preview%2F155454853%2Ftwitter.jpg%3Fversion%3D4",
            "country": "US",
            "language": "en",
            "summary": " high temperature records and call it global warming at the drop of a hat. The graphic says it all in response to those who like to throw out high temperatures records and say it's global warming is not true. It's not. It is not real. "
        },
        {
            "published_date": "2025-01-22T17:33:29",
            "title": "Bell Let's Talk Day: Focus on youth mental health, eastern Ontario hubs responding",
            "author": "Toula Mazloum",
            "url": "https://barrie.ctvnews.ca/ottawa/article/bell-lets-talk-day-focus-on-youth-mental-health-eastern-ontario-hubs-responding",
            "url_media": "https://www.ctvnews.ca/resizer/v2/VPAM7MO22BFDNHEZKFPRTHWPQU.jpg?smart=true&auth=8e21f557fae0ec719ee5ce9315047fad1359b62e04eaed56ea24fd346fc3eb0b&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": "Some parts of Canada are under severe weather alerts. Trump is withdrawing the U.S. from the Paris climate agreement again. The weather in Canada is very cold and blizzards are very dangerous. The temperature is expected to drop to minus 20 degrees Celsius."
        },
        {
            "published_date": "2025-01-22T17:30:02",
            "title": "If the US government will be obstructionist on climate agreements, it's better they step out of global for",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/01/22/If_the_US_government_will_be_obstructionist_on_climate_agree",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "David G. Victor, professor at UC San Diego, explains 'global warming gridlock' and highlights solutions to the problem. He suggests solutions such as using more renewable energy sources.  .    \"Global warming\" is a term used to refer to the phenomenon of global warming."
        },
        {
            "published_date": "2025-01-22T17:21:40",
            "title": "2024 weather another year for the heat record books",
            "author": "Daniel Bezte",
            "url": "https://www.manitobacooperator.ca/weather/2024-weather-another-year-for-the-heat-record-books",
            "url_media": "https://static.manitobacooperator.ca/wp-content/uploads/2025/01/22105445/69986_web1_processed-D6DD4738-4B55-42A3-95B5-9FC877863F6A.jpeg",
            "country": "CA",
            "language": "en",
            "summary": "2014 was the warmest year on record globally, surpassing the previous record set one year earlier. It was the first year with an average temperature that exceeded the 1.5 degree Celsius threshold set by the Paris Agreement. The earth had record-breaking heat for 14 straight months from June 2023 to July 2024. In the Arctic, the minimum sea ice coverage was the sixth-lowest on record. The summer period saw record precipitation across the region. In South America, Brazil saw some of its worst drought and flood in 2024."
        },
        {
            "published_date": "2025-01-22T17:16:50",
            "title": "Awe at Nature Phenomenon Captured on Side of the Road: 'Had To Pull Over'",
            "author": "Soo Kim",
            "url": "https://www.newsweek.com/natural-phenomenon-birds-starlings-murmuration-2019031",
            "url_media": "https://d.newsweek.com/en/full/2570815/man-holding-phone-towards-sky-road.jpg",
            "country": "US",
            "language": "en",
            "summary": "A video of a murmuration of starlings has been viewed over 810,000 times on TikTok. The clip was shared by user Curtis Bicknell on January 17 and has received a lot of views. The murmuration is a phenomenon that has intrigued scientists and bird-watchers alike."
        },
        {
            "published_date": "2025-01-22T17:16:00",
            "title": "Trump signs order to pull U.S. out of Paris climate agreement",
            "author": "",
            "url": "https://www.koamnewsnow.com/news/national-news/trump-signs-order-to-pull-u-s-out-of-paris-climate-agreement/video_d94781a5-d900-5556-a658-2f90b7d9ba8c.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/koamnewsnow.com/content/tncms/assets/v3/editorial/d/94/d94781a5-d900-5556-a658-2f90b7d9ba8c/67912b8b9410a.image.jpg?crop=1920%2C1008%2C0%2C35&resize=438%2C230&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The international community is reacting to President Donald Trump's reversing U.S. policy on climate change. CNN's Bill Weir explains how the world reacts to the change in policy and what it means for the United States and the rest of the world.   "
        },
        {
            "published_date": "2025-01-22T17:13:09",
            "title": "AP Business SummaryBrief at 12:13 p.m. EST",
            "author": "Wendy Fry",
            "url": "https://www.eagletribune.com/region/ap-business-summarybrief-at-12-13-p-m-est/article_25e453d9-d6dc-5eec-92d0-a8a43ba3e744.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/eagletribune.com/content/tncms/custom/image/ae213140-df8c-11e7-b06d-b798580d75a5.jpg?resize=600%2C333",
            "country": "US",
            "language": "en",
            "summary": "António Guterres is speaking at the World Economic Forum's annual event in Davos. He ratchets up his warning about climate change and warns of the threat of \"ungoverned\" AI. He also mentions economic growth potential in China and Russia and artificial intelligence."
        },
        {
            "published_date": "2025-01-22T17:10:16",
            "title": "Winter weather in the Cape Fear is changing school schedules",
            "author": "Wway News",
            "url": "https://www.wwaytv3.com/winter-weather-in-the-cape-fear-is-changing-school-schedules",
            "url_media": "https://www.wwaytv3.com/content/uploads/2025/01/c/u/snow.jpg",
            "country": "US",
            "language": "en",
            "summary": "Bladen County Schools will move online for Thursday due to widespread hazardous road conditions. Pender County Schools are also moving online. New Hanover County schools will be closed Thursday. Calvary Christian School will have a two hour delay on Thursday. Cape Fear Academy is closed. UNCW classes are canceled through Thursday. Campus dining options will be open Wednesday and Thursday."
        },
        {
            "published_date": "2025-01-22T17:04:58",
            "title": "Uganda: Central Banks Intensify Efforts to Integrate Climate Considerations Into Monetary Policy.",
            "author": "All Africa",
            "url": "https://article.wn.com/view/2025/01/22/Uganda_Central_Banks_Intensify_Efforts_to_Integrate_Climate_",
            "url_media": "https://i.ytimg.com/vi/PEWWDS98O3Y/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "As the effects of climate change become more pronounced, central banks around the world are intensifying their efforts to integrate climate considerations into their monetary policy frameworks. The world's central banks are working to incorporate climate change into their policy framework to reduce interest rates on carbon emissions."
        },
        {
            "published_date": "2025-01-22T17:00:00",
            "title": "Trump saw off Trudeau",
            "author": "David Flint",
            "url": "https://www.spectator.com.au/2025/01/trump-saw-off-trudeau",
            "url_media": "https://www.spectator.com.au/wp-content/uploads/2025/01/flint-25-jan_post.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Albanese-Bowen climate plan is a suicide note for the Australian nation. Let's hope he sees off Albanese government.    If there is one reason to vote out Albanese, this is it.  It is replacing cheap and dependable electricity with expensive and unreliable substitutes."
        },
        {
            "published_date": "2025-01-22T16:54:45",
            "title": "The Horrific and Wonderful 2024",
            "author": "Carma Henry",
            "url": "https://thewestsidegazette.com/the-horrific-and-wonderful-2024",
            "url_media": "https://thewestsidegazette.com/wp-content/uploads/2024/08/OBeyond-Refuge-HoustonChris-hedshot.jpg",
            "country": "US",
            "language": "en",
            "summary": "2024 was the hottest year on record and the first year to average more than 1.5 degrees Celsius over the pre-industrial average. The last 10 years have been the hottest 10 years on record. There are currently 56 active conflicts, the most since the end of the Second World War. Violence costs the world $19.1 trillion a year. UNICEF identified 307 million people in need of aid in 2025. The appeal for funding was 1.2%."
        },
        {
            "published_date": "2025-01-22T16:44:00",
            "title": "Shallow fog likely in AP & Yanam in next 3 days: Met",
            "author": "South",
            "url": "https://uniindia.com/~/shallow-fog-likely-in-ap-yanam-in-next-3-days-met/States/news/3373166.html",
            "url_media": "http://www.uniindia.com/cms/gall_content/LargePhoto//2025/1/2025_1$LargePhoto22_Jan_2025_22012025164708.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Shallow fog is likely to occur at isolated places in Coastal Andhra Pradesh & Yanam and Rayalaseema during the next three days. The lowest minimum temperature of 13 degrees Celsius was recorded at Arogyavaram on the intervening night of Tuesday and Wednesday."
        },
        {
            "published_date": "2025-01-22T16:41:39",
            "title": "At Davos, Guterres slams backsliding on climate commitments",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/at-davos-guterres-slams-backsliding-on-climate-commitments-973c1c75be9eac337b2dd6dce78be03ac84205c1",
            "url_media": "https://static.globalissues.org/globalissues.png",
            "country": "FR",
            "language": "en",
            "summary": "Mr. Guterres was speaking at the annual meeting of the World Economic Forum in the Swiss Alps. He took aim at the theme of this year's meeting, Collaboration for the Intelligent Age. He pointed to the climate crisis, the \"ungoverned expansion\" of Artificial Intelligence and fossil fuel addiction."
        },
        {
            "published_date": "2025-01-22T16:26:29",
            "title": "Odisha Govt Inks 3 MoUs for Climate Resilience, Sustainable Development",
            "author": "Yajati Keshari Rout",
            "url": "https://pragativadi.com/odisha-govt-inks-3-mous-for-climate-resilience-sustainable-development",
            "url_media": "https://pragativadi.com/core/uploads/2025/01/WhatsApp-Image-2025-01-22-at-7.13.46-PM-1.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Odisha Forest, Environment, and Climate Change Department has signed three significant agreements to enhance the state's climate resilience and sustainable development efforts. The department has entered into a Memorandum of Understanding (MoU) with IIT Bhubaneswar under the Enhancing Climate Resilience of India's Coastal Communities (ECRICC) project. The collaboration focuses on restoring critical coastal ecosystems, including seagrass beds and salt marshes. It also inked a Letter of Understanding with the World Food Programme (WFP) for a regional adaptation project between India and Sri Lanka. It aims to strengthen the resilience of vulnerable farming communities."
        },
        {
            "published_date": "2025-01-22T16:10:52",
            "title": "Hampton's historic Aberdeen Gardens neighborhood to address flooding with $20M grant",
            "author": "Daily Press",
            "url": "https://article.wn.com/view/2025/01/22/Hampton_s_historic_Aberdeen_Gardens_neighborhood_to_address_",
            "url_media": "https://i.ytimg.com/vi/xbdppypjKJQ/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Aberdeen Gardens resident Shelton Tucker says flooding is a growing problem in his neighborhood due to sea level rise and the community's location on a peninsula surrounded by water in several directions. If a property abuts a creek or a waterway, it can become problematic during heavy rain."
        },
        {
            "published_date": "2025-01-22T16:05:32",
            "title": "1 person is killed and 2 injured in stabbing outside Nagano station in central Japan",
            "author": "The Associated Press",
            "url": "https://kitchener.ctvnews.ca/world/article/1-person-is-killed-and-2-injured-in-stabbing-outside-nagano-station-in-central-japan",
            "url_media": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fstatic.themebuilder.aws.arc.pub%2Fbellmediainc%2F1730923620854.svg?auth=f1cf09be30d79f3fc423ee797e5d40ba62b742439525848fa3215fac178a9980&width=1200",
            "country": "CA",
            "language": "en",
            "summary": "Some parts of Canada are under severe weather alerts. Trump is withdrawing the U.S. from the Paris climate agreement again. The weather in Canada is very cold and blizzards are very dangerous. The temperature is expected to drop to minus 20 degrees Celsius."
        },
        {
            "published_date": "2025-01-22T16:00:00",
            "title": "Warning of ice and frost on roads as gritters deployed",
            "author": "Kieran Williams",
            "url": "https://www.worcesternews.co.uk/news/24876158.warning-ice-frost-roads-gritters-deployed",
            "url_media": "https://www.worcesternews.co.uk/resources/images/19000791.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Ringway Worcestershire's gritting team will be out from 6pm to treat all primary and secondary routes. There is a risk of icy patches and hoar frost overnight (January 22). Road surface temperatures will dip to -1.3c."
        },
        {
            "published_date": "2025-01-22T15:58:46",
            "title": "Pakistan Braces for Worsening Drought as Rainfall Plummets",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/international/3235286-pakistan-braces-for-worsening-drought-as-rainfall-plummets",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_01_2025_21_28_32_0155291.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Pakistan experienced a 40 percent deficit in expected rainfall from September 1, 2024, to January 15, 2025. The report warns of drought-like conditions in various regions, including Potohar in Punjab and numerous areas in Sindh and Balochistan. The anticipated dry conditions in the season's latter half, spanning January to March, are expected to exacerbate the drought situation."
        },
        {
            "published_date": "2025-01-22T15:57:00",
            "title": "Western NC farmers wait for Helene aid",
            "author": "",
            "url": "https://www.journalpatriot.com/western-nc-farmers-wait-for-helene-aid/article_2f7e6b36-425c-5a82-a8bd-1e2720aae9c9.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/journalpatriot.com/content/tncms/custom/image/7e4f81e4-8453-11e8-ad0a-7b3a3d90d3b8.png",
            "country": "US",
            "language": "en",
            "summary": "Tropical Storm Helene caused a lot of damage to farmers in Western North Carolina. The American Relief Act, signed in December, includes $21 billion for disaster assistance to farmers and $10 billion in direct economic assistance. The Farm Service Agency is just beginning to build the program, but farmers need information and money now."
        },
        {
            "published_date": "2025-01-22T15:36:03",
            "title": "What is La Niña, will it change Europe's weather and will a weak signal bring fewer problems?",
            "author": "Rosie Frost",
            "url": "https://www.euronews.com/green/2025/01/22/what-is-la-nina-will-it-change-europes-weather-and-will-a-weak-signal-bring-fewer-problems",
            "url_media": "https://static.euronews.com/articles/stories/08/99/40/60/1200x675_cmsv2_6e202260-34f0-5321-8f5a-8a854570ffd4-8994060.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The long-awaited La Niña has finally arrived, but it's weak and unlikely to cause as many weather problems as usual. Last year it brought drought, food shortages and deadly heat in some parts of the world. It's a seasonal phenomenon that lasts for several months in a row and can change global temperatures as well as rain or snow patterns in predictable ways."
        },
        {
            "published_date": "2025-01-22T15:34:46",
            "title": "Study Finds Modern Warming And Treeline Advances Peaked By 1940s, Defying Climate Narratives",
            "author": "Thomas Richard",
            "url": "https://climatechangedispatch.com/study-finds-modern-warming-and-treeline-advances-peaked-by-1940s-defying-climate-narratives",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/01/forest-trees-fb.jpeg",
            "country": "US",
            "language": "en",
            "summary": "All modern warming and treeline advances at a Rocky Mountain ice patch site occurred from the 1910s to the 1940s. 30% of the globe's forests have not warmed in the modern era (1900s-present) and 50% have not advanced upslope."
        },
        {
            "published_date": "2025-01-22T15:29:06",
            "title": "Eco Balance, stakeholders, discuss risk financing for vulnerable populations in Dominica and region",
            "author": "Malaika",
            "url": "https://dominicanewsonline.com/news/homepage/news/eco-balance-coordinates-roundtable-with-various-parties-to-highlight-risk-financing-for-vulnerable-populations",
            "url_media": "https://dominicanewsonline.com/news/wp-content/uploads/2025/01/pexels-n-voitkevich-7172774-scaled-e1737559484662.jpg",
            "country": "DO",
            "language": "en",
            "summary": "Eco Balance Inc. and the Caribbean Policy Development Centre have organized a roundtable discussion on risk financing for vulnerable sectors of the Dominican and wider Caribbean population. The event will take place on January 21-22, 2025 at the Prevo Cinemall. The CPDC's role is implementing the Caribbean aspect of a broader initiative known as the 'Multi-Actor-Partnership (MAP)' which aims to promote pro-poor and gender-equitable climate risk financing. The initiative is financially supported by the German Ministry for Economic Cooperation and Development and CARE International."
        },
        {
            "published_date": "2025-01-22T15:25:51",
            "title": "Carter County Commission approves disaster repair initiatives",
            "author": "Contributed Content",
            "url": "https://www.elizabethton.com/2025/01/22/carter-county-commission-approves-disaster-repair-initiatives",
            "url_media": "https://www.elizabethton.com/wp-content/uploads/sites/36/2025/01/NW0123-Carter-County-Commission-approves-1A.jpg",
            "country": "US",
            "language": "en",
            "summary": "Carter County Commission approved a motion Tuesday to seek help from the federal government to repair waterway banks damaged by Hurricane Helene. The hurricane, which swept through the region on Sept. 27, 2024, caused extensive flooding in Carter County, damaging streams, roads, bridges, and culverts. Sonya Shows, who is assisting the county with disaster relief, estimated that repairing the banks will cost about $2 million. The Rescue Squad plans to set up a temporary site in Poga to respond to emergency calls."
        },
        {
            "published_date": "2025-01-22T15:24:20",
            "title": "Norwegians told to eat less red meat to save the climate",
            "author": "Richard Orange",
            "url": "https://www.thelocal.no/20250122/norwegians-told-to-eat-less-red-meat-to-save-the-climate",
            "url_media": "https://apiwp.thelocal.com/cdn-cgi/image/format=webp,width=1200,quality=75/https://apiwp.thelocal.com/wp-content/uploads/2025/01/watermarks-logo-cristi-caval-roXKEtOT_Ms-unsplash.jpg",
            "country": "NO",
            "language": "en",
            "summary": "The agency has released its annual climate action update, Climate Action in Norway – Knowledge Base 2025. It has increased its estimate of the emissions that could be reduced by cutting meat consumption to take into account new national dietary recommendations published last year. Cutting every Norwegian's consumption of red meat to or below the recommended 350 grams a week would cut national emissions by more than 2.3 million tonnes of CO2 a year."
        },
        {
            "published_date": "2025-01-22T15:16:00",
            "title": "How to communicate with Florida's small-town voters on climate change",
            "author": "David Vaina",
            "url": "https://www.tampabay.com/opinion/2025/01/22/how-communicate-with-floridas-small-town-voters-climate-change-column",
            "url_media": "https://www.tampabay.com/resizer/v2/Q2KO2TIXHBD6KJ2EPYCFHDWFPU.jpg?auth=2afde35c6953f61acdb59230f5c491a48739504051f56ff0240e06d6066e9ebc&height=675&width=1200&smart=true",
            "country": "US",
            "language": "en",
            "summary": "David Vaina has a Ph.D. in political theory and has helped fund, develop and operate Florida nonprofits over the last 15 years. Vaina's hometown of High Springs has 5,000 people. Nearly half of Florida's municipalities have fewer than 5, 000 people. Small-town voters understand the complexity of climate change and are empathetic. "
        },
        {
            "published_date": "2025-01-22T15:00:00",
            "title": "Americans are no longer afraid of climate change — and CNN is BAFFLED",
            "author": "Blazetv Staff",
            "url": "https://www.theblaze.com/shows/pat-gray-unleashed/americans-no-longer-afraid-of-climate-change-cnn-is-baffled",
            "url_media": "https://www.theblaze.com/media-library/image.jpg?id=55739171&width=1200&height=600&coordinates=0%2C0%2C0%2C120",
            "country": "US",
            "language": "en",
            "summary": "Google searches for 'wildfire' are up 2,400% since 2004. Searches for 'climate change' are down 9%. Americans are interested in following the news about the wildfires, but they are not making the connection with climate change. Gallup research reveals that only 39% of Americans expressed significant concern about climate change in 2023. Pew Research Center found that 45% believe humans play a major role in the problem."
        },
        {
            "published_date": "2025-01-22T14:55:39",
            "title": "LETTER: American Livestock and Future Wildland Fires",
            "author": "Pagosa Daily Post",
            "url": "https://article.wn.com/view/2025/01/22/LETTER_American_Livestock_and_Future_Wildland_Fires",
            "url_media": "https://i.ytimg.com/vi/4QIZE708gJ4/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "After the California wildfires, we need to get more serious about addressing global warming. Political leaders should support more public funding for global warming mitigation efforts.  .    for the cause.  For more information, go to: http://www.globaldwasser.org/"
        },
        {
            "published_date": "2025-01-22T14:41:00",
            "title": "Alberta is experiencing an 'invasion' of northern owls: expert",
            "author": "Amir Said",
            "url": "https://www.sott.net/article/497709-Alberta-is-experiencing-an-invasion-of-northern-owls-expert",
            "url_media": "https://www.sott.net/image/s36/722670/full/owls_alberta_invasion_irruptio.jpg",
            "country": "US",
            "language": "en",
            "summary": "Sightings of rare owls are on the rise in Alberta. Great grey owls and northern hawk owls have been seen at an unusually high rate in recent months. Biologist Lisa Takats Priestley is documenting the invasion and hopes to write a scientific paper about it."
        },
        {
            "published_date": "2025-01-22T14:36:22",
            "title": "UN chief says world's addiction to fossil fuels is ‘Frankenstein's monster'",
            "author": "",
            "url": "https://www.theguardian.com/world/video/2025/jan/22/un-chief-says-worlds-addiction-to-fossil-fuels-is-frankensteins-monster-video",
            "url_media": "https://i.guim.co.uk/img/media/7c3c553d130b827484083c7c03d549a8a97ad78f/0_311_4656_2793/master/4656.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cada89e22ccd6d16e15afeda4e87865b",
            "country": "GB",
            "language": "en",
            "summary": "António Guterres said the world's addiction to fossil fuels is a 'Frankenstein's monster sparing nothing and no one'. He warned that extreme weather events are a preview of the horror movie to come.  .     "
        },
        {
            "published_date": "2025-01-22T14:27:39",
            "title": "DeSantis is on board with Gulf of America executive order. He's already officially used it",
            "author": "News Journal",
            "url": "https://article.wn.com/view/2025/01/22/DeSantis_is_on_board_with_Gulf_of_America_executive_order_He_p",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "Trump renames Gulf of Mexico to Gulf of America. A low pressure system moving across the Gulf will bring winter weather to North Florida beginning on Tuesday.      .   i   in this context.  in which a low pressure is interacting with Arctic air to bring widespread impactful winter weather."
        },
        {
            "published_date": "2025-01-22T14:23:38",
            "title": "DeSantis is on-board with Gulf of America executive order. He's already officially used it",
            "author": "News-Press",
            "url": "https://article.wn.com/view/2025/01/22/DeSantis_is_onboard_with_Gulf_of_America_executive_order_He__a",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "Trump renames Gulf of Mexico to Gulf of America. A low pressure system moving across the Gulf will bring winter weather to North Florida beginning on Tuesday.      .   i   in this context.  in which a low pressure is interacting with Arctic air to bring widespread impactful winter weather."
        },
        {
            "published_date": "2025-01-22T13:39:26",
            "title": "Cold Surge #9: low temperatures and more rain for several days",
            "author": "Rico",
            "url": "https://qcostarica.com/cold-surge-9-low-temperatures-and-more-rain-for-several-days",
            "url_media": "https://i0.wp.com/qcostarica.com/wp-content/uploads/2025/01/LLUVIAS-rains-.jpg?fit=1024%2C671&ssl=1",
            "country": "CR",
            "language": "en",
            "summary": "The meteorological phenomenon Cold Surge #9 will enter the country through the Caribbean Sea today, Wednesday. It will cause low temperatures and prolonged rain for the next 3-4 days in the Northern Zone and Southern Caribbean. In the rest of the country, partial cloudiness is projected with the possibility of isolated showers in mountainous areas."
        },
        {
            "published_date": "2025-01-22T13:26:29",
            "title": "Odisha Partners with Institutions to Tackle Climate Change and Boost Resilience",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3235026-odisha-partners-with-institutions-to-tackle-climate-change-and-boost-resilience",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/09_07_2024_16_53_12_7095265.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Forest, Environment, and Climate Change department formalized two MoUs and a Letter of Understanding with IIT Bhubaneswar, the World Food Programme (WFP), and the Council on Energy, Environment and Water. The first agreement focuses on the restoration of critical coastal ecosystems under the Enhancing Climate Resilience of India's Coastal Communities (ECRICC) project."
        },
        {
            "published_date": "2025-01-22T13:06:47",
            "title": "Davos 2025: Trade, tariffs, AI and UN chief Guterres dominate World Economic Forum agenda",
            "author": "JAMEY KEATEN",
            "url": "https://www.gloucestertimes.com/davos-2025-trade-tariffs-ai-and-un-chief-guterres-dominate-world-economic-forum-agenda/article_d5e12c8d-10ac-5bd6-ad73-16bb858c3e97.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/gloucestertimes.com/content/tncms/assets/v3/editorial/4/8f/48f2dc6c-c896-5a79-9e8e-bd97fa819ec3/67910069ed83c.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "António Guterres is the U.N. secretary-general at the World Economic Forum's annual meeting in Davos. He warns about climate change and the risks posed by artificial intelligence. He also calls for greater attention to the world's thirst for fossil fuels."
        },
        {
            "published_date": "2025-01-22T13:02:25",
            "title": "Phoenix Mayor Kate Gallego: City won't stop fighting climate change under Trump",
            "author": "Taylor Seely",
            "url": "https://eu.azcentral.com/story/news/local/phoenix/2025/01/22/kate-gallego-phoenix-wont-stop-fighting-climate-change-under-donald-trump/77856521007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2024/04/23/PPHX/73430801007-pb-017966.JPG?auto=webp&crop=4504,2534,x0,y228&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Trump withdrew the U.S. from a global agreement to combat climate change on Inauguration Day. Mayor Kate Gallego says the city has no plans to stop its work reducing emissions, regardless of Trump's decision to pull out of the Paris Agreement. She is part of a coalition of 350 Arizona mayors dedicated to advancing \"federal and global climate action\""
        },
        {
            "published_date": "2025-01-22T13:00:58",
            "title": "Odisha Govt Signs MoU with IIT Bhubaneswar, WFP, CEEW to Enhance Climate Resilience",
            "author": "Itishree Sethy",
            "url": "https://pragativadi.com/odisha-govt-signs-mou-with-iit-bhubaneswar-wfp-ceew-to-enhance-climate-resilience",
            "url_media": "https://pragativadi.com/core/uploads/2025/01/climate-resilience.png",
            "country": "IN",
            "language": "en",
            "summary": "The Forest, Environment, and Climate Change Department, Government of Odisha has signed three significant agreements to enhance the state's climate resilience and sustainable development efforts. The agreements aim to tackle climate change challenges, promote sustainable livelihoods, and protect Odisha's rich biodiversity and coastal ecosystems."
        },
        {
            "published_date": "2025-01-22T12:52:00",
            "title": "Temperatures could feel like -35C in GTA Wednesday morning: Environment Canada",
            "author": "Cbc News",
            "url": "https://www.cbc.ca/news/canada/toronto/extreme-cold-continues-gta-wednesday-morning-1.7437989",
            "url_media": "https://i.cbc.ca/1.6734664.1675355994!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_1180/toronto-cold-jan-2022.jpg?im=Resize%3D620",
            "country": "CA",
            "language": "en",
            "summary": "Frigid temperatures are persisting in the GTA on Wednesday morning with wind chill values ranging from minus 30 to minus 35. The GTA is currently under an extreme cold weather warning caused by an Arctic airmass. The extreme cold is expected to end later this morning and temperatures are forecast to return to more seasonable ranges by Thursday."
        },
        {
            "published_date": "2025-01-22T12:49:30",
            "title": "Climate Facts: Whiplash events could double rapidly if temperature rises to 3°C, says study",
            "author": "Janefrances Chibundu",
            "url": "https://www.thecable.ng/climate-facts-whiplash-events-could-double-rapidly-if-temperature-rises-to-3c-says-study",
            "url_media": "https://www.thecable.ng/wp-content/uploads/2023/11/David-canoe-flood.jpeg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria became the first African country to issue a sovereign bond in February 2017 to help boost climate action in the country. The second bond result stood at N15 billion (US$ 42 million) which is expected to be used to fund a wider portfolio. The carbon dioxide level in the atmosphere rose to 3.58 ppm in 2024."
        },
        {
            "published_date": "2025-01-22T12:46:36",
            "title": "Most birds adapted to spending winter in Michigan can handle below-zero cold",
            "author": "Keith Matheny",
            "url": "https://www.yahoo.com/news/most-birds-adapted-spending-winter-124636030.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/LmNwrbMLTJ7bUeBiK7mmVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/detroit_free_press_natl_articles_245/17f52628164e238f23474bfbbc1f1356",
            "country": "US",
            "language": "en",
            "summary": "There is a lot of discussion about the nature of nature and nature of the bird-like and non-bird-like elements in the discussion. Benjamin Winger, a professor at University of Michigan, explains the difference between the different types of birds and their mutual intermingling. "
        },
        {
            "published_date": "2025-01-22T12:33:55",
            "title": "Australia probes origin of funding for antisemitic incidents; it could come from Iran",
            "author": "",
            "url": "https://www.ynetnews.com/article/skejqirwke",
            "url_media": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/01/11/H10005skPkx/H10005skPkx_0_0_1171_682_0_large.jpg",
            "country": "IL",
            "language": "en",
            "summary": "In recent months, there has been a sharp spike in the number of antisemitic incidents in Australia. A synagogue was set on fire in Melbourne and incidents against Jews have been occurring every few days in Sydney. The latest incident involved the burning of a Jeiwsh children's daycare center."
        },
        {
            "published_date": "2025-01-22T12:07:38",
            "title": "Stanton Bird Club lecture series continues Feb. 3 at Auburn library",
            "author": "Stacy Blanchet",
            "url": "https://www.sunjournal.com/2025/01/22/stanton-bird-club-lecture-series-continues-feb-3-at-auburn-library",
            "url_media": "https://www.sunjournal.com/wp-content/uploads/sites/11/2018/12/sunjournal-social.jpg",
            "country": "US",
            "language": "en",
            "summary": "Stanton Bird Club is hosting the third lecture in its 2024-25 lecture series, 'Birding in the Falkland Islands' with Loring (Danny) Danforth, PhD., from 4-6 p.m. on Monday, Feb. 3 at Auburn Public Library, 49 Spring St. in Auburn. There is no cost and all are welcome."
        },
        {
            "published_date": "2025-01-22T12:00:00",
            "title": "Study finds winter days on the Great Lakes growing shorter due to climate change",
            "author": "Danielle C Kaeding",
            "url": "https://www.apg-wi.com/townnews/hydrography/study-finds-winter-days-on-the-great-lakes-growing-shorter-due-to-climate-change/article_9b114728-d815-11ef-acad-0fc7d7008764.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/apg-wi.com/content/tncms/assets/v3/editorial/1/bc/1bce8408-d775-11ef-afa5-f343d5a7bf08/678ebf7b35dd0.image.jpg?crop=1343%2C705%2C0%2C116&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Great Lakes have been losing an average of 14 days of winter each decade since 1995 due to warming air temperatures, according to a new study. The study was published in the peer-reviewed journal Environmental Research Letters and builds on previous research that shows winters on the Great Lakes are growing shorter due to climate change."
        },
        {
            "published_date": "2025-01-22T11:36:00",
            "title": "Norfolk people wanted for RSPB's Big Garden Birdwatch 2025",
            "author": "Gabriella Crisp",
            "url": "https://www.edp24.co.uk/news/24869198.norfolk-people-wanted-rspbs-big-garden-birdwatch-2025",
            "url_media": "https://www.edp24.co.uk/resources/images/18980657.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "The RSPB's Big Garden Birdwatch takes place from January 24 to January 26. Blue tits, house sparrows and wood pigeons were the most commonly seen birds in Norfolk last year. A total of nine million birds were counted across the UK last year by 60,000 people."
        },
        {
            "published_date": "2025-01-22T11:32:52",
            "title": "Transform uncertainty into an opportunity for growth",
            "author": "Aisha Al Darmaki",
            "url": "https://www.omanobserver.om/article/1165229/opinion/oman/transform-uncertainty-into-an-opportunity-for-growth",
            "url_media": "https://www.omanobserver.om/thumbs/600x600/.jpg",
            "country": "OM",
            "language": "en",
            "summary": "The World Economic Forum's Global Risks Report 2025 highlights this year's challenges as stemming from escalating political and economic conflicts, extreme weather events driven by climate change, deep societal and political divides, and the consequences of accelerating technological development. Misinformation has created a more fraught geopolitical environment, amplifying economic tensions. Social inequalities and disparities in wealth and income distribution are also flagged as critical risks. Multilateralism will play a vital role in addressing shared challenges. Oman's approach is guided by a vision of sustainable development that integrates awareness of global risks with local opportunities."
        },
        {
            "published_date": "2025-01-22T11:28:00",
            "title": "Bitter Cold Persist Through Thursday Morning",
            "author": "",
            "url": "http://wrde.com/weather/bitter-cold-persist-through-thursday-morning/article_b91fb776-d839-11ef-9f26-8fa2f6dc5480.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/coasttv.com/content/tncms/assets/v3/editorial/2/f7/2f70e1ca-d83a-11ef-ba5d-47bed6be71e2/67900a16f1817.image.png?crop=1920%2C1008%2C0%2C35&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Sussex County and Ocean City remain under a Cold Weather Advisory through noon Wednesday. Arctic high pressure brings extreme cold and icy conditions. Residents are advised to limit time outdoors and ensure proper layering to avoid frostbite and hypothermia. Coastal areas may also experience snow showers from a weak offshore system."
        },
        {
            "published_date": "2025-01-22T11:24:24",
            "title": "Road that took months to repair collapses for a third time",
            "author": "",
            "url": "https://www.newarkadvertiser.co.uk/news/road-that-took-months-to-repair-collapses-for-a-third-time-9401067",
            "url_media": "https://www.newarkadvertiser.co.uk/_media/img/F15QOO11R90C4H6LNM4U.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The road at Carlton Ferry Lane, Collingham, collapsed for the third time in less than three years. Residents are forced to exit the village through the alternative back road on Northcroft Lane. Nottinghamshire County Council is working with the Environment Agency, the owners of the adjacent quarry and local residents to look at sustainable options for the future."
        },
        {
            "published_date": "2025-01-22T11:14:28",
            "title": "Winter Blasts Flora and Fauna",
            "author": "바바리안의 미국주식 정복기",
            "url": "https://n.news.naver.com/mnews/article/077/0006497701",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/01/22/PAP20250122155601009_P2_20250122111428094.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Temperatures drop below 40 F (5 C) and iguanas can start dropping from trees. They become immobilized until the temperature increases enough for them to move around again. iguanos in Plantation, Florida, could die of this cold weather in 2022."
        },
        {
            "published_date": "2025-01-22T11:11:59",
            "title": "Ivory Coast's Cocoa Crisis: Drought and Heat Slash Harvest Expectations",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3234779-ivory-coasts-cocoa-crisis-drought-and-heat-slash-harvest-expectations",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/03_06_2024_13_04_55_3118753.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Cocoa arrivals at Ivory Coast ports are expected to decline by 100,000 metric tons between February and March compared to last year. The main crop season, spanning October to March, has already seen many regions in the 13-region cocoa belt with depleted harvests. Farmers across cocoa-producing areas face a bleak outlook as drought and seasonal winds have devastated potential yields."
        },
        {
            "published_date": "2025-01-22T11:10:21",
            "title": "The CO2 canard is coming apart at the seams",
            "author": "Edwin",
            "url": "https://edwin797.substack.com/p/the-co2-canard-is-coming-apart-at",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3f90ad51-8e05-4713-bbe4-82b8c2fed2e8_640x423.jpeg",
            "country": "US",
            "language": "en",
            "summary": "In 2007, the Supreme Court ruled that carbon dioxide and other heat-trapping emissions are pollutants under the Clean Air Act. Since then, the world has been subjected to numerous climate-related laws and treaties. Collister Johnson recently wrote an article that questions the prevailing narrative on CO2. Scientists disprove the assumption that CO2 increases cause a linear and dangerous increase in global temperatures."
        },
        {
            "published_date": "2025-01-22T11:00:00",
            "title": "Why it feels like we're stuck in an endless loop of droughts and floods",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6619739",
            "url_media": "https://i.cbc.ca/ais/bdad4a00-67e9-4615-b6b1-088b0fada092,1737506043624/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3BResize%3D%281180%29",
            "country": "CA",
            "language": "en",
            "summary": "Johanna Wagstaffe explains why rapid swings between very dry and very wet seasons are becoming more extreme and more frequent as our atmosphere warms. She also explains why we need to be more aware of climate change.       \"Johannia Wagstaff\""
        },
        {
            "published_date": "2025-01-22T11:00:00",
            "title": "Greater Insurability of Climate Risk is Key to Global Economic Resilience: Aon Catastrophe Report",
            "author": "Aon plc",
            "url": "https://www.newswire.ca/news-releases/greater-insurability-of-climate-risk-is-key-to-global-economic-resilience-aon-catastrophe-report-812300137.html",
            "url_media": "https://mma.prnewswire.com/media/1632623/Aon_Logo_2.jpg?p=twitter",
            "country": "CA",
            "language": "en",
            "summary": "Annual report reveals 60 percent of economic damage caused by catastrophes in 2024 was uninsured. Insured losses reached $145 billion globally – the sixth costliest year on record. Hurricane Helene was the costliest global event in 2024, causing $75 billion of damages and 243 fatalities."
        },
        {
            "published_date": "2025-01-22T10:54:21",
            "title": "World's addiction to fossil fuels is ‘Frankenstein's monster', says UN chief",
            "author": "Damian Carrington",
            "url": "https://www.theguardian.com/environment/2025/jan/22/worlds-addiction-to-fossil-fuels-is-frankensteins-monster-says-un-chief",
            "url_media": "https://i.guim.co.uk/img/media/bdab9dea2f365754c0af8f549bdffe1bf7834417/0_143_4656_2794/master/4656.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=19543a0e38c0fb359c14c5b202884b5b",
            "country": "GB",
            "language": "en",
            "summary": "António Guterres spoke at the World Economic Forum in Davos on Wednesday. He warned that the world's addiction to fossil fuels is a 'Frankenstein's monster sparing nothing and no one'. He urged governments to keep their Paris agreement promise to produce new national climate action plans by February."
        },
        {
            "published_date": "2025-01-22T10:34:31",
            "title": "Nigeria: Seven Key Issues That Shaped Nigeria's Agriculture Sector in 2024",
            "author": "Abdulkareem Mojeed",
            "url": "https://allafrica.com/stories/202501220289.html",
            "url_media": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Nigeria has a food crisis because of Tinubu's policies, especially the removal of fuel and currency subsidies. Extreme weather events, such as heat waves, droughts, and floods, have made food production almost impossible for farmers in the country. Nigeria's disaster management agency, NEMA, said floods killed over 303 people and affected over 1.2 million people."
        },
        {
            "published_date": "2025-01-22T10:26:29",
            "title": "Newly discovered proof of an ancient glacier reveal secrets about our planet's future",
            "author": "Sophie Thompson",
            "url": "https://www.msn.com/en-us/news/technology/newly-discovered-proof-of-an-ancient-glacier-reveal-secrets-about-our-planet-s-future/ar-AA1xE0U0",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The remnants of a 770,000-year-old glacier on an island in the Canadian Arctic could be the oldest proof of their existence. According to the WWF, more than a third of the world's glaciers will be gone before 2100. The Pleistocene epoch took place 2.58 million to 11,700 years ago."
        },
        {
            "published_date": "2025-01-22T10:26:29",
            "title": "Newly discovered proof of ancient glacier reveal secrets about Earth's future",
            "author": "Sophie Thompson",
            "url": "https://www.msn.com/en-us/news/technology/newly-discovered-proof-of-ancient-glacier-reveal-secrets-about-earth-s-future/ar-AA1xE0U0",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The remnants of a 770,000-year-old glacier on an island in the Canadian Arctic could be the oldest proof of their existence. According to the WWF, more than a third of the world's glaciers will be gone before 2100. The Pleistocene epoch took place 2.58 million to 11,700 years ago."
        },
        {
            "published_date": "2025-01-22T10:26:29",
            "title": "Newly discovered proof of an ancient glacier reveal secrets about our planet's future",
            "author": "Sophie Thompson",
            "url": "https://www.indy100.com/science-tech/oldest-arctic-glacier-canada-million-years",
            "url_media": "https://www.indy100.com/media-library/exploring-the-majestic-ice-formations-of-a-snowy-mountain.jpg?id=55783666&width=1200&height=600&coordinates=0%2C456%2C0%2C456",
            "country": "US",
            "language": "en",
            "summary": "The remnants of a 770,000-year-old glacier on an island in the Canadian Arctic could be the oldest proof of their existence. According to WWF, more than a third of the world's glaciers will be gone before 2100. The Pleistocene epoch took place 2.58 million to 11,700 years ago."
        },
        {
            "published_date": "2025-01-22T10:24:49",
            "title": "Climate crisis heavily affects Turkish Republic of Northern Cyprus",
            "author": "Basti Mammad",
            "url": "https://en.trend.az/azerbaijan/society/3996322.html",
            "url_media": "https://en.trend.az/imagen/3996322",
            "country": "AZ",
            "language": "en",
            "summary": "Filiz Besim is the Deputy Chairperson of the Health Committee of the Turkish Parliamentary Assembly of Turkic States (TURKPA). She said climate change has a great impact on the Turkish Republic of Northern Cyprus as well. She noted the impact of climate change effects on human health."
        },
        {
            "published_date": "2025-01-22T10:24:42",
            "title": "Britain's seaside towns 'swallowed by the sea' - 5 iconic hotspots that could disappear by 2050",
            "author": "Benedict Tetzlaff-Deas",
            "url": "https://www.mirror.co.uk/news/uk-news/britains-seaside-towns-swallowed-sea-34527429",
            "url_media": "https://i2-prod.mirror.co.uk/incoming/article34528500.ece/ALTERNATES/s1200/2_Boats-in-Poole-Harbour-Dorset-looking-out-to-Brownsea-Island.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Rising sea levels mean some seaside destinations could be underwater by 2050, according to new projections. Coastal defence schemes are already in place along the Thames and across parts of the UK to tackle rising sea levels and prevent potential damage, but campaigners are calling for more to be done."
        },
        {
            "published_date": "2025-01-22T10:11:57",
            "title": "‘Catastrophic': Great Barrier Reef hit by its most widespread coral bleaching, study finds",
            "author": "archyde",
            "url": "https://www.archyde.com/catastrophic-great-barrier-reef-hit-by-its-most-widespread-coral-bleaching-study-finds-great-barrier-reef",
            "url_media": "https://i.guim.co.uk/img/media/006ae31dc2028ef1746daf027c86ec25620c0424/107_0_1813_1020/1813.jpg?width=465&dpr=1&s=none&crop=none",
            "country": "US",
            "language": "en",
            "summary": "The Great Barrier Reef is experiencing the most widespread coral bleaching event in its recorded history. Over 40% of the corals at One Tree Island in the southern part of the reef died due to heat stress. Only 92 colonies managed to escape the devastation entirely. The event serves as a reminder of the urgent threat posed by climate change to coral reefs worldwide."
        },
        {
            "published_date": "2025-01-22T10:05:00",
            "title": "Letter: Spend on fire defenses, not climate change",
            "author": "",
            "url": "https://www.staradvertiser.com/2025/01/22/editorial/letters/letter-spend-on-fire-defenses-not-climate-change",
            "url_media": "https://www.staradvertiser.com/wp-content/uploads/2025/01/web1_0240818-a8-CTY-LAHAINA-AFTERMATH0326.jpg",
            "country": "US",
            "language": "en",
            "summary": "Lahaina and L.A. wildfires were possibly beyond control, but in both cases there was poor management. Governor Josh Green wants to spend millions on hardening measures, but there is abundant dry brush and grass next to residential neighborhoods that need to be cleared out."
        },
        {
            "published_date": "2025-01-22T09:54:47",
            "title": "The US is leaving the Paris Agreement – what happens next?",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/01/22/The_US_is_leaving_the_Paris_Agreement_what_happens_next",
            "url_media": "https://i.ytimg.com/vi/R6nmmDKI1bc/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "The world's largest economy and second-largest emitter of greenhouse gases will withdraw from the global climate pact, disrupting efforts to tackle climate change. The U.S. is the world's biggest economy and the second-biggest emitter of greenhouse gas."
        },
        {
            "published_date": "2025-01-22T09:43:41",
            "title": "Largest Spike in Atmospheric CO2 Recorded at Hawaii's Mauna Loa Observatory in 2024",
            "author": "Defara Dhanya",
            "url": "https://en.tempo.co/read/1966931/largest-spike-in-atmospheric-co2-recorded-at-hawaiis-mauna-loa-observatory-in-2024",
            "url_media": "https://statik.tempo.co/data/2025/01/22/id_1371430/1371430_720.jpg?rand=10",
            "country": "ID",
            "language": "en",
            "summary": "The Mauna Loa Observatory in Hawaii recorded the largest spike in atmospheric carbon dioxide (CO2) concentrations in 2024. Global CO2 levels also rose by 2.9 ppm in 2024, which is one of the largest increases since satellite observations began. The scientists warn that the goal of limiting global warming to 1.5°C is increasingly unlikely."
        },
        {
            "published_date": "2025-01-22T09:34:58",
            "title": "In Our New Climate Reality, There Is No Getting Back to Normal",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/in-our-new-climate-reality-there-is-no-getting-back-to-normal-45c5e88ee42f2a16d201026f5379f19a99e04d28",
            "url_media": "https://www.thenation.com/wp-content/uploads/2025/01/la-fires-vw-van-getty.jpg",
            "country": "FR",
            "language": "en",
            "summary": "\"We are on the brink of an irreversible climate disaster,\" says the latest \"State of the Climate Report\" by 14 leading climate scientists from the United States, Europe, Australia, China, and Brazil. The mainstream media has largely tried to contain the wildfire narrative within an Overton window of acceptable, i.e., unalarming discourse."
        },
        {
            "published_date": "2025-01-22T09:21:00",
            "title": "Global collaboration key to addressing climate change: UK official",
            "author": "arabtimes",
            "url": "https://www.arabtimesonline.com/news/global-collaboration-key-to-addressing-climate-change-uk-official",
            "url_media": "https://www.arabtimesonline.com/arabtimes/uploads/images/2025/01/22/thumbs/400x400/49056.jpg",
            "country": "KW",
            "language": "en",
            "summary": "Neil Hornby, CEO of the British Centre for Environment, Agriculture, and Fisheries (CEFAS), visited Kuwait to celebrate the 10th anniversary of CEFAS's operations in Kuwait. He praised Kuwait's commitment to global cooperation in addressing climate change and current environmental challenges. He also praised the Kuwaiti youth's active participation in environmental conservation."
        },
        {
            "published_date": "2025-01-22T09:14:37",
            "title": "Ombudsman: Fishermen Suffer Rp9bn in Losses Due to Sea Fence in Tangerang",
            "author": "Hanin Marwah",
            "url": "https://en.tempo.co/read/1966909/ombudsman-fishermen-suffer-rp9bn-in-losses-due-to-sea-fence-in-tangerang",
            "url_media": "https://statik.tempo.co/data/2025/01/22/id_1371417/1371417_720.jpg?rand=8",
            "country": "ID",
            "language": "en",
            "summary": "Indonesian Ombudsman Chair, Mokhammad Najih, has revealed that fishermen in Tangerang Regency have suffered losses amounting to Rp9 billion due to the construction of a sea fence. The 30.16-kilometer-long sea fence, located 500 meters from the shoreline, impacts 16 villages and affects the livelihoods of approximately 4,000 fishermen. The Ministry of Maritime Affairs and Fisheries acknowledges the negative impact of the sea fence and discussions regarding its removal are still ongoing."
        },
        {
            "published_date": "2025-01-22T09:00:00",
            "title": "We are in a new era",
            "author": "",
            "url": "https://www.victoriaadvocate.com/opinion/we-are-in-a-new-era/article_d209c030-d81e-11ef-a6f0-57eb475ec4eb.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/victoriaadvocate.com/content/tncms/assets/v3/editorial/9/3d/93d23d28-31c8-11e8-8d93-67d768207613/5aba50eed707e.image.jpg?crop=259%2C259%2C60%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Scientists say 2024 will be the hottest year on record due to human-caused climate change. Wildfires are burning hotter and moving faster, storms are getting bigger and carrying more moisture, and soaring temperatures worldwide are leading to heat waves and drought. In Europe, extreme heat contributed to at least 47,000 deaths in 2023. In the United States, heat-related deaths have doubled in recent decades."
        },
        {
            "published_date": "2025-01-22T08:53:15",
            "title": "How do birds survive in the cold?",
            "author": "Cai",
            "url": "https://www.capeandislands.org/in-this-place/2025-01-22/how-do-birds-survive-in-the-cold",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/a3e262c/2147483647/strip/true/crop/1024x538+0+93/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F45%2Fbd%2Fdccfe2b342a48a24b158ac634a7c%2F39731955462-7639e7108b-b.jpg",
            "country": "US",
            "language": "en",
            "summary": "It's been very cold in the past few days, but birds are still able to survive. They have downy feathers that trap heat and block wind. Bird feet are cold, but they have little nerve tissue or water in them, so they don't get frostbite. They also have a special circulatory system where blood vessels coming to and from the body are close together to exchange heat."
        },
        {
            "published_date": "2025-01-22T08:36:49",
            "title": "Earth's Magnetic North Pole Is On The Move, This Is How Far It Has Shifted",
            "author": "Bhavya Sukheja",
            "url": "https://www.ndtv.com/science/earths-magnetic-north-pole-is-on-the-move-this-is-how-far-it-has-shifted-7531840",
            "url_media": "https://c.ndtvimg.com/2022-10/naoo5i6_earth-generic_625x300_08_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
            "country": "IN",
            "language": "en",
            "summary": "Earth's magnetic north pole is drifting towards Russia at an accelerated speed. It is now closer to Siberia than it was five years ago. The movement of the magnetic field has been unprecedented over the past few years. Scientists expect the drift toward Russia will continue to slow."
        },
        {
            "published_date": "2025-01-22T08:27:54",
            "title": "Hazardous ice conditions prompt road closures in Nassau County",
            "author": "Jacqueline Lee",
            "url": "https://www.news4jax.com/traffic/2025/01/22/hazardous-ice-conditions-prompt-road-closures-in-nassau-county",
            "url_media": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/AKNNTYA7HZALFMSCRBYSIQRNHE.jpg?_a=DATAdtfiZAA0",
            "country": "US",
            "language": "en",
            "summary": "Ice accumulation on roads and bridges has caused several accidents. The Intracoastal Waterway (ICW) and Shave Bridge have been closed for an unknown period. Emergency services are responding to multiple incidents. Roads will remain closed until conditions improve and safety is assured."
        },
        {
            "published_date": "2025-01-22T07:45:00",
            "title": "Trump's war on efforts to slow climate change futile",
            "author": "",
            "url": "https://www.smh.com.au/national/nsw/trump-s-war-on-efforts-to-slow-climate-change-futile-20250122-p5l6b8.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.159%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_0%2C$y_3/t_crop_custom/q_62%2Cf_auto/8634098adc651f7da4c2bddfa40a1f852e914bec",
            "country": "AU",
            "language": "en",
            "summary": "Donald Trump signed an executive order to withdraw from the Paris Agreement on climate change. The new president's policy of filling senior positions of his administration with 'loyalists', his control of the Senate and Congress by a Republican Party subservient to him, and his appointment of conservatives give rise to a government structure more committed to him than to the Constitution and the people as a whole."
        },
        {
            "published_date": "2025-01-22T07:03:44",
            "title": "Kenya's Food Crisis: 1.8 Million Face Severe Hunger",
            "author": "Vijay A",
            "url": "https://www.newkerala.com/news/o/18-million-kenyans-face-food-insecurity-arid-areas-bear-596",
            "url_media": "https://www.newkerala.comhttps://one.newkerala.com/images/r/newsdefault.webp",
            "country": "IN",
            "language": "en",
            "summary": "1.8 million Kenyans are food insecure and in need of humanitarian assistance. Nearly 480,000 children and 110,000 mothers are at risk of malnutrition. The situation is worse in the 23 arid and semi-arid counties of Kenya, mainly in Wajir, Garissa, Turkana, Marsabit, and Mandera."
        },
        {
            "published_date": "2025-01-22T06:18:13",
            "title": "Why desert lizards are facing their own ‘cost-of-living' crisis as global warming hikes their ‘energy bills'",
            "author": "",
            "url": "https://www.malaymail.com/news/life/2025/01/22/why-desert-lizards-are-facing-their-own-cost-of-living-crisis-as-global-warming-hikes-their-energy-bills/164213",
            "url_media": "https://www.malaymail.com/malaymail/uploads/images/2025/01/22/thumbs/400x400/257234.jpg",
            "country": "MY",
            "language": "en",
            "summary": "Global warming is squeezing the energy budget of lizards, increasing the amount of food they need to survive, while reducing the time they have to find it in deserts. Lizards that are active during the day are the most vulnerable to global warming. African desert lizards will be the hardest hit."
        },
        {
            "published_date": "2025-01-22T06:02:58",
            "title": "Forever chemicals being found 'literally everywhere'",
            "author": "Jack Gramenz",
            "url": "https://www.bordermail.com.au/story/8872426/forever-chemicals-being-found-literally-everywhere",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/915286bf-9acf-4f0e-94f5-90ac596d3192.jpg/r0_91_797_509_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Australia needs to prevent the introduction of more \"forever chemicals\" amid warnings it is becoming increasingly difficult to deal with the contaminants already in the environment, according to the World Health Organisation.      .   in this context, Australia needs to stop introducing more chemicals. "
        },
        {
            "published_date": "2025-01-22T06:00:00",
            "title": "Falkirk district residents urged to sign up for Big Garden Birdwatch 2025",
            "author": "Fiona Dobie",
            "url": "http://www.falkirkherald.co.uk/news/people/falkirk-district-residents-urged-to-sign-up-for-big-garden-birdwatch-2025-4952008",
            "url_media": "https://www.falkirkherald.co.uk/webimg/b25lY21zOmZmZmZjYTc4LWU0ZjItNDczMC05ZDgyLTQwZTZjNTFlYTA5ZjpjMTQxZmJkYS00YWI4LTRiZGEtOTQzMS01MzRmMmVlN2Y3ZmE=.jpg?width=1024&auto=webp&quality=75&crop=3:2,smart&trim=",
            "country": "GB",
            "language": "en",
            "summary": "Residents in Falkirk district are being invited to take part in the Big Garden Birdwatch this weekend. The survey provides an annual snapshot of how garden birds in the UK are faring. More than 40,000 people in Scotland took part last year, counting more than 80,000 birds of nearly 50 species."
        },
        {
            "published_date": "2025-01-22T05:56:30",
            "title": "East Africa: Most Parts of Greater Horn Africa Expected to Receive Below-Normal Rainfall, ICPAC Predicts",
            "author": "",
            "url": "https://allafrica.com/stories/202501220092.html",
            "url_media": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "ICPAC has released its seasonal climate forecast for March to May (MAM) 2025. Most parts of the Greater Horn of Africa are likely to experience below-normal rainfall. There is a higher likelihood of warmer-than-normal conditions. The projected climatic conditions will have significant socio-economic impacts on vulnerable populations."
        },
        {
            "published_date": "2025-01-22T05:46:29",
            "title": "Farmers urged to adopt sustainable practices",
            "author": "",
            "url": "http://agriculture.einnews.com/article_detail/779189839/4eXGmouQUqoFEeb0",
            "url_media": "https://www.fbcnews.com.fj/wp-content/uploads/2025/01/sugar-west.png",
            "country": "UA",
            "language": "en",
            "summary": "Climate change is threatening the viability of sugarcane crops. Sugar Research Institute of Fiji is urging farmers to adopt sustainable farming practices. Sugarcane burning negatively impacts both crop productivity and the environment. Organic matter can maintain soil health and enhance its ability to retain nutrients, even during heavy rain."
        },
        {
            "published_date": "2025-01-22T05:38:40",
            "title": "Mozambique: Dikeledi Kills 11 in Nampula",
            "author": "",
            "url": "https://allafrica.com/stories/202501220073.html",
            "url_media": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Cyclone Dikeledi has caused the death of 11 people in the northern Mozambican province of Nampula. There are currently 2,316 displaced people in three accommodation centres in the province. 27,470 houses were damaged and 19,751 totally destroyed. The cyclone destroyed 371 classrooms and affected 807 teachers. It also affected 44 health units and damaged 67 kilometers of road."
        },
        {
            "published_date": "2025-01-22T05:15:11",
            "title": "Trumpocalypse: What Turbocharged Carbon Will Do to Our Children",
            "author": "Juan Cole",
            "url": "https://www.juancole.com/2025/01/trumpocalypse-turbocharged-children.html",
            "url_media": "https://media.juancole.com/images/2024/11/IMG_4491.jpg",
            "country": "US",
            "language": "en",
            "summary": "It's the 24th year of Our Trump and it's a bad time to be living in the U.S. because of the climate change. Donald Trump and Joe Manchin put billions into reviving Big Coal. It's too hot for the planes to take off and the planes are grounded. The highways are a parking lot and the price of gasoline is too high."
        },
        {
            "published_date": "2025-01-22T05:05:43",
            "title": "CARICOM and Ben Franklin",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/commentary/20250122/editorial-caricom-and-ben-franklin",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/01/22/3026736/8219408.jpg?itok=8MV0hSII",
            "country": "JM",
            "language": "en",
            "summary": "Donald Trump's presidency poses existential threats to the Caribbean. Since his inauguration, he has withdrawn the United States from the Paris Agreement on climate change. Caribbean countries are struggling to find the financing to respond to current climate-related catastrophes and harden their infrastructure against future threats."
        },
        {
            "published_date": "2025-01-22T05:04:00",
            "title": "New Zealand Climate Policies Fall Short: Urgent Action Needed",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/new-zealand-climate-policies-fall-short-urgent-1394492",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1505751172876-fa1923c5c528%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Last year was the warmest year on record globally and the first to exceed 1.5°C above pre-industrial levels. New Zealand's 2050 climate target has two components: Methane emissions from livestock must be cut by 24% to 47% below 2017 levels and emissions of all other greenhouse gases must reach net zero. The commission has made three main recommendations to raise ambition: a net negative target for emissions of long-lived gases, a higher target range for biogenic methane emissions and the inclusion of emissions from international shipping and aviation."
        },
        {
            "published_date": "2025-01-22T05:00:00",
            "title": "Letter to the editor: Will our species go extinct?",
            "author": "Pittsburgh News",
            "url": "https://triblive.com/opinion/letter-to-the-editor-will-our-species-go-extinct",
            "url_media": "https://triblive.com/wp-content/themes/TribLIVE2/assets/visuals/images/icons/head/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "The writer of the letter 'More meat, more CO2 among resolutions' ignores the overwhelming evidence that climate change is real and here now. Half the earth's population lives in coastal cities, many of which are already being flooded by rising sea level. Humans are displacing animal habitats everywhere, and species go extinct daily."
        },
        {
            "published_date": "2025-01-22T04:24:01",
            "title": "Brazil fires consumed wilderness area larger than Italy in 2024 – report",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/01/22/Brazil_fires_consumed_wilderness_area_larger_than_Italy_in_2",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "New report says more than 30m hectares burned, 79% more than in 2023. Brazil had its worst drought on record in 2024. Between January and January, between January and February, between 1.5 and 2.5 million hectares were burned. "
        },
        {
            "published_date": "2025-01-22T04:20:31",
            "title": "Africas climate change experience is a paradox, Says Yemi Osinbajo",
            "author": "Thisday",
            "url": "https://www.latestnigeriannews.com/p/4062050/africas-climate-change-experience-is-a-paradox-says-yemi-osinbajo.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Prof. Yemi Osinbajo (SAN) has said that Africa's climate change experience is a paradox. He stated this in Lagos recently at the 23rd S.L. Edu Memorial in honour of the former Vice President, Professor Yemi Ogunbajo."
        },
        {
            "published_date": "2025-01-22T03:21:00",
            "title": "Russian intelligence an ‘obvious candidate' behind antisemitic attacks",
            "author": "",
            "url": "https://www.skynews.com.au/australia-news/crime/russian-intelligence-an-obvious-candidate-behind-antisemitic-attacks/video/9ca86567bd8c011c30b74e2d0822ee3f",
            "url_media": "https://content.api.news/v3/images/bin/fc24f20ef61f25299286449f906bc2e2",
            "country": "AU",
            "language": "en",
            "summary": "Professor Greg Barton believes the rise of antisemitic attacks in Australia is due to foreign interference or a state actor. The AFP Commissioner is investigating whether 'overseas actors' have paid local criminals via cryptocurrency to carry out the attacks. Russian intelligence is an obvious candidate."
        },
        {
            "published_date": "2025-01-22T03:10:00",
            "title": "Southern Maryland Public School Delays for Wednesday, January 22, 2025",
            "author": "",
            "url": "https://smnewsnet.com/archives/542943/southern-maryland-public-school-delays-for-wednesday-january-22-2025",
            "url_media": "https://smnewsnet.com/wp-content/uploads/2022/01/snow-school-bus.jpg",
            "country": "US",
            "language": "en",
            "summary": "NAS Patuxent River's Edge Child and Youth Center and Child Development Center will be closed on Wednesday, Jan. 22, 2025 due to cold temperatures. St. Mary's County Public Schools will have a delayed opening of two hours for ten and eleven-month employees and food service workers. Charles County Public schools have no call yet. Anne Arundel Public Schools have no plans to delay opening. Prince George's County Schools will open 2 hours late."
        },
        {
            "published_date": "2025-01-22T02:46:46",
            "title": "Letters: US must wake up to the fact that climate change isn't a debate – it's a countdown",
            "author": "Irish Independent",
            "url": "https://article.wn.com/view/2025/01/22/Letters_US_must_wake_up_to_the_fact_that_climate_change_isn_",
            "url_media": "https://i.ytimg.com/vi/0ZGlHE1Qzbg/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "America needs to stop pretending climate change is up for discussion.    - John Sutter, editor-in-chief of Global Warming.org, says it's not up for debate.  - Sutter's blog is at: http://www.globalwasser.org/."
        },
        {
            "published_date": "2025-01-22T02:34:03",
            "title": "Save the world's glaciers to save the planet, says UN",
            "author": "Jawed Naqvi",
            "url": "https://www.dawn.com/news/1886827/save-the-worlds-glaciers-to-save-the-planet-says-un",
            "url_media": "https://www.dawn.com/_img/social-default.jpg",
            "country": "PK",
            "language": "en",
            "summary": "UN agencies launch an appeal to scale up efforts to save the world's 275,000 glaciers, which are rapidly melting away as the planet warms. The world's glaciers cover 700,000 square kilometres and store 70 percent of world's fresh water, which is essential for billions of people. President Donald Trump announced he would withdraw the US from the Paris climate accord."
        },
        {
            "published_date": "2025-01-22T02:20:00",
            "title": "Holden Beach bridge closed due to slippery conditions",
            "author": "WECT Staff",
            "url": "https://www.wect.com/2025/01/22/holden-beach-bridge-closed-until-further-notice-officials-say",
            "url_media": "https://gray-wect-prod.gtv-cdn.com/resizer/v2/PH66JR4GZRHOXIO5YDUWVW2O4I.png?auth=940ca4de49b7fbd7a9748286960131e865617c0f4593beeb318b40e2c36bad72&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "The Holden Beach bridge has been closed due to the winter storm, according to Mayor Alan Holden. Police closed the bridge due to cars sliding along the road. The bridge is closed until further notice, Mayor Holden said. The situation will be updated as more details become available."
        },
        {
            "published_date": "2025-01-22T01:48:42",
            "title": "Australian-Chinese research makes breakthrough in solving mystery of how Mars evolved",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/01/22/AustralianChinese_research_makes_breakthrough_in_solving_mys_4",
            "url_media": "https://article.wn.com/view/2025/01/22/[]",
            "country": "US",
            "language": "en",
            "summary": "Australian and Chinese scientists have made a breakthrough in solving the mystery of how the landscape of Mars evolved over billions of years. The data from marsquakes reveal how the planet's southern hemisphere is significantly hotter compared to its northern hemisphere, according to the study published on Wednesday."
        },
        {
            "published_date": "2025-01-22T01:21:38",
            "title": "To save Australia's animals, scientists must count how many are left. But what if they're getting it wrong?",
            "author": "Benjamin Scheele",
            "url": "https://theconversation.com/to-save-australias-animals-scientists-must-count-how-many-are-left-but-what-if-theyre-getting-it-wrong-247456",
            "url_media": "https://images.theconversation.com/files/643445/original/file-20250120-15-6q3dvr.jpg?ixlib=rb-4.1.0&rect=57%2C401%2C5398%2C2695&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Biodiversity monitoring helps document changes in animal and plant populations. It also helps experts decide if a species is at risk of extinction. Long-term monitoring programs can be challenging to maintain. A lack of funding means the results do not reflect the trajectory of a species across its entire range. Victoria Zoo has monitored 18 common species of birds for more than two decades across more than 570 sites in Australia's southeast."
        },
        {
            "published_date": "2025-01-22T01:08:06",
            "title": "Snow falling in Greenwood County",
            "author": "",
            "url": "https://www.foxcarolina.com/video/2025/01/22/snow-falling-greenwood-county",
            "url_media": "https://gray-whns-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F01-22-2025%2Ft_c70086e532a3451d929d2b9d48442cb6_name_file_1280x720_2000_v3_1_.jpg?auth=dc8dabee98997a645cfd4a23e2148b1a7d2e28c4db442eb30c323957b431feba&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Alexa Erbach speaks with residents about the weather conditions in Greenwood County, South Carolina, on FOX Carolina's Alexa Erbach's show \"This is Life on Earth\" on Fox Carolina's \"This Is Life on TV\" on Sunday at 8 p.m. ET"
        },
        {
            "published_date": "2025-01-22T01:06:32",
            "title": "Sleeping on beaches and staying social: how Australians kept cool in heatwaves before modern technology",
            "author": "Mandy Paul",
            "url": "https://theconversation.com/sleeping-on-beaches-and-staying-social-how-australians-kept-cool-in-heatwaves-before-modern-technology-247326",
            "url_media": "https://images.theconversation.com/files/643336/original/file-20250119-18-j1t8fe.jpeg?ixlib=rb-4.1.0&rect=6%2C222%2C1013%2C505&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "The Black Friday bushfires killed at least 420 people in southeastern Australia in January 1939. In the first fortnight of 1939, the capital city of Adelaide experienced 13 days of temperatures exceeding 34°C. January 12 was Adelaide's hottest day since records began: 46.1°C (recorded at the time as 117.7°F). Noel Weller, who lived on a suburban block in Glandore with his wife and two children, kept a daily diary. Irene Ingram lived in the closely-packed row cottages of Adelaide's East End in the 1930s with her husband and son. Florence Bond tried to sleep on a cane lounge in the garden with her dogs."
        },
        {
            "published_date": "2025-01-22T01:00:00",
            "title": "CLIMATE CHANGE: A call for action, not dismissal",
            "author": "",
            "url": "https://cdapress.com/news/2025/jan/22/climate-change-a-call-for-action-not-dismissal",
            "url_media": "https://hagadone.media.clients.ellingtoncms.com/static-4/cdapress/images/default-social.jpg?v=2",
            "country": "US",
            "language": "en",
            "summary": "The recent column dismissing 2024's heat record is wrong. The current warming far exceeds natural variability and aligns directly with industrial-era emissions. Heatwaves, droughts, and extreme weather, all intensified by climate change, are already reducing crop yields and threatening food security. Warming oceans fuel stronger hurricanes with higher rainfall, contributing to rising disaster costs. Renewable energy like solar and wind is increasingly cost-competitive, offering practical solutions to reduce emissions. Investing in these technologies and adaptation measures is preparation for the future."
        },
        {
            "published_date": "2025-01-22T00:49:00",
            "title": "New Hampshire Audubon hosts 38th annual Backyard Winter Bird Survey",
            "author": "Marissa Barrett",
            "url": "https://www.wmur.com/article/nh-audubon-backyard-winter-bird-survey-2025/63500932",
            "url_media": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/videoframe-1534854-679058ab79a1a.png?crop=0.351xw:0.350xh;0.519xw,0.308xh&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "New Hampshire Audubon is inviting bird lovers to participate in its 38th annual Backyard Winter Bird Survey. Last year, more than 1,500 people took part in the survey. The American Goldfinch was the most spotted species, with nearly 10,000 recorded sightings."
        },
        {
            "published_date": "2025-01-22T00:46:34",
            "title": "PHOTO COLLECTION: Winter Blasts Weather",
            "author": "",
            "url": "https://www.thetelegraph.com/news/article/photo-collection-winter-blasts-weather-20048018.php",
            "url_media": "https://s.hdnux.com/photos/01/46/60/16/26936221/3/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "The weather service issued cold weather advisories across the Great Lakes region. High temperatures in many places are expected to rise into the single digits Monday and Tuesday. The advisories are in effect from Monday until Tuesday morning.    in Chicago, the weather service said. "
        },
        {
            "published_date": "2025-01-22T00:42:46",
            "title": "Trump withdraws US from Paris Agreement",
            "author": "Newsbase",
            "url": "https://intellinews.com/trump-withdraws-us-from-paris-agreement-362765",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/US_Dept._of_State_-_PD_Cropped.jpg",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump has withdrawn the US from the Paris Agreement. It is the second time Trump has ordered the US to leave the global climate pact. The agreement obliges signatory countries to cut greenhouse gas emissions as part of the global goal to limit the world's temperature increase to well below 2°C and limit the rise to 1.5°C. The announcement comes at a difficult time for the US with wildfires raging in California and devastating hurricanes in Florida, North Carolina and Texas."
        },
        {
            "published_date": "2025-01-22T00:26:00",
            "title": "Scientists' Count of Aussie Animals Questioned",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/scientists-count-of-aussie-animals-questioned-1394800",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fuploads%2F1412533519888a485b488%2Fbb9f9777%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Biodiversity monitoring helps document changes in animal and plant populations. It also helps experts decide if a species is at risk of extinction. Long-term monitoring programs can be challenging to maintain. A lack of funding means the results do not reflect the trajectory of a species across its entire range. The study focused on 18 common bird species in Australia's southeast. It aimed to gauge how the birds responded to threats such as bushfires and logging."
        },
        {
            "published_date": "2025-01-22T00:10:00",
            "title": "How Aussies Stayed Cool Before Tech: Beaches & Socializing",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/how-aussies-stayed-cool-before-tech-beaches-1394793",
            "url_media": "https://images.theconversation.com/files/643336/original/file-20250119-18-j1t8fe.jpeg?ixlib=rb-4.1.0&rect=39%2C0%2C979%2C729&q=45&auto=format&w=496&fit=clip",
            "country": "US",
            "language": "en",
            "summary": "In the first fortnight of 1939, Adelaide endured 13 days of temperatures exceeding 34°C. January 12 was Adelaide's hottest day since records began: 46.1°C ( recorded at the time as 117.7°F). Most human deaths occurred during the preceding heatwave, but at least 420 people died as a result of the high temperatures during the week."
        },
        {
            "published_date": "2025-01-22T00:04:00",
            "title": "Cook Gov't Allocates $3M for WA Coastline Protection",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/cook-govt-allocates-3m-for-wa-coastline-1394789",
            "url_media": "https://www.parliament.wa.gov.au/webcms/webcms.nsf/resources/file-parliament-house-front-day/$file/parl-house-front-day.jpg",
            "country": "US",
            "language": "en",
            "summary": "More than $3 million in CoastWA grants available for coastal planning and management. It's part of Cook Labor Government's $33.5 million investment to mitigate coastal hazards. The CoastWA program seeks to ensure long-term sustainable land use and development of the State's coast."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "EXPLAINER - Will Trump's Paris Agreement pullout derail global climate action?",
            "author": "Rabia Ali",
            "url": "https://www.aa.com.tr/en/americas/explainer-will-trump-s-paris-agreement-pullout-derail-global-climate-action/3459258",
            "url_media": "https://cdnuploads.aa.com.tr/uploads/Contents/2025/01/22/thumbs_b_c_6e6cb27ad14f809e6f08a37e8aab2d50.jpg?v=151741",
            "country": "TR",
            "language": "en",
            "summary": "Donald Trump's decision to withdraw from the Paris Agreement is a setback for global climate change efforts, according to environmental experts. Without the US contributing its fair share, climate finances for vulnerable nations to build resilience and tackle impacts of global warming will fall drastically short, says Harjeet Singh."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Trade, tariffs, AI and UN chief Guterres dominate World Economic Forum agenda",
            "author": "Naharnet",
            "url": "https://article.wn.com/view/2025/01/22/Trade_tariffs_AI_and_UN_chief_Guterres_dominate_World_Econom",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "António Guterres, the U.N. secretary-general, warns about climate change and the risks posed by artificial intelligence. He says the world's thirst for fossil fuels is a \"Frankenstein monster\" that spares no one and is caused by burning fossil fuels."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Sydney, Melbourne, Brisbane weather: Australia set to swelter as temperatures soar to 46C - as ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/01/22/Sydney_Melbourne_Brisbane_weather_Australia_set_to_swelter_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will soar to 40C or more in almost all states and territories this week. The mercury will reach 46C in Birdsville on the border between Queensland and the Northern Territory on Wednesday. Windorah in the state's central west will be at 46C."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "What Trump's climate policy rollbacks may mean for WA",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/22/What_Trump_s_climate_policy_rollbacks_may_mean_for_WA",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There's been a lot of federal backtracking on climate change. States like ours need to lead the effort against climate change, because the federal government is already backing away from it.   .      \"All eyes now turn to states like ours\"  "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Deep freeze: From homeless advocates to ice boaters, how Jersey Shore is handling the cold",
            "author": "app",
            "url": "https://article.wn.com/view/2025/01/22/Deep_freeze_From_homeless_advocates_to_ice_boaters_how_Jerse",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Jim Gervolino, winter fleet captain of the Long Branch Ice Boat & Yacht Club, discusses how changing climate conditions are threatening iceboating in New Jersey. It's been the coldest January since 2015 along the Jersey Shore this week, so far this month."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Rita Ora Shows Off Body in Skimpy Green Bikini on Vacation in Australia",
            "author": "TMZ",
            "url": "https://article.wn.com/view/2025/01/22/Rita_Ora_Shows_Off_Body_in_Skimpy_Green_Bikini_on_Vacation_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Rita Ora is in Australia and she's showing off her bikini body down there. She's looking hotter than ever. She looks amazing in the pictures.      Â   in Australia. She is looking sexy in the photos. "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Climate crisis affecting rocky seashore species",
            "author": "Tyler Morning Telegraph",
            "url": "https://article.wn.com/view/2025/01/22/Climate_crisis_affecting_rocky_seashore_species_l",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The rise in the temperature of seas is changing the types of animals and plants found on rocky shores. The rise in sea temperature is affecting the species of plants and animals living on the seas. The change is due to the increase in the sea temperature.  "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "If the US government will be obstructionist on climate agreements, it's better they step out ...",
            "author": "The Economic Times",
            "url": "https://article.wn.com/view/2025/01/22/If_the_US_government_will_be_obstructionist_on_climate_agree_l",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "David G. Victor, professor at UC San Diego, explains 'global warming gridlock' and highlights solutions to the problem. He suggests solutions such as using more renewable energy sources.  .    \"Global warming\" is a term used to refer to the phenomenon of global warming."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "£15m investment in research to help UK prepare for climate change (NERC - Natural Environment Research Council)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/01/22/15m_investment_in_research_to_help_UK_prepare_for_climate_ch",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Researchers will work with business, industry and community bodies to develop long-term solutions to extreme weather and other effects of climate change. Restoring wetlands and forests, the effect of climate shocks on food prices and protecting vulnerable people will be among the goals.   (22 January 2025)"
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "With US no longer reliable, India must step up on climate action",
            "author": "Indian Express",
            "url": "https://article.wn.com/view/2025/01/22/With_US_no_longer_reliable_India_must_step_up_on_climate_act",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Delayed domestic action on climate change on the part of a large emitter like the US is hurtling the world, writes Robert Kuttner.    \"The US is hurting the world by not taking action on the issue of climate change.\" "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "How Malaysia can tackle the growing threat of climate change-affected El Ni�o and La Ni�a",
            "author": "The Star",
            "url": "https://article.wn.com/view/2025/01/22/How_Malaysia_can_tackle_the_growing_threat_of_climate_change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is supercharging these weather cycles, which are causing a lot more damage than they used to. Read full story at: http://www.dailymail.co.uk/news/article-news/climate-change-supercharges-weather-cycles-causing-a-lot-more-damage-than-previous-time."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "NZ's climate policies are no longer enough to keep warming at 1.5°C – here's what ...",
            "author": "Robert McLachlan",
            "url": "https://article.wn.com/view/2025/01/22/NZ_s_climate_policies_are_no_longer_enough_to_keep_warming_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Last year was the warmest year on record globally and the first to exceed 1.5C above pre-industrial levels. New Zealand is no longer net zero for all gases for all greenhouse gasses. It's too late to rein in further warming, but the ambition needs to rise with each delay in action."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "2024 sees hottest ocean temperature on record in Cook Islands waters",
            "author": "Cook Islands News",
            "url": "https://article.wn.com/view/2025/01/22/2024_sees_hottest_ocean_temperature_on_record_in_Cook_Island",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Sea Surface Temperature (SST) around the Cook Islands reached a record-breaking high of 29.5°C in March. It is the hottest ocean temperature ever recorded since 1970. The dramatic rise in sea temperatures has been closely monitored by the Meteorological Service."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "EXPLAINER - Will Trump's Paris Agreement pullout derail global climate action?",
            "author": "Anadolu Agency",
            "url": "https://article.wn.com/view/2025/01/22/EXPLAINER_Will_Trump_s_Paris_Agreement_pullout_derail_global",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Harjeet Singh is a climate activist. Without the US contributing its fair share, climate finances for vulnerable nations to build resilience and tackle impacts of global warming will fall short and deepen 'global climate injustices', says Harjeet. The US has the biggest historical setback for the global fight against climate change."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Cook Labor Government funds more than $3 million grants package to protect WA's coastline (State Government of Western Australia)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/01/22/Cook_Labor_Government_funds_more_than_3_million_grants_packa",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There are more than $3 million in CoastWA grants available for coastal planning and management. It's part of Cook Labor Government's $33.5 million investment to mitigate coastal hazards. Applications close on 14 April 2025. It will help protect and manage Western WA's coastal areas."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Fossil discovery in the Geiseltal Collection: Researchers identify unique bird skull",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/01/22/Fossil_discovery_in_the_Geiseltal_Collection_Researchers_ide",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Diatryma roamed the Geiseltal region in southern Saxony-Anhalt 45 million years ago. It was a flightless bird that stood 4.6 feet tall (1.40 meters) tall. An international team of scientists studied it."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Africa's climate change experience is a paradox, Says Yemi Osinbajo",
            "author": "This Day",
            "url": "https://article.wn.com/view/2025/01/22/Africa_s_climate_change_experience_is_a_paradox_Says_Yemi_Os",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Prof. Yemi Osinbajo (SAN) has said that Africa's climate change experience is a paradox. He stated this in Lagos recently at the 23rd S.L. Edu Memorial Lecture, tagged Greening Africa's Economies: Can Climate Positive Growth."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Advocacy group says new men-only warming centres in Waterloo region 'not an acceptable solution'",
            "author": "CBC",
            "url": "https://article.wn.com/view/2025/01/22/Advocacy_group_says_new_menonly_warming_centres_in_Waterloo_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Region of Waterloo needs to address gender stipulations on newly announced warming centres. The region is under an extreme cold warning and advocates are calling on the Region to address the issue.      Â  .   y   i "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Farmers urged to adopt sustainable practices",
            "author": "FBC News",
            "url": "https://article.wn.com/view/2025/01/22/Farmers_urged_to_adopt_sustainable_practices",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is threatening the viability of sugarcane crops in Fiji. Sugar Research Institute of Fiji is urging farmers to grow them. It is urging them to take steps to reduce CO2 emissions.      Â   in this regard. "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Rethinking capitalism: Can it adapt to the Anthropocene's demands?",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/22/Rethinking_capitalism_Can_it_adapt_to_the_Anthropocenes_dema",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Anthropocene epoch is an epoch in which human activity is dictating environmental and biological change on Earth as it did in previous periods. It is a relatively recent term.    It was coined to define the epoch where humans are increasingly dictating the environment. "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Earth's Magnetic North Pole Is On The Move, This Is How Far It Has Shifted",
            "author": "NDTV",
            "url": "https://article.wn.com/view/2025/01/22/Earths_Magnetic_North_Pole_Is_On_The_Move_This_Is_How_Far_It",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Earth's magnetic north pole is drifting towards Russia at an accelerated speed. It is now closer to Siberia than it was five years ago, according to British scientists. It's now drifting towards Siberia at a faster rate than it did before. It was drifting closer to Russia 5 years ago."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "The significance of Trump withdrawing from the Paris Climate Agreement",
            "author": "CBS News",
            "url": "https://article.wn.com/view/2025/01/22/The_significance_of_Trump_withdrawing_from_the_Paris_Climate",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "President Trump again withdrew the U.S. from the Paris Climate Agreement. The agreement aims to fight global warming. CBS News national environmental correspondent David Schechter reports on the move and its impact on the environment and climate change.      "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Times letters: Omissions in President Trump's to-do list",
            "author": "The Times/The Sunday Times",
            "url": "https://article.wn.com/view/2025/01/22/Times_letters_Omissions_in_President_Trump_s_todo_list",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "William Hague highlights the omissions in President Trump's first-day blitz ('It's what Trump won't do that is worrying', Jan 20). The most egregious is climate change. There is a bizarre reference in Trump's speech to the damage done in the Carolinas by Hurricane Helene."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Mounds of Donated Clothes Are Clogging Beaches in Ghana",
            "author": "Yahoo Daily News",
            "url": "https://article.wn.com/view/2025/01/22/Mounds_of_Donated_Clothes_Are_Clogging_Beaches_in_Ghana",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ghana is located on the southern coast of West Africa. It has more than 500 kilometers of coastline that arcs around the country. It is located in the southern part of the country, on the coast of Ghana.      Â  "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Incredibly rare sight to leave Australian skies for the next 800,000 years: 'It's amazing to ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/01/22/Incredibly_rare_sight_to_leave_Australian_skies_for_the_next",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The G3 Atlas comet has returned to southern hemisphere skies for a once-in-a-lifetime show. Stargazers are in for a treat this week as a rare comet passes by. A few lucky Aussies have already snapped pictures of the spectacular sight."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "National Adaptation Plans: Building Resilience in a Changing Climate",
            "author": "APO",
            "url": "https://article.wn.com/view/2025/01/22/National_Adaptation_Plans_Building_Resilience_in_a_Changing_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There is a need to prepare national plans to adapt to the escalating impacts of climate change. Developed and developing countries are increasingly recognizing the threat posed by rising temperatures and extreme weather events and prioritizing climate resilience to safeguard their citizens.   .  "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Arctic blast grips much of the country",
            "author": "Good Morning America",
            "url": "https://www.goodmorningamerica.com/news/video/arctic-blast-grips-country-117970054",
            "url_media": "https://s.abcnews.com/images/GMA/250122_gma_perez1_hpMain_16x9_1600.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are in the single digits in Chicago as a winter blast hits millions. Alex Perez reports from the area.    for ABC News' Alex Perez on the weather in Chicago and the rest of the U.S. on the ABC News website. "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Farms in peril",
            "author": "Sajid Awan",
            "url": "https://www.thenews.com.pk/print/1274652-farms-in-peril",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-01-22/l_1274652_012037_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's agricultural sector faces significant challenges due to changing weather patterns. Uncertain rainfall, rising temperatures and changing seasonal cycles are making it difficult for farmers to grow crops and raise livestock. The government should develop a national climate change policy that focuses on farmers' needs. "
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Spokesperson's Remarks｜China responds to US announcement to withdraw from Paris Agreement and WHO",
            "author": "作者：马子倩",
            "url": "http://news.cyol.com/gb/articles/2025-01/22/content_VY2vVEIv9Y.html",
            "url_media": "http://news.cyol.com/themes/cyol/assets/images/cyol/cyol_logo.png",
            "country": "CN",
            "language": "en",
            "summary": "Chinese Foreign Ministry responded to questions regarding US withdrawing from the Paris Agreement and WHO. China's resolve and actions to actively respond to climate change will remain unchanged. WHO plays a central role in coordinating global public health governance. China will continue to support WHO in fulfilling its duty."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Letter to the editor: We are in a new era",
            "author": "Ron Sadler",
            "url": "https://www.chronline.com/stories/letter-to-the-editor-we-are-in-a-new-era,374141",
            "url_media": "https://cdn3.creativecirclemedia.com/lafromboise/original/20210304-152925-Letters.jpg",
            "country": "US",
            "language": "en",
            "summary": "Scientists announced that 2024 will be the hottest year on record due to climate change. Al Gore warned that the world has entered a new era of chaotic floods, storms and fires made worse by human-caused Climate Change. Wildfires are highly unusual in Southern California in January, which is supposed to be the rainy season."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "EDITORIAL: What effect will Trump's climate stance have on Bahamas?",
            "author": "",
            "url": "https://www.tribune242.com/news/2025/jan/22/editorial-what-effect-will-trumps-climate-stance-have-on-bahamas",
            "url_media": "https://thetribune.media.clients.ellingtoncms.com/static-4/thetribune/images/pdf-edition.jpg",
            "country": "BH",
            "language": "en",
            "summary": "The first day of Donald Trump's second term in office saw a flurry of executive orders and landed the new agenda right on the doorstep of The Bahamas. In November, Foreign Affairs Minister stated that the number one issue for The Bahamas is climate change. He warned that severe sea level rise could leave 70 percent of New Providence underwater by 2100. Prime Minister Philip Davis has built his reputation around the world on sounding the warning alarm over climate change and trying to make industrialised nations pay for the damage they have caused."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Open Forum: California's wildfires are a 'wake-up call for everyone'",
            "author": "NICK SNOW",
            "url": "https://www.winchesterstar.com/winchester_star/open-forum-california-s-wildfires-are-a-wake-up-call-for-everyone/article_267a5a06-c4a6-5ebb-b603-44ff75e028de.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/winchesterstar.com/content/tncms/custom/image/b90e1064-655d-11e6-b66e-837339c5a247.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "John Massoud and Nick Snow respond to John Massoud's Open Forum. Massoud is correct that the Los Angeles wildfires are a \"self-inflicted disaster\" and that environmental extremism is to blame for the California disaster. In 2023, wildfire activity reached record levels, with global forest fires surpassing previous records by 24%. This decade contains three of the four worst global wildfire seasons."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Horn of Africa zone set for below-average rains season",
            "author": "Joseph Prosper",
            "url": "https://www.ippmedia.com/the-guardian/news/world/read/horn-of-africa-zone-set-for-below-average-rains-season-2025-01-22-184031",
            "url_media": "https://www.ippmedia.com/images/favicon_ippmedia.png",
            "country": "TZ",
            "language": "en",
            "summary": "The Greater Horn of Africa will experience below-normal rainfall during the March to May rainy season. The region is going through a spate of climate variability. The predicted climatic conditions for the season are likely to have gender-differentiated impacts on the affected populations. The most adverse effects are expected among women, children, older persons, and persons with disabilities."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "LETTER: American Livestock and Future Wildland Fires",
            "author": "Post Contributor",
            "url": "https://pagosadailypost.com/2025/01/22/letter-american-livestock-and-future-wildland-fires",
            "url_media": "https://pagosadailypost.com/wp-content/uploads/2016/04/16LogoPDP_120-150x150.jpg",
            "country": "US",
            "language": "en",
            "summary": "After the California wildfires, we need to get more serious about addressing global warming. Political leaders should support more public funding for cultivated-meat research. Cultivated meat is grown from livestock cells, without slaughter. It will require a fraction of the greenhouse-gas emissions that raising and slaughtering livestock does."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "More drought, less snowfall in report",
            "author": "The Nugget Newspaper",
            "url": "https://www.nuggetnews.com/story/2025/01/22/news/more-drought-less-snowfall-in-report/37325.html",
            "url_media": "https://www.nuggetnews.com/home/cms_data/dfault/images/companylogo_facebook.png",
            "country": "US",
            "language": "en",
            "summary": "The Seventh Oregon Climate Assessment was published Wednesday. It was written by 65 scientists, experts, and engineers from Oregon State University, the Oregon Department of Energy, and the U.S. Department of Agriculture. The report is used in statewide emergency and natural hazard planning. The average annual temperature in Oregon has increased 2.2 degrees Fahrenheit since the industrial revolution began. It is expected to rise at least 5 degrees in the next 50 years and 7.6 degrees by the end of the century."
        },
        {
            "published_date": "2025-01-22T00:00:00",
            "title": "Tracks in the snow",
            "author": "Larry Whiteley",
            "url": "https://www.bolivarmonews.com/stories/tracks-in-the-snow,131623",
            "url_media": "https://bolivarbanners.creativecirclemedia.com/www/delivery/avw.php?zoneid=21&cb=INSERT_RANDOM_NUMBER_HERE&n=a2a05a5a",
            "country": "US",
            "language": "en",
            "summary": "The thermometer out the window shows the temperature is in the mid-teens again, as it had been for several mornings lately. It's not windy and the wind chills are in the single-digit range, so what happened to global warming?"
        }
    ]
}