{
    "status": "ok",
    "total_articles": 97,
    "articles": [
        {
            "published_date": "2025-01-18T23:42:25",
            "title": "Corporate climate action was sidelined in 2024. This year may be worse",
            "author": "Mark Wembridge",
            "url": "https://www.afr.com/policy/energy-and-climate/corporate-climate-action-was-sidelined-in-2024-this-year-may-be-worse-20241227-p5l0ur",
            "url_media": "https://static.ffx.io/images/$zoom_0.7936%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_86/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_opinion_no_age_social_wm/da6a45186519b3ccd3620dcc0e1fe09d07d511df",
            "country": "AU",
            "language": "en",
            "summary": " 2024 was the hottest year on record. However, corporate profits were the main reason behind the cooling in attitudes towards climate action. For some companies, taking steps to achieve their green targets was shoved into the 'too hard', 'too expensive', or 'just plain irrelevant' baskets."
        },
        {
            "published_date": "2025-01-18T23:12:06",
            "title": "The Australian Open revamped its heat policy seven years ago. How does it work?",
            "author": "Madi Chwasta",
            "url": "https://www.abc.net.au/news/2025-01-19/australian-open-heat-policy/104794752",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/e61311d80e8603dbde2824ff90c8af5e?impolicy=wcms_watermark_news&cropH=1680&cropW=2982&xPos=0&yPos=308&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Carolyn Broderick was appointed chief health officer of the Australian Open in 2017. She developed a method to assess the risk of an athlete developing heat stroke in real time. Ollie Jay, a professor of heat and health from the University of Sydney, co-developed the heat policy."
        },
        {
            "published_date": "2025-01-18T22:51:27",
            "title": "Red flag warning issued for Inland Empire, western Coachella Valley as strong winds loom",
            "author": "Desert Sun",
            "url": "https://article.wn.com/view/2025/01/18/Red_flag_warning_issued_for_Inland_Empire_western_Coachella_",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Red flag warning has been issued for rapid fire spread and extreme fire behavior. Sara Robins, a 10-year resident of Idyllwild, California, shares her wildfire concerns amid the LA fires. Sara is worried about living with wildfire concerns in IdyllWildlife."
        },
        {
            "published_date": "2025-01-18T21:47:19",
            "title": "California wildfire: Will Trump reconsider the Paris Accord?",
            "author": "",
            "url": "https://www.brecorder.com/news/40343377/california-wildfire-will-trump-reconsider-the-paris-accord",
            "url_media": "https://i.brecorder.com/large/2025/01/678c02b7baa47.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The wildfires in California have devastated over 35,840 acres (56 square miles) since they began on January 7, 2025. The fires have claimed at least 16 lives and destroyed more than 12,000 structures, including homes and businesses. The economic losses are estimated between $135 billion and $150 billion. The situation remains critical as strong Santa Ana winds and dry conditions fuel the blazes."
        },
        {
            "published_date": "2025-01-18T20:26:16",
            "title": "A Century of UFO Psyops Exposed Part 3: Spooks, Scientologists, Satanists, and The New Mind Wars",
            "author": "The Last American Vagabond",
            "url": "https://article.wn.com/view/2025/01/18/A_Century_of_UFO_Psyops_Exposed_Part_3_Spooks_Scientologists",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Since the world is being pushed towards the greatest and most destructive magic trick in history that is the nuclear bomb, it's a good idea to focus on the present situation instead of looking towards the future.   .   in the future, the world will get closer to nuclear bomb."
        },
        {
            "published_date": "2025-01-18T19:00:22",
            "title": "Book review: A thoughtful must-read on the carbon tax issue",
            "author": "Tom Sandborn",
            "url": "https://windsorstar.com/entertainment/books/book-review-thoughtful-read-carbon-tax",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/01/pedersen-alaska-glacier_courtesy-author.jpeg",
            "country": "CA",
            "language": "en",
            "summary": "The body's secretary-general Celeste Saulo said late last year: 'The record-breaking rainfall and flooding, rapidly intensifying tropical cyclones, deadly heat, relentless drought and raging wildfires that we have seen in different parts of the world this year are unfortunately our new reality and a foretaste of our future' Many observers have called for a carbon tax as a way to reduce emissions and slow the damage we are doing. Thomas F. Pederson, professor emeritus at the University of Victoria and founding executive director of the Pacific Institute for Climate Solutions, has written a book on the topic."
        },
        {
            "published_date": "2025-01-18T18:23:17",
            "title": "2.3 billion people rely on polluting cooking methods, sparking call for eco-friendly alternatives",
            "author": "",
            "url": "https://www.ntv.co.ug/ug/news/national/2-3-billion-people-rely-on-polluting-cooking-methods-sparking-call-for-eco-friendly-alternatives-4893930",
            "url_media": "https://www.ntv.co.ug/resource/blob/4893928/f606dd9318885cac625267baa5c97ad6/eco-data.png",
            "country": "UG",
            "language": "en",
            "summary": "2.3 billion people rely on polluting cooking methods. Government and organizations are calling for the adoption of eco-friendly alternatives like clean cooking technologies like briquettes. Today, we look at how briquette are part of the climate solution and how they can help the environment."
        },
        {
            "published_date": "2025-01-18T18:21:22",
            "title": "Scientists Expose Major Problems With Climate Change Data",
            "author": "TLB Staff",
            "url": "https://www.thelibertybeacon.com/scientists-expose-major-problems-with-climate-change-data",
            "url_media": "https://www.thelibertybeacon.com/wp-content/uploads/2025/01/Climate-Chg-Data-ET-feat-1-18-25.jpg",
            "country": "US",
            "language": "en",
            "summary": "The latest U.S. government National Climate Assessment report states that global warming is accelerating because of human activities. But scientific experts from around the world in a variety of fields are pushing back. They cite a wide range of flaws with the global temperature data used to reach the dire conclusions. They say it's time to reexamine the whole narrative."
        },
        {
            "published_date": "2025-01-18T18:17:05",
            "title": "B.C. Climate News: Officials say global temperatures this year to rival 2024's record-breaking heat",
            "author": "Tiffany Crawford",
            "url": "https://vancouversun.com/news/climate-change-news-jan-19-2025",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/01/2192419849.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The Intergovernmental Panel on Climate Change says humans are the main drivers of climate change. It warns the window to limit warming to 1.5 C above pre-industrial times is closing. The Earth is now about 1.3 C warmer than it was in the 1800s. 2024 was hottest on record globally, beating the last record in 2023."
        },
        {
            "published_date": "2025-01-18T18:00:44",
            "title": "Safeguarding Saint Lucia: A Call to Action",
            "author": "Vp Digital",
            "url": "https://thevoiceslu.com/2025/01/safeguarding-saint-lucia-a-call-to-action",
            "url_media": "https://thevoiceslu.com/wp-content/uploads/2021/07/Climate-change.jpg",
            "country": "LC",
            "language": "en",
            "summary": "Small Island Developing States (SIDS) stand to lose the most from sea level rise due to climate change. SIDS should focus on climate change adaptation measures this year rather than wait for large and developed countries that emit greenhouse gases to provide them with the necessary resources. The island's location in the hurricane zone and periodic seismic disturbances highlight the need for a forward-thinking approach to climate resilience."
        },
        {
            "published_date": "2025-01-18T17:30:54",
            "title": "Storm surges and planning for coastal resilience along Monterey Bay",
            "author": "Tracey Weiss",
            "url": "https://www.santacruzsentinel.com/2025/01/18/tracey-weiss-our-ocean-backyard-storm-surges-and-planning-for-coastal-resilience-along-monterey-bay",
            "url_media": "https://www.santacruzsentinel.com/wp-content/uploads/2023/01/STC-L-STORMGALLERY-0106-08_102873842.jpg?w=1024&h=634",
            "country": "US",
            "language": "en",
            "summary": "The storm surge from December's storm has damaged Santa Cruz Wharf and damaged the Santa Cruz Harbor. Most of California's coastal communities did not prepare for climate change. The U.S. Bureau of Oceans and International Environmental and Scientific Affairs released a new National Adaptation and Resilience Planning Strategy on Jan. 10. California State Coastal Conservancy made additional investments to help local coastal resilience and recovery projects."
        },
        {
            "published_date": "2025-01-18T17:24:58",
            "title": "The desperate need for degrowth neutral Capitalism",
            "author": "Martyn Bradbury",
            "url": "https://thedailyblog.co.nz/2025/01/19/the-desperate-need-for-degrowth-neutral-capitalism",
            "url_media": "https://thedailyblog.co.nz/wp-content/uploads/2024/10/Screenshot-2024-06-02-at-3.07.33 PM-600x558.png",
            "country": "NZ",
            "language": "en",
            "summary": "The global economy could face 50% loss in GDP between 2070 and 2090 from the catastrophic shocks of climate change unless immediate action by political leaders is taken to decarbonise and restore nature. At 3C or more of heating by 2050, there could be more than 4 billion deaths, significant sociopolitical fragmentation worldwide, failure of states and significant loss of capital. Right now, poverty is a choice for this Government, their focus is on their Donors interests, not the common good."
        },
        {
            "published_date": "2025-01-18T17:16:52",
            "title": "Something Concerning Is Happening To The Sea Near Bermuda",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/01/18/Something_Concerning_Is_Happening_To_The_Sea_Near_Bermuda",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "After 40 years of tracking, scientists have noticed that the Atlantic Ocean surrounding Bermuda is warming and losing oxygen. The ocean is also becoming increasingly salty.   .   i   in this context,  in the context of the warming Atlantic Ocean, the change of temperature and the loss of oxygen."
        },
        {
            "published_date": "2025-01-18T17:06:57",
            "title": "Big Oil Faces Wave of Climate Lawsuits from U.S. States and Territories",
            "author": "Oil Price",
            "url": "https://article.wn.com/view/2025/01/18/Big_Oil_Faces_Wave_of_Climate_Lawsuits_from_US_States_and_Te",
            "url_media": "https://i.ytimg.com/vi/iMjHQLwBTwU/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hawaii, Alaska, and Puerto Rico are some of the U.S. states and territories most affected by climate change. They have all launched lawsuits against either the government or oil, which they claim is to blame for climate change, and they are suing the government and oil."
        },
        {
            "published_date": "2025-01-18T16:18:59",
            "title": "California couple found their diamond wedding ring in the rubble of their burnt home",
            "author": "",
            "url": "https://www.kens5.com/video/news/nation-world/california-couple-found-their-diamond-wedding-ring-in-the-rubble-of-their-burnt-home/273-549fbbd1-8808-40c1-9df3-0d594ea8e084",
            "url_media": "https://media.kens5.com/assets/KENS/images/bdcaea85-6e60-4609-960c-5cdf5a7f1e76/20250118T161616/bdcaea85-6e60-4609-960c-5cdf5a7f1e76_1140x641.jpg",
            "country": "US",
            "language": "en",
            "summary": "ng study suggests that recent California wildfires were more intense because of planet-warming fossil fuel production. Next up in 5 minutes.   .   \"The next up in five minutes\"  \"A new study suggests recent California wildfire was more intense due to planet- warming. "
        },
        {
            "published_date": "2025-01-18T16:00:40",
            "title": "Joe Rogan listeners left baffled by theory on how world will end that has finally been declassified by CIA",
            "author": "Anish Vij",
            "url": "https://www.ladbible.com/entertainment/celebrity/joe-rogan-jimmy-corsetti-climate-change-theory-875416-20250118",
            "url_media": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blte2ddfeebee60b9ca/678bcd5c792ae4ae9c01a301/Joe-Rogan-theory-how-world-will-end.png",
            "country": "GB",
            "language": "en",
            "summary": "The Adam and Eve Story, a book written in 1965 by Chan Thomas, has been declassified by the CIA. It claims that the Earth will flip 90 degrees in 6,500 years and there will be a standstill, the sun will stay in the same spot, and the wind will travel at 1,000 miles per hour at the equator. Media Matters for America shared a report in 2023, issuing caution against the 'Adam and Eve' theory."
        },
        {
            "published_date": "2025-01-18T15:03:44",
            "title": "Another Arctic blast is here, but how much colder than ‘normal' is it really?",
            "author": "Richard B.  Rood",
            "url": "https://ca.news.yahoo.com/arctic-blast-feel-brutally-cold-132215549.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ow72QFcO_2J6fFXpyZER1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NzQ-/https://media.zenfs.com/en/the_conversation_us_articles_815/c7c2ba6d551936ba05cb630a70e5780e",
            "country": "US",
            "language": "en",
            "summary": "A large part of the U.S. is getting hit with another Arctic blast, adding to an already cold January 2025. Forecasters expect temperatures to drop below zero in several states, and to plunge to more than minus 30 in parts of the Dakotas, Minnesota and Wisconsin. Global temperatures have been rising over the past century and the trend has accelerated since 1980."
        },
        {
            "published_date": "2025-01-18T14:50:49",
            "title": "Lightning strikes on the rise in Kerala; Kottayam tops the list, says study",
            "author": "Mini Muringatheri",
            "url": "https://www.thehindu.com/news/national/kerala/lightning-strikes-on-the-rise-in-kerala-kottayam-tops-the-list-says-study/article69113072.ece",
            "url_media": "https://th-i.thgim.com/public/news/national/kerala/u0uwdi/article69113129.ece/alternates/LANDSCAPE_1200/Lightning_hits_tree.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Kottayam district in Kerala has the highest rate of lightning strikes per square kilometre per year. Districts like Thrissur and Palakkad report the lowest frequency. The primary cause of these lightning strikes in Kerala is the formation of cumulonimbus clouds along the slopes of the Western Ghats due to convection. Rising sea surface temperatures are a key factor contributing to the increased frequency of thunderstorms."
        },
        {
            "published_date": "2025-01-18T14:22:23",
            "title": "Rare migratory bird is now considered extinct",
            "author": "Nachrichten",
            "url": "https://www.krone.at/3658627",
            "url_media": "https://imgl.krone.at/scaled/3658625/vc10101/og_image.jpg",
            "country": "AT",
            "language": "en",
            "summary": "The last confirmed sighting of the thin-billed curlew dates back to the 1990s. The species is now \"irretrievably lost\". Conservationists describe the disappearance of the migratory bird as a \"sad milestone in the history of species extinction\"."
        },
        {
            "published_date": "2025-01-18T14:21:06",
            "title": "Andres Chang",
            "author": "Andres Chang",
            "url": "https://www.commondreams.org/author/andres-chang",
            "url_media": "https://www.commondreams.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTY3MDAxOS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc5NDg0MjY1MX0.wKtiPBCW-ccQo5mltBx9LQvbKpETZaTkJ3eNK6vchNw/image.png?width=210",
            "country": "US",
            "language": "en",
            "summary": "Andres Chang is a senior research specialist at Greenpeace USA. His areas of focus include climate change mitigation and pathways, the oil and gas industry, and environmental protest. He has a background in Earth system modeling and holds an ScB in Geology-Physics from Brown University. He spent more than four years leading research projects at the U.N.-backed Science Based Targets initiative."
        },
        {
            "published_date": "2025-01-18T14:00:00",
            "title": "Cerca de 100 vulcões têm o potencial de entrar em erupção na Antártida",
            "author": "thedailydigest.com",
            "url": "https://www.msn.com/en-za/news/other/cerca-de-100-vulc%C3%B5es-t%C3%AAm-o-potencial-de-entrar-em-erup%C3%A7%C3%A3o-na-ant%C3%A1rtida/ss-AA1xpT2X",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Accelerated melting of ice in Antarctica could activate hidden volcanoes beneath its surface, according to a recent study by scientists from the University of Washington.      .   in the study. In the study, scientists warned that the melting of the ice could activate the volcanoes. "
        },
        {
            "published_date": "2025-01-18T13:56:24",
            "title": "Kenora and Lake of the Woods Region Settling into Arctic Weather Hug",
            "author": "Net News Ledger Weather Desk",
            "url": "https://www.netnewsledger.com/2025/01/18/kenora-and-lake-of-the-woods-region-settling-into-arctic-weather-hug",
            "url_media": "https://www.netnewsledger.com/wp-content/uploads/2020/12/Ice-Fishing-twenty20_14c3e1dd-4866-4d83-bb25-66d7a0516306-696x522.jpg",
            "country": "US",
            "language": "en",
            "summary": "It's -26°C at the Kenora Airport this morning with light snow and wind chill of -39°C. The snow will clear out to reveal mainly sunny skies today, but don't expect any warmth from the sunshine. The high will reach a frosty -23°C, with wind chills near -39 °C in the morning and -34 °C by the afternoon. The temperature is expected to plummet to -30°C tonight, and it will feel closer to -41°C overnight. Frostbite is a serious risk, with exposed skin freezing in minutes."
        },
        {
            "published_date": "2025-01-18T13:36:56",
            "title": "What If the Los Angeles Fires Were a Turning Point?",
            "author": "Heather Souvaine Horn",
            "url": "https://news.knowledia.com/all/all/articles/what-if-the-los-angeles-fires-were-a-turning-point-4b416043c88a14e0a20e511e8153a30251fd3e7d",
            "url_media": "https://images.newrepublic.com/b1a43abfe77ffb2409a92555c27af7cd971e77b1.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "country": "FR",
            "language": "en",
            "summary": "The Wall Street Journal ridicules the idea that climate change could have played a role in the recent dry spell in Los Angeles. Donald Trump, days away from his second term as president, blamed the destruction on Democratic California Governor Gavin Newsom and a tiny fish called the delta smelt."
        },
        {
            "published_date": "2025-01-18T13:32:07",
            "title": "The Dimming",
            "author": "Jessica Rose",
            "url": "https://jessicar.substack.com/p/the-dimming",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F835f3836-33c8-4dd5-983a-35d046ae90a1_1952x1086.png",
            "country": "US",
            "language": "en",
            "summary": "Covert climate engineering operations are wreaking havoc on already badly damaged climate systems around the world. GeoengineeringWatch.org documentary \"The Dimming\" has reached a milestone of over 25 million views on YouTube as we enter 2025. All are needed in the critical battle to wake populations to what is coming."
        },
        {
            "published_date": "2025-01-18T13:25:05",
            "title": "How (Almost All) Life Went Extinct",
            "author": "",
            "url": "https://www.ynetnews.com/environment/article/bkek97tpkx",
            "url_media": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/01/18/B1pS9Qtwyg/B1pS9Qtwyg_0_0_580_435_0_large.jpg",
            "country": "IL",
            "language": "en",
            "summary": "The Permian-Triassic Mass Extinction wiped out 90% of all species on Earth 250 million years ago. New study suggests that El Niño played a significant role in the extinction. It suggests a strong connection between greenhouse gases, El Niño, and the global climate system."
        },
        {
            "published_date": "2025-01-18T13:03:19",
            "title": "The Challenges of Central American Integration in 2025 ⋆ The Costa Rica News",
            "author": "Tcrn Staff",
            "url": "https://thecostaricanews.com/the-challenges-of-central-american-integration-in-2025",
            "url_media": "https://thecostaricanews.com/wp-content/uploads/2025/01/descarga-1.jpg",
            "country": "CR",
            "language": "en",
            "summary": "The Central American integration in 2025 faces a series of complex challenges. They include economic inequality, migration, security, climate change, governance, and education. Central America is one of the most vulnerable regions to climate change. Institutional weakness and corruption are major obstacles. Strengthening institutions and promoting transparency and accountability are necessary steps to advance integration."
        },
        {
            "published_date": "2025-01-18T13:01:31",
            "title": "Severe drought conditions issued for 11 counties in eastern N.C. including portions of Dare and Hyde",
            "author": "",
            "url": "https://islandfreepress.org/outer-banks-news/severe-drought-conditions-issued-for-11-counties-in-eastern-n-c-including-portions-of-dare-and-hyde",
            "url_media": "https://islandfreepress.org/wp-content/uploads/2025/01/drought.jpg",
            "country": "US",
            "language": "en",
            "summary": "11 counties in eastern North Carolina are experiencing severe drought conditions. 42 counties are experiencing moderate drought. La Niña pattern is expected to continue for the rest of the winter. The next update will be on Jan. 23. The drought map is updated weekly on Thursdays based on conditions through Tuesday."
        },
        {
            "published_date": "2025-01-18T13:00:53",
            "title": "Siberian air is descending on Canada. Here's what to know about the 'polar vortex'",
            "author": "Stewart Lewis",
            "url": "https://www.recorder.ca/news/canada/cold-winter-canada-polar-vortex",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/01/20240130120136-65b9339e079b8a5150ffe20djpeg.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The intense cold snap about to settle over most of Canada and the U.S. has been dubbed a 'polar vortex', but Environment Canada Senior Climatologist David Phillips says it could just as easily be called 'Arctic air or Siberian air'.   "
        },
        {
            "published_date": "2025-01-18T12:28:04",
            "title": "What Makes Earth Uniquely Capable of Hosting Fire? — Curiosmos",
            "author": "Hey",
            "url": "https://curiosmos.com/what-makes-earth-uniquely-capable-of-hosting-fire",
            "url_media": "https://curiosmos.com/wp-content/uploads/2024/09/Incredible-Animation-Tracks-Earths-Tectonic-Plates-Over-1.8-Billion-Years.jpg",
            "country": "US",
            "language": "en",
            "summary": "For billions of years, Earth itself lacked fire. Life on Earth changed 2.4 billion years ago during the Great Oxidation Event. It took millions of years for oxygen levels to stabilize at the right concentration to support combustion. During the Devonian period, around 383 million years ago, oxygen levels stabilized within the range of 13% to 35%."
        },
        {
            "published_date": "2025-01-18T12:26:00",
            "title": "Stakes high for New Mexico ag growers awaiting new farm bill",
            "author": "Roz Brown",
            "url": "https://kiowacountypress.net/content/stakes-high-new-mexico-ag-growers-awaiting-new-farm-bill",
            "url_media": "https://kiowacountypress.net/sites/default/files/favicon-512.png",
            "country": "US",
            "language": "en",
            "summary": "There has been no update to the Farm Bill since 2018. Sayrah Namaste, program co-director for the American Friends Service Committee, regularly meets with farmers who provide food to local schools. Climate change is accelerating so fast that it's hard for farmers to keep up with what they need to do."
        },
        {
            "published_date": "2025-01-18T12:00:00",
            "title": "Climate change is literally impacting time itself",
            "author": "Kurtis Alexander",
            "url": "https://www.msn.com/en-us/news/technology/climate-change-is-literally-impacting-time-itself/ar-AA1xqgGj",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "There have been 27 leap seconds added to Coordinated Universal Time since 1972. Earth's rotation has been slowing down recently and the length of the day has started getting shorter. Geophysicist Duncan Agnew predicts that a second will be added to universal time as soon as next year and removed in 2029."
        },
        {
            "published_date": "2025-01-18T12:00:00",
            "title": "AARON SAWATSKY-KINGSLEY: 2024 was the hottest year so far",
            "author": "Aaron Sawatsky-Kingsley",
            "url": "https://www.goshennews.com/news/aaron-sawatsky-kingsley-2024-was-the-hottest-year-so-far/article_a8ca03d6-d505-11ef-929d-437258e6194a.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/goshennews.com/content/tncms/assets/v3/editorial/a/8c/a8ca03d6-d505-11ef-929d-437258e6194a/678aabbb0e5b4.preview.jpg?crop=1184%2C622%2C0%2C564&resize=1184%2C622&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "A year ago, January of 2024, many sources reported that 2023 was the hottest year on record. Last year, 2024, was hotter. Rising temperatures are caused by burning fossil fuels, such as gasoline, coal, and natural gas for energy uses in vehicles, airplanes, buildings, power plants, electric generation, and heating. These rising temperatures are in part to blame for the 27 billion-dollar weather and climate disasters which the U.S. endured in 2024. Between 1980 and 2024 the average number of these large-scale disasters is 8.5 per year."
        },
        {
            "published_date": "2025-01-18T12:00:00",
            "title": "Letters From Readers, Jan. 18, 2025",
            "author": "",
            "url": "https://www.avpress.com/opinion/letters/letters-from-readers-jan-18-2025/article_0b655c2a-d542-11ef-98b6-27d022bae2ca.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/avpress.com/content/tncms/assets/v3/editorial/4/85/48562650-d542-11ef-a9d0-43b9497dd21d/678b0f9707204.image.jpg?crop=1645%2C864%2C0%2C198&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Scientists announced that 2024 will be the hottest year on record. Los Angeles burned for days on end because of the pollution in the atmosphere, which is harmful to the planet.      Â  .   in the past year, the planet has been hotter than ever."
        },
        {
            "published_date": "2025-01-18T11:17:21",
            "title": "How climate instability may be disrupting the polar vortex",
            "author": "The Conversation",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-instability-may-be-disrupting-the-polar-vortex-e0f14d7be4f03c9fc3d26effda38894b554304dd",
            "url_media": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/01/p-1-91262166-extreme-cold.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Extremely cold Arctic air and severe winter weather swept southward into much of the U.S. in mid-January 2024. Tens of millions of people were affected by dangerously cold temperatures. Heavy lake-effect snow and snow squalls have had severe effects across the Great Lakes and Northeast regions."
        },
        {
            "published_date": "2025-01-18T11:14:28",
            "title": "Role of engineers in mitigating climate change and global warming in Sabah",
            "author": "Mariah Doksil",
            "url": "https://www.theborneopost.com/2025/01/18/role-of-engineers-in-mitigating-climate-change-and-global-warming-in-sabah",
            "url_media": "https://www.theborneopost.com/newsimages/2025/01/Engineering-Matters-2.jpg",
            "country": "MY",
            "language": "en",
            "summary": "Engineers are at the forefront of creating a safer and more sustainable future for Sabah, Malaysia, due to climate change and global warming. Engineers can play a pivotal role in developing renewable energy development, climate-resilient infrastructure and urban sustainability in Sabah."
        },
        {
            "published_date": "2025-01-18T11:01:00",
            "title": "Weather expert links Madison County's cold spells to melting polar ice",
            "author": "Scott Marion",
            "url": "https://www.theintelligencer.com/news/article/melting-polar-ice-leads-to-cold-temperatures-20036857.php",
            "url_media": "https://s.hdnux.com/photos/01/46/54/05/26919251/5/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to local weather expert Dr. Alan Black, the polar ice is melting, allowing cold air to escape south. The position of the jet stream determines where the coldest air can go. The weather trends can have the ups and downs of a rollercoaster. The forecast for the first few days of next week calls for more bitter cold."
        },
        {
            "published_date": "2025-01-18T11:00:59",
            "title": "The worst thing LA could do as it recovers from fire disaster",
            "author": "",
            "url": "https://www.yahoo.com/news/worst-thing-la-could-recovers-110059539.html",
            "url_media": "https://media.zenfs.com/en/cnn_articles_875/9f28a84194cecc715f84c717b3c67ba4",
            "country": "US",
            "language": "en",
            "summary": "Jeff Goodell is a journalist and writer who has covered climate change and the environment for the past quarter century. He believes there's no level of preparation that could have changed the trajectory of the Los Angeles fires. Goodell believes we must reimagine how we build our world and the kinds of urban planning, water supplies, building insulation, and public transportation to adapt to a hotter climate."
        },
        {
            "published_date": "2025-01-18T11:00:00",
            "title": "Winter birdwatching is a great way to enjoy nature this season at the Arboretum in Guelph",
            "author": "Joy Struthers Reporter",
            "url": "https://www.therecord.com/news/winter-birdwatching-is-a-great-way-to-enjoy-nature-this-season-at-the-arboretum-in/article_3283c7c5-d794-5f71-9f70-3269cccea53f.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/therecord.com/content/tncms/assets/v3/editorial/0/85/0852deca-4386-57e7-a744-397978e669ac/67897be532bf5.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Winter is a great time to go birdwatching. There are many workshops available at the Arboretum at the University of Guelph. In-person events are booking up quickly. There's only one left to register for on Friday Jan. 31, from 8 to 10 a.m."
        },
        {
            "published_date": "2025-01-18T10:45:34",
            "title": "New research uncovers disturbing trend among governments across the globe: 'There is an increasing .. crackdown'",
            "author": "Matthew Marini",
            "url": "https://www.yahoo.com/news/research-uncovers-disturbing-trend-among-104534110.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/geZmZqdeV0_vr1lz0.SS1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/f256207d066252b7af7bc8a7bd75bef1",
            "country": "US",
            "language": "en",
            "summary": "A new wave of government censorship is sweeping across the globe as countries are increasing their crackdowns on climate activism. In the United Kingdom, anti-protest laws have expanded, allowing harsher penalties for peaceful demonstrators. U.N. special rapporteur Michel Forst notes that the state response to peaceful environmental protest is to repress rather than to enable and protect those who speak up for the environment."
        },
        {
            "published_date": "2025-01-18T09:33:00",
            "title": "Terrorism in Bab Al-Mandab: Straining global economy, triggering inflation concerns",
            "author": "WAM",
            "url": "https://www.emirates247.com/world/terrorism-in-bab-al-mandab-straining-global-economy-triggering-inflation-concerns-2025-01-18-1.736414",
            "url_media": "https://www.emirates247.com/polopoly_fs/1.736415.1737192790!/image/image.jpg",
            "country": "AE",
            "language": "en",
            "summary": "Houthi attacks on commercial vessels in the Bab Al-Mandab Strait threaten to destabilise the world economy and compromise global food security. UNCTAD report warns that the global economy faces an increasing risk due to vulnerabilities in major maritime routes. 30% of oil and 40% of dry cargo are transported through the Red Sea and the Suez Canal."
        },
        {
            "published_date": "2025-01-18T09:30:00",
            "title": "Eco-nomics: A brief history of how the climate crisis unfolded",
            "author": "",
            "url": "https://www.heraldnet.com/opinion/eco-nomics-a-brief-history-of-how-the-climate-crisis-unfolded",
            "url_media": "http://www.heraldnet.com/wp-content/uploads/2017/04/heraldnet_logo.png",
            "country": "US",
            "language": "en",
            "summary": "Fossil fuel industry has been trying to undermine climate science for 50 years. Project 2025 includes a pledge to end the war on fossil fuels, by nixing policies designed to limit climate change. The incoming Trump administration is committed to accelerating the burning of fossil fuels."
        },
        {
            "published_date": "2025-01-18T09:28:12",
            "title": "New model predicts solar storm particle acceleration and escape",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/18/New_model_predicts_solar_storm_particle_acceleration_and_esc",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The sun is a searing hot sphere of gas composed of hydrogen and helium. Its surface and outer atmospheric temperatures range from 10,000 to 3.6 million degrees Fahrenheit on its surface and its atmosphere's outermost layer. It is composed of helium and hydrogen."
        },
        {
            "published_date": "2025-01-18T09:20:25",
            "title": "54日跋涉1130公里 挪威21歲女生獨自滑雪抵達南極點",
            "author": "",
            "url": "https://bastillepost.com/hongkong/article/14640490-54%e6%97%a5%e8%b7%8b%e6%b6%891130%e5%85%ac%e9%87%8c-%e6%8c%aa%e5%a8%8121%e6%ad%b2%e5%a5%b3%e7%94%9f%e7%8d%a8%e8%87%aa%e6%bb%91%e9%9b%aa%e6%8a%b5%e9%81%94%e5%8d%97%e6%a5%b5%e9%bb%9e",
            "url_media": "https://image.bastillepost.com/640x/wp-content/uploads/hongkong/2025/01/bplib_20250116-145804_20250116_GL_Karen-Kylleso_source-web__704px.777.jpg",
            "country": "CN",
            "language": "en",
            "summary": "Melting ice could awaken the Antarctic's hidden volcanoes. There are over 100 volcanoes beneath the ice, and what lies beneath could shake the world, according to the scientists.    pic.twitter.com/obBijAwUcB"
        },
        {
            "published_date": "2025-01-18T09:05:51",
            "title": "Science Saturday: California wildfires, global warming, and more",
            "author": "Science",
            "url": "https://news.cgtn.com/news/2025-01-18/Science-Saturday-California-wildfires-global-warming-and-more-1AgiFfdfSzS/p.html",
            "url_media": "https://video.cgtn.com/news/2025-01-18/Science-Saturday-California-wildfires-global-warming-and-more-1AgiFfdfSzS/video/wu_1ihs4n8nbq6o1d41157ghhk1quu1r/wu_1ihs4n8nbq6o1d41157ghhk1quu1r-1280.png",
            "country": "CN",
            "language": "en",
            "summary": "This week of Science Saturday, we look back at the major breakthroughs made in science and technology over the past year. Earth recorded the hottest year ever in 2024. Scientists unearth ancient ice from the Antarctic. China's Chang'e-5 samples show that the moon had a magnetic field 2 billion years ago."
        },
        {
            "published_date": "2025-01-18T09:00:19",
            "title": "Letter: Wildfires put every US state on notice",
            "author": "Deb Sayer",
            "url": "https://www.pressherald.com/2025/01/18/letter-wildfires-a-wake-up-call-for-climate-action",
            "url_media": "https://www.pressherald.com/wp-content/uploads/sites/4/2025/01/California_Wildfires_Calmer_Weather_Explainer_94790_4f4a63-1736959435.jpg?w=1000",
            "country": "US",
            "language": "en",
            "summary": "70,000 people have been evacuated from forest fires in California due to climate change. Nancy Hasenfus from Brunswick, Maine is worried about the situation in California. America has just elected a climate denier and a politician who does not want to face scientific facts. We need to pass a carbon price and learn more about carbon removal techniques."
        },
        {
            "published_date": "2025-01-18T09:00:00",
            "title": "Commentary: How ocean temps are driving L.A. firestorms",
            "author": "David Helvarg",
            "url": "https://www.spokesman.com/stories/2025/jan/18/commentary-how-ocean-temps-are-driving-la-firestor",
            "url_media": "https://thumb.spokesman.com/NDB_WK-M9jZdGG-1HVAxViwPt3A=/1200x630/smart/media.spokesman.com/photos/2025/01/17/678ac7333f806.hires.jpg",
            "country": "US",
            "language": "en",
            "summary": "Arctic Ocean is warming three times faster than the rest of the world due to a phenomenon known as 'Arctic amplification'. The Earth's 10 hottest years have all occurred in the past decade. The Heritage Foundation's Project 2025 agenda calls for NOAA to be 'broken up and downsized' so it stops contributing to the climate change alarm industry."
        },
        {
            "published_date": "2025-01-18T08:45:26",
            "title": "Northwesterly winds to bring temperatures down in Oman: Met",
            "author": "Observer Web Team",
            "url": "https://www.omanobserver.om/article/1164988/oman/weather/northwesterly-winds-to-bring-temperatures-down-in-oman-met",
            "url_media": "https://www.omanobserver.om/omanobserver/uploads/images/2025/01/18/thumbs/600x600/2900258.jpg",
            "country": "OM",
            "language": "en",
            "summary": "Most governorates of the Sultanate of Oman will be affected by northwesterly winds until January 21. Sea waves will rise to a maximum height of 2.5 meters on the coasts of western Musandam Governorate and the Sea of Oman. There will be a drop in temperatures during this period."
        },
        {
            "published_date": "2025-01-18T08:15:00",
            "title": "Letter to the editor: We are in a new era",
            "author": "RON SADLER",
            "url": "https://www.bakersfield.com/opinion/letters-to-editor/letter-to-the-editor-we-are-in-a-new-era/article_83a1cf0e-d4ff-11ef-9746-af8db1275562.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/bakersfield.com/content/tncms/custom/image/d09180fc-6bee-11e7-8b72-ff928e2e17d5.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "2024 will be the hottest year on record, according to scientists. Scientists warn that the world has entered a dangerous new era of chaotic floods, storms and fires made worse by human-caused climate change. Los Angeles burned for days on end as a result of the recent heat wave."
        },
        {
            "published_date": "2025-01-18T08:01:01",
            "title": "Advocates worry about North Carolina's old growth forests, damaged by Hurricane Helene",
            "author": "",
            "url": "https://www.kawc.org/2025-01-18/advocates-worry-about-north-carolinas-old-growth-forests-damaged-by-hurricane-helene",
            "url_media": "https://www.kawc.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "The old growth forests of Western North Carolina took a beating from Hurricane Helene. Now they've lost a bid for federal protection. This worries advocates that the forests could soon vanish. KAWC has a PO Box 929 in Yuma, Arizona 85366 and a website at: www.kawc.org."
        },
        {
            "published_date": "2025-01-18T08:01:01",
            "title": "Advocates worry about North Carolina's old growth forests, damaged by Hurricane Helene",
            "author": "",
            "url": "https://www.spokanepublicradio.org/2025-01-18/advocates-worry-about-north-carolinas-old-growth-forests-damaged-by-hurricane-helene",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The old growth forests of Western North Carolina took a beating from Hurricane Helene. Now they've lost a bid for federal protection. This worries advocates that the forests could soon vanish. On KPBX 91.1, KPBZ 90.3 PRX Remix, and KSFC 91.9."
        },
        {
            "published_date": "2025-01-18T08:00:00",
            "title": "Experts alert: Melting Antarctic ice could cause 100 volcanoes to erupt",
            "author": "thedailydigest.com",
            "url": "https://www.msn.com/en-my/news/other/experts-alert-melting-antarctic-ice-could-cause-100-volcanoes-to-erupt/ss-AA1xpHTK",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Accelerated melting of ice in Antarctica could activate hidden volcanoes beneath its surface, according to a recent study by scientists from the University of Washington.      .   in the study. In the study, scientists warned that the melting of the ice could activate the volcanoes. "
        },
        {
            "published_date": "2025-01-18T07:52:00",
            "title": "Gendered Impacts Of Climate Change: Addressing Inequality In Punjab's Agricultural Sector",
            "author": "Dr Ejaz Hussain",
            "url": "https://thefridaytimes.com/18-Jan-2025/gendered-impacts-of-climate-change-addressing-inequality-in-punjab-s-agricultural-sector",
            "url_media": "https://thefridaytimes.com/digital_images/large/2025-01-18/gendered-impacts-of-climate-change-addressing-inequality-in-punjab-s-agricultural-sector-1737186750-3999.jpeg",
            "country": "PK",
            "language": "en",
            "summary": "Maryam Nawaz is the Chief Minister of Punjab. She has launched the 'Assan Korobar' and 'Ujala program' for agricultural growth. According to the Pakistan Bureau of Statistics, less than 2% of women own land within Punjab. Women in the agriculture sector lack land ownership, access to credit and access to decision-making. They also lack access to the provision of loans and subsidies. They are often left to bear the brunt of social and economic insecurities due to climate change."
        },
        {
            "published_date": "2025-01-18T07:28:00",
            "title": "Canada Boosts Climate Adaptation for Atlantic Safety",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/canada-boosts-climate-adaptation-for-atlantic-1393168",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "Natural Resources Canada announced $8.8 million in funding for nine projects in Atlantic Canada under the Climate Change Adaptation Program and Climate-Resilient Coastal Communities Program. The projects will focus on developing and improving strategies, tools and resources and implementing innovative adaptation actions to address climate change risks and adaptation gaps."
        },
        {
            "published_date": "2025-01-18T06:50:55",
            "title": "Dance review: Striking scenes and staging in Arts Fission's gritty A Brooding Beast In The Corner",
            "author": "Straits Times",
            "url": "https://article.wn.com/view/2025/01/18/Dance_review_Striking_scenes_and_staging_in_Arts_Fission_s_g",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change has been frequently mentioned in the media recently. It is a human-caused phenomenon. It has a negative impact on people's lives. It's a cause of concern for many people, especially in the West.    for climate change. "
        },
        {
            "published_date": "2025-01-18T06:41:49",
            "title": "Qinghai Province: Record Warmth on the 'Roof of the World'",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/chinese-province-roof-world-registers-warmest-year-2024-895",
            "url_media": "https://www.newkerala.comhttps://one.newkerala.com/images/r/newsdefault.webp",
            "country": "IN",
            "language": "en",
            "summary": "In 2024, Qinghai Province experienced above-average temperatures and increased precipitation. The annual average temperature was 3.9 degrees Celsius, 1.1 degrees higher than the historical average. The Qinghai-Xizang Plateau is becoming warmer, wetter and greener due to climate change."
        },
        {
            "published_date": "2025-01-18T05:36:11",
            "title": "Climate Change: The ongoing global initiatives that will shape our lives in years to come",
            "author": "The Nation",
            "url": "https://www.latestnigeriannews.com/p/4053458/climate-change-the-ongoing-global-initiatives-that-will-shape-our-lives-in-years.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Climate change is one of the most pressing issues of our time. Rising global temperatures, melting ice caps, and extreme weather are consequences of climate change. The ongoing global initiatives that will shape our lives in years to come will affect us in the long-term."
        },
        {
            "published_date": "2025-01-18T05:19:00",
            "title": "Kerala's eroding edge: A coast in crisis",
            "author": "TNN",
            "url": "https://timesofindia.indiatimes.com/city/kochi/keralas-eroding-edge-a-coast-in-crisis/articleshow/117345447.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Coastal erosion has emerged as a pressing issue in Kerala. The construction of breakwaters and artificial barriers has intensified the problem. The coastal zone spans 590km and accounts for 15% of the state's land area. It is home to 30% of Kerala's population and 77% of its fisherfolk. "
        },
        {
            "published_date": "2025-01-18T05:18:00",
            "title": "India's cooler months warming faster: Data",
            "author": "Abhishek Jha",
            "url": "https://www.hindustantimes.com/india-news/indias-cooler-months-warming-fasterdata-101737139804162.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/01/17/1600x900/The-trend-comes-against-the-backdrop-of-the-climat_1737139796711.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In 2024, India will be the warmest year on record. The annual mean temperature in 2024 was 0.65°C above the long-term average. Sea surface temperatures in the Arabian Sea and Bay of Bengal hit their highest levels since 1854. Nighttime temperatures are warming both during day and night."
        },
        {
            "published_date": "2025-01-18T05:01:00",
            "title": "Greenland: The Semi-Final Frontier",
            "author": "The American Conservative",
            "url": "https://www.theamericanconservative.com/greenland-the-semi-final-frontier",
            "url_media": "https://www.theamericanconservative.com/wp-content/uploads/2025/01/shutterstock_2482539743-scaled.jpg",
            "country": "US",
            "language": "en",
            "summary": "In Part One, we considered the geopolitics of Greenland and its potential as a place to make money and flourish. In Part Two, we looked at the geothermal energy potential of the Earth's core. In this second part, we look at the potential of geothermal technology."
        },
        {
            "published_date": "2025-01-18T05:00:00",
            "title": "Below freezing temperatures forecast for next week, with a chance of snow thrown in",
            "author": "LARRY STANFORD NEWS REPORTER",
            "url": "https://www.griffindailynews.com/news/below-freezing-temperatures-forecast-for-next-week-with-a-chance-of-snow-thrown-in/article_3fec3dba-6388-5179-804b-f0b6d40a4a31.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/7/4f/74f4e273-6a8f-52fd-b7d7-9de828663e11/678afabe529dd.image.jpg?crop=435%2C435%2C69%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Extremely cold Arctic air is expected to come sweeping down into north and central Georgia Sunday evening. Spalding County will open two warming centers next week in anticipation of the extreme cold. The subfreezing temperatures could remain in the area until Thursday, with wind chill factors as low as -10 degrees."
        },
        {
            "published_date": "2025-01-18T04:30:00",
            "title": "World's record heat is worsening air pollution and health in Global South",
            "author": "Mongabay",
            "url": "https://www.eastmojo.com/free-digest/2025/01/18/worlds-record-heat-is-worsening-air-pollution-and-health-in-global-south",
            "url_media": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2025/01/Editorial-Workspace-28.jpg?fit=1920%2C1080&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "2024 was the hottest year on record, with average global temperature rising 1.5°C above the pre-industrial period. The European Union's Copernicus Climate Change Service has declared it the first year in history with such a rise. Escalating climate change is expected to exacerbate pollution and worsen public health in the future."
        },
        {
            "published_date": "2025-01-18T04:19:10",
            "title": "Cold weather next week could delay repair progress on Big Mac Bridge",
            "author": "WLWT",
            "url": "https://ca.news.yahoo.com/cold-weather-next-week-could-041910697.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/JXg4nUmMITmh2YaB2Sv_2Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/video.wlwt.hearstnews.com/de533ae1b2ac48e3c1e6961ff6a149c4",
            "country": "US",
            "language": "en",
            "summary": "Cold weather next week could delay repair progress on Big Mac Bridge repair work.   It's expected to be cold next week. It's also possible to delay the repair work on the bridge by a week or more, depending on how cold it gets. It could be very cold."
        },
        {
            "published_date": "2025-01-18T04:00:00",
            "title": "Some tax relief for our residents",
            "author": "",
            "url": "https://www.chronicleonline.com/opinion/columnists/some-tax-relief-for-our-residents/article_80c461ae-c6d0-50a7-9b01-4bc9133bcc20.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/chronicleonline.com/content/tncms/assets/v3/editorial/7/a4/7a4c62b2-15a0-5148-8dc3-4a69a65215d3/66b4e93e8bb81.image.png?crop=588%2C588%2C364%2C280&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Citrus County Property Appraiser's office will be mailing a courtesy letter informing property owners that a tax relief may be available to them for property damage they may have received due to the horrific hurricanes that occurred in 2024. The office is fully prepared to guide you through the assessment process."
        },
        {
            "published_date": "2025-01-18T03:34:00",
            "title": "Research On Past Hurricanes Aims To Reduce Future Risk",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/research-on-past-hurricanes-aims-to-reduce-1393069",
            "url_media": "https://cdn.web.uta.edu/-/media/project/website/news/releases/2025/01/hurricanes-sampled-uta.ashx?revision=d5629b94-27f9-4063-a998-9e9a91bb8f69",
            "country": "US",
            "language": "en",
            "summary": "In 2023, climate migration linked to tropical storms saw 2.5 million people attempt to cross the U.S. southern land border. New research led by The University of Texas at Arlington emphasizes that studying the impacts of past tropical storms can help communities better prepare for future storms."
        },
        {
            "published_date": "2025-01-18T03:31:00",
            "title": "Australia scans the frozen continent for early signs of deadly disease",
            "author": "Sydney Morning Herald",
            "url": "https://article.wn.com/view/2025/01/18/Australia_scans_the_frozen_continent_for_early_signs_of_dead",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Antarctic researchers are on high alert for a deadly strain of bird flu. It could hit the continent's wildlife at any moment and then make its way to Australia. It's possible it could kill people and animals in Australia as well as the Arctic. "
        },
        {
            "published_date": "2025-01-18T02:28:00",
            "title": "‘Below the replacement rate': Alarming trend sweeping the globe",
            "author": "Jamie Seidel",
            "url": "https://www.news.com.au/world/below-the-replacement-rate-alarming-trend-sweeping-the-globe/news-story/12fc2a64ce97866907575469ecca3eec",
            "url_media": "https://content.api.news/v3/images/bin/bc6fff3f272ddbebe9c027a24eeae45a",
            "country": "AU",
            "language": "en",
            "summary": "There is a global decline in global fertility rates. In Mexico City, the trend is less than one baby per woman per lifetime. Even the world's most populous countries – India and China – are below the replacement rate. The 21st century is a population tipping point."
        },
        {
            "published_date": "2025-01-18T02:28:00",
            "title": "‘Doom loop' facing entire planet",
            "author": "Jamie Seidel",
            "url": "https://www.townsvillebulletin.com.au/news/world/below-the-replacement-rate-alarming-trend-sweeping-the-globe/news-story/12fc2a64ce97866907575469ecca3eec",
            "url_media": "https://content.api.news/v3/images/bin/bc6fff3f272ddbebe9c027a24eeae45a",
            "country": "AU",
            "language": "en",
            "summary": "In Mexico City, the trend is less than one baby per woman per lifetime. Thailand is at about a one-to-one ratio. Even the world's most populous countries – India and China – are below the replacement rate. Myanmar is one of the most impoverished nations in the world."
        },
        {
            "published_date": "2025-01-18T02:17:00",
            "title": "Pictou Storm Protection Infrastructure Boost",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/pictou-storm-protection-infrastructure-boost-1393008",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Pictou Market Wharf will be less vulnerable to storm surge events and sea level rise after a combined investment of $6 million from the federal, provincial and municipal governments. The project is expected to reduce the risk associated with future sea-level rise and storm surges. It will also reduce the number of people who are left without access to essential services during storm events."
        },
        {
            "published_date": "2025-01-18T02:00:00",
            "title": "No, CNN and BBC, 2024 Wasn't the ‘Hottest Year on Record' When ALL of the Available Evidence Is Considered",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/01/17/no-cnn-and-bbc-2024-wasnt-the-hottest-year-on-record-when-all-of-the-available-evidence-is-considered",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/01/la-fire-water-drop.webp?fit=1024%2C513&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The mainstream media are reporting that 2024 is the hottest year on record. The Copernicus Climate Change Service (CCCS) claims it's the second record-breaking year, following the exceptional 2023. NOAA reports that the year 2024 was the warmest year since global records began in 1850 at 1.29°C (2.32°F) above the 20th century average. The ten warmest years in the 175-year record have all occurred during the last decade (2015–2024). Paleoclimatological evidence shows Earth has experienced significantly hotter temperatures long before industrial revolution."
        },
        {
            "published_date": "2025-01-18T01:47:50",
            "title": "Duck Hunting Reloads Despite a Shorter Season",
            "author": "The Epoch Times",
            "url": "https://article.wn.com/view/2025/01/18/Duck_Hunting_Reloads_Despite_a_Shorter_Season",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Wetland bird hunting numbers have surged despite bag limits and a shortened season. An estimated 391,900 ducks were hunted in Victoria in 2024, about 22 percent higher than the average. Anti-hunters predicted it would happen every year, but it didn't."
        },
        {
            "published_date": "2025-01-18T01:31:12",
            "title": "Give Oceans Some Breathing Room",
            "author": "Alex Borgas",
            "url": "https://www.independent.com/2025/01/17/give-oceans-some-breathing-room",
            "url_media": "https://www.independent.com/wp-content/uploads/2019/03/indyicon.png?fit=32%2C32",
            "country": "US",
            "language": "en",
            "summary": "Oceans are at risk of irreversible damage due to oil drilling and unsustainable fishing practices. Expanding marine protected areas is necessary to give oceans the breathing room they need to bounce back before it's too late, writes UC Santa Barbara freshman and environmentalist, Andrew Kuznetsov."
        },
        {
            "published_date": "2025-01-18T01:20:20",
            "title": "Securing Pak agricultural future",
            "author": "Dr M Bilal Tahir",
            "url": "https://pakobserver.net/securing-pak-agricultural-future",
            "url_media": "https://pakobserver.net/wp-content/uploads/2022/11/article.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's economy is heavily reliant on Rabi and Kharif crops. Climate change poses a serious threat to Pakistan's major crops, including wheat, rice, maize, and sugarcane. The Ministry of National Food Security and Research reports a promising 6.25% growth in the agricultural sector during the fiscal year 2023-24."
        },
        {
            "published_date": "2025-01-18T01:00:00",
            "title": "New climate date shows Oregon heating up",
            "author": "Jeremy C. Ruark Country Media",
            "url": "https://theworldlink.com/news/new-climate-date-shows-oregon-heating-up/article_f1c90e9f-b288-5042-b509-68ce36a514f5.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/theworldlink.com/content/tncms/assets/v3/editorial/9/6a/96ad1794-43b1-5330-b9f5-c539579dfaa6/678ae58448818.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Oregon is becoming warmer and more prone to drought, according to the Seventh Oregon Climate Assessment. Scientists at Oregon State University outline what they found in the latest assessment.      .   in their report. It's cold winter, but it's also getting warmer."
        },
        {
            "published_date": "2025-01-18T00:59:40",
            "title": "Letter: Give our children a chance at good lives",
            "author": "Opinion Contributor",
            "url": "https://www.bangordailynews.com/2025/01/17/opinion/letters/letter-give-our-children-chance-at-good-lives",
            "url_media": "https://bdn-data.s3.amazonaws.com/uploads/2025/01/Yuma-Food-Bank-Feeding-America-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Climate change is a serious threat to world stability. Congress needs to increase renewable energy sources and eliminate tax subsidies and preferential regulatory treatment for fossil fuels. It's about giving our children a chance at good lives. Richard Thomas is a resident of Waterville, Maine."
        },
        {
            "published_date": "2025-01-18T00:48:19",
            "title": "Greenland's melting ice paves the way for a mineral exploration boom",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/asia/greenlands-melting-ice-paves-the-way-for-a-mineral-exploration-boom",
            "url_media": "https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png",
            "country": "NG",
            "language": "en",
            "summary": "Ice melt from Greenland is exposing the island's natural resources, making some of the world's largest untapped mineral reserves more accessible. U.K.-based mining company 80 Mile is developing three projects in Greenland, including an oil concession on the east coast, a titanium project near the U.S. Pituffik Space Base in the northwest and its Disko-Nuussuaq project in the southwest. The company's Disko project could be one of the largest occurrences of nickel and copper on the planet."
        },
        {
            "published_date": "2025-01-18T00:16:00",
            "title": "Monroe County Launches Total Navigation",
            "author": "",
            "url": "https://www.weau.com/video/2025/01/18/monroe-county-launches-total-navigation",
            "url_media": "https://gray-weau-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F01-18-2025%2Ft_1c07ee6b0a09407cb87fd31aa6164115_name_file_1280x720_2000_v3_1_.jpg?auth=7afd236886b31aa8044b4ec81f9de18258daba7d6796d2e87d2645f6ca31f968&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Monroe County launches Total Navigation Staying Safe in the Extreme Cold. First Alert Weather is one more mild day before potent arctic air brings dangerous cold and wind chills this weekend. 13 First Alert Forecast is at Noon. The Silver Screen Spotlight is at 1:17/25. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "People Are Just Learning That For Billions Of Years, There Was No Fire On Earth",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/01/18/People_Are_Just_Learning_That_For_Billions_Of_Years_There_Wa",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Earth is the only planet we know of that has ever had a fire. On Venus, the hottest planet in the Solar System, there has never been a fire there. Neither on Mercury, nor Jupiter, nor any of the other planets surrounding our or any other star."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Temperatures rising steadily amid global warming",
            "author": "Kuensel",
            "url": "https://article.wn.com/view/2025/01/18/Temperatures_rising_steadily_amid_global_warming",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bhutan is experiencing warmer winters due to global warming. The average temperature during October, November, and December has increased by an average of 0.3°C. Sea Surface Temperature patterns in the Pacific and Indian Oceans influence the monthly average temperature but it has remained consistent."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "2024 may have been the rainiest – as well as hottest",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/01/18/2024_may_have_been_the_rainiest_as_well_as_hottest_year_on_r",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The global average precipitation in 2024 may have broken the previous record set in 1998, as rising temperatures boosted the amount of moisture in the atmosphere, according to the World Meteorological Agency (WMO). WMO reports that the global average rainfall in 2024 will be higher than in 1998."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Carbon dioxide up at rates 'incompatible' with 1.5�C target, study warns",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/18/Carbon_dioxide_up_at_rates_incompatible_with_15_C_target_stu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide in the atmosphere is increasing at increasing rates that are increasing at rates that is dangerous for the environment.   .   in the Earth's atmosphere is getting more CO2-rich at increasing rate.  in this way, carbon dioxide levels are increasing. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Weather expert links Madison County's cold spells to melting polar ice",
            "author": "The Intelligencer",
            "url": "https://article.wn.com/view/2025/01/18/Weather_expert_links_Madison_Countys_cold_spells_to_melting_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The difference in temperature between the equator and the poles has been reduced over time, according to the scientists.   Â. Â   ‘The difference between the Equator and The Poles has been reducing over time.’  "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Scientists Expose Major Problems With Climate Change Data",
            "author": "The Liberty Beacon",
            "url": "https://article.wn.com/view/2025/01/18/Scientists_Expose_Major_Problems_With_Climate_Change_Data",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists Expose Major Problems With Climate Change Data. 'Climate activism has become the new religion of the 21st century. Heretics are not welcome and not allowed to ask questions,' said astrophysicist Willie Soon. Temperature records used by climate scientists and governments to build models."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Greenland reveal stunning ice-inspired hummel away shirt",
            "author": "90min",
            "url": "https://article.wn.com/view/2025/01/18/Greenland_reveal_stunning_iceinspired_hummel_away_shirt",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greenland's new away shirt by hummel is inspired by the Ice Sheet that covers huge swathes of the world's largest island and is directly inspired by this fact. It is a design by Hummel and is available in black and white on the official website."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Storm surges and planning for coastal resilience along Monterey Bay",
            "author": "Santa Cruz Sentinel",
            "url": "https://article.wn.com/view/2025/01/18/Tracey_Weiss_Our_Ocean_Backyard_Storm_surges_and_planning_fo",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The storm surge from December's storm is still felt throughout Santa Cruz County. The damage to the Santa Cruz Wharf and the storm's impact on Santa Cruz Harbor has been costly and heartbreaking. This storm has sparked crucial city, county and state conversations about life along a changing coastline."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "India's cooler months warming faster: Data",
            "author": "Hindustan Times",
            "url": "https://article.wn.com/view/2025/01/18/India_s_cooler_months_warming_faster_Data",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Rising temperatures across India are blurring seasonal distinctions. The traditionally cooler months are warming at a faster rate than warmer months over the past century. The trend comes against the backdrop of the climate crisis. The increase in temperatures is more pronounced during monsoon and post monsoon, and less clear in winters."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "London faces frazzling in heatwave over 40°C, warns Government in new risk report",
            "author": "AOL",
            "url": "https://article.wn.com/view/2025/01/18/London_faces_frazzling_in_heatwave_over_40_C_warns_Governmen_u",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures could reach 40°C in London. The Tube, rail and buses could be disrupted, tens of thousands more workers may stay at home, and water supplies could be hit. Climate change means that the risk of extreme heat has become more likely in the UK."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "'I'm a Brit living in Australia – one thing about their food is totally wrong'",
            "author": "The Mirror",
            "url": "https://article.wn.com/view/2025/01/18/aposi_aposm_a_brit_living_in_australia_one_thing_about_their",
            "url_media": "https://article.wn.com/view/2025/01/18/[]",
            "country": "US",
            "language": "en",
            "summary": "A British man has been living in Australia for the last few years. He finds the food a big difference between the British and the Aussies' cultures baffling, because of the difference in the quality of their food. It's all to do with the different food preparation."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Climate change driving 'cost-of-living' squeeze in lizards, finds study",
            "author": "Times",
            "url": "https://article.wn.com/view/2025/01/18/Climate_change_driving_costofliving_squeeze_in_lizards_finds",
            "url_media": "https://i.ytimg.com/vi/um6b_kFw0TQ/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Desert lizards are experiencing a 'cost-of-living' pinch as global temperatures rise, according to a new study in Melbourne. A lizard's 'cost of living' is the amount of food it earns per day.  It's also the amount it saves. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "More than 40 Pakistanis feared drowned in the capsizing of a migrant boat off African coast",
            "author": "The Hindu",
            "url": "https://article.wn.com/view/2025/01/18/More_than_40_Pakistanis_feared_drowned_in_the_capsizing_of_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "More than 40 Pakistanis are feared to have drowned in the capsizing of a migrant boat off West Africa's Atlantic coastline, officials say. The boat capsized off the coast of West Africa, near the Atlantic coast of Africa's coast, and is believed to have been carrying Pakistani migrants."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Restricted Fire Season For Murchison And Lake Rotoiti",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/01/18/Restricted_Fire_Season_For_Murchison_And_Lake_Rotoiti",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dry and windy weather conditions are drying out vegetation and increasing the wildfire danger in the Nelson Marlborough area.   Grant Hayward is the district manager for Fire and Emergency in Nelson-Marlborough. He says the change is due to the continuing dry weather conditions. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "‘Climate Change' Is NOT to Blame for LA Fires",
            "author": "Principia Scientific",
            "url": "https://article.wn.com/view/2025/01/18/8216climate_change_8217_is_not_to_blame_for_la_fires",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Droughts and Santa Ana winds have been part of the ecosystem for centuries and are still part of it today. The current drought is the result of the Santa Ana wind. It's caused by drought-like conditions in the past and present. It can also be caused by Santa Anas."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Could the Los Angeles fires happen in Australia?",
            "author": "Stuff",
            "url": "https://article.wn.com/view/2025/01/18/Could_the_Los_Angeles_fires_happen_in_Australia",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Experts say it is only a matter of time before major Australian cities experience 'house-to-house ignition' on a similar scale to LA's.       in a similar way as in Los Angeles, where people live together in a shared space. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "How Is Antarctica Melting, Exactly? Crucial Details Are Beginning To Come Into Focus",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/01/18/How_Is_Antarctica_Melting_Exactly_Crucial_Details_Are_Beginn",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antarctic ice sheet covers twice the area of Australia and holds enough freshwater to raise global sea levels by 58 metres. Ice loss from this sheet is projected to be the leading driver of sea level rise by 2100, yet its size is hard to comprehend. "
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Cold weather and hibernation",
            "author": "Garry Brandenburg",
            "url": "https://www.timesrepublican.com/news/outdoors-today/2025/01/cold-weather-and-hibernation",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.timesrepublican.com/images/2025/01/17231156/780_0591-1100x733.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hibernation is a state of minimal activity and metabolic slow down. It is a response to survive when vegetation type foods outside are not growing due to winter. Some critters such as pikas and hummingbirds hibernate. Groundhog Day is the halfway point of winter."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Black-headed gulls fly thousands of miles to overwinter in Zhongshan",
            "author": "Alice Fung",
            "url": "https://www.newsgd.com/node_d36b0ef83f/46e7eba5cb.shtml",
            "url_media": "https://gdtoday.newsgd.com/asset/favicon.ico",
            "country": "CN",
            "language": "en",
            "summary": "Black-headed gulls flew over the Shenzhen-Zhongshan Link on January 15. They are migratory birds that spend the winter in the warmer southern China. In the area, more than 290 species of birds have been recorded, including 23 nationally protected species."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "Extreme weather events difficult to predict in rapidly warming world: WMO chief",
            "author": "",
            "url": "https://arunachaltimes.in/index.php/2025/01/18/extreme-weather-events-difficult-to-predict-in-rapidly-warming-world-wmo-chief",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "Extreme weather events are becoming more intense and difficult to forecast in a rapidly warming world. Celeste Saulo is the first woman to hold the post of WMO chief. She refuses to attribute individual events such as the wildfires in Los Angeles to climate change but said they have'many ingredients' directly linked to it. The United Nations launched the 'Early warnings for all' initiative to ensure everyone on Earth is protected from hazardous weather, water and climate events by the end of 2027."
        },
        {
            "published_date": "2025-01-18T00:00:00",
            "title": "‘Extreme weather events difficult to predict'",
            "author": "",
            "url": "https://www.thehitavada.com/Encyc/2025/1/18/-Extreme-weather-events-difficult-to-predict-.html",
            "url_media": "https://www.thehitavada.com/Encyc/2025/1/18/WMO-chief_202501181104039604_H@@IGHT_510_W@@IDTH_655.jpg",
            "country": "IN",
            "language": "en",
            "summary": "'Extreme weather events difficult to predict' according to World Meteorological Organisation chief Celeste Saulo. She refused to attribute individual events such as the wildfires in Los Angeles to climate change but said they had'many ingredients' directly linked to it. Saulo is the first woman to hold the post of WMO chief."
        }
    ]
}