{
    "status": "ok",
    "total_articles": 88,
    "articles": [
        {
            "published_date": "2025-01-19T23:59:37",
            "title": "Climate Science Must Unlock Solutions In New Era",
            "author": "Aditi Mukherji",
            "url": "https://www.eurasiareview.com/20012025-climate-science-must-unlock-solutions-in-new-era-oped",
            "url_media": "https://www.eurasiareview.com/wp-content/uploads/2025/01/a-168.jpeg",
            "country": "US",
            "language": "en",
            "summary": "By the time the world's leading climate scientists publish their next report in 2028-29, the world will have possibly breached 1.5 degrees Celsius warmer than the pre-industrial era for a few years. The deadline for the UN's Paris Agreement to reduce the impacts of climate change was set by the 2015 Paris Agreement. Food systems are a major contributor to climate change and vulnerable to its impacts. The coming IPCC assessments must answer at least three core questions related to the agri-food systems and climate change."
        },
        {
            "published_date": "2025-01-19T23:43:56",
            "title": "Snow, sleet and rain: Extreme cold temperatures expected as winter storm barrels towards the South",
            "author": "archyde",
            "url": "https://www.archyde.com/snow-sleet-and-rain-extreme-cold-temperatures-expected-as-winter-storm-barrels-towards-the-south",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/2025-01-17t194030z-1895194076-rc2vbca8l247-rtrmadp-3-usa-trump-inauguration-copy.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "As global temperatures continue to rise, the UK is likely to experience milder winters on average. Snowfall is expected to become less common, particularly in southern regions, while northern areas may still see occasional snowfall. Adaptation is the first step toward building a more sustainable and resilient future."
        },
        {
            "published_date": "2025-01-19T23:26:00",
            "title": "Meetings, open houses canceled around Cape Fear region because of winter weather",
            "author": "WECT Staff",
            "url": "https://www.wect.com/2025/01/19/meetings-open-houses-canceled-around-cape-fear-region-because-winter-weather",
            "url_media": "https://gray-wect-prod.gtv-cdn.com/resizer/v2/HFCIQMYGSVGC3LR67G6NCAEQ4E.png?auth=f5d2c0eb718376ed3105071dd43636b905c9b9ec44e27dd99ca0df184365cb9c&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "The town of Carolina Beach is postponing its 2025/2026 Budget Open House on Tuesday, January 21 to January 28 from 4 to 6 p.m. at Town Hall. The town of Kure Beach is canceling its town council meeting on January 21. The public is encouraged to attend."
        },
        {
            "published_date": "2025-01-19T23:16:09",
            "title": "Geological forces may hold answers to record-breaking warming trends",
            "author": "Robert Mcgarvey",
            "url": "https://troymedia.com/viewpoint/geological-forces-may-hold-answers-to-record-breaking-warming-trends",
            "url_media": "https://troymedia.com/wp-content/uploads/sites/6/2017/07/McGarvey-Robert200.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Geologists argue natural forces like volcanic activity and ocean currents play a large role in global warming. They argue the prevailing models focus on industrialization and fossil fuel emissions as primary drivers. Geologists' perspectives on climate change are often overlooked by atmospheric scientists and rarely included in IPCC's research reviews."
        },
        {
            "published_date": "2025-01-19T23:10:38",
            "title": "Clean energy progress hinges on policy, science and action",
            "author": "Gulf-Times",
            "url": "https://article.wn.com/view/2025/01/19/Clean_energy_progress_hinges_on_policy_science_and_action",
            "url_media": "https://article.wn.com/view/2025/01/19/[]",
            "country": "US",
            "language": "en",
            "summary": "The US federal policy pendulum is swinging away from facts, reason and basic human decency. The costs of extreme weather events like the Los Angeles wildfires are piling up, and it's tough to be optimistic about the climate these days. It's hard to believe in facts and reason. "
        },
        {
            "published_date": "2025-01-19T22:42:02",
            "title": "Tug of war at crossroads of climate change",
            "author": "Asim Saeed",
            "url": "https://tribune.com.pk/story/2523199/tug-of-war-at-crossroads-of-climate-change",
            "url_media": "https://i.tribune.com.pk/media/images/Untitled1635929381-5/Untitled1635929381-5.png",
            "country": "PK",
            "language": "en",
            "summary": "2014 was the warmest year on record according to the Copernicus Climate Change Service. Goldman Sachs, Wells Fargo, Citigroup and Bank of America left the UN-sponsored Net Zero Banking Alliance (NZBA) on December 6, 2024. JP Morgan followed suit on January 7, 2025. "
        },
        {
            "published_date": "2025-01-19T22:17:00",
            "title": "Bengaluru wakes up to unseasonal rain, five more wet days likely",
            "author": "Nithya.Mandyam",
            "url": "https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-wakes-up-to-unseasonal-rain-five-more-wet-days-likely/articleshow/117378764.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-117378761,width-1070,height-580,imgsize-59478,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Southern Karnataka is likely to receive sporadic light rain over the next five days. Rain is attributed to a low-pressure system over the Bay of Bengal, which intensified rain-bearing winds across the state. The maximum temperature in Bengaluru was 27.4°C, while the minimum was 18.2°C."
        },
        {
            "published_date": "2025-01-19T22:01:17",
            "title": "WA's prescribed burning policy in spotlight, protest held in Nornalup",
            "author": "Mark Bennett",
            "url": "https://www.abc.net.au/news/2025-01-20/wa-prescribed-burning-protests-in-nornalup/104834392",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/c0946e9d48c65bb2cb50e8e74f34f4ea?impolicy=wcms_watermark_news&cropH=2268&cropW=4032&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "There is a debate about the use of prescribed burning in Western Australia in the wake of the Los Angeles fires. More than 250 people attended a rally in Nornalup on the south coast on Saturday. The group that organised the rally wants the government to stop prescribed burns in old-growth forests and increase rapid suppression resources. The Bush Fire Front wants the next government to maintain prescribed burning practices. The Department of Fire and Emergency Service Commissioner Darren Klemm says the practice is important."
        },
        {
            "published_date": "2025-01-19T21:52:19",
            "title": "5 steps Chicago region can take on climate change: Opinion",
            "author": "Crain's Chicago Business",
            "url": "https://www.chicagobusiness.com/crains-forum-winter-climate-changes/5-steps-chicago-region-can-take-climate-change-opinion",
            "url_media": "https://s3-rd-prod.chicagobusiness.com/styles/1200x630/s3/forum-lake-michigan-newscom.jpg",
            "country": "US",
            "language": "en",
            "summary": "Lake Michigan water levels will be more variable. High winds and more intense storms will cause waves to pound the shoreline's built environment. Chicago has its Lake Michigan freshwater largesse. Water is a human health necessity and an economic competitive advantage. Modernize the ComEd grid to be a more decentralized electric system with more energy-efficient buildings throughout the region."
        },
        {
            "published_date": "2025-01-19T21:07:11",
            "title": "Severe Drought Alert Issued for 11 Eastern North Carolina Counties as",
            "author": "Source",
            "url": "https://hoodline.com/2025/01/severe-drought-alert-issued-for-11-eastern-north-carolina-counties-as-dry-conditions-worsen",
            "url_media": "https://img.hoodline.com/2025/1/severe-drought-alert-issued-for-11-eastern-north-carolina-counties-as-dry-conditions-worsen-1.webp",
            "country": "US",
            "language": "en",
            "summary": "11 counties in eastern North Carolina are suffering from severe drought, 42 counties are experiencing moderate drought. La Niña phenomenon is expected to cause prolonged aridity in the coming months. Residents are urged to follow local water utilities' Water Shortage Response recommendations and conserve water as a precaution."
        },
        {
            "published_date": "2025-01-19T20:34:50",
            "title": "MS Coast districts, schools cancel classes under threat of winter weather. Here's the list",
            "author": "Tim Thorsen",
            "url": "https://www.yahoo.com/news/ms-coast-districts-schools-cancel-203450693.html",
            "url_media": "https://media.zenfs.com/en/biloxi_sun_herald_mcclatchy_articles_410/38cfbda84978608a123f6bab66e823b9",
            "country": "US",
            "language": "en",
            "summary": "There is a possibility of frozen precipitation on the Gulf Coast, so local school districts and institutions of higher learning are considering changes of their schedules. Bay St. Louis-Waveland School District and Biloxi Public School District are closed Tuesday, 21st and Wednesday, 22nd. Gulfport School District is closed on Tuesday and Wednesday. Long Beach School District closed on Wednesday. Pascagoula-Gautier School District closes on Tuesday 21st. St. Alphonsus Catholic School and St. Patrick Catholic High School are closed. University of Southern Mississippi is closed, with all classes moved online on Tuesday."
        },
        {
            "published_date": "2025-01-19T20:34:50",
            "title": "MS Coast districts, schools cancel classes under threat of winter weather. Here's the list",
            "author": "Tim Thorsen",
            "url": "https://www.sunherald.com/news/local/education/article298610963.html",
            "url_media": "https://www.sunherald.com/latest-news/i4mhdq/picture284257053/alternates/LANDSCAPE_1140/schoolclose.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a possibility of frozen precipitation on the Gulf Coast, so local school districts and institutions of higher learning are considering changes of their schedules. Bay St. Louis-Waveland School District and Biloxi Public School District are closed Tuesday, Jan. 21, and Wednesday, January 22. Hancock County School District is closed on the same day. St. Alphonsus Catholic School, St. Patrick Catholic High School, Saint Stanislaus High School and University of Southern Mississippi are closed."
        },
        {
            "published_date": "2025-01-19T19:02:16",
            "title": "ECSS officials announce school closures for Jan. 21-22 due to weather",
            "author": "Andrew Garner",
            "url": "https://www.atmoreadvance.com/2025/01/19/ecss-officials-announce-school-closures-for-jan-21-22-due-to-weather",
            "url_media": "https://www.atmoreadvance.com/wp-content/uploads/sites/31/2024/12/News-update-story.jpg",
            "country": "US",
            "language": "en",
            "summary": "Escambia County, Ala. School System announced the closure of schools Jan. 21-22 due to the anticipated snow and winter weather conditions. All schools will also be closed Mon., Jan. 20 for the Dr. Martin Luther King Jr. Day holiday. All sports practices, games and extracurricular activites scheduled for Tuesday and Wednesday are canceled. Coastal Alabama Community College announced today that all campuses will be closed Jan.21-22 because of the weather."
        },
        {
            "published_date": "2025-01-19T18:30:00",
            "title": "LETTER: Making a better Canada for future generations",
            "author": "Letter To The Editor",
            "url": "https://www.guelphtoday.com/letters-to-the-editor/letter-making-a-better-canada-for-future-generations-10070715",
            "url_media": "https://www.vmcdn.ca/f/files/shared/miscellaneous-stock-images/adobestock_548180296.jpeg;w=1200;h=800;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "Guelph today received a letter from Doug Grove. He is concerned about climate change and wants to make Canada a better place for future generations. He thinks the current climate change is going the wrong way. He supports a small amount of money being raised by a new tax to fight global warming."
        },
        {
            "published_date": "2025-01-19T18:20:58",
            "title": "CSIRO, WWF and Australian government team up to launch AdaptLog conservation solutions project",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-01-20/tasmania-adaptlog-conservation-solutions-csiro/104811206",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/dad3c29538838a8c1a3b66c115229dc5?impolicy=wcms_watermark_news&cropH=1701&cropW=3024&xPos=0&yPos=1076&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "There are over 400 conservation \"interventions\" that are now publicly available in a new online resource. It's aim is to showcase conservation solutions at-home and abroad that address climate impacts on vulnerable places and species. The list includes sprinkler systems installed in trees at Bendigo's Rosalind Park to protect flying foxes from heat, fire-resistant nesting boxes for greater gliders in Tallaganda National Park and East Gippsland mounds for one-horned rhinos in Nepal."
        },
        {
            "published_date": "2025-01-19T18:15:53",
            "title": "Up to 40 cm of snow possible with potential early-week snow squalls",
            "author": "Village Media",
            "url": "https://www.barrietoday.com/local-news/up-to-40-cm-of-snow-possible-with-potential-early-week-snow-squalls-10098864",
            "url_media": "https://www.vmcdn.ca/f/files/sootoday/images/weather/weather-features/img_0397.jpeg;w=1200;h=800;mode=crop",
            "country": "US",
            "language": "en",
            "summary": "A snow squall watch has been issued for Midland - Coldwater - Orr Lake, Barrie - Collingwood - Hillsdale, Ont. from Monday afternoon through Wednesday morning. Lake effect snow off Georgian Bay is expected to move into the area Monday afternoon and persist through Wednesday. Locally higher amounts of snow are possible, especially near Georgian Bay."
        },
        {
            "published_date": "2025-01-19T18:01:45",
            "title": "GCC states lead sustainable food security initiatives",
            "author": "Jalal Uddin Laskar",
            "url": "https://weeklyblitz.net/2025/01/20/gcc-states-lead-sustainable-food-security-initiatives",
            "url_media": "https://weeklyblitz.net/wp-content/uploads/2025/01/GCC-states-lead-sustainable-food-security-initiatives-600x337.jpg",
            "country": "US",
            "language": "en",
            "summary": "Gulf Cooperation Council (GCC) states have experienced remarkable population growth, doubling from 26 million in 1995 to 57 million in 2022. The region's arid climate, scarce arable land, and limited freshwater resources make it heavily reliant on food imports. Food security is a central component of the GCC nations' long-term development strategies. The 2022 Global Food Security Index ranked the UAE at 23rd globally, followed by Qatar at 30th, Oman at 35th, Bahrain at 38th, Saudi Arabia at 41st, and Kuwait at 50th."
        },
        {
            "published_date": "2025-01-19T18:00:00",
            "title": "Forget the latte line, this is the new divide splitting Sydney in two",
            "author": "Frances Howe",
            "url": "https://www.smh.com.au/national/nsw/forget-the-latte-line-this-is-the-new-divide-splitting-sydney-in-two-20250109-p5l33j.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.3442%2C$multiply_1.1709%2C$ratio_1%2C$width_1059%2C$x_412%2C$y_196/t_crop_custom/q_62%2Cf_auto/93baf3cd51b5504fbe93791c0fb985192098e47c",
            "country": "AU",
            "language": "en",
            "summary": "Sydney's younger generations have not designed the new suburbs they are likely to live in, such as Marsden Park, Menangle Park and Austral. They will inherit their issues from rising heat, poor transport links and the absence of essential amenities. Urban cooling researcher Sebastian Pfautsch believes these developments have been designed without any regard for their future inhabitants."
        },
        {
            "published_date": "2025-01-19T18:00:00",
            "title": "Dutton catches Albanese as preferred PM as law and order worries grow",
            "author": "Ronald Mizen",
            "url": "https://www.afr.com/politics/federal/dutton-catches-albanese-as-preferred-pm-as-law-and-order-worries-grow-20250119-p5l5i4",
            "url_media": "https://static.ffx.io/images/$zoom_0.5519%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_exclusive_no_age_social_wm/01599d649a4b8d26d5803d03e9686c1ee9ab9821",
            "country": "AU",
            "language": "en",
            "summary": "Peter Dutton has overtaken Anthony Albanese as preferred prime minister in the latest Australian Financial Review /Freshwater Strategy poll. Law and order issues are now the most important concern for voters, overtaking climate change as the second most important issue. There has been a spate of anti-Semitic attacks in Sydney and Melbourne recently."
        },
        {
            "published_date": "2025-01-19T17:51:49",
            "title": "Why the Arctic's accelerated warming is an alarm bell for the planet",
            "author": "Nathan Howes",
            "url": "https://ca.news.yahoo.com/why-arctics-accelerated-warming-alarm-175149195.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/PCxfHJB9wN9zXKjZzPG_gg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/the_weather_network_616/4aa45e1baf6a1449c5b4e8bca7e4d76d",
            "country": "US",
            "language": "en",
            "summary": "The Arctic recently received a failing grade from the National Oceanic and Atmospheric Administration (NOAA). World Wildlife Fund Canada (WWF-Canada) says the region is warming nearly three times faster than the rest of the planet, amplifying global heating, sea level rise and ecosystem loss."
        },
        {
            "published_date": "2025-01-19T17:00:00",
            "title": "App State hosting community forum to spotlight stories of resilience post-Helene",
            "author": "Moss Brennan",
            "url": "https://www.wataugademocrat.com/community/app-state-hosting-community-forum-to-spotlight-stories-of-resilience-post-helene/article_b4c1190c-d1dd-11ef-9d05-93d787a81e76.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/wataugademocrat.com/content/tncms/assets/v3/editorial/1/fb/1fbc5356-5ecc-11ee-a9ed-636c72bbb887/6516d148ef4c9.image.jpg?resize=1200%2C630",
            "country": "US",
            "language": "en",
            "summary": "An upcoming community forum is looking to spotlight post-Helene resilience in the region. Laura England is Director of Academic Sustainability Initiatives / Pathways to Resilience Climate Literacy QEP. She wants to learn from people whose leadership has made an enormous difference in the post-climate disaster well-being of the community."
        },
        {
            "published_date": "2025-01-19T16:36:58",
            "title": "Dr. James Fletcher Leads CARICOM Climate Envoy",
            "author": "Outside Contributor",
            "url": "https://stluciastar.com/dr-james-fletcher-leads-caricom-climate-envoy",
            "url_media": "https://i0.wp.com/stluciastar.com/wp-content/uploads/2015/02/Jimmy.jpg?fit=550%2C299&ssl=1",
            "country": "LC",
            "language": "en",
            "summary": "Dr. James Fletcher has been appointed CARICOM Climate Envoy with effect from 1 January 2025. Dr Fletcher is a well-recognised climate change advocate. He was invited by the President of COP 21 to be part of the ministerial team that helped to achieve consensus on the historic Paris Agreement."
        },
        {
            "published_date": "2025-01-19T16:31:06",
            "title": "Towns bunkering down as tropical cyclone strengthens",
            "author": "Melissa Meehan",
            "url": "https://www.bordermail.com.au/story/8870367/towns-bunkering-down-as-tropical-cyclone-strengthens",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/ce0aa10d-b023-477a-ae69-33ab2e109ef8.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Communities are bunkering down on Australia's western coast as the eastern states deal with the fallout from damaging storms and continuing rain, which has caused a power outage in some areas.       in Australia's eastern states are still recovering from the weather."
        },
        {
            "published_date": "2025-01-19T16:08:57",
            "title": "Bird Bikeshare won't be back",
            "author": "",
            "url": "https://www.wcax.com/video/2025/01/19/bird-bikeshare-wont-be-back",
            "url_media": "https://gray-wcax-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F01-19-2025%2Ft_07af7ef93ea8456ab3c60733214a6033_name_file_1280x720_2000_v3_1_.jpg?auth=41fe2f132ed7ed6d437317c7f8085a632590bb5e92b324585fdf1a67718978e8&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Bird bikes and scooters won't be seen on Chittenden County sidewalks when the weather warms up again.       in the spring, they will be parked on the streets and not on the sidewalks.  In the summer, they'll be on the roads."
        },
        {
            "published_date": "2025-01-19T16:08:08",
            "title": "NiMet to unveil 2025 seasonal climate prediction February 4",
            "author": "Faith Yahaya",
            "url": "https://thenationonlineng.net/nimet-to-unveil-2025-seasonal-climate-prediction-february-4",
            "url_media": "https://cdn.thenationonlineng.net/wp-content/uploads/2024/09/18214435/The-Nigeria-Meteorological-Agency-NiMet.png",
            "country": "NG",
            "language": "en",
            "summary": "NiMet will release the 2025 Seasonal Climate Prediction on February 4th. The Minister of Aviation and Aerospace Development, Festus Keyamo, will perform the presentation of the publication. The document includes the onset and cessation dates of the 2025 rainy season, the length of the cropping season and the total amount of rainfall expected in 774 Local Government Areas."
        },
        {
            "published_date": "2025-01-19T16:00:00",
            "title": "Ministry cautions on climate inflation claim",
            "author": "",
            "url": "https://www.taipeitimes.com/News/taiwan/archives/2025/01/20/2003830540",
            "url_media": "https://www.taipeitimes.com/images/2025/01/20/Greenpeace.jpg",
            "country": "TW",
            "language": "en",
            "summary": "Taiwan's consumer price index has been above 2 percent for three consecutive years since 2022. Climate-related inflation has cost the average household an additional NT$8,000 over the past three years. The government should conduct an economic impact assessment and expand investment in net-zero policies."
        },
        {
            "published_date": "2025-01-19T15:00:00",
            "title": "Monday musing: It's time to talk about the national day",
            "author": "",
            "url": "https://www.westernadvocate.com.au/story/8870353/duttons-australia-day-debate-a-divisive-election-move",
            "url_media": "https://www.westernadvocate.com.au/images/transform/v1/crop/frm/LLBstgPA4H8EG9DTTGcXBL/ebc9640d-1ec5-479c-8124-101f7c798b57.jpg/r0_207_6000_3357_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Geoffrey Blainey wrote that the white sails of the English were a symbol of a gale that would slowly cross the continent in the next hundred years.    It covered with drift sand the grinding stones and fishing nets, silencing the sounds of hundreds of languages, and stripping Aboriginal names from nearly every valley and headland."
        },
        {
            "published_date": "2025-01-19T14:57:04",
            "title": "Climate scientist: \"There's no place that's safe\"",
            "author": "",
            "url": "https://www.yahoo.com/news/climate-scientist-theres-no-place-145704716.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/HPz2x6_7zeyL4kx9QR6aEA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/video.cbsnewsvideos.com/77fa4559d0ac7c8d0152e4f27a0ab77a",
            "country": "US",
            "language": "en",
            "summary": "Peter Kalmus moved his family out of Altadena, California, to North Carolina in 2022. His old house burned to the ground in last week's wildfires. North Carolina suffered the effects of Hurricane Helene last fall. Tracy Smith talks to meteorologist Edgar McGregor and author John Vaillant about climate change."
        },
        {
            "published_date": "2025-01-19T14:34:45",
            "title": "New Corps Plan: 1,500-plus Homes, Businesses Need to Be Elevated in County",
            "author": "Vince Conti",
            "url": "https://capemaycountyherald.com/article/new-corps-plan-1500-plus-homes-businesses-need-to-be-elevated-in-county",
            "url_media": "https://capemaycountyherald.com/wp-content/uploads/2025/01/Army-Corps-Map-of-Back-Bay-Protection-Plan-Areas.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Army Corps of Engineers released a new draft plan for protecting the back bay areas of New Jersey from the ravages of storms and sea level rise. The updated plan is $8 billion cheaper than the $16 billion version released in 2021. The state and local share of the cost would be $3 billion. Cape May County has 57,923 structures that were considered in the report. "
        },
        {
            "published_date": "2025-01-19T14:30:00",
            "title": "New grant funds help local communities prepare for extreme weather",
            "author": "Angie Hong",
            "url": "https://www.hometownsource.com/stillwater_gazette/news/local/new-grant-funds-help-local-communities-prepare-for-extreme-weather/article_13d22626-d39a-11ef-be8b-33cf889f6978.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/hometownsource.com/content/tncms/assets/v3/editorial/1/3d/13d22626-d39a-11ef-be8b-33cf889f6978/67884ad8f1604.preview.jpg?crop=1915%2C1005%2C0%2C38&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Minnesota invested over $100 million in a Climate Resiliency and Water Infrastructure Grant Program for local and tribal governments this spring. The average annual temperature has increased 3 degrees and we're seeing an extra 3.4 inches of precipitation each year. This warming trend is most pronounced during the winter. There are three weeks less of ice coverage on Minnesota lakes compared with 100 years ago."
        },
        {
            "published_date": "2025-01-19T14:00:03",
            "title": "'Twice the size of London\": the world's largest iceberg sets adrift",
            "author": "",
            "url": "https://www.msn.com/en-us/weather/topstories/twice-the-size-of-london-the-world-s-largest-iceberg-sets-adrift/ar-AA1xsGqQ",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The world's largest iceberg, A23a, has been drifting for a year and is heading for the Atlantic. It is moving along ocean currents towards South Georgia, a sub-Antarctic region. If it runs aground on the island, it could harm the local flora and fauna."
        },
        {
            "published_date": "2025-01-19T13:47:17",
            "title": "Global economy could shrink 50% between 2070 and 2090 from climate shocks, say actuaries",
            "author": "Sandra Laville",
            "url": "https://news.knowledia.com/all/all/articles/global-economy-could-shrink-50-between-2070-and-2090-from-climate-7f9cfa6562eaa435e0ef9aa3d378198e40f87844",
            "url_media": "https://grist.org/wp-content/uploads/2025/01/spainflooding.jpg?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "The global economy could lose 50 percent in GDP between 2070 and 2090 due to climate change. Risk management experts at the Institute and Faculty of Actuaries, or IFoA, and scientists at the University of Exeter have warned of this in a report. They call for urgent action by political leaders to tackle the climate crisis."
        },
        {
            "published_date": "2025-01-19T13:30:00",
            "title": "Wildfires burning up Los Angeles are just the latest example of a planet in crisis",
            "author": "the readers",
            "url": "https://www.yahoo.com/news/wildfires-burning-los-angeles-just-133000123.html",
            "url_media": "https://media.zenfs.com/en/fresno_bee_mcclatchy_articles_660/7322e96349c8b3d06026f9c886b84845",
            "country": "US",
            "language": "en",
            "summary": "Scientists say 2024 will be the hottest year on record due to human-caused climate change. The fires in Southern California are the latest extreme weather that is growing more frequent and unpredictable due to the warming climate. The Democrats have sabotaged the United States with their open borders, soft on crime and covering up on outgoing President Joe Biden."
        },
        {
            "published_date": "2025-01-19T12:25:00",
            "title": "Migration and Refugee Crises: Climate Change, Wars and Economic Hardships",
            "author": "Richmond Acheampong",
            "url": "https://www.modernghana.com/news/1372926/migration-and-refugee-crises-climate-change-wars.html",
            "url_media": "https://cdn.modernghana.com/images/content/1192025120423-8et2xkjwvq-migration-and-refugee-crises.jpg",
            "country": "GH",
            "language": "en",
            "summary": "Migration and refugee crises are some of the most significant and urgent challenges facing the world in 2025. These crises are driven by a complex web of factors, including the worsening effects of climate change, the escalation of armed conflicts and the deepening of economic inequalities. Climate change is playing an increasingly significant role in shaping migration patterns. Wars and armed conflicts are a significant driver of forced migration. Economic hardships continue to be a major factor in driving migration."
        },
        {
            "published_date": "2025-01-19T12:00:13",
            "title": "There has been no climatic winter in Kyiv for three years in a row",
            "author": "Iryna Perepechko",
            "url": "https://babel.ua/en/news/114594-there-has-been-no-climatic-winter-in-kyiv-for-three-years-in-a-row",
            "url_media": "https://babel.ua/static/content/nqyjccwr/thumbs/1200x630/0/b2/2e95ade370c3871fda51e03448bf1b20.jpg?v=4366",
            "country": "UA",
            "language": "en",
            "summary": "Kyiv has not had a climatic winter for three years in a row. The average daily air temperature for the winter period was above 0 °C in 2022, 2023 and 2024. Global warming has caused annual global temperatures to exceed the internationally agreed target of 1.5°C for the first time in 2024."
        },
        {
            "published_date": "2025-01-19T12:00:00",
            "title": "Photos: Great grey owl visits Two Harbors",
            "author": "",
            "url": "https://www.duluthnewstribune.com/sports/northland-outdoors/photos-great-grey-owl-visits-two-harbors",
            "url_media": "https://cdn.forumcomm.com/dims4/default/c02eac8/2147483647/strip/true/crop/3508x2339+0+0/resize/1599x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fe1%2F56%2Faa8df2e64b36982ac44ae0842bba%2F011825-n-dmg-greyowl-c001.jpg",
            "country": "US",
            "language": "en",
            "summary": "A great grey owl hunts along Minnesota Highway 61 on Saturday in Two Harbors. Great grey owl is a true owl and is the world's largest species of owl by length. It is the only species of true owl found in both Eastern and Western hemispheres."
        },
        {
            "published_date": "2025-01-19T11:00:00",
            "title": "Ontario municipalities say homelessness could get a whole lot worse. They also have ideas to fix it",
            "author": "Victoria Gibson",
            "url": "https://www.hamiltonnews.com/news/ontario/ontario-municipalities-say-homelessness-could-get-a-whole-lot-worse-they-also-have-ideas-to/article_bb272627-38ad-5629-9b15-a7f16658dc5b.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thespec.com/content/tncms/assets/v3/editorial/d/df/ddf79755-cadd-5c56-bc0a-45444afe7b0e/678bc8307108b.image.jpg?crop=1757%2C922%2C0%2C128&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "A man warmed up by a fire outside his tent at Dufferin Grove Park in Toronto last week. The Toronto Star is sponsored by Hamilton Spectator bHasMigrated. The website is thespec.com sWebsitePrimaryPublication is publications/hamilton_spectator.avatar."
        },
        {
            "published_date": "2025-01-19T10:45:01",
            "title": "Scientists warn of threat infiltrating water supply in coastal communities: 'Those that have the fewest resources are the ones most affected'",
            "author": "Leslie Sattler",
            "url": "https://www.yahoo.com/news/scientists-warn-threat-infiltrating-water-104501601.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/f1Dmp8DfQK0vSNdSUtHf7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/e74af633821fdeacb3e8a901d3e14d80",
            "country": "US",
            "language": "en",
            "summary": "By 2100, three out of four coastal areas worldwide will experience saltwater moving into their freshwater supplies. The areas facing the biggest risks include Southeast Asia, the Gulf of Mexico, and the U.S. Eastern Seaboard. Scientists are creating tools to predict where saltwater intrusion will happen."
        },
        {
            "published_date": "2025-01-19T10:03:53",
            "title": "The climate crisis and the urgent need to protect the Apalachicola River",
            "author": "Maya Shenefelt",
            "url": "https://eu.tallahassee.com/story/opinion/2025/01/19/the-urgent-need-to-protect-the-apalachicola-river-opinion/77755318007",
            "url_media": "https://www.gannett-cdn.com/-mm-/77efe3f3ae0018c39c0fcc011637cffabfe7ef0e/c=86-0-3519-2583/local/-/media/Tallahassee/Tallahassee/2014/08/27/1409164625000-Oyster.jpg?width=320&height=240",
            "country": "US",
            "language": "en",
            "summary": "Maya Shenefelt is a sophomore at Florida A&M University majoring in Environmental Studies. She is passionate about clean energy, environmental equity, and protecting Florida's unique ecosystems. Florida's Apalachicola River, once a symbol of abundance and beauty, is now a battleground for our planet's future. The Florida Department of Environmental Protection plans to approve a drilling permit for Clearwater Land & Minerals, a Louisiana-based company. Florida is highly vulnerable to many aspects of the climate crisis."
        },
        {
            "published_date": "2025-01-19T10:00:00",
            "title": "The top 10 warm-weather destinations for winter getaways",
            "author": "Madeline Fitzgerald",
            "url": "https://qz.com/best-warm-weather-winter-vacations-travel-places-1851742565",
            "url_media": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/a9bc7a8e42ac575a23a2d20e30b5336b.jpg",
            "country": "US",
            "language": "en",
            "summary": "In recent weeks, temperatures in the northeastern United States have plunged below freezing. Traditional outdoor events, including the president's inauguration, are moving indoors to avoid the icy-cold atmosphere. Health experts warn that shorter days and colder temperatures can have detrimental impacts on both physical and mental health. Arka ranked the best warm-weather destinations for the Northern Hemisphere's winter months."
        },
        {
            "published_date": "2025-01-19T09:36:00",
            "title": "Four districts severely affected by heavy rainfall",
            "author": "",
            "url": "https://www.adaderana.lk/news/105073/four-districts-severely-affected-by-heavy-rainfall",
            "url_media": "https://adaderanaenglish.s3.amazonaws.com/1737259563-RAIN.jpg",
            "country": "LK",
            "language": "en",
            "summary": "Anuradhapura, Kilinochchi, Kegalle, and Galle districts have been severely affected by the heavy rains since January 15. 603 people from 319 families have been affected, and four houses in the Kegale have been partially damaged. 200 people from 71 families were evacuated to safer locations."
        },
        {
            "published_date": "2025-01-19T08:39:21",
            "title": "Let's at least try to stop climate change",
            "author": "NWA Online",
            "url": "https://article.wn.com/view/2025/01/19/Let_s_at_least_try_to_stop_climate_change_2",
            "url_media": "https://article.wn.com/view/2025/01/19/[]",
            "country": "US",
            "language": "en",
            "summary": "The key to reversing the heating of Earth's atmosphere focuses on two A's: Attitude and Action, as well as two B's: Creativity and Action. The key to reverse the heating is to focus on the A's and focus on two Bs."
        },
        {
            "published_date": "2025-01-19T08:08:00",
            "title": "Let's at least try to stop climate change",
            "author": "Richard Mason",
            "url": "https://www.arkansasonline.com/news/2025/jan/19/lets-at-least-try-to-stop-climate-change",
            "url_media": "https://wehco.media.clients.ellingtoncms.com/static-4/teaser_images/open_graph_default/ADG_fb_alt.png",
            "country": "US",
            "language": "en",
            "summary": "The key to reversing the heating of Earth's atmosphere focuses on two A's: Attitude and Action. If we don't stop the increase and reverse it, we are going to be faced with a new climate change.  The current record-setting temperatures and violent weather are direct results of atmospheric heating."
        },
        {
            "published_date": "2025-01-19T07:00:00",
            "title": "Rising Temperatures, Declining Pastures: The Struggle Of Shepherds In Khyber Pakhtunkhwa",
            "author": "Hamd Nawaz",
            "url": "https://thefridaytimes.com/18-Jan-2025/rising-temperatures-declining-pastures-the-struggle-of-shepherds-in-khyber-pakhtunkhwa",
            "url_media": "https://thefridaytimes.com/digital_images/large/2025-01-18/rising-temperatures-declining-pastures-the-struggle-of-shepherds-in-khyber-pakhtunkhwa-1737196913-4564.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Sheep farming in Khyber Pakhtunkhwa has been a traditional livelihood for generations. Climate change is affecting every aspect of sheep farming, from grazing to water availability, and even the health and productivity of livestock. Pakistan's average temperature is projected to increase by 2.6°C to 5.1°C by the end of the century."
        },
        {
            "published_date": "2025-01-19T06:30:01",
            "title": "Helvarg: How ocean temps are driving LA firestorms",
            "author": "Guest Commentary",
            "url": "https://itemlive.com/2025/01/19/helvarg-how-ocean-temps-are-driving-la-firestorms",
            "url_media": "https://itemlive.com/wp-content/uploads/2024/09/Guest-Commentary-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "In recent decades, the climate has gotten hotter, drier and more variable due to more intense rains and droughts in California. The most recent urban firestorm that has raged across Los Angeles for over a week now will likely become the most expensive natural disaster in U.S. history. Arctic Ocean is warming three times faster than the rest of the world due to a phenomenon known as 'Arctic amplification'. The Heritage Foundation's Project 2025 agenda calls for NOAA to be 'broken up and downsized' so that it stops contributing to 'the climate change alarm industry.'"
        },
        {
            "published_date": "2025-01-19T06:01:34",
            "title": "Turning the financial tide for Small Island States",
            "author": "Stabroek News",
            "url": "https://www.stabroeknews.com/2025/01/19/features/project-syndicate/turning-the-financial-tide-for-small-island-states",
            "url_media": "https://s1.stabroeknews.com/images/2025/01/ps-5-scaled.jpg",
            "country": "GY",
            "language": "en",
            "summary": "Small island developing states (SIDS) are on the front lines of climate change. SIDS are home to some of the world's most valuable natural assets. The key to breaking the feedback loops is more financing for SIDS. Green and blue bonds provide more affordable financing for climate adaptation and biodiversity conservation."
        },
        {
            "published_date": "2025-01-19T06:00:00",
            "title": "From Namibia's Floods to California's Flames: Home ownership in the Age of Climate Distress",
            "author": "Brenton David",
            "url": "https://www.namibian.com.na/from-namibias-floods-to-californias-flames-home-ownership-in-the-age-of-climate-distress",
            "url_media": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2025/01/Brenton-David.jpg",
            "country": "NA",
            "language": "en",
            "summary": "According to the latest FNB House Price Index, a 12-month growth of 7% was recorded after the third quarter of 2024 compared to 1.7% at the end of the second quarter of the year 2024 and 3.3% in 2023. Namibian real estate is particularly susceptible to physical climate change risk as buildings are situated in fixed locations."
        },
        {
            "published_date": "2025-01-19T05:59:47",
            "title": "Experts Unites To Combat Climate Crisis, Insecurity, Banditry In Northern Nigeria.",
            "author": "Oyenike Oyeniyi",
            "url": "https://von.gov.ng/experts-unites-to-combat-climate-crisis-insecurity-banditry-in-northern-nigeria",
            "url_media": "https://von.gov.ng/wp-content/uploads/2025/01/IMG-20250118-WA0015-1-300x225.jpg",
            "country": "NG",
            "language": "en",
            "summary": "The monthly Climate Hangout was organized by the Climate Change and Environment Desk at the Interfaith Mediation Center (IMC) and ACR in collaboration with the African Climate Reporters (ACR) and the Kaduna State Government's Office on Climate Change. The event brought together a diverse group of stakeholders to address the pressing issues of climate change and insecurity in Northern Nigeria. Abel John Bassa, a criminologist and security expert, stressed the detrimental impact of environmental degradation and climate change on key sectors."
        },
        {
            "published_date": "2025-01-19T05:30:24",
            "title": "Argentina Agriculture",
            "author": "공탈출 행정학",
            "url": "https://n.news.naver.com/mnews/article/077/0006493086",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/01/19/PAP20250119078301009_P2_20250119053024004.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Sunflowers grow in a field in Lobos, Argentina, on Saturday, Jan. 18, 2025, as Natacha Pisarenko reports.    picasa.paparenko.com/napapapranko/en."
        },
        {
            "published_date": "2025-01-19T05:06:42",
            "title": "Economic losses mounting from climate impact",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/business/20250119/cedric-stephens-economic-losses-mounting-climate-impact",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/01/19/3023148/8215690.jpg?itok=FODDlToM",
            "country": "JM",
            "language": "en",
            "summary": "Last week's post-Cabinet press briefing was dominated by issues related to climate change, the condition of the island's roads, government's strategic priorities and legislative agenda, its response to citizens' road complaints and small and medium enterprises. Fifteen per cent of the non-sport articles in last Wednesday's Gleaner were directly connected with climate change. Barbados Prime Minister Mia Mottley understands the risks that climate change poses globally and to small island developing states."
        },
        {
            "published_date": "2025-01-19T05:00:29",
            "title": "Dyer: Climate change truth worth telling no matter how sobering",
            "author": "Gwynne Dyer",
            "url": "https://lfpress.com/opinion/columnists/dyer-climate-change-truth-worth-telling-no-matter-how-sobering",
            "url_media": "https://smartcdn.gprod.postmedia.digital/lfpress/wp-content/uploads/2025/01/2193292465-1.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Average global temperature for 2024 has been plus-1.55 degrees, and the past three months have been plus.1.6 degrees. The scientific custom of requiring a 20-year run of data when calculating average global temperature made sense when temperatures fluctuated in the familiar old way. It makes no sense to use data from as long ago as 2005 when calculating the headline number."
        },
        {
            "published_date": "2025-01-19T05:00:29",
            "title": "Dyer: Climate change truth worth telling no matter how sobering",
            "author": "Gwynne Dyer",
            "url": "https://www.saultstar.com/opinion/columnists/dyer-climate-change-truth-worth-telling-no-matter-how-sobering/wcm/c171e6d3-6998-4543-b8a6-2c768bea7297",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2025/01/2193292465-1.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Scientists and politicians are trying to reassure us it is still worth trying to hold down warming. The world's average temperature did indeed exceed 1.5 degrees Celsius higher than the pre-industrial level in 2024. This does not mean the international plus-1.5-degree target has been broken, because that refers to a long-term average over decades."
        },
        {
            "published_date": "2025-01-19T05:00:00",
            "title": "Warning to anyone with robins in garden in January",
            "author": "Claire Schofield",
            "url": "https://www.express.co.uk/life-style/garden/2001432/warning-robins-garden-january",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/13/1200x630/5892885.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Households are being urged to feed robins in their gardens in January to ensure the birds have access to food this winter. The red-breasted birds don't hibernate during the colder months. Robins are natural ground feeders so putting out food for them on ground feeding trays, or bird tables, is ideal."
        },
        {
            "published_date": "2025-01-19T05:00:00",
            "title": "Trump's team is coming for climate science. The timing couldn't be worse.",
            "author": "Ben Jealous",
            "url": "https://www.phillytrib.com/commentary/trump-s-team-is-coming-for-climate-science-the-timing-couldn-t-be-worse/article_f7cc8dcc-5a12-556e-8691-6e650f05cc05.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/phillytrib.com/content/tncms/assets/v3/editorial/6/85/685fa0a0-7241-5eb0-947f-7b16fb1b1cb6/67867a1976222.image.jpg?crop=1175%2C617%2C0%2C573&resize=1175%2C617&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "2024 was the hottest year on record, surpassing 2023 as the previous hottest year. It is the first time that temperatures have exceeded the goal set in the Paris Climate Agreement of limiting global warming to 1.5 degrees Celsius above pre-industrial levels."
        },
        {
            "published_date": "2025-01-19T05:00:00",
            "title": "RSPB Big Garden Birdwatch returns in January 2024",
            "author": "Ryan Morwood",
            "url": "https://www.countypress.co.uk/news/24860109.rspb-big-garden-birdwatch-returns-january-2024",
            "url_media": "https://www.countypress.co.uk/resources/images/18977485.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "The Big Garden Birdwatch takes place on January 24, 25 and 26. People are asked to spend an hour watching and counting the birds in their garden, balcony or local park. The survey is important as birds are facing challenges due to the nature and climate emergency. In Hampshire, nearly 22,000 people took part, with the house sparrow taking the top spot as the most commonly seen bird, followed by blue tit and wood pigeon."
        },
        {
            "published_date": "2025-01-19T04:45:00",
            "title": "Director of Copernicus Climate Change Service: ‘It's likely that 2024 was the hottest of the last 100,000 years'",
            "author": "Clemente Álvarez",
            "url": "https://english.elpais.com/climate/2025-01-19/director-of-copernicus-climate-change-service-its-likely-that-2024-was-the-hottest-of-the-last-100000-years.html",
            "url_media": "https://imagenes.elpais.com/resizer/v2/WOQLBDE7TJGTHIJGSYK2KUVTOY.jpg?auth=8df4a7845d43e159526643c51f7800ef85fad30f24988c719a899fcad6d01fee&width=1200",
            "country": "ES",
            "language": "en",
            "summary": "Carlo Buontempo is the director of the Copernicus Climate Change Service. He is concerned that society is not taking advantage of the scientific information on the planet's climate imbalance. Every year of the last decade has been among the 10 warmest years on record on Earth. The Paris Agreement seeks to curb warming so that by the end of the century, the average global temperature rise will stay below 2 degrees Celsius."
        },
        {
            "published_date": "2025-01-19T03:56:57",
            "title": "The Antarctic glacier that could raise sea levels by 1.5m",
            "author": "Sydney Morning Herald",
            "url": "https://article.wn.com/view/2025/01/19/The_Antarctic_glacier_that_could_raise_sea_levels_by_15m",
            "url_media": "https://article.wn.com/view/2025/01/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Scientists are monitoring the rapid melt of Denman Glacier in East Antarctica. It is one of the largest frozen rivers in the region.    in terms of volume and volume of ice melting. For more information, go to: http://www.sciencealert.org/denmanglacier."
        },
        {
            "published_date": "2025-01-19T03:50:21",
            "title": "Climate change and urban planning: Building resilient cities",
            "author": "Gary Gerald Mtombeni",
            "url": "https://www.thestandard.co.zw/standard-people/article/200037138/climate-change-and-urban-planning-building-resilient-cities",
            "url_media": "https://cdn.thestandard.co.zw/images/thestandard/uploads/2025/01/xHmDUlnZTzJlnXEQFZ65IDjWIciI3JunMhLX22xK.jpg",
            "country": "ZW",
            "language": "en",
            "summary": "Cities generate more than 60% of greenhouse gas (GHG) emissions globally. Over 50% of the world's population lives in cities. Urban planning plays a critical role in addressing climate change. Green spaces, green roofs, public transportation and climate-resilient infrastructure are important aspects of urban planning."
        },
        {
            "published_date": "2025-01-19T03:49:51",
            "title": "Malawi's Local Councils Overwhelmed by Disaster Response Challenges",
            "author": "Malawi24 Reporter",
            "url": "https://malawi24.com/2025/01/19/malawis-local-councils-overwhelmed-by-disaster-response-challenges",
            "url_media": "https://malawi24.com/wp-content/uploads/2025/01/Environment-and-Climate-Change-Specialist-for-Transforming-Agriculture-and-Entrepreneurship-Programme-TRADE.jpg",
            "country": "MW",
            "language": "en",
            "summary": "Malawi's environmental authorities have highlighted a critical challenge facing local councils in the country. The lack of capacity to effectively respond to disasters hinders councils' ability to provide timely and adequate support to communities affected by disasters. This was revealed at the end of a three-day workshop for Nkhata-Bay and Karonga districts in Mzuzu."
        },
        {
            "published_date": "2025-01-19T03:37:44",
            "title": "Magnitude 3.7 earthquake rocks WA town",
            "author": "",
            "url": "https://www.perthnow.com.au/news/wa/meckering-earthquake-magnitude-37-quake-shakes-houses-in-was-wheatbelt-c-17436292",
            "url_media": "https://images.perthnow.com.au/publication/C-17436292/16615e9ece16ab814b8d7897dcbc74a1d2383ee3-16x9-x0y133w586h330.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "A 3.7 magnitude earthquake has rocked houses in WA's Wheatbelt. It was recorded in Meckering at 11.12 am. More than 150 people have reported feeling the earthquake. Shakes were felt as far as Maida Vale. More to come."
        },
        {
            "published_date": "2025-01-19T03:25:38",
            "title": "Oldest Unbroken Record of Earth's Climate Pulled From Antarctic Ice Sheet",
            "author": "robert klein",
            "url": "https://www.FreedomsPhoenix.com/News/373892-2025-01-18-oldest-unbroken-record-of-earths-climate-pulled-from-antarctic-ice.htm",
            "url_media": "https://www.freedomsphoenix.com/Uploads/Graphics/284-0118171617-IceCoreAntarctica-642x260.jpg",
            "country": "US",
            "language": "en",
            "summary": "Each meter-long segment contains up to 13,000 years of deep, compressed history, including bubbles of ancient air. Uppermost 2,480 meters contain a climate record that goes back to 1.2 million years, says Julien Westhoff, chief scientist on the ground for the European Project for Ice Coring in Antarctica."
        },
        {
            "published_date": "2025-01-19T02:57:23",
            "title": "SCF boosts disaster preparedness in Sanghar",
            "author": "Our Correspondent",
            "url": "https://tribune.com.pk/story/2523049/scf-boosts-disaster-preparedness-in-sanghar",
            "url_media": "https://i.tribune.com.pk/media/images/floods1/floods1.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The Sindh Community Foundation (SCF) has taken a crucial step toward enhancing emergency response and disaster preparedness in the Sanghar district. Emergency kits were handed over to the key representatives from each Community-Based Disaster Risk Management (CBDRM) committee."
        },
        {
            "published_date": "2025-01-19T02:45:00",
            "title": "The Antarctic glacier that could raise sea levels by 1.5m",
            "author": "Caitlin Fitzsimmons",
            "url": "https://www.smh.com.au/environment/climate-change/the-antarctic-glacier-that-could-raise-sea-levels-by-1-5m-20250117-p5l58b.html",
            "url_media": "https://static.ffx.io/images/$zoom_2.1222%2C$multiply_0.5%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/f7df71d69d9aeffe92678f73ece04bd7a33d81a6",
            "country": "AU",
            "language": "en",
            "summary": "Denman Glacier in Antarctica is melting twice as fast on one side as the other. It contains enough water to raise global sea levels by 1.5 metres. Australian scientists have spent the past three summers at a remote outpost in the Bunger Hills 450 kilometres from Casey research station in East Antarctica."
        },
        {
            "published_date": "2025-01-19T02:45:00",
            "title": "The Antarctic glacier that could raise sea levels by 1.5m",
            "author": "Caitlin Fitzsimmons",
            "url": "https://www.watoday.com.au/environment/climate-change/the-antarctic-glacier-that-could-raise-sea-levels-by-1-5m-20250117-p5l58b.html",
            "url_media": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_225%2C$y_387/t_crop_custom/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/e85579f472e46a80b136dcd64de6e6e988097077",
            "country": "AU",
            "language": "en",
            "summary": "Denman Glacier in Antarctica is melting twice as fast on one side as the other. It contains enough water to raise global sea levels by 1.5 metres. Australian scientists have spent the past three summers at a remote outpost in the Bunger Hills 450 km from Casey research station in East Antarctica."
        },
        {
            "published_date": "2025-01-19T02:35:00",
            "title": "These Are What 'Experts' See As The Largest Risks Faced By The World",
            "author": "Tyler Durden",
            "url": "https://www.zerohedge.com/geopolitical/these-are-what-experts-see-largest-risks-faced-world",
            "url_media": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-01/2025-01-18_11-48-41.jpg?h=ecc0fa09&itok=OQyfDael",
            "country": "BG",
            "language": "en",
            "summary": "Climate change and its consequences will pose the greatest risk to the world, according to the World Economic Forum's annual Global Risks Report. For the second year in a row, misinformation and disinformation is considered the most severe risk over the next two years. Extreme weather events are rated as the second most serious risk for the present and near future."
        },
        {
            "published_date": "2025-01-19T02:19:22",
            "title": "Coastal erosion: Kanimozhi inspects Tiruchendur beach, assures action",
            "author": "Express News Service",
            "url": "https://www.newindianexpress.com/states/tamil-nadu/2025/Jan/19/coastal-erosion-kanimozhi-inspects-tiruchendur-beach-assures-action",
            "url_media": "https://media.assettype.com/newindianexpress%2F2025-01-18%2Fh8be8koq%2FCoastal-erosion.jpg?rect=0%2C16%2C525%2C276&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "Thoothukudi MP Kanimozhi Karunanidhi inspected the eroded areas of the Tiruchendur Murugan temple beach on Saturday. She said the issue will be brought to the attention of Chief Minister MK Stalin and appropriate steps will be taken to protect the shore from erosion."
        },
        {
            "published_date": "2025-01-19T02:00:00",
            "title": "The native grass scientists hope can increase drought resistance in crops",
            "author": "Alison Paterson",
            "url": "https://www.queenslandcountrylife.com.au/story/8867813/australias-looming-food-and-water-shortages-warning",
            "url_media": "https://www.queenslandcountrylife.com.au/images/transform/v1/crop/frm/226821444/b218979d-48fb-4553-b5e3-1da196f03906.jpg/r0_207_4032_2324_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "A world-leading expert in agricultural biotechnology has warned Australia's next generation will probably experience severe food and water scarcity due to climate change and environmental issues. He is a leading expert in the field of agriculture and biotechnical research. He says Australia's future generations will probably have to deal with severe food shortages."
        },
        {
            "published_date": "2025-01-19T01:53:51",
            "title": "How to survive Canada's winter: Just move to this frost-free city",
            "author": "Tyler Hamilton",
            "url": "https://ca.news.yahoo.com/survive-canada-winter-just-move-015351307.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/J92.Qic.UnFVxUbK0Ph4HQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_weather_network_616/49a43e03c424979fa4b1b8624a18be82",
            "country": "US",
            "language": "en",
            "summary": "1.3°C is the lowest temperature recorded in Victoria, B.C. so far this winter. The most recent winter in Victoria to completely avoid freezing temperatures was back in 2002-03. Victoria's strategic position on the Saanich Peninsula, surrounded by water on three sides, ensures that milder ocean air dominates during the winter months."
        },
        {
            "published_date": "2025-01-19T01:29:44",
            "title": "China's coal production going ‘through the roof'",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/outsiders/chinas-coal-production-going-through-the-roof/video/7ec0b2a7a87585ffb49393f97fb50c13",
            "url_media": "https://content.api.news/v3/images/bin/e44c2fff599aef691c94c3f0dd7b59ec",
            "country": "AU",
            "language": "en",
            "summary": "Rowan Dean has reacted to a graph showing China's coal production has hit'record highs'. Mr Dean says China is going 'all gangbusters' for coal and wants Australia to get great again.      .   i   in "
        },
        {
            "published_date": "2025-01-19T01:15:22",
            "title": "Climate, crisis and cost of food",
            "author": "Salini Devi Rajendran",
            "url": "https://www.nst.com.my/lifestyle/sunday-vibes/2025/01/1162964/climate-crisis-and-cost-food",
            "url_media": "https://assets.nst.com.my/images/articles/vibes190125scrisisa_1737249306.jpg",
            "country": "MY",
            "language": "en",
            "summary": "The recent floods caused vegetable prices to skyrocket by 50 to 80%. More than 100 hectares of farmland in five states (Johor, Melaka, Perak, Kelantan and Terengganu) were destroyed. The flooding has significantly reduced supply in the market, causing prices to rise sharply. Malaysia's food prices rose 2.6% year-on-year up to last November, the highest increase since December 2023."
        },
        {
            "published_date": "2025-01-19T01:00:00",
            "title": "Cold affects you and the fish",
            "author": "Joe Macaluso",
            "url": "https://www.theadvocate.com/baton_rouge/sports/outdoors/cold-conditions-affect-you-and-the-fish/article_7482dd32-cfb5-11ef-960f-4f7672616f00.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/theadvocate.com/content/tncms/assets/v3/editorial/c/c8/cc839f16-bd1f-591b-b793-cee64f886471/5d2638028f96f.image.jpg?crop=248%2C248%2C66%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The coldest Arctic blast in two years is headed our way. Duck hunters should be prepared for morning temperatures in the 20s. High north winds move water and many areas where you could pass even last week will be mud flats this week. It's common to see fish kills especially in shallow-water areas along the coast."
        },
        {
            "published_date": "2025-01-19T00:27:31",
            "title": "‘A fraud': TV host reacts to ‘crackpot' Greta Thunberg",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/outsiders/a-fraud-tv-host-reacts-to-crackpot-greta-thunberg/video/e09b4439d89861e03d340a03a9f82547",
            "url_media": "https://content.api.news/v3/images/bin/ec809bb6dfb2d66feaa3b4ad7f293e5e",
            "country": "AU",
            "language": "en",
            "summary": "Sky News Australia host Rowan Dean has reacted to Greta Thunberg's presence at a pro-Palestine rally. Mr Dean has said on Outsiders from day one that Greta was a fraud and hopes she's happy with herself now.  "
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Try as he might, Trump can't kill clean energy",
            "author": "The Hill",
            "url": "https://article.wn.com/view/2025/01/19/Try_as_he_might_Trump_can_t_kill_clean_energy",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "President-elect Donald Trump has called global warming 'a canard,' 'a hoax' and 'nonexistent'. He once said that the idea that global warming is caused by fossil fuel emissions was created by and for the Chinese to make U.S. manufacturing non-competitive."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Protest calls for end to prescribed burns in old-growth forests",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/19/Protest_calls_for_end_to_prescribed_burns_in_oldgrowth_fores",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Protesters call for a shake-up of Western Australia's fire management practice. Others point to the tragic outcomes of the Los Angeles fires as a cautionary tale.   in the past, the practice has failed to prevent the fires in Western Australia. "
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "From cod logs to frog bogs: We catalogued 400 ways to help species survive a ...",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/19/From_cod_logs_to_frog_bogs_We_catalogued_400_ways_to_help_sp",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The environment of Australia is changing rapidly as the world warms and many species are struggling to keep up. 2024 has been declared Earth's hottest year, shattering the previous record set in 2023. Conservation managers recognize the need for new ways to help species. "
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Delhi sees warmest Jan day in six years",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/01/19/Delhi_sees_warmest_Jan_day_in_six_years",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It was the warmest Jan day in six years in New Delhi. The usual winter chill was missing due to the combination of bright sunshine and the influence of an active western disturbance over the Himalayas causing variable winds. The air quality index (AQI) was good."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "We left our old lives in Britain for the sun in Australia and have no ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/01/19/We_left_our_old_lives_in_Britain_for_the_sun_in_Australia_an",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Britons have been flocking to Australia in search of a better life. Nearly 50,000 people will arrive on working holiday visas in 2024 alone. Last year saw a rise in the number of Brits living in Australia, who want to never return home."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "‘The discourse is chilling': aid groups on US-Mexico border prepare for Trump",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/01/19/The_discourse_is_chilling_aid_groups_on_USMexico_border_prep_p",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Volunteers who leave water in the desert describe rising fears of vigilantes and climate peril in the wake of the Paris Agreement.    \"There are more and more people leaving water in desert because of the climate change.\"  \"They are worried about vigilantes.\" "
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "When does it get too hot to play tennis?",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/01/19/When_does_it_get_too_hot_to_play_tennis",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "BBC Sport explains how the Australian Open Heat Stress Scale works and when play is called off because of extreme conditions in the event of extreme weather conditions.      .   in this article.  In this article, BBC Sport explains the Heat stress scale and when the play is stopped due to extreme conditions, and how it works."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "UK weather: Britain braces for bitter chill today as Met Office warns of ‘SNOW GRAINS' ...",
            "author": "The Sun",
            "url": "https://article.wn.com/view/2025/01/19/UK_weather_Britain_braces_for_bitter_chill_today_as_Met_Offi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Brits are bracing themselves for a bitter chill today with snow grains on the way. The UK Health Security Agency has issued eight cold-health alerts across large parts of the country. The Met Office has warned of icy temperatures after figures plummeted to -2C."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "According to the Farmer's Almanac, a major winter storm is expected to hit Michigan next week",
            "author": "Independent Newsgroup",
            "url": "https://article.wn.com/view/2025/01/19/according_to_the_farmer_8217s_almanac_a_major_winter_storm_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "This winter has been significantly colder than last year. Grand Rapids had received more than 25 inches of snow as of December 13th. Last winter was the warmest winter in over 125 years, with 38.4″ of snowfall between December 2023 and February 2024."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "COMMENTARY: The Arctic, melting ice and geopolitics",
            "author": "The Indiana Times",
            "url": "https://article.wn.com/view/2025/01/19/COMMENTARY_The_Arctic_melting_ice_and_geopolitics",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Today, global warming and dramatic melting of polar ice underscore the vital importance of the region, says the UN Secretary-General's envoy to the Arctic Council, Michael Lindenblom. He is concerned about the impact of global warming on the Arctic region. "
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "How Australia fights bushfires could soon look very different, but is too late?",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/19/How_Australia_fights_bushfires_could_soon_look_very_differen",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There are concerns that Australia isn't ready to combat fires all year round. There are wildfires raging across Los Angeles and focus is turning to how new technologies, including AI, can aid our response to future disasters, but there are also concerns that they won't be ready to fight them."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Climate Whiplash and Fire Come to L.A.",
            "author": "New Yorker",
            "url": "https://article.wn.com/view/2025/01/19/Climate_Whiplash_and_Fire_Come_to_LA",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change has brought both fiercer rains and deeper droughts, leaving the city with brush like kindling. The phenomenon is on the rise worldwide, according to the UNFCCC. The situation is especially bad in India, which has been hit hard by climate change."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Two ways Trump's inauguration will change the world",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/19/Two_ways_Trumps_inauguration_will_change_the_world",
            "url_media": "https://article.wn.com/view/2025/01/19/[]",
            "country": "US",
            "language": "en",
            "summary": "In Australia, productivity lately is a source of discontent and finger-pointing, especially when compared with the United States. The dark side of Australia's productivity has been made clear. It's not as good as in the U.S., but it's still better than it used to be."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "HEDA Demands EFCC Investigation Into Non-Executed Shoreline Protection Contracts In Ondo Community",
            "author": "",
            "url": "https://saharareporters.com/2025/01/19/heda-demands-efcc-investigation-non-executed-shoreline-protection-contracts-ondo",
            "url_media": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "Gallet Nigeria Limited and Dredging Atlantic failed to execute shoreline protection contracts in Ayetoro Community, Ondo State. Oil exploration has caused significant land loss to Atlantic Ocean incursions, leaving many residents homeless and disrupting their livelihoods. The civil society group urged the anti-graft agency to investigate and prosecute those responsible, and recover misappropriated funds."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Stakes high for New Mexico ag growers awaiting new farm bill",
            "author": "",
            "url": "https://www.alamogordonews.com/2025/01/stakes-high-for-new-mexico-ag-growers-awaiting-new-farm-bill",
            "url_media": "https://www.alamogordonews.com/wp-content/uploads/2025/01/5697-grview-94696-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Climate change threatens many New Mexico crops, including chiles, onions, garlic and pecans. Experts agree climate-smart agriculture will be critical in the fight against climate change, but with a divided Congress and no climate change legislation, it's not easy."
        },
        {
            "published_date": "2025-01-19T00:00:00",
            "title": "Arts and Ideas: June 23, 2025",
            "author": "",
            "url": "https://www.capeandislands.org/show/arts-and-ideas-on-cai/2025-01-19/arts-and-ideas-june-23-2025",
            "url_media": "https://www.capeandislands.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "Local NPR for the Cape, Coast & Islands is 90.1 91.1 94.3. Arts and Ideas is on Sunday nights at 7 pm for high school students on Open to Debate, 8 pm for sea songs from North Carolina's Outer Banks, 9 pm for Big Picture Science, 10 pm for PRX Remix."
        }
    ]
}