{
    "status": "ok",
    "total_articles": 190,
    "articles": [
        {
            "published_date": "2025-01-17T23:55:22",
            "title": "La Nina has developed, so what does that mean for the rest of winter in the Triangle?",
            "author": "Rachel Duensing",
            "url": "https://www.cbs17.com/weather/la-nina-has-developed-so-what-does-that-mean-for-the-rest-of-winter-in-the-triangle",
            "url_media": "https://www.cbs17.com/wp-content/uploads/sites/29/2025/01/image-39.png?w=1280",
            "country": "US",
            "language": "en",
            "summary": "La Niña is when the east to west trade winds over the tropical Pacific Ocean are stronger than average. La Niña usually makes the Pacific and Polar jet streams more variable. North Carolina is going to be cold next week, but February is expected to be warmer than average and drier than usual. The current forecast calls for a 59% chance for the La Niño to persist through April."
        },
        {
            "published_date": "2025-01-17T23:47:00",
            "title": "Climate change impacts threaten future of Maine lighthouses",
            "author": "Gillian Graham",
            "url": "https://www.yahoo.com/news/climate-change-impacts-threaten-future-234700550.html",
            "url_media": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "country": "US",
            "language": "en",
            "summary": "Maine's lighthouses were added to World Monument Watch's list of heritage sites threatened by neglect, wars and extreme weather driven by climate change. Two storms devastated the Maine coast last January, causing more than $70 million in damage. The Gulf of Maine is warming faster than 99% of the ocean surfaces. The rate of change in rising seas and storm surges impacting Maine's light stations is among the most extreme. Lighthouse stewards have limited resources to make the buildings more resilient."
        },
        {
            "published_date": "2025-01-17T23:24:43",
            "title": "2024 was the warmest year globally on record",
            "author": "Adam Strzempko",
            "url": "https://www.yahoo.com/news/2024-warmest-globally-record-232443633.html",
            "url_media": "https://media.zenfs.com/en/wwlp_springfield_articles_751/0058e33cd038b2952c39875d27c12f2e",
            "country": "US",
            "language": "en",
            "summary": "2024 was the warmest year on record, according to NOAA's National Centers for Environmental Information. The Earth's 10 warmest years since 1850 have all occurred in the past decade. It has been 48 years since the average global temperature was colder than average since 1976."
        },
        {
            "published_date": "2025-01-17T22:54:44",
            "title": "What we get wrong about the polar vortex",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6616804",
            "url_media": "https://i.cbc.ca/ais/f66e7382-b106-41ae-b6a4-574854210667,1737154445550/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C231%2C5772%2C3246%29%3BResize%3D%281180%29",
            "country": "CA",
            "language": "en",
            "summary": "A big outbreak of Arctic air is about to drop temperatures across North America, but is it the 'polar vortex' to blame for it?    iReport.com will keep you updated on the latest in this story as it comes to light. "
        },
        {
            "published_date": "2025-01-17T22:46:06",
            "title": "‘Kyoto' Review: A Riveting, Fast-Paced Political Thriller About Climate Change Accords Makes West End Leap",
            "author": "Variety",
            "url": "https://article.wn.com/view/2025/01/17/8216kyoto_8217_review_a_riveting_fastpaced_political_thrille",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "As urgent and vital as it is, an investigation into international angles on climate change doesn't sound remotely theatrical to me. I don't think it's necessary. I think it would be a waste of time. I'm not sure if it's a good idea."
        },
        {
            "published_date": "2025-01-17T22:30:00",
            "title": "Letters to the editor for the week of Jan. 17, 2025",
            "author": "Barbara Pahre",
            "url": "https://napavalleyregister.com/news/local/napa-valley-and-nearby-speaks-up-letters-to-the-editor-for-the-week-of-jan/collection_a55850a4-cca3-550a-a1c7-a20248e304ab.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/napavalleyregister.com/content/tncms/assets/v3/editorial/a/55/a55850a4-cca3-550a-a1c7-a20248e304ab/6789f5dbb8ab6.preview.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Napa AAUW Scholarship Foundation is sponsoring its annual Authors Forum on February 15th at the Napa Valley College Performing Arts Center at 2 p.m. This year's authors will be Cara Black, Dorothy Lazard, Lauren Markham, and Nina Schuyler. Tickets are $50 plus processing fees. Some tickets are being offered free for current Napa College faculty and students."
        },
        {
            "published_date": "2025-01-17T22:15:30",
            "title": "Chinese province on \"roof of world\" registers warmest year in 2024",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250117/1cb7b3b5ed854b17b93275d659c1778b/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Qinghai Province on the Qinghai-Xizang Plateau registered the warmest year in 2024. The annual average temperature in the province increased by an average of 0.36 degrees Celsius every decade since 1961. Global climate change is increasing the frequency of extreme weather events in China."
        },
        {
            "published_date": "2025-01-17T21:58:05",
            "title": "Antarctica's Ice Melt Could Awaken Hidden Volcanoes",
            "author": "Michelle Starr",
            "url": "https://www.yahoo.com/news/antarcticas-ice-melt-could-awaken-215805687.html",
            "url_media": "https://media.zenfs.com/en/sciencealert_160/8a8924a402d7e81c08231c08efef5fe5",
            "country": "US",
            "language": "en",
            "summary": "Earth is losing ice. Greenland's ice is shrinking, at a rate of 270 billion tons per year, and Antarctica is losing 150 billion tons a year. The West Antarctic Ice Sheet, the smaller half of Antarctica to the west of the Transantarctic Mountains, is particularly vulnerable to collapse. Its underlying volcanic rift is rarely taken into account when modeling its future. As ice melts, the pressure on the crust is eased, allowing magma trapped in chambers therein to expand. This can result in increased eruptions."
        },
        {
            "published_date": "2025-01-17T20:49:00",
            "title": "How the universe could end: 5 jaw-dropping scenarios that will blow your mind",
            "author": "TOI Trending Desk",
            "url": "https://timesofindia.indiatimes.com/etimes/trending/how-the-universe-could-end-5-jaw-dropping-scenarios-that-will-blow-your-mind/articleshow/117339348.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-117339337,width-1070,height-580,imgsize-19710,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "There are several ways by which the world might end. Heat death is the most prominent one. The Big Rip is a cosmological theory that suggests the universe will end in a violent expansion that tears apart all matter, including stars, planets, atoms, and even spacetime."
        },
        {
            "published_date": "2025-01-17T20:38:38",
            "title": "How farmers, tradies in northern Australia are making the most of a late monsoon",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-01-18/late-monsoon-allows-extra-work-time-but-creating-wild-weather/104830030",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/98fabfc88b24e30282ae2b7dc16b6d49?impolicy=wcms_watermark_news&cropH=2690&cropW=4782&xPos=0&yPos=3&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "The monsoon will hit Australia about January 26. It will be the latest since the Bureau of Meteorology records began in 1957. It's been a mild wet season in the Top End, but it's been especially late in the Northern part of Australia this year. The delay is due to the high temperatures and lack of cloud cover."
        },
        {
            "published_date": "2025-01-17T20:34:52",
            "title": "As the World Warms, Davos Braces for Political Drama",
            "author": "David Gelles",
            "url": "https://www.nytimes.com/2025/01/17/climate/davos-trump-world-economic-forum.html",
            "url_media": "https://static01.nyt.com/images/2025/01/20/multimedia/20sp-davos-climate-inyt-02-kzwc/20sp-davos-climate-inyt-02-kzwc-facebookJumbo.jpg",
            "country": "US",
            "language": "en",
            "summary": "The world is the hottest it's ever been. Last year was officially the warmest in recorded history. The World Economic Forum identified extreme weather as one of the top global risks. Donald J. Trump will be president of the United States when he takes office. He has called for a rapid expansion of fossil fuels like oil, gas and coal and he has said he will pull out of the Paris climate accord. The priorities of the incoming administration will shape the dialogue in Davos."
        },
        {
            "published_date": "2025-01-17T20:21:00",
            "title": "Canada Invests in Climate Change Adaptation to Keep Communities Safe in Atlantic Canada",
            "author": "Natural Resources Canada",
            "url": "https://www.newswire.ca/news-releases/canada-invests-in-climate-change-adaptation-to-keep-communities-safe-in-atlantic-canada-853027163.html",
            "url_media": "https://www.newswire.ca/content/dam/cision/icons/favicon.png",
            "country": "CA",
            "language": "en",
            "summary": "$8.8 million in funding announced for nine projects in Atlantic Canada under Natural Resources Canada's Climate Change Adaptation Program (CCAP) and Climate-Resilient Coastal Communities (CRCC) Program. The projects will focus on developing and improving strategies, tools and resources, strengthening the knowledge and skills of practitioners, and implementing innovative adaptation actions to address climate change risks and adaptation gaps."
        },
        {
            "published_date": "2025-01-17T20:19:47",
            "title": "Popular summer spots in New Bern add renovations",
            "author": "Sartori",
            "url": "https://www.yahoo.com/news/popular-summer-spots-bern-add-201947340.html",
            "url_media": "https://media.zenfs.com/en/wnct_greenville_articles_424/7be79ffe7a5bbebce56d27d1da8589e2",
            "country": "US",
            "language": "en",
            "summary": "Jack's Island and the Marshwalk in New Bern unveiled their updated enhancements to the community. The picnic shelter has been constructed and the sidewalk fixed after deterioration over time. The original boardwalk dates back to 1990 and was destroyed by Hurricane Florence. The city used FEMA funds to rebuild it after the storm."
        },
        {
            "published_date": "2025-01-17T20:04:31",
            "title": "DMAC lists 11 eastern NC counties to be experiencing severe drought",
            "author": "",
            "url": "https://foxwilmington.com/dmac-lists-11-eastern-nc-counties-to-be-experiencing-severe-drought",
            "url_media": "https://foxwilmington.com/wp-content/uploads/2025/01/106366-3N5PFEXK6BE5BCSAF4XEUHZTGY.jpg",
            "country": "US",
            "language": "en",
            "summary": "11 counties in eastern North Carolina are experiencing severe drought conditions. 42 counties are under moderate drought. The next update will be on Jan. 23. The forecast is for a continued dry winter due to the La Niña pattern. To check the drought map, click here."
        },
        {
            "published_date": "2025-01-17T19:37:18",
            "title": "Happisburgh homeowner vows to keep fighting coastal erosion",
            "author": "Debbie Tubby",
            "url": "https://www.bbc.com/news/articles/cgq003wy37jo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/7353/live/cf54d540-d509-11ef-9fd6-0be88a764111.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Bryony Nierop-Reading, 78, is about to lose her home to the sea to coastal erosion for the second time. North Norfolk District Council has been working on erosion risk management in Happisburgh for \"many years\". In 2009, she bought a bungalow metres away from the cliff edge, but it was destroyed by a storm four years later."
        },
        {
            "published_date": "2025-01-17T18:40:00",
            "title": "Climate change impacts threaten future of Maine lighthouses",
            "author": "Carl Natale",
            "url": "https://www.centralmaine.com/2025/01/17/climate-change-impacts-threaten-future-of-maine-lighthouses",
            "url_media": "https://w2pcms.com/wp-content/uploads/sites/10/2024/12/31690-POY.storm_17.jpg?w=750",
            "country": "US",
            "language": "en",
            "summary": "Maine's lighthouses are threatened by sea level rise and intensifying coastal storms. Ford Reiche, who owns a lighthouse off the coast of Harpswell, documented the damage caused by last year's storms. The state's 66 lighthouse were built between 1791 and 1910. Of those, 57 still guide sailors using automated light systems."
        },
        {
            "published_date": "2025-01-17T18:26:46",
            "title": "Investigating Historical Hurricanes to Mitigate Future Risks",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/investigating-historical-hurricanes-to-mitigate-future-risks",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/01/Investigating-Historical-Hurricanes-to-Mitigate-Future-Risks.jpeg",
            "country": "TR",
            "language": "en",
            "summary": "Tropical storms are one of the most destructive forces experienced by coastal regions globally. The U.S., Mexico, Central America, and the Caribbean witness their prolonged impacts etched into the socio-economic fabric of these areas. There are projections that climate change may catalyze a 10-15% rise in the frequency and intensity of tropical storms. A new study by The University of Texas at Arlington is emphasizing the importance of analyzing historical tropical storms to pave the way for future disaster preparedness."
        },
        {
            "published_date": "2025-01-17T18:17:00",
            "title": "Why is the global temperature high despite La Nina's arrival?",
            "author": "Abhishek Jha",
            "url": "https://www.hindustantimes.com/environment/weather-bee-why-is-the-global-temperature-high-despite-la-ninas-arrival-101737124359905.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/01/17/1600x900/FINLAND-WEATHER-GLOBAL-WARMING-CLIMATE-4_1737124787146_1737124849506.jpg",
            "country": "IN",
            "language": "en",
            "summary": "La Nina is a cyclical cooling of the equatorial Pacific Ocean. December 2024 was the second warmest December in recorded history. December last year was warmer than the pre-industrial average by more than 1.5°C. There is a lag between the onset of La Nina and its impact on global temperatures."
        },
        {
            "published_date": "2025-01-17T18:04:13",
            "title": "Permafrost in climate change: Models predict Arctic's response to global warming",
            "author": "Science X staff",
            "url": "https://www.msn.com/en-us/weather/topstories/permafrost-in-climate-change-models-predict-arctic-s-response-to-global-warming/ar-AA1xodEq",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Arctic is warming fast as a result of global warming. The permafrost in the northern hemisphere is thawing. This thaw is changing the landscape of the Arctic. It also has a negative impact on Earth's climate. Scientists are trying to understand how the Arctic will react to rising temperatures."
        },
        {
            "published_date": "2025-01-17T18:00:00",
            "title": "How climate instability may be disrupting the polar vortex",
            "author": "The Conversation",
            "url": "https://www.fastcompany.com/91262166/polar-vortex-climate-instability",
            "url_media": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/01/p-1-91262166-extreme-cold.jpg",
            "country": "US",
            "language": "en",
            "summary": "Extremely cold Arctic air and severe winter weather swept southward into much of the U.S. in mid-January 2024, breaking daily low temperature records from Montana to Texas. Tens of millions of people were affected by dangerously cold temperatures and heavy lake-effect snow and snow squalls. The number of extreme cold events is clearly decreasing with global warming."
        },
        {
            "published_date": "2025-01-17T18:00:00",
            "title": "Albanese's inaction drives his own party towards extinction",
            "author": "Richard Flanagan",
            "url": "https://www.smh.com.au/politics/federal/albanese-s-inaction-drives-his-own-party-towards-extinction-20250115-p5l4nh.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.13%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_2%2C$y_0/t_crop_custom/q_62%2Cf_auto/9123e8f9d0df9adc5d90f193121ff1ce4429dd0a",
            "country": "AU",
            "language": "en",
            "summary": "Albanese's Labor party is suffocating in a deluge of corporate shit that eats the values and purpose it needs to survive. Labor secured just 32.58 per cent of the national primary vote, its lowest vote since 1934. Labor's electoral fortunes give every appearance of spiralling only further downwards at the next election."
        },
        {
            "published_date": "2025-01-17T18:00:00",
            "title": "DFES warns Goldfields community of bushfire risk following accidental blaze caused by grinding",
            "author": "",
            "url": "https://thewest.com.au/news/kalgoorlie-miner/dfes-warns-goldfields-community-of-bushfire-risk-following-accidental-blaze-caused-by-grinding-c-17405540",
            "url_media": "https://images.thewest.com.au/publication/C-17405540/0baf1a6ab4ea254a3b192419175c01812cfa2668-16x9-x0y306w3543h1993.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "DFES warns Goldfields community of bushfire risk following accidental blaze caused by grinding in the Goldfields area.       \"There is a risk of a bushfire\" in the area. It is possible that the fire could be started accidentally. "
        },
        {
            "published_date": "2025-01-17T18:00:00",
            "title": "TDEC lifts water contact advisory for areas affected by Helene",
            "author": "Contributed Reports",
            "url": "https://www.citizentribune.com/news/state/tdec-lifts-water-contact-advisory-for-areas-affected-by-helene/article_886c8d76-c047-5e71-b382-5ce8249edc24.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/citizentribune.com/content/tncms/assets/v3/editorial/6/74/6743bf78-4de4-525b-a603-957473197bcb/6788181c1d34b.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Tennessee Department of Environment and Conservation has lifted an advisory that told the public to avoid all contact with waterbodies affected by the extreme flooding from Hurricane Helene. The advisory was issued out of an abundance of caution and was not based on any specific water quality data."
        },
        {
            "published_date": "2025-01-17T17:47:40",
            "title": "Glaciologists Expose Major Flaw In Sea-Level Rise Projections",
            "author": "Thomas Richard",
            "url": "https://climatechangedispatch.com/glaciologists-expose-major-flaw-in-sea-level-rise-projections",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/01/glacier-ice-flow-fb.jpeg",
            "country": "US",
            "language": "en",
            "summary": "New research shows temperate glacier ice flows more steadily than previously thought, leading to lower projections of sea-level rise. Temperate ice has been difficult to study and characterize. The research paper describes lab experiments and the resulting data that suggest a standard value within the 'empirical foundation of glacier flow modeling' should be changed."
        },
        {
            "published_date": "2025-01-17T17:42:34",
            "title": "We built an AI model that analysed millions of images of retreating glaciers – what ...",
            "author": "The Conversation",
            "url": "https://article.wn.com/view/2025/01/17/We_built_an_AI_model_that_analysed_millions_of_images_of_ret",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "The Arctic has warmed nearly four times faster than the global average since 1979. Svalbard, an archipelago near the northeast coast of Greenland, is at the frontline of this climate change, warming up as a result of climate change in the Arctic. "
        },
        {
            "published_date": "2025-01-17T17:01:47",
            "title": "Keeping your fuzzy friends safe around unstable ice and waterways",
            "author": "Julianna Balsamo",
            "url": "https://www.ctvnews.ca/barrie/article/keeping-your-fuzzy-friends-safe-around-unstable-ice-and-waterways",
            "url_media": "https://www.ctvnews.ca/resizer/v2/3RDI2TIWX3AICKRADNU2L2YQDU.jpg?smart=true&auth=996cda141027d2284b2b2ba1e47a03fd25faf75071b70a41ce788d01a3962d8d&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": " a man walking his dog. The ice floes are getting bigger.    Darryl Dyck   for the Canadian Press.  for The Canadian Press  for  Canadian Press darryl dyck  for Darryll Dyck. "
        },
        {
            "published_date": "2025-01-17T16:57:00",
            "title": "Turning the Financial Tide for Small Island States",
            "author": "Maya Delaney",
            "url": "https://www.project-syndicate.org/commentary/small-island-states-need-more-financing-green-blue-bonds-fight-climate-change-by-maya-delaney-and-aminath-shauna-2025-01",
            "url_media": "https://webapi.project-syndicate.org/library/3ec1bbda30f1018a9eb10eade2542769.2-1-super.1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Small island developing states (SIDS) are on the front lines of climate change. They are home to 40% of the world's coral reefs, which shelter one-quarter of all marine life and directly support the livelihoods of 500 million people. SIDS are also at risk of entering a debt spiral. Innovative financial solutions such as green and blue bonds hold the key to these countries' resilience."
        },
        {
            "published_date": "2025-01-17T16:54:44",
            "title": "The mainstream left is in denial on economic growth and the climate crisis",
            "author": "Guardian Staff",
            "url": "https://www.theguardian.com/environment/2025/jan/17/the-mainstream-left-is-in-denial-on-economic-growth-and-the-climate-crisis",
            "url_media": "https://i.guim.co.uk/img/media/901e9b0f139198431fdcd35902c774a9ae7544f9/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a004365a5b912feda15d25a8635e7ecb",
            "country": "GB",
            "language": "en",
            "summary": "Kate SoperRodmell welcomes the editorial condemning Donald Trump's climate denialism and his obfuscatory responses to the Los Angeles fires. She takes issue with the suggestion that the refusal to accept the link between economic growth and the depth of environmental collapse is confined to the populist right. The commitment to growth is shared across the left-right divides of mainstream politics."
        },
        {
            "published_date": "2025-01-17T16:45:50",
            "title": "We built an AI model that analysed millions of images of retreating glaciers – what it found is alarming",
            "author": "Jonathan Bamber",
            "url": "https://theconversation.com/we-built-an-ai-model-that-analysed-millions-of-images-of-retreating-glaciers-what-it-found-is-alarming-247715",
            "url_media": "https://images.theconversation.com/files/643246/original/file-20250117-15-lxlukw.jpg?ixlib=rb-4.1.0&rect=0%2C225%2C1584%2C790&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "The Arctic has warmed up to seven times faster than the global average since 1979. Svalbard, an archipelago near the northeast coast of Greenland, is at the frontline of this climate change. Most of the glaciers in the Arctic are sensitive to even slight temperature increases and are shrinking faster than ever."
        },
        {
            "published_date": "2025-01-17T16:05:32",
            "title": "New home revealed for Newport flood survivor Janet Sams",
            "author": "",
            "url": "https://www.knoxnews.com/picture-gallery/news/local/2025/01/17/new-home-revealed-for-newport-flood-survivor-janet-sams/77497428007",
            "url_media": "https://www.knoxnews.com/gcdn/authoring/authoring-images/2025/01/07/PKNS/77497387007-janet-newport-0104-0204.jpg?crop=3692,2077,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "Janet Sams' home was destroyed by flooding from Hurricane Helene flood damage in September. Volunteers from God's Pit Crew and Servant's Heart Ministries helped Janet Sams rebuild her home in Newport, Tenn., on Saturday, Jan. 4, 2025."
        },
        {
            "published_date": "2025-01-17T16:01:00",
            "title": "Risk Outlook 2025: A fragmented world",
            "author": "Ludwig Federigan",
            "url": "https://www.manilatimes.net/2025/01/18/business/green-industries/risk-outlook-2025-a-fragmented-world/2040559",
            "url_media": "https://www.manilatimes.net/manilatimes/uploads/images/2025/01/17/517622.jpg",
            "country": "PH",
            "language": "en",
            "summary": "The World Meteorological Organization confirmed that 2024 is the warmest year on record. Global temperature rise has resulted in severe weather events, including hurricanes, droughts, floods and heat waves. The competition for dwindling resources such as water, arable land and food can ignite tensions within and between nations. Misinformation and public perception pose challenges to current governance and stability in the age of social media and rapid information exchange. Organizations need to adopt comprehensive strategies to cope with growing instabilities."
        },
        {
            "published_date": "2025-01-17T16:00:17",
            "title": "Climate Change and Sewage: A Dangerous Combination for Coastal Communities • The Revelator",
            "author": "The Revelator",
            "url": "https://therevelator.org/climate-change-sewage",
            "url_media": "https://therevelator.org/wp-content/uploads/2025/01/Sewage-Asian-Development-Bank.jpg",
            "country": "US",
            "language": "en",
            "summary": "Storm surges and sea-level rise damage sanitation systems and threaten ecosystems and human health. Pollution mitigation activities received just 3.9% of all philanthropic funding for oceans between 2010 and 2022. Public funding and development finance for sanitation lags, with the annual funding gap estimated to be as high as $140 billion. Climate Resilient Sanitation Coalition has partnered with the Green Climate Fund to develop step-by-step advice on designing sanitation systems that can withstand climate impacts."
        },
        {
            "published_date": "2025-01-17T16:00:10",
            "title": "Global GDP could be halved without urgent action on climate change, report warns",
            "author": "Joanna Bailey",
            "url": "https://www.euronews.com/green/2025/01/17/global-gdp-could-be-halved-without-urgent-action-on-climate-change-report-warns",
            "url_media": "https://static.euronews.com/articles/stories/08/98/17/44/1200x675_cmsv2_b3004474-cea1-5ff0-9ab1-70006234b0ee-8981744.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Climate change could cause a 50% loss of global GDP if policymakers don't take action. The Institute and Faculty of Actuaries (IFoA) and the University of Exeter have warned of this in a new report. The annual global temperature has broken the internationally agreed 1.5C target for the first time in 2024."
        },
        {
            "published_date": "2025-01-17T15:50:11",
            "title": "Dispossession in the Name of Climate Change?",
            "author": "",
            "url": "https://www.epw.in:443/journal/2025/3/commentary/dispossession-name-climate-change.html",
            "url_media": "https://www.epw.in:443/themes/contrib/epw/images/epw.ico",
            "country": "IN",
            "language": "en",
            "summary": "In March 2019, Zimbabwe suffered widespread devastation from Cyclone Idai. More than 300 deaths were recorded and more than 4,000 people were displaced. Fighting climate change has been put at the top of the state's agenda (Zimbabwe National Climate Policy 2021). At the community level, lessons learned from droughts in 1992 and 2012 have resulted in public support for proposed climate change measures."
        },
        {
            "published_date": "2025-01-17T15:49:38",
            "title": "Deputies warn of open water on Shawano Lake, 2 incidents within past 24 hours",
            "author": "Ben Newhouse",
            "url": "https://www.yahoo.com/news/deputies-warn-open-water-shawano-154938634.html",
            "url_media": "https://media.zenfs.com/en/wfrv_articles_965/ba8257cbefea1e968537b1342fabe46a",
            "country": "US",
            "language": "en",
            "summary": "Shawano County deputies warn the public not to use the Kellogg Landing access to Shawano Lake at Maders Circle due to worsening ice conditions. There have been two incidents in the area in the past 24 hours and conditions are going to continue to worsen due to warm temperatures."
        },
        {
            "published_date": "2025-01-17T15:49:38",
            "title": "Deputies warn of open water on Shawano Lake, 2 incidents within past 24 hours",
            "author": "Ben Newhouse",
            "url": "https://www.wearegreenbay.com/news/local-news/deputies-warn-of-open-water-on-shawano-lake-2-incidents-within-past-24-hours",
            "url_media": "https://www.wearegreenbay.com/wp-content/uploads/sites/70/2024/01/421631009_759068946254243_3091427010834325479_n.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "Shawano County deputies warn the public not to use the Kellogg Landing access to Shawano Lake at Maders Circle due to worsening ice conditions. There have been two incidents in the same location in the past 24 hours. There is a large, open water area 75 yards offshore."
        },
        {
            "published_date": "2025-01-17T15:39:13",
            "title": "The case for super strong sustainability",
            "author": "Dr Niranjan Shetty",
            "url": "https://www.omanobserver.om/article/1164967/opinion/international/the-case-for-super-strong-sustainability",
            "url_media": "https://www.omanobserver.om/omanobserver/uploads/images/2025/01/17/thumbs/600x600/2899835.jpg",
            "country": "OM",
            "language": "en",
            "summary": "A shift in the fundamental thinking about the environment's sustainability is the need of the hour before it becomes too late. One million species of plants and animals are threatened with extinction and 75 per cent of the Earth's land surface has been significantly altered by human actions. Environmental degradation is a global crisis, not a regional or local problem. US has sustained 400 weather and climate disasters since 1980 and its cost exceeds $2.785 trillion."
        },
        {
            "published_date": "2025-01-17T15:30:00",
            "title": "NASA Study Reveals Alarming Shifts in Water Cycle Driven by Human Actions",
            "author": "Lydia Amazouz",
            "url": "https://www.msn.com/en-us/weather/topstories/nasa-study-reveals-alarming-shifts-in-water-cycle-driven-by-human-actions/ar-AA1xo283",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The global water cycle is undergoing significant changes and humans are at the center of it. NASA study is based on nearly two decades of satellite observations. It highlights three main areas of change: over-extraction of resources, land-use changes and climate change, seasonality changes and extreme weather."
        },
        {
            "published_date": "2025-01-17T15:26:24",
            "title": "Wildfires mixed with record fossil fuel burning make 2024 worst year ever for CO2",
            "author": "Dan Vevers",
            "url": "https://www.dailyrecord.co.uk/news/scottish-news/wildfires-mixed-record-fossil-fuel-34503080",
            "url_media": "https://i2-prod.dailyrecord.co.uk/news/uk-world-news/article33514791.ece/ALTERNATES/s1200/2_js342367329.jpg",
            "country": "GB",
            "language": "en",
            "summary": "2024 was the worst year ever for pumping carbon into the atmosphere, according to the Met Office report. Carbon dioxide in the atmosphere rose more quickly than ever before. Wildfires, droughts and record fossil fuel burning made it worse. Scots campaigners say it's'mind-blowing' politicians are considering green-lighting new oil fields in the North Sea given the findings."
        },
        {
            "published_date": "2025-01-17T15:09:03",
            "title": "Oregon Will Experience Extreme Weather Patterns",
            "author": "Lucille Mcnamara",
            "url": "https://www.dailytidings.com/oregon-will-experience-extreme-weather-patterns-soaring-temperatures-and-ice-storms-in-future-years",
            "url_media": "https://www.dailytidings.com/wp-content/uploads/2024/09/Hot-weather-wave-Oregon.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Oregon will increase by 7.6 degrees Fahrenheit by the year 2100. Willamette Valley near Columbia River Gorge will be hard-hit by ice storms. Oregon will lose 50% of its snowpack by the end of the century. People are urged to prepare for the changes in weather patterns."
        },
        {
            "published_date": "2025-01-17T14:33:56",
            "title": "Exclusive-Diana West Exposes Globalist Plot Behind Lahaina and LA Fires: War on Property and Freedom (Interview)",
            "author": "AFC Valerie",
            "url": "https://actforcanada.substack.com/p/exclusive-diana-west-exposes-globalist",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa1106f59-ad1a-41e4-8d1d-54ffb93df584_624x328.jpeg",
            "country": "US",
            "language": "en",
            "summary": "'This is such an act of war against our country' - West. She argued that the fires are part of a deliberate strategy to dismantle private property and force populations into controlled urban centers. She also called attention to geoengineering and weather modification, practices that contribute to modern environmental crises."
        },
        {
            "published_date": "2025-01-17T14:30:09",
            "title": "Moving to a plant-based diet can mitigate climate change, research suggests",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/17/Moving_to_a_plantbased_diet_can_mitigate_climate_change_rese",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "2024 will be the hottest year on record to date, according to researchers across the world's research.   Â. Â   y 2024 will be one of the hottest years on record. y 2024 will also be the sunniest year ever. "
        },
        {
            "published_date": "2025-01-17T14:21:00",
            "title": "Carbon Dioxide Levels Rose by a Record Amount Last Year",
            "author": "Yale Environment 360",
            "url": "https://www.yahoo.com/news/carbon-dioxide-levels-rose-record-142100389.html",
            "url_media": "https://media.zenfs.com/en/yale_environment_360_articles_559/31f285b8da1a5aebb69618a008e9fbdd",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels rose by 3.58 parts per million last year, the biggest one-year jump on record. The figure exceeds even the most pessimistic predictions of the U.K. Met Office, which says that record-high emissions from burning fossil fuels cannot explain the surge in carbon dioxide. Severe heat and drought mean that trees and grasses are drawing down less carbon dioxide than in the past, while desiccated soils release more carbon back into the atmosphere."
        },
        {
            "published_date": "2025-01-17T14:00:25",
            "title": "Equal and opposite, summer-winter, and poor man's fertilizer by Dennis Forney",
            "author": "Dennis Forney",
            "url": "https://chestertownspy.org/2025/01/17/equal-and-opposite-summer-winter-and-poor-mans-fertilizer-by-dennis-forney",
            "url_media": "https://chestertownspy.org/files/2025/01/IMG_9687-2-scaled-768x447.jpg",
            "country": "US",
            "language": "en",
            "summary": "This winter on Delmarva Peninsula is bringing extreme cold and lots of precipitation. It reminds Dennis Forney of the winters of 1977 and 1978, when the peninsula's waterways were covered in thick ice. Free fertilizer offers a welcome premonition of good crops when winter gives way to spring."
        },
        {
            "published_date": "2025-01-17T14:00:00",
            "title": "50,000 Scientists Beg Congress to Protect Science As Trump Prepares to Take Office",
            "author": "Jackie Appel",
            "url": "https://www.msn.com/en-us/news/politics/50-000-scientists-beg-congress-to-protect-science-as-trump-prepares-to-take-office/ar-AA1xnh5P",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "50,000 scientists signed a letter urging Congress to protect the work of scientists and the institutions built upon scientific research. They are worried about the impact of Donald Trump's Project 2025, which proposes dramatic reorganization and outright elimination of several scientific governmental institutions. The letter also lays out a 'First 100 Days Pledge for Science' that it implores officials to follow."
        },
        {
            "published_date": "2025-01-17T13:22:33",
            "title": "Met Office says record rise in carbon dioxide in 2024 was 26% higher than predicted",
            "author": "",
            "url": "https://morningstaronline.co.uk/article/met-office-says-record-rise-carbon-dioxide-2024-was-26-higher-predicted",
            "url_media": "https://morningstaronline.co.uk/sites/default/files/Smoke%20rising%20from%20behind%20trees%20near%20the%20scene%20of%20a%20grass%20fire.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Carbon dioxide emissions rose at their fastest-ever rate in 2024 due to record fossil fuel burning, deforestation and wildfires. The rate of increase is incompatible with staying below 1.5°C of global warming. The El Nino weather pattern in the Pacific drove up rates last year. The rise between 2024 and 2025 is expected to be less extreme than last year, at 2.26ppm."
        },
        {
            "published_date": "2025-01-17T13:10:51",
            "title": "Indonesian volcano Mount Ibu sends up 4km ash column",
            "author": "",
            "url": "https://www.bordermail.com.au/story/8869626/indonesian-volcano-mount-ibu-sends-up-4km-ash-column",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/2ee11d63-1e57-4dd1-a92a-3b81da1e8173.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "An eruption at a 1300-metre-high Indonesian volcano has trigged the highest alert level, according to the country's Geological Agency. The eruption is taking place at the summit of the Mount Agulafo-Agulaf, 1300 metres high."
        },
        {
            "published_date": "2025-01-17T13:03:26",
            "title": "How a Simple Math Error Derailed Doomsday Sea-Level Forecasts",
            "author": "Dr. Matthew Wielicki",
            "url": "https://irrationalfear.substack.com/p/how-a-simple-math-error-derailed",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3dd92360-c1d5-41b7-8ae4-d164aebc2d2d_1222x1368.png",
            "country": "US",
            "language": "en",
            "summary": "Glacier ice may be more stable and less prone to rapid melt than climate scientists previously assumed. A key parameter in the standard 'flow law' equation was being misapplied under warm-ice conditions. If A is set too high, ice appears to flow more readily than it really does, causing models to overestimate how quickly glaciers discharge water into the ocean."
        },
        {
            "published_date": "2025-01-17T13:00:35",
            "title": "Fires show urgent need for progress on climate change",
            "author": "U T Readers",
            "url": "https://www.sandiegouniontribune.com/2025/01/17/fires-show-urgent-need-for-progress-on-climate-change",
            "url_media": "https://www.sandiegouniontribune.com/wp-content/uploads/2025/01/AP23200831234985.jpg?w=1024&h=683",
            "country": "US",
            "language": "en",
            "summary": "There is a drought in San Diego. Climate change plays a central role in the increasing frequency and intensity of wildfires. The economic loss in L.A. is estimated to surpass $135 billion. The incoming administration plans to halt federal climate action and roll back environmental protections."
        },
        {
            "published_date": "2025-01-17T12:39:00",
            "title": "Media: rising sea levels threaten major oil ports with flooding",
            "author": "",
            "url": "https://www.sb.by/en/media-rising-sea-levels-threaten-major-oil-ports-with-flooding.html",
            "url_media": "https://storage01.sb.by/iblock/e9e/e9e48a9d005f73dac526835aef88a934/da2a5d15dec50df0ee9742f1b804db63.jpg",
            "country": "BY",
            "language": "en",
            "summary": "The world's largest oil ports could be flooded due to rising sea levels caused by climate change. The analysis showed that 13 ports with the highest tanker traffic would be severely affected by a sea level rise of just 1m. Two low-lying ports in Saudi Arabia, Ras Tanura and Yanbu, through which 98 percent of the country's oil exports go, are particularly vulnerable."
        },
        {
            "published_date": "2025-01-17T12:14:39",
            "title": "Dangerous cold will soon hit much of the United States. Where temps will be subzero.",
            "author": "Ben Noll",
            "url": "https://www.washingtonpost.com/weather/2025/01/17/dangerous-cold-polar-vortex-wind-chill-forecast-storms",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M7QBBNPL4NDQTC5YRYW2DBZ4T4.png&w=1440",
            "country": "US",
            "language": "en",
            "summary": "Polar vortex currently over northern Greenland is projected to swirl more than 3,000 miles south toward the United States. Around 30 states and nearly 50 million people could experience temperatures below minus-10 degrees. The dangerous wind chills and severe levels of cold will drive the risk of hypothermia and frostbite."
        },
        {
            "published_date": "2025-01-17T12:06:59",
            "title": "Results of Audubon's 2024 Christmas Bird Count",
            "author": "Keith Bruno",
            "url": "https://pagosadailypost.com/2025/01/17/results-of-audubons-2024-christmas-bird-count",
            "url_media": "https://pagosadailypost.com/wp-content/uploads/2025/01/17-Audubon-Christmas-Bird-Count.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Pagosa Springs citizens came together to conduct the 125th Christmas Bird Count on December 14, 2024. The group logged 6,125 total birds across 79 species on count day. American crow was the species recorded in highest numbers at 555. This year marks the first time Western Meadowlarks were recorded in Pagosa Springs."
        },
        {
            "published_date": "2025-01-17T12:04:46",
            "title": "Everything about climate change may seem grim. It isn't",
            "author": "list.metadata.agency",
            "url": "https://www.livemint.com/global/everything-about-climate-change-may-seem-grim-it-isnt-11737113921653.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/01/17/1600x900/gb19061f6334d2ba37feb17dcb0aabb887e56c6036593b08e0_1737114143593_1737114143821.jpg",
            "country": "IN",
            "language": "en",
            "summary": "This year was warmer than the previous one, but the trend of global warming is inexorable. Every year renewables get cheaper, especially solar panels. China added more solar capacity at home last year than the whole world could boast in 2015. Rich countries should provide financial help to the global south to help the transition to a clean-energy world."
        },
        {
            "published_date": "2025-01-17T12:00:00",
            "title": "More than three-quarters of people think the UK is not prepared to deal with flooding",
            "author": "Isaac Cooper",
            "url": "https://uk.news.yahoo.com/more-three-quarters-people-think-120000922.html",
            "url_media": "https://media.zenfs.com/en/news_and_star_893/092c1e83d9874371467e46a96789ea09",
            "country": "US",
            "language": "en",
            "summary": "More than three-quarters of people think the UK is not prepared to deal with climate change. Flooding is seen as the most pressing impact of climate change for the UK, followed by rising seas and coastal erosion. Carlisle MP, Julie Minns has called for the completion of the city's flood defence."
        },
        {
            "published_date": "2025-01-17T12:00:00",
            "title": "Letters: U.S. and Big Oil should take the blame for climate change. Here's why",
            "author": "Chronicle readers",
            "url": "https://www.sfchronicle.com/opinion/letterstotheeditor/article/climate-change-social-security-tiktok-20038936.php",
            "url_media": "https://s.hdnux.com/photos/01/40/27/47/25262547/5/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "Blaming Big Oil for climate change won't solve the problem, writes Jim Gray. According to Worldometer, the U.S. emits nearly twice as much carbon per capita as China and seven times as much as India. Kuwait, Qatar, Bahrain, Oman, the United Arab Republic and Saudi Arabia all emit carbon at a far greater per-capita rate than China, India or the United States. Transportation is responsible for 28% of our carbon emissions in 2022, according to the EPA."
        },
        {
            "published_date": "2025-01-17T12:00:00",
            "title": "More than 75% think the UK is not prepared to deal with flooding",
            "author": "Isaac Cooper",
            "url": "https://www.newsandstar.co.uk/news/24863279.75-think-uk-not-prepared-deal-flooding",
            "url_media": "https://www.newsandstar.co.uk/resources/images/18118276.jpg?type=og-image&xType=0&yType=597",
            "country": "GB",
            "language": "en",
            "summary": "Polling suggests flooding is the most pressing impact of climate change for the UK. £25 million was allocated for new flood defences for Carlisle but the work has not yet been fully completed. Julie Minns has called the lack of action 'unacceptable'. Phase three of the flood defence plan covers the Denton Holme, Willow Holme and Caldewgate area and consists of raising existing defences along the River Caldew and enhanced maintenance of the river corridor."
        },
        {
            "published_date": "2025-01-17T11:57:38",
            "title": "Yearslong droughts on the increase worldwide, study finds",
            "author": "Tom Chivers",
            "url": "https://www.yahoo.com/news/yearslong-droughts-increase-worldwide-study-115738923.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/0M._yk7.ioAD_6p9fLqMjQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/semafor_310/be932b8f0990ee25159653a1f51ddf76",
            "country": "US",
            "language": "en",
            "summary": "Multi-year droughts have become more common over the last 40 years, according to new research. Droughts in Chile, the western US and Australia have extended fire seasons and hit water reservoirs. Climate models predicted that changing weather patterns driven by global warming will increase the number and severity of drought."
        },
        {
            "published_date": "2025-01-17T11:48:00",
            "title": "Vietnam faces hottest year, strongest storm in 2024",
            "author": "Tieu Bac",
            "url": "https://tuoitrenews.vn/news/society/20250117/vietnam-faces-hottest-year-strongest-storm-in-2024/83999.html",
            "url_media": "https://static.tuoitrenews.vn/ttnew/r/2025/01/17/weather-1737096585.png",
            "country": "VN",
            "language": "en",
            "summary": "2024 marked as an exceptionally extreme year for weather in Vietnam, with the highest average annual temperature in history and the most powerful typhoon in three decades that caused widespread destruction. The total rainfall in Vietnam last year ranged from 1,500 to 2,500 mm, with some areas recording even higher rain volumes."
        },
        {
            "published_date": "2025-01-17T11:45:00",
            "title": "Weather: Warm up to arctic blast",
            "author": "Lindsey Slater",
            "url": "https://www.wisn.com/article/weather-warm-up-to-arctic-blast/63454252",
            "url_media": "https://kubrick.htvapps.com/vidthumb/f9f6520d-bff1-4f5d-97db-0667026c2b3a/8452ddfb-98a6-4f2d-9be3-340aeb3d10b6.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "It's going to be warm and sunny today, but it will be cold and windy tomorrow. The weekend is going to get warmer and colder. The snow chances are slim over the next 7 days. The temperatures are going to reach 25 degrees on Saturday and 25 on Sunday."
        },
        {
            "published_date": "2025-01-17T11:26:42",
            "title": "Is Wisconsin ready to welcome climate change migrants?",
            "author": "Madison",
            "url": "https://article.wn.com/view/2025/01/17/Is_Wisconsin_ready_to_welcome_climate_change_migrants",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "The recent wildfires in Los Angeles highlight the devastating impacts of climate change. Events such as this are becoming alarmingly common and are pushing millions of Americans to rethink where they can live.   .      \"The recent stories about wildfires burning out of control across Los Angeles highlights the devastating impact on climate change.\" "
        },
        {
            "published_date": "2025-01-17T11:22:01",
            "title": "'Warm water' flowing towards big Antarctic ice shelf concerns scientists",
            "author": "Gregory",
            "url": "https://www.indy100.com/science-tech/antarctica-weather-ice-shelf-climate-change",
            "url_media": "https://www.indy100.com/media-library/antarctica-coast-guard-divers-brave-antarctic-waters-for-critical-ship-repair.jpg?id=28051458&width=1200&height=600&coordinates=0%2C340%2C0%2C77",
            "country": "US",
            "language": "en",
            "summary": "Filchner-Ronne Ice Shelf (FRIS) is one of Antarctica's largest ice shelves. It is in the southern Weddell Sea and is roughly the size of Sweden. The ice shelf's integrity could be threatened by warm water from the deep sea flowing towards it."
        },
        {
            "published_date": "2025-01-17T11:11:10",
            "title": "Tragedy Off West Africa: Migrants' Dreams Dashed",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/law-order/3228550-tragedy-off-west-africa-migrants-dreams-dashed",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/07_06_2024_09_19_53_4723899.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A boat carrying 80 people, including 44 Pakistanis, capsized near Dakhla, a strategically important Moroccan-controlled port city in the disputed Western Sahara. President Asif Ali Zardari expressed his deep sorrow and emphasized the importance of implementing rigorous measures to combat human trafficking. Walking Borders, a Spain-based migrant rights organization, reported that 50 people perished en route to the Canary Islands."
        },
        {
            "published_date": "2025-01-17T11:05:28",
            "title": "More than 40 Pakistanis feared drowned in the capsizing of a migrant boat off African coast",
            "author": "Munir Ahmed",
            "url": "https://www.washingtonpost.com/world/2025/01/17/pakistan-migrant-boat-capsize-morocco/f5b4ec76-d4c2-11ef-9835-51843d9371d6_story.html",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RUGLRTKULZB6XPESJMXXJVLTDI.jpeg&w=1440",
            "country": "US",
            "language": "en",
            "summary": "More than 40 Pakistanis are feared to have drowned in the capsizing of a boat off West Africa's Atlantic coastline. President Asif Ali Zardari expressed grief over the deaths and stressed the need for strict measures to curb human trafficking. West Africa has emerged as a primary point of departure for migrants aiming to reach Europe."
        },
        {
            "published_date": "2025-01-17T11:00:33",
            "title": "Met Office: Record global CO2 rise leaves 1.5C goal hanging by a thread",
            "author": "",
            "url": "https://www.businessgreen.com/news/4396770/met-office-record-global-co2-rise-leaves-5c-goal-hanging-thread",
            "url_media": "https://image.chitra.live/api/v1/wps/08e6048/cb1aa1a3-cd47-4d43-b93f-75d99fc03589/3/iStock-587794524-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Record levels of carbon dioxide have been recorded. The chances of achieving the Paris Agreement's target of limiting global warming to 1.5C by the end of the century are now hanging by a thread, after record levels of CO2 were recorded this year. "
        },
        {
            "published_date": "2025-01-17T11:00:00",
            "title": "Is Wisconsin ready to welcome climate-change migrants?",
            "author": "",
            "url": "https://madison.com/opinion/letters/letter-climate-change-migrants-wisconsin-water-wildfires/article_18bf3140-d04f-11ef-bad2-2b6716b421e8.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/madison.com/content/tncms/assets/v3/editorial/1/8b/18bf3140-d04f-11ef-bad2-2b6716b421e8/6787071d03fda.preview.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The recent wildfires in Los Angeles highlight the devastating impacts of climate change. Rising sea levels, wildfires, extreme heat and water scarcity are driving what could become the largest internal migration in U.S. history. Wisconsin, with its cooler climate, abundant freshwater and relative stability from extreme weather is a likely refuge."
        },
        {
            "published_date": "2025-01-17T10:46:00",
            "title": "Little Things Make Big Ice Shelves Melt 17 January 2025",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/little-things-make-big-ice-shelves-melt-17-1392589",
            "url_media": "https://www.antarctica.gov.au/site/assets/files/69851/rs24291_vanderford_glacier_jeremy_smith.1200x630.jpg",
            "country": "US",
            "language": "en",
            "summary": "Ice loss from the Antarctic ice sheet is projected to be the leading driver of sea level rise by 2100, but scientists still don't know exactly how the ocean melts ice shelves. Dr Madelaine Rosevear, from the Australian Centre for Excellence in Antarctic Science and the University of Melbourne, has reviewed the current understanding of ice-ocean boundary-layer dynamics."
        },
        {
            "published_date": "2025-01-17T10:45:39",
            "title": "UN scientists issue stark warning about Earth's soil: 'The consequences of inaction grow increasingly dire'",
            "author": "Timothy McGill",
            "url": "https://www.yahoo.com/news/un-scientists-issue-stark-warning-104539679.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/9RGlpc8xjMS11ZRVl64aDQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/dbe06633a0405633b55fcaf94d367ad0",
            "country": "US",
            "language": "en",
            "summary": "Almost 78% of Earth's land experienced drier conditions in the 30 years leading up to 2020. Drylands expanded by 1.6 million square miles in the same period. Most of the regions analyzed in the UNCCD report have transformed from humid landscapes to drylands. Many species are endangered in these regions amid desertification and ecosystem degradation."
        },
        {
            "published_date": "2025-01-17T10:42:00",
            "title": "Antarctica's Melting: Crucial Details Emerge",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/antarcticas-melting-crucial-details-emerge-1392585",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1526256262350-7da7584cf5eb%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Antarctic ice sheet covers nearly twice the area of Australia. Sea levels are certain to rise this century, but the contribution from the Antarctic ice sheet is uncertain. Ocean processes that control the fate of the sheet occur on a micro-scale scale and are difficult to measure and model. Scientists have made significant progress in understanding this \"ice-ocean boundary layer\"."
        },
        {
            "published_date": "2025-01-17T10:41:13",
            "title": "2024 saw fastest-ever annual rise in CO2 levels: UK weather service",
            "author": "AFP",
            "url": "https://www.yahoo.com/news/2024-saw-fastest-ever-annual-104113122.html",
            "url_media": "https://media.zenfs.com/en/afp.com/6d70c36d6fab61cd08272933053a4fb9",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere in 2024 grew at the fastest annual rate on record, exceeding their own projections by some margin. The sharp rise in planet-warming CO2 was driven by fossil fuel burning, devastating wildfires and a weakening of Earth's natural carbon stores. Scientists say at such rates, the world cannot hope to hold global warming to the 1.5C limit."
        },
        {
            "published_date": "2025-01-17T10:41:13",
            "title": "2024 saw fastest-ever annual rise in CO2 levels: UK weather service",
            "author": "AFP",
            "url": "https://www.citizentribune.com/news/national/2024-saw-fastest-ever-annual-rise-in-co2-levels-uk-weather-service/article_b83da179-f029-510e-94b1-1b92f68f9c9c.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/citizentribune.com/content/tncms/assets/v3/editorial/f/91/f9150e1d-ffe0-5eb3-a0df-5ab6aaaac7be/678a3c2eea1fc.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere in 2024 grew at the fastest annual rate on record. The sharp rise in planet-warming CO2 was driven by fossil fuel burning, devastating wildfires and a weakening of Earth's natural carbon stores, the Met Office says.  "
        },
        {
            "published_date": "2025-01-17T10:41:13",
            "title": "2024 saw fastest-ever annual rise in CO2 levels: UK weather service",
            "author": "AFP",
            "url": "https://www.kpcnews.com/news/national/article_85616c66-afc8-5b0a-a454-21f131e00e89.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/kpcnews.com/content/tncms/assets/v3/editorial/7/9e/79e05165-314e-5b7f-b713-277889a20aab/678a3c5609e5f.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere in 2024 grew at the fastest annual rate on record. The sharp rise in planet-warming CO2 was driven by fossil fuel burning, devastating wildfires and a weakening of Earth's natural carbon stores, the Met Office says.  "
        },
        {
            "published_date": "2025-01-17T10:41:13",
            "title": "2024 saw fastest-ever annual rise in CO2 levels: UK weather service",
            "author": "David Mcnew",
            "url": "https://www.newsbug.info/news/nation/2024-saw-fastest-ever-annual-rise-in-co2-levels-uk-weather-service/article_e087ca32-1480-5476-a313-4eb8968c4445.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/newsbug.info/content/tncms/assets/v3/editorial/4/e8/4e8760fd-2437-5d35-95fe-021ba51a86ff/678a3bd2577ad.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "There will be a record rise in carbon dioxide levels in the atmosphere in 2024. This is due to a weakening of Earth's nature carbon stores like forests, according to the scientists.   .   in part because of the weakening of the Earth's carbon stores. "
        },
        {
            "published_date": "2025-01-17T10:40:44",
            "title": "Two logistics warehouses in C Papua to address extreme weather hunger",
            "author": "Rahmad Nasution",
            "url": "https://en.antaranews.com/news/341818/two-logistics-warehouses-in-c-papua-to-address-extreme-weather-hunger",
            "url_media": "https://cdn.antaranews.com/cache/1200x800/2025/01/17/1737094546257_copy_2146x1431.jpg",
            "country": "ID",
            "language": "en",
            "summary": "Puncak District in Central Papua Province has two food logistics warehouses to combat hunger during extreme weather conditions. The warehouses are managed and operated by the Central Papua Provincial Government under the central government's supervision. Emergency logistics, such as tents, generators, medicines, and items for infants and pregnant women are stocked in the warehouses. Extreme weather had severely impacted Central Papua since 1997."
        },
        {
            "published_date": "2025-01-17T10:21:10",
            "title": "THEY ARE PLANNING AN EXTERMINATION - THE TRACK TRACE TERMINATION OF BILLIONS ACROSS THE PLANET - WE HAVE A DUTY TO STOP THIS GLOBALIST CULT TERRORIST ATTACK ON THE PEOPLE - INFO@SAVEUSNOW.ORG.UK",
            "author": "Save Us Now",
            "url": "https://saveusnow.substack.com/p/they-are-planning-an-extermination",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-video.s3.amazonaws.com%2Fvideo_upload%2Fpost%2F155008418%2F861b62c6-fe5b-4869-80dc-ac9bd04a146b%2Ftranscoded-00001.png",
            "country": "US",
            "language": "en",
            "summary": "There is a plan to exterminate billions of billions of people across the planet. Save the People UK has a duty to stop it.    - INFO@SAVEUSNOW.ORG.UK.     ‘We have to stop this GLOBALIST CULT TERRORIST ATTACK ON THE PEOPLE."
        },
        {
            "published_date": "2025-01-17T10:16:32",
            "title": "North Devon group to host climate forum",
            "author": "Ella Sampson",
            "url": "https://www.northdevongazette.co.uk/news/home/1704818/north-devon-group-to-host-climate-forum.html",
            "url_media": "https://www.northdevongazette.co.uk/resizer/1200/700/true/2025_01_17/north_devon_grou-1737108933094.jpg--barnstaple_library_.jpg?1737108933127",
            "country": "GB",
            "language": "en",
            "summary": "A Climate Forum is taking place at Barnstaple Library on Saturday, 1 February at 11am. The North Devon Biosphere, a UN-designated area of ecological importance, spans a significant portion of Devon's countryside. Its mission is to encourage a sustainable connection between people and nature. Andy Bell will discuss the challenges of climate change and the role of nature-based solutions."
        },
        {
            "published_date": "2025-01-17T10:14:00",
            "title": "Climate Change Pressures Lizards' Cost-of-Living",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/climate-change-pressures-lizards-cost-of-living-1392571",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1574170608990-8b45e8d75449%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1351%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Desert lizards are facing a 'cost-of-living' squeeze as global temperatures continue to rise, according to a new study published today in Science. The study found climate warming can'squeeze' desert lizard energy budgets by increasing the food they need just to survive and decreasing their time to find it."
        },
        {
            "published_date": "2025-01-17T10:10:32",
            "title": "Climate: Facing the New Reality and Fighting Back",
            "author": "Resilience",
            "url": "https://article.wn.com/view/2025/01/17/Climate_Facing_the_New_Reality_and_Fighting_Back",
            "url_media": "https://i.ytimg.com/vi/g2uadWPqkVM/default_live.jpg",
            "country": "US",
            "language": "en",
            "summary": "A new and frightening world of climate change is unfolding around us. Donald Trump is concerned about climate change and its effects on the environment. Donald is worried about the future of the planet and its people. Donald Donald is also concerned about his people's future. "
        },
        {
            "published_date": "2025-01-17T10:06:06",
            "title": "Wildfires unveil shocking truths about planet's dangerous climate situation",
            "author": "Web Desk",
            "url": "https://jang.com.pk/en/29523-wildfires-unveil-shocking-truths-about-planets-dangerous-climate-situation-news",
            "url_media": "https://jang.com.pk/assets/uploads/english_news/2025-01-17/29523_030528_eng.jpg",
            "country": "PK",
            "language": "en",
            "summary": "In the previous year, the global average temperature reached a new high and the planet exceeded the 1.5C target set by the Paris climate agreement. The Mauna Loa observatory in Hawaii recorded a record 427 ppm of CO2 in the atmosphere. This is much higher than the 280 ppm level that existed before large-scale fossil fuel burning began causing climate change."
        },
        {
            "published_date": "2025-01-17T10:05:16",
            "title": "Addressing Climate Change: A Global Call to Action",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3228436-addressing-climate-change-a-global-call-to-action",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/02_08_2024_12_40_47_7907994.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Paris Climate Summit set a target of limiting global warming to 1.5 degrees Celsius above pre-industrial levels by 2024. 2015 was the hottest year ever recorded. Celeste Saulo, the Chief of the World Meteorological Organization, has warned of the lack of action by governments and the private sector to combat climate change."
        },
        {
            "published_date": "2025-01-17T10:03:22",
            "title": "Canal cleaners: Crews on Fort Myers Beach continue to collect piles of hurricane debris",
            "author": "Mark H. Bickel",
            "url": "https://www.news-press.com/story/news/2025/01/17/hurricane-debris-on-fort-myers-beach-being-cleaned-out-of-canals/77721089007",
            "url_media": "https://www.news-press.com/gcdn/authoring/authoring-images/2025/01/15/PFTM/77721792007-fmb-3.jpg?crop=479,270,x0,y256&width=479&height=270&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "Two hurricanes hit Southwest Florida in the span of 13 days. The clean-up of the canals on Fort Myers Beach is a tall order. The efforts continue and progress is being made, according to the harbormaster Curtis Ludwig. The next two hurricanes are Helen (September 2024) and Milton (October 2024)."
        },
        {
            "published_date": "2025-01-17T10:00:00",
            "title": "Despite recent flooding, Barcelona does not have enough water",
            "author": "Infrequent",
            "url": "https://www.bbc.com/future/article/20250116-barcelonas-urgent-search-for-water-after-floods",
            "url_media": "https://ychef.files.bbci.co.uk/624x351/p0kk9cdl.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Barcelona's Parc de Joan Miró is experiencing drought after several years of drought. Climate change is making rainfall more intense and infrequent, so authorities are battling to provide security and drinking water to millions. Spain's National Climate Change Adaptation Plan notes that while rainstorms are expected to increase in intensity and frequency, they will do little to recharge aquifers."
        },
        {
            "published_date": "2025-01-17T09:46:26",
            "title": "How is Antarctica melting, exactly?",
            "author": "Madelaine Gamble",
            "url": "https://article.wn.com/view/2025/01/17/Explained_How_is_Antarctica_melting_exactly",
            "url_media": "https://i.ytimg.com/vi/6VG9Zk_xiBc/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Antarctic ice sheet is two km thick on average and covers nearly twice the size of the Earth's surface. The ocean is melting the Antarctic ice shelves due to the warming of the sea water.   The Conversation is a project of Madelaine Gamble Rosevear."
        },
        {
            "published_date": "2025-01-17T09:42:57",
            "title": "Extreme fire: 'unprecedented risk' poorly understood",
            "author": "Kelly MACNAMARA",
            "url": "https://www.thepress.net/news/national/extreme-fire-unprecedented-risk-poorly-understood/article_583d8d61-2c2d-518f-bf92-9c7885368ffa.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/thepress.net/content/tncms/assets/v3/editorial/a/5c/a5c5f5c4-92b5-53e7-b5bf-f4a965df7810/678a2e43db564.image.jpg?crop=384%2C384%2C64%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Athens, Maui and now Los Angeles are among major cities that have suffered catastrophic fires. Climate change and other human influences represent an unprecedented risk that is still poorly understood, according to a report for the European Space Agency and FutureEarth last year.   "
        },
        {
            "published_date": "2025-01-17T09:28:04",
            "title": "How is Antarctica melting, exactly?",
            "author": "PTI",
            "url": "https://www.deccanherald.com/environment/explained-how-is-antarctica-melting-exactly-3360178",
            "url_media": "https://images.deccanherald.com/deccanherald%2Fimport%2Fsites%2Fdh%2Ffiles%2Farticleimages%2F2022%2F08%2F11%2Fantarctica-reuters-1135094-1660210091.jpg?rect=0%2C29%2C1280%2C672&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "The ocean melts ice shelves from below. Increased basal melting has led to the thinning and retreat of the ice sheet in some regions. This has raised global sea levels, which is a result of the process known as 'basal melting'.    "
        },
        {
            "published_date": "2025-01-17T09:28:00",
            "title": "RSPCA: Duck Hunting Season Irresponsible Now",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/rspca-duck-hunting-season-irresponsible-now-1392531",
            "url_media": "https://www.rspcasa.org.au/wp-content/uploads/2018/03/Duck-shooting-in-SA.jpg",
            "country": "US",
            "language": "en",
            "summary": "RSPCA South Australia is concerned by the State Government's decision to allow another duck hunting season. The H5N1 strain of bird flu has the potential to decimate wild bird populations and the poultry industry. RSPCA has long opposed duck hunting because the shotgun pellets that recreational hunters fire at flying ducks tend to wound them rather than kill them outright. The Australian Veterinary Association also opposes duck hunting due to its inherent welfare issues."
        },
        {
            "published_date": "2025-01-17T09:00:00",
            "title": "Norfolk's average rainfall dropped in 2024 despite record-breaking downpours",
            "author": "Chris Hill",
            "url": "https://uk.news.yahoo.com/norfolks-average-rainfall-dropped-2024-090000660.html",
            "url_media": "https://media.zenfs.com/en/eastern_daily_press_378/cc272f0daaeca53fb4e68e812938d1d4",
            "country": "US",
            "language": "en",
            "summary": "Norfolk was drier in 2024 than in the previous year, according to the county's rainfall recorders. The highest annual rainfall totals recorded for 2024 were 942.5mm in Houghton St Giles, 901.3mm in Thetford, 900.8mm in Little Snoring, 889.2mm in North Walsham, 878.5 mm in Holt, 853.8 mm in Sheringham, and 688.0mm in Bressingham. The lowest annual totals were 621.5m in Wreningham, 633.1m in Blakeney, 657.4m in Bracon Ash,"
        },
        {
            "published_date": "2025-01-17T09:00:00",
            "title": "Norfolk's average rainfall reduced in 2024, say analysts",
            "author": "Chris Hill",
            "url": "https://www.edp24.co.uk/news/24855381.norfolks-average-rainfall-reduced-2024-say-analysts",
            "url_media": "https://www.edp24.co.uk/resources/images/17747248.jpg?type=og-image&xType=0&yType=219",
            "country": "GB",
            "language": "en",
            "summary": "Norfolk's highest annual rainfall totals recorded for 2024 were 942.5mm in Houghton St Giles, 901.3mm in Thetford, 900.8mm in Little Snoring, 889.2mm in North Walsham, 878.5 mm in Holt, 853.8 mm in Sheringham, and 688.0mm in Bressingham. The lowest annual totals were 621.5m in Wreningham, 633.1m in Blakeney and 657.4m in Bracon Ash."
        },
        {
            "published_date": "2025-01-17T09:00:00",
            "title": "Letter: The DEP must consider climate reality",
            "author": "Amanda Armstrong",
            "url": "https://www.salemnews.com/opinion/letter-the-dep-must-consider-climate-reality/article_bf165e24-d44b-11ef-9808-8f0e9eaa54b4.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/salemnews.com/content/tncms/custom/image/29c67f80-6b81-11e5-9882-1ba0e94cc00f.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "The Department of Environmental Protection has a crucial decision to make regarding the expansion of Beverly Airport's hangar. 2024 has been confirmed as Earth's hottest year on record, and we cannot keep building infrastructure that enables the most carbon-intensive form of transportation.   "
        },
        {
            "published_date": "2025-01-17T08:38:57",
            "title": "Warm temperatures worsen Shawano Lake ice; public urged to heed barricades and warnings",
            "author": "Ashley Kaster",
            "url": "https://fox11online.com/news/local/warm-temperatures-worsen-shawano-lake-ice-public-urged-to-heed-barricades-and-warnings-kellogg-maders-circle-water-fishing-weekend",
            "url_media": "https://fox11online.com/resources/media2/16x9/1920/986/center/90/d66ae28c-703d-487a-ae40-cd0984b68f6e-IcefishermanonShawanoLake.jpg",
            "country": "US",
            "language": "en",
            "summary": "Shawano County Sheriff's Office is warning the public about deteriorating Shawano Lake ice conditions. Colder air will come in Friday night. Barricades have been put in place to warn people to stay away from the Kellogg (Maders Circle) landing. Free Fishing Weekend is on Saturday and Sunday."
        },
        {
            "published_date": "2025-01-17T08:29:39",
            "title": "Libya: World News in Brief - Security Council Libya Resolution, Cyclone Recovery in Mozambique, Marburg Virus in Tanzania, Counter-Terrorism Laws in Türkiye",
            "author": "",
            "url": "https://allafrica.com/stories/202501170003.html",
            "url_media": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "The UN Security Council on Thursday passed a resolution to renew the mandate of the Panel of Experts of the 1970 Libya Sanctions Committee. It also extends measures related to the illicit export of petroleum from oil-rich Libya. UN aid teams in northern Mozambique are doing their utmost to provide help to communities hit by two deadly cyclones in a month. A vaccination campaign to deal with cholera was launched on 6 January and it has reached 86 per cent of the nearly 200,000 people that were targeted. WHO is mobilising technical expertise and logistical supplies to support the investigation and response to the Marburg virus in Tanzania."
        },
        {
            "published_date": "2025-01-17T08:28:48",
            "title": "Swiss researchers warn ‘mega-droughts' are spreading around the world",
            "author": "Swi Swissinfo.Ch",
            "url": "https://www.swissinfo.ch/eng/science/swiss-researchers-warn-mega-droughts-are-spreading-around-the-world/88737943",
            "url_media": "https://www.swissinfo.ch/content/wp-content/uploads/sites/13/2025/01/5f67e009d4a7ed7248adb44c812ba83a1fb144f4-88736495.jpg?ver=db155f03&fit=1200,900",
            "country": "CH",
            "language": "en",
            "summary": "The global land area affected by prolonged droughts increased by 50,000 square kilometres per year between 1980 and 2018. This has been caused by rising temperatures linked to climate change. This news story has been written and fact-checked by an external editorial team and translated by DeepL."
        },
        {
            "published_date": "2025-01-17T08:24:37",
            "title": "AP-Pictures-of-the-Week-Global-Photo-Gallery",
            "author": "PRO",
            "url": "https://n.news.naver.com/mnews/article/077/0006490575",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/01/17/PAP20250117100301009_P2_20250117082437210.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Seagulls fly near the Baltic Sea in Scharbeutz, northern Germany, on Friday, Jan. 10, 2025, as seen by AP Photo/Michael Probst. The seagull is flying near the sea.   Â "
        },
        {
            "published_date": "2025-01-17T08:22:00",
            "title": "UN Brief: Libya, Mozambique, Tanzania, Türkiye Issues",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/un-brief-libya-mozambique-tanzania-turkiye-1392470",
            "url_media": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Collections/Embargoed/15-02-2024_OCHA_Libya-01.jpg/image770x420cropped.jpg",
            "country": "US",
            "language": "en",
            "summary": "The resolution authored by the United Kingdom was passed by 14 votes with none against. Russia abstained. It introduces new provisions concerning the arms embargo and assets freeze measures imposed in 2011 following the overthrow of Muammar Gaddafi. It also establishes a new listing criterion targeting individuals and entities involved in the illicit exploitation of crude oil or refined petrol in Libya. UN aid teams in northern Mozambique are doing their utmost to provide help to communities hit by two deadly cyclones in a month."
        },
        {
            "published_date": "2025-01-17T08:08:48",
            "title": "Slovenia warmed to 1.8C above long-term average in 2024",
            "author": "",
            "url": "https://sloveniatimes.com/42250/slovenia-warmed-to-1-8c-above-long-term-average-in-2024",
            "url_media": "https://sloveniatimes.com/foto/990,660,5,1017599",
            "country": "SI",
            "language": "en",
            "summary": "Slovenia experienced its warmest year on record in 2024. The average temperature was 1.8 degrees Celsius above the average for 1991-2020. The global average last year was about 15.1 degrees Celsius. It was the warmest since around the mid-19th century."
        },
        {
            "published_date": "2025-01-17T08:01:14",
            "title": "Can the courts save us from the war we've waged against our own planet?",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/01/17/Can_the_courts_save_us_from_the_war_we_ve_waged_against_our_",
            "url_media": "https://i.ytimg.com/vi/RRSPqgJTid4/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "By 2023, Earth recorded its hottest year since systematic weather tracking began in the 1850s. For Pakistan, these climatic variations have resulted in heavy floods and droughts, raising serious concerns regarding water and food security.   .   \"Climate Change is a defining challenge of our time\""
        },
        {
            "published_date": "2025-01-17T07:42:07",
            "title": "Can the courts save us from the war we've waged against our own planet?",
            "author": "Ahmad Rafay Alam",
            "url": "https://www.dawn.com/news/1875358/can-the-courts-save-us-from-the-war-weve-waged-against-our-own-planet",
            "url_media": "https://i.dawn.com/large/2025/01/17122209093c15b.jpg?r=122240",
            "country": "PK",
            "language": "en",
            "summary": "Asghar Leghari, a lawyer and farmer from Punjab, filed a petition challenging the government's inaction on climate change. Lahore High Court ruled that climate change is a defining challenge of our time. Pakistani courts have increasingly invoked the principles of climate justice in cases before both the high courts and the Supreme Court."
        },
        {
            "published_date": "2025-01-17T07:38:34",
            "title": "Understanding the 'Ice-Ocean Boundary Layer': A Key to Predicting Sea Level Rise",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3228226-understanding-the-ice-ocean-boundary-layer-a-key-to-predicting-sea-level-rise",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_29_28_0264767.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Recent scientific advancements have brought us closer to understanding the interactions between the Antarctic ice sheet and the Southern Ocean responsible for significant sea level changes. New technologies, including autonomous underwater vehicles, are revealing critical insights. These developments are pivotal in addressing uncertainties around sea level rise projections."
        },
        {
            "published_date": "2025-01-17T07:30:00",
            "title": "Opinion: What carbon capture and storage might mean for Alaska",
            "author": "",
            "url": "https://www.peninsulaclarion.com/opinion/opinion-what-carbon-capture-and-storage-might-mean-for-alaska",
            "url_media": "https://www.peninsulaclarion.com/wp-content/uploads/2025/01/38384975_web1_KPC_070520_column_willl-camping_1-1024x683.jpg",
            "country": "US",
            "language": "en",
            "summary": "Alaska has some of the best carbon storage potential in the world. The Cook Inlet region is gaining attention as an excellent site for carbon storage. Alaska is rich in oil and natural gas, and its depleted oil and gas fields could hold new promise as prime candidates for CCS initiatives."
        },
        {
            "published_date": "2025-01-17T07:21:14",
            "title": "Denmark may face a shortage of elderly care workers",
            "author": "Nicolai Kampmann",
            "url": "https://cphpost.dk/2025-01-17/news/round-up/denmark-may-face-a-shortage-of-elderly-care-workers",
            "url_media": "https://cphpost.dk/wp-content/uploads/2023/08/CPHpost_Circle_Turquoise_XL_RGB_background.png",
            "country": "DK",
            "language": "en",
            "summary": "A new analysis reveals that delaying climate adaptation could cost Denmark billions. The study estimates that postponing climate initiatives by 10 years would cost the country billions.  .    i   in the CIP Foundation, citing research from the Technical University of Denmark (DTU)."
        },
        {
            "published_date": "2025-01-17T07:20:12",
            "title": "Climate researcher fired for refusing to take planes awarded compensation",
            "author": "Stuti Mishra",
            "url": "https://www.msn.com/en-us/news/world/climate-researcher-fired-for-refusing-to-take-planes-awarded-compensation/ar-AA1xlYwl",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Dr Gianluca Grimalda lost his job at Kiel Institute for the World Economy because he refused to take a plane back to Germany from fieldwork in Papua New Guinea. He received compensation of €75,000 (£63,000) and donated the rest to environmental activism. He hopes the case will encourage more employees to stand up for their climate principles."
        },
        {
            "published_date": "2025-01-17T06:15:00",
            "title": "Why this climate scientist moved from LA two years ago and why he says nowhere is safe",
            "author": "Bernice Harrison",
            "url": "https://www.irishtimes.com/podcasts/in-the-news/why-this-climate-scientist-moved-from-la-two-years-ago-and-why-he-says-nowhere-is-safe",
            "url_media": "https://www.irishtimes.com/resizer/v2/OJFIFFK3MYJMFDCUHXO5XW4MVY.jpg?smart=true&auth=090022071fe51b842e8b3ec47c7e1754e077abe0b983592204a3848fb0089af6&width=1200&height=630",
            "country": "IE",
            "language": "en",
            "summary": "Dr Peter Kalmus moved his family from Altadena, California to North Carolina two years ago because of the climate change. Now he has seen his old neighbourhood destroyed by wildfires caused by climate-driven wildfires. Kalmus has spent his career warning about the deadly impact of our fossil fuel dependence."
        },
        {
            "published_date": "2025-01-17T06:12:00",
            "title": "Siberian air to make Trump swearing-in coldest in 40 years",
            "author": "Pablo Martinez Monsivais",
            "url": "https://www.timesdaily.com/news/nation/siberian-air-to-make-trump-swearing-in-coldest-in-40-years/article_bc8c0538-d44a-11ef-9b64-0369850839fc.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/timesdaily.com/content/tncms/assets/v3/editorial/0/ed/0edf092a-d44b-11ef-8ec0-776c7379c137/6789704eddc14.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Another polar vortex disruption will stretch Arctic air across the top of the globe. Donald Trump's second inauguration will be the coldest in 40 years, meteorologists say. The vast majority of Americans are about to get an extended taste of frigid Siberian weather. "
        },
        {
            "published_date": "2025-01-17T06:05:00",
            "title": "Our planet's fever has broken 1.5°C — it's a global climate wakeup call",
            "author": "Michelle McKeown",
            "url": "https://www.irishexaminer.com/lifestyle/outdoors/arid-41552713.html",
            "url_media": "https://www.irishexaminer.com/cms_media/module_img/8915/4457893_4_seoimageog_ENVIRONMENT_20Climate_20_2016533595.jpg",
            "country": "IE",
            "language": "en",
            "summary": "2024 will be remembered as a landmark year in the climate crisis. For the first time in recorded history, the Earth's average annual temperature has exceeded 1.5°C above pre-industrial levels. Global warming is not a distant threat but an unfolding crisis impacting millions already. The Paris Agreement provides a framework, but the real challenge lies in implementation."
        },
        {
            "published_date": "2025-01-17T06:00:20",
            "title": "Angus climate impact deniers warned budget hit is coming",
            "author": "Graham Brown",
            "url": "https://www.thecourier.co.uk/fp/news/angus-mearns/5163321/angus-climate-change-budget-warning",
            "url_media": "https://www.thecourier.co.uk/wp-content/uploads/sites/12/2024/04/KFX-3051023-02-01-2_53968574-1jsc4l8io-scaled.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Angus council has a £9.5 million budget shortfall. Bill Duff warns the money will have to be found for dealing with the impacts of climate change. The council is planning a 15% hike in council tax to plug the gap. 60 Brechin homes are still empty 15 months after Storm Babet and Montrose beach is at risk of being flooded."
        },
        {
            "published_date": "2025-01-17T06:00:00",
            "title": "How to make sense of 2024's wild temperatures",
            "author": "",
            "url": "https://www.hindustantimes.com/environment/how-to-make-sense-of-2024-s-wild-temperatures-101736609213352.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/01/11/1600x900/Temperatures-passed-50-degrees-Celsius--122-Fahren_1736610367717_1736610373756.jpg",
            "country": "IN",
            "language": "en",
            "summary": "2014 was the hottest year since modern record-keeping began. It also contained the hottest day in that record. Global warming is driven by emissions of carbon dioxide and other greenhouse gases. The trend is steeper than it used to be and is likely to pass the 1.5°C limit before the decade is out."
        },
        {
            "published_date": "2025-01-17T05:51:05",
            "title": "Russia to Canada: 7 COLDEST countries in the world for winter lovers",
            "author": "Amrita Ghosh",
            "url": "https://newsable.asianetnews.com/webstories/lifestyle/russia-to-canada-7-coldest-countries-in-the-world-for-winter-lovers-atg-sq7xl5",
            "url_media": "https://static-gi.asianetnews.com/images/01jhsc1agr6my9kw0wqmbyxpxy/fotojet--87-.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The Arctic regions of Canada and Greenland are coldest places in the world. The Oymyakon region is one of the coldest inhabited places in Russia. Finland offers a wonderland of snow. Lapland is renowned for reindeer safaris and the Santa Claus Village."
        },
        {
            "published_date": "2025-01-17T05:26:56",
            "title": "Mild weather in Metro Vancouver coming to an end",
            "author": "Lauren Stallone",
            "url": "https://vancouver.citynews.ca/2025/01/16/vancouver-weather-warm-arctic-mass",
            "url_media": "https://vancouver.citynews.ca/wp-content/blogs.dir/sites/9/2023/10/25/Rainy-Weather-Vancouver-Rain-Wind-Storm-Forecast-2.jpg",
            "country": "CA",
            "language": "en",
            "summary": "An arctic air mass is on its way to Metro Vancouver, bringing with it below-seasonal temperatures. Environment Canada says Vancouver will see temperatures dropping below zero in the upcoming days. In the eastern and southern interior parts of B.C., we'll see temperatures that are more below seasonal temperatures. Out on the coast, we're looking for temperatures to be 2-5 degrees below normal."
        },
        {
            "published_date": "2025-01-17T05:00:20",
            "title": "Wildfires drive record leap in global level of climate-heating CO2",
            "author": "Damian Carrington",
            "url": "https://www.theguardian.com/environment/2025/jan/17/wildfires-drive-record-leap-in-global-level-of-climate-heating-co2",
            "url_media": "https://i.guim.co.uk/img/media/4f705cf24322c37dedc3d7aa17c782a6ae161a8b/0_7_5241_3145/master/5241.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=32a51fd4919f6724b5eeb6b2364887b3",
            "country": "GB",
            "language": "en",
            "summary": "The global average temperature set a new record in 2024. The planet passed the 1.5C limit agreed as a target by the Paris climate agreement for the first time. Wildfires released billions of tonnes of CO2 in 2024, especially in the Americas. El Niño also contributed to the record rise in CO2."
        },
        {
            "published_date": "2025-01-17T05:00:00",
            "title": "Letter to the editor: We need legislation to fix climate change",
            "author": "Pittsburgh News",
            "url": "https://triblive.com/opinion/letter-to-the-editor-we-need-legislation-to-fix-climate-change",
            "url_media": "https://triblive.com/wp-content/themes/TribLIVE2/assets/visuals/images/icons/head/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "Earth had its hottest year ever in 2024. The last 10 years are the 10 hottest on record and likely the hottest in 125,000 years. There were 27 weather disasters in the United States that caused at least $1 billion in damage in 2024, including Hurricane Helene. Fossil fuels account for over 75% of global greenhouse gas emissions and nearly 90% of carbon dioxide emissions. Tell your legislators to support the Inflation Reduction Act and Carbon Fee and Dividend legislation."
        },
        {
            "published_date": "2025-01-17T04:19:48",
            "title": "Fire Risk Increasing In Dry Manawatū-Whanganui Weather",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/01/17/fire_risk_increasing_in_dry_manawat_x16bwhanganui_weather",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "There is a high fire danger in the Manawatūwhangui-Whanganui region due to the hot, dry conditions and brisk winds. Kerry O'Keefe is the community risk manager for the region. He says the fire danger is increasing."
        },
        {
            "published_date": "2025-01-17T04:10:00",
            "title": "DYER: Climate feedbacks - not in front of the children",
            "author": "GWYNNE DYER",
            "url": "https://www.the-star.co.ke/opinion/columnists/2025-01-17-dyer-climate-feedbacks-not-in-front-of-the-children",
            "url_media": "https://cms.eu-central-1.linodeobjects.com/image/2025/01/99b8a098-3b09-44e4-9f65-96dee255071c.png?1737089554204",
            "country": "KE",
            "language": "en",
            "summary": "Scientists and politicians have been telling us for 10 years that we must never exceed the 'aspirational' +1.5C target or very bad things would follow. We have now passed that target and some of that warming is breaking loose. Los Angeles is this week's example."
        },
        {
            "published_date": "2025-01-17T04:09:47",
            "title": "Planet-warming gas levels rose more than ever in 2024",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/01/17/Planetwarming_gas_levels_rose_more_than_ever_in_2024",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "The record rise is incompatible with keeping global warming to 1.5C according to the Met Office, which is concerned about the impact of climate change on the environment.      .   in the world's atmosphere is getting warmer by about 1C. "
        },
        {
            "published_date": "2025-01-17T04:02:30",
            "title": "Blazing a trail: The job of a fire investigator",
            "author": "Anna  Sargent",
            "url": "https://www.rnz.co.nz/news/national/539253/blazing-a-trail-the-job-of-a-fire-investigator",
            "url_media": "https://media.rnztools.nz/rnz/image/upload/s--POf4U1hF--/t_tohu-badge-facebook/v1708140144/4KUNW0E_17_CHP_Fire08_jpg?_a=BACCd2AD",
            "country": "NZ",
            "language": "en",
            "summary": "Wildfires are on the rise and investigators work the ground to try and figure out how they start. Fire and Emergency specialist investigator Craig Chambers was involved in the investigation of the massive fire on Christchurch's Port Hills in February 2024. The blaze burned through 700 hectares of land, forced more than 100 properties to evacuate and destroyed a container home. In the last five years there were 4683 wildfires that burned 8000 hectares."
        },
        {
            "published_date": "2025-01-17T04:00:00",
            "title": "The 1.5C global warming target is a 'delusion', warns climate scientist who fled Los Angeles",
            "author": "Lottie Elton",
            "url": "https://www.bigissue.com/news/environment/los-angeles-fires-global-warming-climate-change",
            "url_media": "https://www.bigissue.com/wp-content/uploads/2025/01/Untitled-design-2025-01-16T132504.258.jpg",
            "country": "US",
            "language": "en",
            "summary": "Peter Kalmus left Los Angeles two years ago because of the climate change. He believes the fires are a portent of things to come. 2024 was the hottest calendar year on record and the first in which the average temperature breached the 1.5C global warming target."
        },
        {
            "published_date": "2025-01-17T03:57:21",
            "title": "Arctic blast expected to bring danerously cold temperatures to the U.S.",
            "author": "",
            "url": "https://www.kawc.org/2025-01-17/arctic-blast-expected-to-bring-danerously-cold-temperatures-to-the-u-s",
            "url_media": "https://www.kawc.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "The incoming Arctic blast is expected to bring dangerously cold temperatures to large parts of the U.S. NPR's Leila Fadel speaks with Axios senior climate reporter Andrew Freedman about the incoming cold blast.   Â   on NPR Facebook, Twitter and LinkedIn. "
        },
        {
            "published_date": "2025-01-17T03:25:31",
            "title": "Repair of Anse La Raye Bridge Decking Plates",
            "author": "Observer News",
            "url": "https://www.thestkittsnevisobserver.com/repair-of-anse-la-raye-bridge-decking-plates",
            "url_media": "https://www.thestkittsnevisobserver.com/wp-content/uploads/Bridge-Decking-Plates.png",
            "country": "US",
            "language": "en",
            "summary": "There has been significant bending to the decking plates along the Anse La Raye Bridge and along the West Coast route. On January 16, a team will be repairing the plates toward the southern end of the bridge. The affected area has been cordoned off for public protection. The public is urged to approach the area with extreme caution."
        },
        {
            "published_date": "2025-01-17T03:13:48",
            "title": "Planet-warming carbon dioxide levels rose more than ever in 2024",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/01/planet-warming-carbon-dioxide-levels-rose-more-than-ever-in-2024-bbc-com",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "Planet-warming carbon dioxide levels rose more than ever in 2024, according to BBC.com.    iReport.com: Carbon dioxide levels in the atmosphere rose more in 2024 than ever before.  iReporter.com says it's because of climate change. "
        },
        {
            "published_date": "2025-01-17T03:13:08",
            "title": "Planet-warming gas levels rose more than ever in 2024",
            "author": "",
            "url": "https://www.yahoo.com/news/planet-warming-gas-levels-rose-031308362.html",
            "url_media": "https://media.zenfs.com/en/bbc_us_articles_995/39d5945a169e8f7fb9541906dcc64f0c",
            "country": "US",
            "language": "en",
            "summary": "2014 was the hottest year on record according to the US science group NOAA. Global CO2 emissions from fossil fuels reached new highs last year, according to preliminary data from the Global Carbon Project team. The long-term CO2 increase is unquestionably due to human activities mainly through burning coal, oil and gas and cutting down forests."
        },
        {
            "published_date": "2025-01-17T03:13:00",
            "title": "Planet-warming carbon dioxide levels rose more than ever in 2024",
            "author": "Justin Rowlatt",
            "url": "https://www.bbc.com/news/articles/c30dn5dn53jo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/8d95/live/8919cc60-d456-11ef-87df-d575b9a434a4.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Concentrations of carbon dioxide in the atmosphere are more than 50% higher than before humans started burning fossil fuels. Last year, fossil fuel emissions were at record highs, while the natural world struggled to absorb as much CO2 due to factors including wildfires and drought. The rapid increase in CO2 is \"incompatible\" with the international pledge to limit global warming to 1.5C above pre-industrial levels."
        },
        {
            "published_date": "2025-01-17T03:08:36",
            "title": "Peregrine Audubon hosts Steve Hampton on Birds and Climate Change",
            "author": "Submitted",
            "url": "https://www.ukiahdailyjournal.com/2025/01/16/peregrine-audubon-hosts-steve-hampton-on-birds-and-climate-change",
            "url_media": "https://www.ukiahdailyjournal.com/wp-content/uploads/2025/01/PEREGRINE2.jpg?w=330&h=213",
            "country": "US",
            "language": "en",
            "summary": "Peregrine Audubon Society is hosting Steve Hampton on Birds and Climate Change on Tuesday, Jan. 21 at 7 p.m. Steve Hampton has been birding since he was 7 years old. He lived in Davis for 30 years and worked for the California Dept. of Fish and Wildlife. Steve has a PhD in resource economics and studies birds and climate change."
        },
        {
            "published_date": "2025-01-17T03:05:33",
            "title": "Experts discuss Pakistan's preparedness to climate change impacts",
            "author": "Amin Ahmed",
            "url": "https://www.dawn.com/news/1885716/experts-discuss-pakistans-preparedness-to-climate-change-impacts",
            "url_media": "https://www.dawn.com/_img/social-default.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's preparedness and response to the escalating impacts of climate change and associated humanitarian crises were discussed at a meeting on Thursday. The meeting focusing on 'Building a climate-resilient Pakistan: insights from the humanitarian future 2025' was organised by the International Rescue Committee and Pakistan Humanitarian Forum. Pakistan contributes less than one per cent to global greenhouse gases emissions yet ranks among the top 10 most climate-vulnerable countries worldwide."
        },
        {
            "published_date": "2025-01-17T03:03:46",
            "title": "World's record heat is worsening air pollution and health in Global South",
            "author": "Joseph Prosper",
            "url": "https://www.ippmedia.com/the-guardian/features/read/worlds-record-heat-is-worsening-air-pollution-and-health-in-global-south-2025-01-16-164425",
            "url_media": "https://www.ippmedia.com/images/favicon_ippmedia.png",
            "country": "TZ",
            "language": "en",
            "summary": "2024 was the first year with an average global temperature rising 1.5° Celsius (2.7° Fahrenheit) above the pre-industrial period. In 2024, extreme heat enveloped whole regions of the world for weeks on end. The Global South, an epicenter of poor air quality, is being especially hard hit. The summer of 2024 in India's capital, New Delhi, was more brutal than any Kunal Kumar can remember."
        },
        {
            "published_date": "2025-01-17T02:39:00",
            "title": "Study: Carbon dioxide up at rates 'incompatible' with 1.5C target",
            "author": "PA Media/dpa",
            "url": "https://thebrunswicknews.com/news/world_news/study-carbon-dioxide-up-at-rates-incompatible-with-1-5c-target/article_7c849648-9cbb-5572-a203-d274e9713e47.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thebrunswicknews.com/content/tncms/assets/v3/editorial/9/e8/9e8aab88-fa7d-59d9-9fb3-96dbfbaa58e6/6789c6a47879a.image.jpg?crop=1760%2C924%2C0%2C127&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide in the atmosphere is increasing at rates incompatible with staying below 1.5 degrees Celsius of global warming. Concentrations of the key greenhouse gas rose at their fastest annual levels in 2024 in the long-running record of measurements taken at Mauna Loa, Hawaii."
        },
        {
            "published_date": "2025-01-17T02:34:09",
            "title": "Ottawa provides $117M for drought resilience on B.C.'s Sunshine Coast",
            "author": "The Canadian Press",
            "url": "https://saskatoon.ctvnews.ca/vancouver/article/ottawa-provides-117m-for-drought-resilience-on-bcs-sunshine-coast",
            "url_media": "https://www.ctvnews.ca/resizer/v2/VFRZBNN7TITNQ4KJ4WQQFV5ZVA.jpg?smart=true&auth=485c9fe0d8721c7e0c54bcf876116ed2de99b45d9524d40192611105f4783201&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": "Drought conditions are seen on B.C.'s Sunshine Coast in a file photo taken from a weather report. It's dry on the Sunshine Coast, but warm on the rest of the province's coast. It is very dry on most other parts of the country."
        },
        {
            "published_date": "2025-01-17T02:32:36",
            "title": "Alon Ben-Meir: Addressing climate change strengthens economic growth",
            "author": "Alon Ben-Meir",
            "url": "https://augustafreepress.com/news/alon-ben-meir-addressing-climate-change-strengthens-rather-than-stifles-economic-growth",
            "url_media": "https://augustafreepress.com/wp-content/uploads/2023/10/climate-change.jpg?_t=1737081428",
            "country": "US",
            "language": "en",
            "summary": "The Los Angeles wildfires killed 25 people and destroyed over 12,000 structures. Donald Trump champions economic growth. He should look into the vast opportunities for economic growth that can be harnessed by addressing climate change. For every degree Celsius increase in global warming, the US risks losing 2.3 percent of GDP."
        },
        {
            "published_date": "2025-01-17T02:28:35",
            "title": "Terraced house hellfire: New builds in Akl overheating due to poor design",
            "author": "Newstalk ZB",
            "url": "https://article.wn.com/view/2025/01/17/Terraced_house_hellfire_New_builds_in_Akl_overheating_due_to",
            "url_media": "https://i.ytimg.com/vi/A4igOj9tCk8/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Some terraced houses in Auckland are overheating. Large windows, poor ventilation and lack of shade are the main causes of the overheating, according to experts. A resident of a house that overheats gets hot in the summer and cold in the winter. "
        },
        {
            "published_date": "2025-01-17T02:23:00",
            "title": "Sharks stranded in rock pools near Ahipara",
            "author": "",
            "url": "https://www.nzherald.co.nz/nz/sharks-stranded-in-rock-pools-near-ahipara/JGVVXQ6WOW4F446ZQD7UD3TBBA",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/GLJNEJXNXJBP3GGMKIOCBJ64OA.jpg?auth=1e4b390e79b9cb6458ae1dfdedcc4f8a3336f01ee5fd5524af0fa8fa37c5d318&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "Travelers were stranded at Dallas Fort Worth International Airport on Saturday, 11 January 2025, after a snowstorm. Los Angeles is still under seige from flames. A suspected arsonist was forced to strip off after setting his pants on fire during a Christmas morning attack on a Melbourne shop that backfired."
        },
        {
            "published_date": "2025-01-17T02:12:30",
            "title": "Climate risk index warns of threats to Cambodian children's health, welfare",
            "author": "Vietnam News",
            "url": "https://article.wn.com/view/2025/01/17/climate_risk_index_warns_of_threats_to_cambodian_children_x2",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "The first Children's Climate Risk Index (CCRI) has reported that nearly two million Cambodian children are facing climate change-related threats, especially floods, droughts and heat waves. This ensures that disaster risk reduction and climate adaptation strategies are focused on the needs of children and youth."
        },
        {
            "published_date": "2025-01-17T02:08:30",
            "title": "Marin climate change risks assessed in ‘biosphere' report",
            "author": "Adrian Rodriguez",
            "url": "https://www.marinij.com/2025/01/16/marin-climate-change-risks-assessed-in-biosphere-report",
            "url_media": "https://www.marinij.com/wp-content/uploads/2023/04/MIJ-L-EVENTS-0427-1.jpg?w=1024&h=681",
            "country": "US",
            "language": "en",
            "summary": "Coastal redwood forests like Muir Woods are at heightened risk of water stress, mortality and overall poor health if climate change remains unchecked. The report was produced by the Golden Gate Biosphere Network, a collaboration of state and federal park managers, environmental researchers and preservation groups. The organization covers 28,000 square miles from San Mateo to Mendocino counties."
        },
        {
            "published_date": "2025-01-17T01:52:54",
            "title": "Romina emphasizes urgent need for robust climate risk management strategies",
            "author": "",
            "url": "https://www.nation.com.pk/17-Jan-2025/romina-emphasizes-urgent-need-for-robust-climate-risk-management-strategies",
            "url_media": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Romina Khurshid Alam is the Coordinator to the Prime Minister for Climate Change. She was speaking at the 'Humanitarian Futures 2025' event organized by the International Rescue Committee on Thursday. The event was attended by government officials, representatives of local and international humanitarian agencies, academics, climate scientists, and meteorological organizations. She outlined the escalating severity of climate impacts that Pakistan is experiencing."
        },
        {
            "published_date": "2025-01-17T01:50:28",
            "title": "PM aide calls for urgent climate risk management",
            "author": "Our Correspondent",
            "url": "https://tribune.com.pk/story/2522659/pm-aide-calls-for-urgent-climate-risk-management",
            "url_media": "https://i.tribune.com.pk/media/images/Romina-Khurshid-Alam1726528072-0/Romina-Khurshid-Alam1726528072-0.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Coordinator to the Prime Minister for Climate Change, Romina Khurshid Alam, spoke at the 'Humanitarian Future' event organised by the International Rescue Committee on Thursday. She stressed the need for climate risk management strategies at the national, provincial, and district levels to enhance preparedness for natural disasters and reduce their economic, social, and environmental impacts. Alam also highlighted the significant initiatives launched at COP29 in Baku, Azerbaijan to combat climate change."
        },
        {
            "published_date": "2025-01-17T01:42:49",
            "title": "Air monitoring station records biggest ever jump in atmospheric CO2",
            "author": "Michael Le Page",
            "url": "https://news.knowledia.com/all/all/articles/air-monitoring-station-records-biggest-ever-jump-in-atmospheric-co2-ea2785583689ac1dc2fc763b79ff0aff78adce2b",
            "url_media": "https://images.newscientist.com/wp-content/uploads/2025/01/16171150/SEI_236194731.jpg?crop=16:9,smart&width=1200&height=675&upscale=true",
            "country": "FR",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere increased by 3.58 parts per million in 2024, the biggest jump since records began at the Mauna Loa Observatory in Hawaii in 1958. The increase is partly due to CO2 emissions from fossil fuel burning and other human actions, such as cutting down forests."
        },
        {
            "published_date": "2025-01-17T01:42:49",
            "title": "Severe droughts are getting bigger, hotter, drier and longer",
            "author": "James Dinneen",
            "url": "https://news.knowledia.com/all/all/articles/severe-droughts-are-getting-bigger-hotter-drier-and-longer-457f95348514e568f7447d5bdd1cc2172b855b02",
            "url_media": "https://images.newscientist.com/wp-content/uploads/2025/01/16174253/sei2361884881.jpg?crop=16:9,smart&width=1200&height=675&upscale=true",
            "country": "FR",
            "language": "en",
            "summary": "Severe droughts that persist for years have grown hotter, drier and larger since the 1980s. Rising temperatures linked to climate change have increased the risk of drought. The recent worst-in-a-millennium megadroughts were in parts of North and South America."
        },
        {
            "published_date": "2025-01-17T01:16:25",
            "title": "Migration Drops 10 Percent in 2023-24: Australia's First Decline Since Border Reopening",
            "author": "The Epoch Times",
            "url": "https://article.wn.com/view/2025/01/17/Migration_Drops_10_Percent_in_202324_Australia_s_First_Decli",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Migrant arrivals during 2023-24 dropped to 667,000 from 739,000 the previous year, a 10 percent annual decrease. This is the first dip since the 1990s. The data is from the Australian Bureau of Statistics (ABS)."
        },
        {
            "published_date": "2025-01-17T01:16:00",
            "title": "Research Reveals Massive Glacier Loss in Warming Region",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/research-reveals-massive-glacier-loss-in-1392176",
            "url_media": "https://www.bristol.ac.uk/media-library/sites/news/2025/january/Glacier%20image%20article.jpg",
            "country": "US",
            "language": "en",
            "summary": "The vast majority of glaciers across Svalbard in the Arctic have been significantly shrinking since 1985. The biggest retreat occurred in recent years, when the calving rates were double the average between 2010 and 2015 due to extreme warming events. The research team used Artificial Intelligence to identify glacier patterns across large areas."
        },
        {
            "published_date": "2025-01-17T01:11:17",
            "title": "Global ocean temperatures set new record in 2024",
            "author": "SAT Articles",
            "url": "https://southafricatoday.net/environment/global-ocean-temperatures-set-new-record-in-2024",
            "url_media": "https://i3.wp.com/imgs.mongabay.com/wp-content/uploads/sites/20/2025/01/14223004/4-1-768x512.jpg?ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "Temperatures across the world's oceans reached an all-time high in 2024, according to a new multi-team study. The findings fit with a decades-long trend of ocean heating. The ocean stores about 90% of the excess heat from human-caused global warming and is viewed as a measure of planetary health. Ocean temperatures have risen steadily since the 1950s."
        },
        {
            "published_date": "2025-01-17T01:02:00",
            "title": "Arctic Study Uncovers Climate Stress Hotspots",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/arctic-study-uncovers-climate-stress-hotspots-1392163",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1517245386807-bb43f82c33c4%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Ecological warning lights have blinked on across the Arctic over the last 40 years. Many of the fastest-changing areas are clustered in Siberia, the Canadian Northwest Territories, and Alaska. The most substantial land warming between 1997-2020 occurred in the far eastern Siberian tundra and throughout central Siberia."
        },
        {
            "published_date": "2025-01-17T01:00:00",
            "title": "Multi-year droughts are becoming hotter, lasting longer and causing more damage: study",
            "author": "Alexandra Mae Jones",
            "url": "https://www.cbc.ca/news/science/multi-year-droughts-worsen-1.7433828",
            "url_media": "https://i.cbc.ca/1.7433847.1737071892!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/climate-cop29-extreme-weather.jpg?im=Resize%3D620",
            "country": "CA",
            "language": "en",
            "summary": "2024 was the hottest year on record, according to climate scientists. Multi-year droughts are becoming longer and more severe. Land affected by them is increasing by 50,000 square kilometres per year. Canada is not exempt from this problem. Canada needs to build more reservoirs, conserving more water and working on forest management."
        },
        {
            "published_date": "2025-01-17T01:00:00",
            "title": "Letters to the Editor: One size fits all doesn't work for climate change",
            "author": "",
            "url": "https://www.irishexaminer.com/opinion/yourview/arid-41555716.html",
            "url_media": "https://www.irishexaminer.com/cms_media/module_img/8927/4463755_4_seoimageog_LC_20school_20out_2016.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Ireland's contribution to global warming and climate change is minimal, according to the World Bank, the EU and UNFCCC. The main culprits for global warming are members of the G7 and G20 countries, responsible for over 70% of all emissions. Environmental Protection Authority has stated that Ireland will certainly miss 2025 and 2030 emission reduction targets of 51% and will at best achieve 29%."
        },
        {
            "published_date": "2025-01-17T00:56:51",
            "title": "NASA Scientists Find New Human-Caused Shifts in Global Water Cycle",
            "author": "Erica McNamee",
            "url": "https://news.knowledia.com/all/all/articles/nasa-scientists-find-new-human-caused-shifts-in-global-water-cycle-nasa-7abb941b8ee6fac4739a623720b1f35c959c3856",
            "url_media": "https://www.nasa.gov/wp-content/uploads/2025/01/deathvalleynps.jpeg",
            "country": "FR",
            "language": "en",
            "summary": "Shifts in the global water cycle are driven by agriculture and could have impacts on ecosystems and water management, especially in certain regions. Water management practices are often based on assumptions that the water cycle fluctuates within a certain range, but this may no longer hold true for some regions."
        },
        {
            "published_date": "2025-01-17T00:54:43",
            "title": "Whatever happened to the Ice Age?",
            "author": "Graham Pinn",
            "url": "https://www.spectator.com.au/2025/01/whatever-happened-to-the-ice-age",
            "url_media": "https://www.spectator.com.au/wp-content/uploads/2025/01/GettyImages-56662996.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The current media emphasis is always on climate change. In reality, summer heat is nothing new and sensationalising social media is looking to create a crisis in the middle of the summer is a distraction from the real problem.      .  "
        },
        {
            "published_date": "2025-01-17T00:45:49",
            "title": "Romina urges protecting vulnerable communities, maintaining sustainability",
            "author": "News Desk",
            "url": "https://pakobserver.net/romina-urges-protecting-vulnerable-communities-maintaining-sustainability",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/01/2-18.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The International Rescue Committee (IRC) and Pakistan Humanitarian Forum (PHF) co-hosted the national conference titled 'Pakistan's Humanitarian Future 2025' supported by Swedish International Development Cooperation Agency (SIDA). It aimed at addressing the country's preparedness and response to the escalating impacts of climate change and humanitarian crises. The event was attended by government officials, representatives of local and international humanitarian agencies, academics, climate scientists and meteorological organizations."
        },
        {
            "published_date": "2025-01-17T00:09:22",
            "title": "Pioneering research exposes huge loss of glaciers in one of the fastest-warming places on Earth",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/01/17/Pioneering_research_exposes_huge_loss_of_glaciers_in_one_of_",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "A new study has revealed that glaciers have shrunk over the past 40 years in a global warming hotspot. The biggest retreat has occurred in recent years, according to the study, and the extent of the shrinkage has been increasing recently.  . "
        },
        {
            "published_date": "2025-01-17T00:09:22",
            "title": "Asteroid impact sulfur release less lethal in dinosaur extinction",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/01/17/Asteroid_impact_sulfur_release_less_lethal_in_dinosaur_extin",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "ans extinction that wiped the dinosaurs off the face of the Earth was caused by the release of sulfur from rocks, as previous studies have posited.   .   in this article:   and in this one  and this one:. "
        },
        {
            "published_date": "2025-01-17T00:01:46",
            "title": "Earth is 'off-track' to limit global warming to 1.5°C, scientists warn - as satellites show a 'very large rise' in CO2 across the globe",
            "author": "SHIVALI BEST",
            "url": "https://www.dailymail.co.uk/sciencetech/article-14292147/Earth-global-warming-large-rise-CO2.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/01/16/12/94163823-0-image-m-114_1737031586221.jpg",
            "country": "GB",
            "language": "en",
            "summary": "According to the Met Office, Earth is 'off-track' to limit global warming to 1.5°C (2.7°F) as set out by the Paris Agreement. Last year, measurements taken at Mauna Loa, Hawaii, revealed the fastest annual rise in carbon dioxide (CO2) since records began back in 1958. Last week, it was confirmed that 2024 was the warmest year on record."
        },
        {
            "published_date": "2025-01-17T00:01:17",
            "title": "WGN's Demetrius Ivory talks about Chicago snowfall patterns",
            "author": "Crain's Chicago Business",
            "url": "https://www.chicagobusiness.com/crains-forum-winter-climate-changes/wgns-demetrius-ivory-talks-about-chicago-snowfall-patterns",
            "url_media": "https://s3-rd-prod.chicagobusiness.com/styles/1200x630/s3/forum-IVORY_WEATHER_CENTER1.jpg",
            "country": "US",
            "language": "en",
            "summary": "There's been a lot of snowfall in February since 2004. The weather has become more unpredictable due to climate change. It took a while for the cold air to get to Chicago, but now we're starting to see influxes of cold air. Lake effect is probably going to bring more snow this year because of what happened in the summer and fall."
        },
        {
            "published_date": "2025-01-17T00:01:00",
            "title": "Carbon dioxide rising at rates ‘incompatible' with staying below 1.5C",
            "author": "Emily Beament",
            "url": "https://uk.news.yahoo.com/carbon-dioxide-rising-rates-incompatible-000100476.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/fc9hO8MqOiLQeLxfDI04IA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/pa_viral_news_uk_120/586f1e9c4c29205cbf3f96b015ae57e4",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide in the atmosphere is increasing at a rate incompatible with staying below 1.5C of global warming, according to the Met Office study. The rise is due to record high emissions from fossil fuel burning, natural'sinks' such as tropical forests capturing less carbon, and wildfires."
        },
        {
            "published_date": "2025-01-17T00:01:00",
            "title": "Carbon dioxide rising at rates ‘incompatible' with staying below 1.5C",
            "author": "Emily Beament",
            "url": "https://www.standard.co.uk/news/environment/met-office-carbon-dioxide-pacific-hawaii-el-nino-b1205379.html",
            "url_media": "https://static.standard.co.uk/2025/01/17/00/16145919-da70d578-bf68-4d0b-9950-dea195bc6883.jpg?width=1200&auto=webp&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "Even a slower rise from pre-industrial levels will not be enough to stay on track with IPCC's climate change pathways.   The IPCC's pathways see temperatures below 1.5C of warming from pre,industrial levels with no or little overshoot.  The Met Office warns that even this slower rise will be too fast."
        },
        {
            "published_date": "2025-01-17T00:01:00",
            "title": "Rising carbon dioxide levels 'incompatible' with halting global warming, study finds",
            "author": "Simon Rushton",
            "url": "https://www.thenationalnews.com/climate/2025/01/17/rising-carbon-dioxide-levels-incompatible-with-halting-global-warming-study-finds",
            "url_media": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/v2/4ICAJLN3B6HXEXAUBMAB35TIUE.jpg?smart=true&auth=72d17fac27dc081677264914dcb05ba9bd4646658cb6c731dca3c59827152be4&width=1200&height=630",
            "country": "AE",
            "language": "en",
            "summary": "Concentrations of carbon dioxide in the atmosphere are incompatible with keeping global warming below 1.5°C, according to a study by the Met Office. The study used measurements taken at Mauna Loa, Hawaii stretching back to 1958. It found a rise of 3.58 parts per million (ppm) in 2024, well above the predicted 2.84ppm."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "The megadroughts are upon us",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/01/17/The_megadroughts_are_upon_us",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Multi-year droughts have become more common since 1980. They will continue to get worse with the warming climate, according to the scientists.   Â. Â   y.  y.  y. y. yer. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "How climate change may alter hydrology of grassland ecosystems",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/01/17/How_climate_change_may_alter_hydrology_of_grassland_ecosyste",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New research reveals that drought and increased temperatures in a CO2-rich climate can dramatically alter how grasslands use and move.   Â  .   in a climate with a high CO2 content can affect grasslands' use and movement. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Pivoting to a Strategy based in Climate Adaptation: The Path Forward from Trump-world",
            "author": "Resilience",
            "url": "https://article.wn.com/view/2025/01/17/Pivoting_to_a_Strategy_based_in_Climate_Adaptation_The_Path_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The SAFER strategy is ambitious and audacious, but in the face of escalating climate impacts, it's not a good idea at this time. It's not the solution to climate change. It is not a solution to the problem of climate change at all. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "How climate instability may be disrupting the polar vortex",
            "author": "Fast Company",
            "url": "https://article.wn.com/view/2025/01/17/How_climate_instability_may_be_disrupting_the_polar_vortex",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Extremely cold Arctic air and severe winter weather swept southward into much of the U.S. in mid-January 2024, breaking daily low temperature records from Montana to Texas. Tens of millions of people were affected by dangerously cold temperatures and heavy lake-effect snow and snow squalls."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Research reveals hurricane impact on water resources and climate change",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/17/Research_reveals_hurricane_impact_on_water_resources_and_cli",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tropical storms like hurricanes are terrifying and costly for coastal regions across the United States, Mexico, Central America and the Caribbean. The storm could be devastating for the U.S., Mexico and Central America's coastal regions. It could also be costly for the Caribbean and Mexico's coastal areas."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Rise in carbon dioxide off track for limiting global warming to 1.5°C (MET Office - Meteorological Office)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/01/17/Rise_in_carbon_dioxide_off_track_for_limiting_global_warming",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Rise in carbon dioxide off track for limiting global warming to 1.5°C, according to Met Office study. Last year saw rise of 1.3°C in CO₂. IPCC pathways for limiting warming to below 1°C remain unchanged."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Earth is 'off-track' to limit global warming to 1.5°C, scientists warn - as satellites show ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/01/17/Earth_is_offtrack_to_limit_global_warming_to_15_C_scientists",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "According to the Met Office, Earth is 'off-track' to limit global warming to 1.5°C (2.7°F) - the goal set out by the IPCC in the Paris Agreement. Last year, measurements taken at Mauna were taken at 2°C."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Planet-warming carbon dioxide levels rose more than ever in 2024",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/01/17/Planetwarming_carbon_dioxide_levels_rose_more_than_ever_in_2",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The record rise is incompatible with keeping global warming to 1.5C according to the Met Office, which is concerned about the impact of climate change on the environment.      .   in the world's atmosphere is getting warmer by about 1C. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Study: Carbon dioxide up at rates 'incompatible' with 1.5C target",
            "author": "The Brunswick News",
            "url": "https://article.wn.com/view/2025/01/17/Study_Carbon_dioxide_up_at_rates_incompatible_with_15C_targe",
            "url_media": "https://i.ytimg.com/vi/2YdPK4gs09I/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere are increasing at incompatible rates, according to the UNFCCC. It's a problem for the environment.    in the Earth's atmosphere is growing at unsustainable rates, it says.  in a report by UNFCC. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Actuaries and scientists warn climate shocks risk 'planetary insolvency'",
            "author": "Raw Story",
            "url": "https://article.wn.com/view/2025/01/17/Actuaries_and_scientists_warn_climate_shocks_risk_planetary_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "U.K. actuaries and University of Exeter climate scientists warn of planetary insolvency unless we act decisively. They urge policymakers to implement realistic and effective approaches to global risk management. Actuaries have developed techniques that \"underpin the functioning of the planet\"."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Siberian air to make Trump swearing-in coldest in 40 years",
            "author": "Naharnet",
            "url": "https://article.wn.com/view/2025/01/17/Siberian_air_to_make_Trump_swearingin_coldest_in_40_years_o",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Another polar vortex disruption will stretch Arctic air across the top of the globe and make Donald Trump's second inauguration the coldest in 40 years. After starting in the Rockies Thursday night, it will reach the Arctic by Friday morning. It would be one of the worst outbreaks of the past 10 years, 15 years."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Permafrost in climate change: Models predict Arctic's response to global warming",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/17/Permafrost_in_climate_change_Models_predict_Arctics_response",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Arctic is heating up as a result of global warming. The widespread permafrost in this area is thawing fast. There are serious consequences for the permafrosts in the Arctic.      .   for this. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Canada Invests in Climate Change Adaptation to Keep Communities Safe in Atlantic Canada",
            "author": "Canada Newswire",
            "url": "https://article.wn.com/view/2025/01/17/Canada_Invests_in_Climate_Change_Adaptation_to_Keep_Communit",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Islanders have felt the devastating impacts of climate change. Extreme events like floods, wildfires and heatwaves are on the rise. Islanders need to prepare for the future and the reality of what they're facing, and these vitally important investments are helping them do just that."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Angus climate impact deniers warned budget hit is coming",
            "author": "The Courier",
            "url": "https://article.wn.com/view/2025/01/17/Angus_climate_impact_deniers_warned_budget_hit_is_coming",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There is a 'disconnect' between residents' concerns over climate change and what needs to be done to mitigate against devastating events like Storm Babet's destruction of Brechin, according to a budget consultation in Angus, Scotland.   .   "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Scrub Hub: What are ice dams and how big of a problem are they for your roof? (pretty big)",
            "author": "Indy Star",
            "url": "https://article.wn.com/view/2025/01/17/Scrub_Hub_What_are_ice_dams_and_how_big_of_a_problem_are_the",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is here in Indiana and its effects are growing stronger. We can expect more flooding in spring and drought conditions in summer, among other changes, according to Purdue researchers. The gutter and eaves will stay frozen and icy for longer because colder air is all around it."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Los Angeles Fires Were Fueled by Climate Change",
            "author": "Scientific American",
            "url": "https://article.wn.com/view/2025/01/17/Los_Angeles_Fires_Were_Fueled_by_Climate_Change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There were recent destructive wildfires in the Los Angeles area. Climate change contributed to the problem, according to the study.    -   for example, Santa Ana winds and urban planning decisions played a role in the recent fires. For more information, go to: http://www.cnn.com/2013/01/20/science/climate-change/"
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Billionaire couple try to find out if landscape repair can turn a profit",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/17/Billionaire_couple_try_to_find_out_if_landscape_repair_can_t",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The 5,000-hectare property in Tasmania was once used for sheep grazing. When the sheep farmers left, an unlikely buyer moved in and bought the property. The property is in the middle of Tasmania and is located in the centre of the state."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "President-Elect Trump Moves Inauguration Indoors for Safety and Unity",
            "author": "Texas Border Business",
            "url": "https://article.wn.com/view/2025/01/17/PresidentElect_Trump_Moves_Inauguration_Indoors_for_Safety_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As an Arctic blast sweeps the country, President Trump has moved the inaugural address and accompanying ceremonies indoors due to record-breaking cold in Washington, D.C., and he's concerned about the security of the event.      .  "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Climate change impacts threaten future of Maine lighthouses",
            "author": "Journal Tribune",
            "url": "https://article.wn.com/view/2025/01/17/Climate_change_impacts_threaten_future_of_Maine_lighthouses",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Maine's lighthouses are threatened by rising sea levels and intense storms. Adapting them to be more resilient is a challenge for Maine's lighthouse keepers, who have to make them more resistant to storms and sea level rise.  . "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Risk Outlook 2025: A fragmented world",
            "author": "The Manila Times",
            "url": "https://article.wn.com/view/2025/01/17/Risk_Outlook_2025_A_fragmented_world",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The World Meteorological Organization confirmed that 2024 is the warmest year on record, underscoring the urgent climate crisis confronting humanity. Temperatures exceed 1.5 degrees Celsius above preindustrial levels for the first time since 1850. The repercussions are immense, influencing geopolitics, social and economic."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "ACES: Graduating from plastics",
            "author": "Newburyport Daily News",
            "url": "https://article.wn.com/view/2025/01/17/ACES_Graduating_from_plastics",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "This is one in a continuing series of educational columns about fostering environmental stewardship and leadership coordinated by ACES — The Alliance of Climate and Environmental Stewards. It's one of the educational columns in a series of articles about fostering environment stewardship, leadership. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "China's commitment to promoting global low-carbon transition remains unwavering: spokesperson",
            "author": "People Daily",
            "url": "https://article.wn.com/view/2025/01/17/Chinas_commitment_to_promoting_global_lowcarbon_transition_r",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "China has never ceased its efforts toward green development. China's commitment to promoting a global low-carbon transition remains unwavering, foreign ministry spokesperson says. China is actively responding to climate change and engaging in global climate governance, Xinhua reports.    "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "How to make sense of 2024's wild temperatures",
            "author": "Hindustan Times",
            "url": "https://article.wn.com/view/2025/01/17/How_to_make_sense_of_2024_s_wild_temperatures",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "On January 10th a number of bodies which monitor the world's climate put out their assessments of 2024. It was the hottest year since modern record-keeping began and it is believed to be the hottest in human history. It also contained the hottest day in that record."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Urgent need for climate risk management emphasised",
            "author": "The News International",
            "url": "https://article.wn.com/view/2025/01/17/Urgent_need_for_climate_risk_management_emphasised",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Coordinator to the Prime Minister for Climate Change, Romina Khurshid Alam addresses the 'Humanitarian Futures' event organised by the International Rescue Committee on January 16, 2025. She emphasises the urgent need for climate change mitigation in Pakistan."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "2024 saw fastest-ever annual rise in CO2 levels: UK weather service",
            "author": "Iosco County News Herald",
            "url": "https://article.wn.com/view/2025/01/17/2024_saw_fastestever_annual_rise_in_CO2_levels_UK_weather_se_s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere in 2024 grew at the fastest annual rate on record, exceeding their own projections by some margin, according to the UK weather service's forecast. The growth is exceeding their projections by a large margin.      "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Azerbaijan Highly Values Georgia's Contribution To Fight Global Climate Change",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/01/17/Azerbaijan_Highly_Values_Georgias_Contribution_To_Fight_Glob",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Azerbaijan highly appreciates Georgia's contribution to the fight against global climate change, Prime Minister Ali Asadov said.      .   i   in   via Trend News Agency.  in this regard, Georgia is a key ally of Azerbaijan. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Africa: Sink or Swim - Africa's Crucial Maritime Milestones in 2025",
            "author": "All Africa",
            "url": "https://article.wn.com/view/2025/01/17/Africa_Sink_or_Swim_Africas_Crucial_Maritime_Milestones_in_2",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Progress has been slow during the AU's Decade of African Seas and Oceans. Five urgent steps can correct the course, according to the AU secretary general, AU Secretary General Joachim Herrmann. He urges urgent action on the urgent steps. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Climate change driving 'cost-of-living' squeeze in lizards",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/01/17/Climate_change_driving_costofliving_squeeze_in_lizards",
            "url_media": "https://article.wn.com/view/2025/01/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Desert lizards are facing a 'cost-of-living squeeze' squeeze as global temperatures continue to rise. For a lizard, the cost of living for a desert lizard is higher than for a human being.   for a reptile it's lower. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Chinese province on \"roof of world\" registers warmest year in 2024",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/01/17/Chinese_province_on_roof_of_world_registers_warmest_year_in_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Qinghai Province on the Qinghai-Xizang Plateau registered the warmest year in 2024. Qinghai's top 10 weather events in 2024 were unveiled at the event that unveiled the province's top ten weather events on Friday. Qingai is often referred to as the roof of the world."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Commentary: Wealthy nations can't ignore climate effects on poorer countries — Ken Silverstein",
            "author": "Journal Courier",
            "url": "https://article.wn.com/view/2025/01/17/Commentary_Wealthy_nations_can_t_ignore_climate_effects_on_p",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Less-developed countries contribute only 1% to 3% of all carbon-dioxide emissions to global warming. By comparison, the 20 richest nations contribute at least 80% of their CO2 emissions to the cause of global warming, while the developing ones contribute less than 1%."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Wetter and warmer: How does climate change impact dengue transmission?",
            "author": "Straits Times",
            "url": "https://article.wn.com/view/2025/01/17/Wetter_and_warmer_How_does_climate_change_impact_dengue_tran",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Our changing climate creates conditions that can be dangerous for humans and other species.    “The climate is changing.” “It's getting worse. ”  “The environment is getting more dangerous.“  "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Insuring against extreme heat: navigating risks in a warming world",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/17/Insuring_against_extreme_heat_navigating_risks_in_a_warming_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In 2024, the planet will reach a critical milestone: each of the last 10 years has been the hottest on record. For the first time, it will be hotter than the previous 10 years.    in 2024, when the Earth will be warmer than it was in 2000."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Not at point of no return, but need stronger climate action: World Meteorological Organization chief Saulo",
            "author": "Deccan Herald",
            "url": "https://article.wn.com/view/2025/01/17/Not_at_point_of_no_return_but_need_stronger_climate_action_W",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " Celeste. Governments and private sectors are not doing enough to mitigate climate change, she says. It will have irreversible consequences on future generations, according to Celeste, World Meteorological Organization chief Celeste says.   .   for future generations. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Wildfires drive record leap in global level of climate-heating CO2",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/01/17/Wildfires_drive_record_leap_in_global_level_of_climateheatin_1",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Data for 2024 shows humanity is moving deeper into a dangerous world of supercharged extreme weather, as shown by the data for 2024 data for 2015 data for 2016 data for 2017 data for 2018 data for 2019 data for 2020 data for 2021 data for 2022 data for 2023."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Greenland's melting ice is clearing the way for a mineral ‘gold rush'",
            "author": "system",
            "url": "https://article.wn.com/view/2025/01/17/Greenland_s_melting_ice_is_clearing_the_way_for_a_mineral_go",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greenland, a vast but sparsely populated Arctic island, has been transformed by the climate crisis in recent decades. It's population has been reduced by the change caused by climate change. It has a population of about 1.5 million people. It is a vast and sparsely-populated island."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Air monitoring station records biggest ever jump in atmospheric CO2",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/01/17/Air_monitoring_station_records_biggest_ever_jump_in_atmosphe",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Wildfires and fossil fuel burning in 2024 contributed to the biggest annual rise in atmospheric CO2 levels ever recorded at the Mauna Loa Observatory in Hawaii, according to the study by the observatory's director, Dr. Richard Brinke.   "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Extreme wildfires in UK would spark evacuations, Government warns as Los Angeles fires burn",
            "author": "London Evening Standard",
            "url": "https://article.wn.com/view/2025/01/17/Extreme_wildfires_in_UK_would_spark_evacuations_Government_w",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The alarm was raised about the growing risk of wildfires as the planet warms, because of the warming climate.      .   in this article.  In this article, we have been updated to reflect the fact that the alarm has been raised and that the danger of wildfires is growing."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Urgent need for climate risk management emphasised",
            "author": "Our Correspondent",
            "url": "https://www.thenews.com.pk/print/1273044-urgent-need-for-climate-risk-management-emphasised",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-01-17/l_1273044_051153_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Romina Khurshid Alam is the Coordinator to the Prime Minister for Climate Change. She spoke at the 'Humanitarian Futures' event organised by the International Rescue Committee (IRC) and Pakistan Humanitarian Forum (PHF) on Thursday. The event was attended by government officials, representatives of local and international humanitarian agencies, academics, climate scientists, and meteorological organisations."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Human-caused CO2 is not benign",
            "author": "",
            "url": "https://www.adirondackdailyenterprise.com/opinion/letters-to-the-editor/2025/01/human-caused-co2-is-not-benign",
            "url_media": "https://d14e0irai0gcaa.cloudfront.net/www.adirondackdailyenterprise.com/images/2017/04/17105339/Untitled-2.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to the Intergovernmental Panel on Climate Change, human activities are estimated to have caused approximately 1.0 degrees Celsius of global warming above pre-industrial levels. Since 1979, September has lost 1.61 million square kilometers (622,000 square miles) of Arctic summer sea ice."
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Dukett's climate bias commentary is flawed",
            "author": "",
            "url": "https://www.adirondackdailyenterprise.com/opinion/letters-to-the-editor/2025/01/duketts-climate-bias-commentary-is-flawed",
            "url_media": "https://d14e0irai0gcaa.cloudfront.net/www.adirondackdailyenterprise.com/images/2017/04/17105339/Untitled-2.jpg",
            "country": "US",
            "language": "en",
            "summary": "Jed Dukett's recent guest commentary about climate change is wrong. Studies show that CO2 is the principal cause of warming over the past half-century. Over 95% of climate experts agree on the central role of carbon dioxide in recent warming. "
        },
        {
            "published_date": "2025-01-17T00:00:00",
            "title": "Response to Jed Dukett's commentary on climate bias",
            "author": "Richard Brandt",
            "url": "https://www.adirondackdailyenterprise.com/opinion/guest-commentary/2025/01/response-to-jed-duketts-commentary-on-climate-bias",
            "url_media": "https://d14e0irai0gcaa.cloudfront.net/www.adirondackdailyenterprise.com/images/2017/04/17105339/Untitled-2.jpg",
            "country": "US",
            "language": "en",
            "summary": "Guest commentary by Jed Dukett on Jan. 11 is deeply flawed and does a disservice to readers. Richard Brandt is a polar climate scientist with over 20 expeditions to the Arctic and Antarctic. Arctic sea-ice extent has declined dramatically since the mid-2000s. Last year was the warmest on record."
        }
    ]
}