{
    "status": "ok",
    "total_articles": 82,
    "articles": [
        {
            "published_date": "2025-03-23T23:50:51",
            "title": "Winston Peters raises questions over NZ's place in Paris Climate Agreement",
            "author": "",
            "url": "https://www.rnz.co.nz/national/programmes/middayreport/audio/2018980166/winston-peters-raises-questions-over-nz-s-place-in-paris-climate-agreement",
            "url_media": "https://media.rnztools.nz/rnz/image/upload/s--ImISGBa8--/c_fill,f_auto,g_auto,h_300,q_auto,w_300/v1719960626/4KNMJ82_midday_report_external_cover_July_2024_jpg?_a=BACCd2AD",
            "country": "NZ",
            "language": "en",
            "summary": "Winston Peters is raising questions about New Zealand's involvement in the Paris Climate Agreement. RNZ's climate change correspondent Eloise Gibson spoke to Charlotte Cook about the issue 25 minutes ago and it's costing the country dearly..      "
        },
        {
            "published_date": "2025-03-23T23:45:07",
            "title": "Australian scientists discover world's oldest meteorite crater",
            "author": "Agence France-Presse",
            "url": "https://www.scmp.com/posties/kids/eye-news/article/3301760/australian-scientists-discover-worlds-oldest-meteorite-crater",
            "url_media": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_posties_article/public/d8/images/canvas/2025/03/10/034dd989-98a1-4da3-bd6f-885b28f7469e_bda3e8e8.jpg?itok=M4dfAm6v&v=1741586708",
            "country": "HK",
            "language": "en",
            "summary": "Curtin University scientists have discovered the oldest known meteorite impact crater in the world. The crater is located in a remote area of northwestern Australia and is 3.5 billion years old. The meteorite is believed to have struck the area at speeds over 36,000 km per hour, creating a crater larger than 100 km wide."
        },
        {
            "published_date": "2025-03-23T23:00:21",
            "title": "Glaciers at risk",
            "author": "News Desk",
            "url": "https://pakobserver.net/glaciers-at-risk",
            "url_media": "https://pakobserver.net/wp-content/uploads/2022/11/editorial-1.jpg",
            "country": "PK",
            "language": "en",
            "summary": "On World Glaciers Day, Prime Minister Shehbaz Sharif highlighted the urgent need to protect glaciers. Pakistan is home to the largest number of glaciers outside the Polar Regions. Over 10,000 of these glaciers are rapidly shrinking, with devastating consequences for the nation's water supply, agriculture and safety of vulnerable communities living along streams and rivers. The rapid melting of glaciers is an inevitable consequence of global warming."
        },
        {
            "published_date": "2025-03-23T21:11:30",
            "title": "Wildfire Emergency Declared in Both Carolinas as Multiple Blazes Spread",
            "author": "Adeola Adeosun",
            "url": "https://www.msn.com/en-us/news/us/wildfire-emergency-declared-in-both-carolinas-as-multiple-blazes-spread/ar-AA1BviGf",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "North and South Carolina have declared state of emergency as wildfires continue to burn, forcing evacuations and threatening communities. The wildfires pose immediate danger to communities already struggling to rebuild after Hurricane Helene's devastating impact on western North Carolina when it struck last year. The state is battling three active fires in Polk County alone, with the two largest spanning between 1.7 and 1.9 square miles. In South Carolina, the Table Rock fire in Pickens County has prompted voluntary evacuations of residents near Table Rock Mountain."
        },
        {
            "published_date": "2025-03-23T21:02:18",
            "title": "Record March Heat in South Korea's Southern Regions",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/south-koreas-southern-regions-report-record-high-march-temperatures-104",
            "url_media": "https://one.newkerala.com/images/t/newkerala-com-news250.webp",
            "country": "IN",
            "language": "en",
            "summary": "Gumi in North Gyeongsang Province, 200 km southeast of Seoul, recorded its highest March temperature of 28.5 degrees Celsius on Sunday. Daegu, Andong, Gyeongju, Incheon and Daejeon also reported record-breaking March temperatures. South Korea is experiencing extreme temperatures due to a combination of factors, including global warming, increased greenhouse gas emissions and weather patterns."
        },
        {
            "published_date": "2025-03-23T19:42:50",
            "title": "CM Naidu reviews crop damages due to untimely rains",
            "author": "MD Ilyas",
            "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/cm-naidu-reviews-crop-damages-due-to-untimely-rains-1868622",
            "url_media": "https://www.deccanchronicle.com/h-upload/2025/03/23/1901173-naid.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Two banana farmers in Neelampalli, Yellanur Mandal of Anantapur district tried to commit suicide due to crop losses caused by torrential rains. The health of the farmers has improved and they are out of immediate danger. The officials informed the Chief Minister that they have personally inspected the field situations regarding the crop damages due to untimely rains and severe winds."
        },
        {
            "published_date": "2025-03-23T19:01:51",
            "title": "In the wild world of KZN, disruptive floods are now a seasonal reality — this is what we need to do",
            "author": "Derek Alberts",
            "url": "https://www.dailymaverick.co.za/article/2025-03-23-kzn-disruptive-flooding-now-a-seasonal-reality-what-we-need-to-do",
            "url_media": "https://i0.wp.com/www.dailymaverick.co.za/wp-content/uploads/2022/08/MC-CSW-29Aug.jpg?fit=1280%2C694&quality=89&ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "Heavy rains in the catchment of KwaZulu-Natal's east-flowing rivers continue to cause flooding in the greater Durban area. The March 2025 floods are the 12th in a series of events dating from July 2016. Climate change is here to stay and we need to adapt urgently, says Professor Tafadzwa Mabhaudhi."
        },
        {
            "published_date": "2025-03-23T18:10:42",
            "title": "Why UWA is looking to stop invasive species in parks",
            "author": "",
            "url": "https://ntv.co.ug/ug/news/national/why-uwa-is-looking-to-stop-invasive-species-in-parks-4976434",
            "url_media": "https://www.ntv.co.ug/resource/blob/4976430/961d677cf95c2f93aebc61c319d3e971/uwa-data.png",
            "country": "UG",
            "language": "en",
            "summary": "The number of alien species on every continent is expected to increase by 36 percent by 2050. Uganda has not been spared from the global phenomenon of invasive species, which prevent the harmonious habitation of wildlife in some national parks. Today, we look at how big the problem is and the effectiveness of current interventions."
        },
        {
            "published_date": "2025-03-23T18:04:00",
            "title": "S. Korea's southern regions set record high March temperatures amid unusually warm winds",
            "author": "김승연",
            "url": "https://n.news.naver.com/mnews/article/001/0015282761",
            "url_media": "https://imgnews.pstatic.net/image/001/2025/03/23/AEN20250323002100315_01_i_20250323180419113.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Gumi in North Gyeongsang Province, 200 km southeast of Seoul, recorded highest March temperature of 28.5 C on Sunday. Daegu at 27.9 C, Andong at 25.7 C and Gyeongju 27.8 C also set new records. Daejeon, Incheon and Seoul recorded their second-highest March temperatures on record. The unusually high temperatures are due to the hot and dry westerly winds."
        },
        {
            "published_date": "2025-03-23T17:40:31",
            "title": "WWD: Climate-induced temperature affecting Nigerias agric, othersRUWASSA chair",
            "author": "Latestnigeriannews",
            "url": "https://www.latestnigeriannews.com/p/4207763/wwd-climateinduced-temperature-affecting-nigerias-agric-others-ruwassa-chair.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Oyo State Rural Water Supply and Sanitation Agency (RUWASSA) Sunday alerted that climate-induced temperature increases are already affecting Nigerias agriculture, water availability, and disaster. Click here to read the full news article.     "
        },
        {
            "published_date": "2025-03-23T17:34:50",
            "title": "WWD: Climate-induced temperature affecting Nigeria's agric, others",
            "author": "Bayo Agboola",
            "url": "https://blueprint.ng/wwd-climate-induced-temperature-affecting-nigerias-agric-others-ruwassa-chair",
            "url_media": "https://blueprint.ng/wp-content/uploads/2024/05/oyo-State-.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Oyo State Rural Water Supply and Sanitation Agency (RUWASSA) has warned that climate-induced temperature increases are already affecting Nigeria's agriculture, water availability and disaster resilience. This year's theme for World Water Day is 'Glacier Preservation'."
        },
        {
            "published_date": "2025-03-23T17:33:33",
            "title": "Freezout Lake water levels effect bird migration",
            "author": "Aneesa Coomer",
            "url": "https://www.krtv.com/freezout-lake-water-levels-effect-bird-migration",
            "url_media": "https://ewscripps.brightspotcdn.com/dims4/default/1f95a7f/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F75%2F9e%2F57bbb9c64b039093503d82c8e7de%2Fkrtv00004.png",
            "country": "US",
            "language": "en",
            "summary": "Wild Wings Festival celebrates Montana's stunning waterfowl migration every March. Freezout Lake is a critical stopover in the Pacific Flyway migration route. About 30,000 snow geese visited Freezeout Lake today, which is close to average, but still below normal numbers. The festival takes place March 21-23 at the Choteau Pavilion in North Central Montana."
        },
        {
            "published_date": "2025-03-23T16:45:50",
            "title": "World Water Day: Oyo reaffirms commitment to clean water access",
            "author": "Rotimi Agboluaje",
            "url": "https://guardian.ng/news/world-water-day-oyo-reaffirms-commitment-to-clean-water-access",
            "url_media": "https://guardian.ng/wp-content/uploads/2024/10/GXx0mmjW0AAmHni-scaled-e1732209287422.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Oyo State joined the global community to mark World Water Day, celebrated on March 22 each year to raise awareness about the global water crisis. The day emphasizes the importance of achieving Sustainable Development Goal 6: water and sanitation for all by 2030. Chairman of RUWASSA, Babalola Afobaje, stressed the significance of this year's theme, 'Glacier Preservation,' emphasizing the urgent need for glacier preservation."
        },
        {
            "published_date": "2025-03-23T16:39:54",
            "title": "Retreating glaciers",
            "author": "Gk Editorial Desk",
            "url": "https://www.greaterkashmir.com/opinion/retreating-glaciers",
            "url_media": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2025/03/Glacier_on_Antarctic_coast_mountain_behind-e1742577471237.jpg",
            "country": "IN",
            "language": "en",
            "summary": "All 19 of the world's glacier regions lost mass in 2024. Since records began in 1975, glaciers separate from the massive ice sheets of Greenland and Antarctica have lost over 9,000 billion tonnes of ice. This is equivalent to an ice block the size of Germany, 25 meters thick disappearing. Glaciers store around 70% of world's freshwater, feeding rivers, sustaining agriculture, and providing drinking water for millions of people."
        },
        {
            "published_date": "2025-03-23T16:38:05",
            "title": "We had it coming - What the current heat wave says about our ecosystem",
            "author": "",
            "url": "https://www.pulse.ng/articles/lifestyle/we-had-it-coming-what-the-current-heat-wave-says-about-our-ecosystem-2025032316380583584",
            "url_media": "https://image.api.sportal365.com/process//smp-images-production/pulse.ng/10032025/b96bda30-f018-415d-b944-21eeee28a4bf.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Since the start of the year, Nigeria has experienced prolonged stretches of heat across different states. The heat wave's most immediate effects are drying up of rivers, streams, and other water bodies, increasing evaporation, and decreasing water availability for human consumption and ecological functions. The extreme heat is also causing widespread habitat destruction, pushing many plant and animal species to the brink of extinction. Heat waves increase electricity consumption as people rely more on air conditioning and fans to stay cool."
        },
        {
            "published_date": "2025-03-23T16:11:14",
            "title": "Global warming and air pollution",
            "author": "Tags",
            "url": "https://www.naturalnews.com/2025-03-23-global-warming-and-air-pollution.html",
            "url_media": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/03/Earth-Trash-Pollution-Garbage-Concept.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a decrease in cloud cover worldwide, which could be caused by less air pollution. NASA confirms the findings of a study done 23 years ago. The US government has spent almost half a trillion dollars on climate change initiatives since the 'problem' was identified. It's time to change the narrative."
        },
        {
            "published_date": "2025-03-23T16:00:00",
            "title": "New analysis charts historical loss of New Zealand's glaciers",
            "author": "Jamie Morton",
            "url": "https://www.nzherald.co.nz/nz/land-of-the-short-white-cloud-new-analysis-charts-historic-loss-of-nzs-glaciers/EZ47DBBKJ5D6FFNVTTYR74QFPA",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/DTYS4JQDGL2WZA5J4L5DA37G3I.jpg?auth=2276f55a7a6f7ac78bac088f4bd2f69a74c31ed13d932b65fc759394fcb2548b&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "The research reconstructed ice volume changes for more than 3000 small and medium-sized glaciers and the 12 largest glaciers in the Southern Alps region. Ice volume declined steadily as temperatures rose by 0.5C between 1895 and 1949. Since 1949, temperatures had increased by a further 1.3C, accelerating the loss dramatically. The study also highlighted the role of climate drivers such as the Southern Annular Mode (SAM) and the Interdecadal Pacific Oscillation (IPO) in glacier retreat."
        },
        {
            "published_date": "2025-03-23T16:00:00",
            "title": "Temperature and rainfall records broken in 2024",
            "author": "",
            "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/03/24/temperature-and-rainfall-records-broken-in-2024",
            "url_media": "https://cdn.thestar.com.my/Themes/img/newTsol_logo_socmedia.png",
            "country": "MY",
            "language": "en",
            "summary": "2024 was the warmest year in Singapore, tying with 2019 and 2016, with temperatures hitting an annual mean of 28.4˚C. The wettest November in more than 40 years was also recorded in 2024, while two unusual episodes in September and October brought intense rain. The unusual rainfall patterns of 2024 could not be linked directly to climate change."
        },
        {
            "published_date": "2025-03-23T16:00:00",
            "title": "Climate risk reporting could stop investors from walking",
            "author": "Alice Peacock",
            "url": "https://newsroom.co.nz/2025/03/24/climate-risk-reporting-could-stop-investors-from-walking",
            "url_media": "https://i0.wp.com/newsroom.co.nz/wp-content/uploads/2025/03/GettyImages-1397822853-scaled.jpg?fit=2560%2C1707&ssl=1",
            "country": "NZ",
            "language": "en",
            "summary": "60 percent of NZX50 companies are including the risk of climate change in their financial statements. This is a 44 percent jump since 2021 and makes New Zealand the global leader. There is consultation on a potential row-back on NZ's broader climate disclosures regime. "
        },
        {
            "published_date": "2025-03-23T15:37:30",
            "title": "Oman marks World Meteorological Day",
            "author": "Joydeep B",
            "url": "https://www.muscatdaily.com/2025/03/23/oman-marks-world-meteorological-day",
            "url_media": "https://www.muscatdaily.com/wp-content/uploads/2025/03/Oman-early-warning-systems.jpg",
            "country": "OM",
            "language": "en",
            "summary": "Oman joined the global community in observing World Meteorological Day on March 23. This year's theme is 'Closing the Early Warning Gap Together'. 2024 was the hottest year on record, underscoring the urgency of climate resilience as extreme weather events become more frequent. Oman established the National Multi-Hazard Early Warning Centre in 2004."
        },
        {
            "published_date": "2025-03-23T14:44:24",
            "title": "Extreme weather, climate change hit fishing community in Kerala, says study",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/news/national/kerala/extreme-weather-climate-change-hit-fishing-community-in-kerala-says-study/article69364956.ece",
            "url_media": "https://www.thehindu.com/theme/images/og-image.png",
            "country": "IN",
            "language": "en",
            "summary": "Extreme weather conditions and climate change are taking a heavy toll on the fishing community in Kerala, leading to a considerable loss of fishing days, reduced catch, and declining profitability. Central Marine Fisheries Research Institute (CMFRI) study highlights the growing challenges faced by fishermen."
        },
        {
            "published_date": "2025-03-23T14:29:00",
            "title": "‘Climate-resilient farming need of hour in Bihar'",
            "author": "",
            "url": "https://timesofindia.indiatimes.com/city/patna/climate-resilient-farming-need-of-hour-in-bihar/articleshow/119375971.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-119375969,width-1070,height-580,imgsize-37152,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bihar's agriculture department secretary, Sanjay Kumar Agrawal, talks to TOI about the impact of climate change on agriculture and the government's efforts to educate farmers on climate-resilient farming. The department has successfully trained over 5.9 lakh farmers under the CRA programme."
        },
        {
            "published_date": "2025-03-23T14:20:42",
            "title": "2024 one of Singapore's warmest on record",
            "author": "CNA",
            "url": "https://www.channelnewsasia.com/watch/2024-one-singapores-warmest-record-5019146",
            "url_media": "https://dam.mediacorp.sg/image/upload/s--IccZLCq7--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2025/03/23/1742740039-image.jpg?itok=YGz0u3uk",
            "country": "SG",
            "language": "en",
            "summary": "The year 2024 was one of Singapore's hottest years on record, with average temperatures of 28.4 degrees Celsius. Temperature records were also broken several times.   n Natalie Ong has more information on the record-breaking temperature in Singapore in 2024 and more in general."
        },
        {
            "published_date": "2025-03-23T14:20:09",
            "title": "The world wants more action to fight climate change, survey says",
            "author": "Steve MacLaughlin",
            "url": "https://www.nbcmiami.com/news/local/changing-climate-south-florida/the-world-wants-more-action-to-fight-climate-change-survey-says/3573691",
            "url_media": "https://media.nbcmiami.com/2025/03/GettyImages-2174124651.jpg?quality=85&strip=all&resize=1200%2C675",
            "country": "US",
            "language": "en",
            "summary": "The United States has pulled out of the Paris Climate Agreement for the second time in five years. A survey published in Nature Climate Change shows that the world wants more climate action, not less. 69% of people are willing to contribute 1% of their income to fight global warming, but only 43% think other people want to do the same."
        },
        {
            "published_date": "2025-03-23T13:17:00",
            "title": "11 U.S. Areas That Might Be Uninhabitable by 2070, Scientists Warn",
            "author": "David Quintero",
            "url": "https://www.msn.com/en-us/weather/topstories/11-u-s-areas-that-might-be-uninhabitable-by-2070-scientists-warn/ss-AA1BudJP",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "By 2070, 11 regions of the United States could become uninhabitable due to climate change, extreme heat, rising seas, and ecological collapse. Here are the areas at greatest risk and the forces pushing them toward their breaking point.  . "
        },
        {
            "published_date": "2025-03-23T13:00:00",
            "title": "The Trump administration's climate policies jeopardize research in disaster-prone Puerto Rico",
            "author": "Víctor Rodríguez Velázquez",
            "url": "https://www.msn.com/en-us/news/politics/the-trump-administration-s-climate-policies-jeopardize-research-in-disaster-prone-puerto-rico/ar-AA1Bufy9",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Trump's climate policies limit funding for academic research on climate change. Puerto Rico has 107 active NIH-funded grants totaling $78.5 million. Of these, 91 are led by University of Puerto Rico scientists, 25 are housed at private institutions. The Coastal Research and Planning Institute (CoRePI) is affiliated with the UPR's School of Planning at the Río Piedras campus. Its last project will conclude in April 2026 unless it secures new funding."
        },
        {
            "published_date": "2025-03-23T12:58:21",
            "title": "Swiss Scientists Race to Preserve Alps' Largest Glacier Amidst Rapid Ice Loss",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3318614-swiss-scientists-race-to-preserve-alps-largest-glacier-amidst-rapid-ice-loss",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_08_2024_18_00_50_4410351.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Swiss scientists are trying to preserve the largest glacier in the Alps, despite the accelerated pace of ice loss. The United Nations has documented the most rapid glacial mass loss ever recorded over the past three years, underscoring the need for global action to mitigate the effects of climate change and preserve these vital ice reserves."
        },
        {
            "published_date": "2025-03-23T12:31:40",
            "title": "CO2 on the Menu at a Restaurant Near You",
            "author": "Tuco's Child",
            "url": "https://tucoschild.substack.com/p/co2-on-the-menu-at-a-restaurant-near",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F49aa0a1b-da14-49c1-94b2-15b940efac58_400x494.png",
            "country": "US",
            "language": "en",
            "summary": "The Nemeth Report has published a CO 2 nugget entitled Emissions On the Menu from the Hilton hotel in London. The colour-coded letter score beside each item on the menu was the CO2 emissions score of each dish calculated by a group called Klimato."
        },
        {
            "published_date": "2025-03-23T11:55:12",
            "title": "We ditched the UK for sunny Australia – we swapped a 2-bed bungalow for a huge house with a garden & still saved cash",
            "author": "Leanne Hall",
            "url": "https://www.thescottishsun.co.uk/fabulous/14532811/uk-australia-house-swap-saved-cash",
            "url_media": "https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/03/home_673fc8.jpg?1742730980&strip=all&quality=100&w=1920&h=1080&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "Gee Knight and her partner moved from the UK to Perth with their 18-month-old son. They sold their two-bed bungalow in the UK and bought a huge house with a garden near the beach. Gee shares some packing tips with her followers."
        },
        {
            "published_date": "2025-03-23T11:45:00",
            "title": "AU PSC calls for integrating environmental dimensions in peace, security & development strategies in Africa",
            "author": "North Africa Post",
            "url": "https://northafricapost.com/85508-au-psc-calls-for-integrating-environmental-dimensions-in-peace-security-development-strategies-in-africa.html",
            "url_media": "https://northafricapost.com/wp-content/uploads/2012/09/logo_NAP_var5-150x60.png",
            "country": "US",
            "language": "en",
            "summary": "The Peace and Security Council (PSC) of the African Union (AU) underscored the importance of integrating environmental and climate dimensions into peace, security, and development strategies in Africa. The PSC also calls for enhanced cooperation between African stakeholders and international partners in responding to climate-related challenges."
        },
        {
            "published_date": "2025-03-23T11:33:02",
            "title": "Glaciers the size of Germany gone in 50 yrs; saving them a matter of survival: UN",
            "author": "The Federal",
            "url": "https://thefederal.com/category/science/climate-change-un-warns-of-mass-shrinking-of-world-glaciers-178002",
            "url_media": "https://thefederal.com/h-upload/2025/03/23/521674-a16.jpg",
            "country": "GB",
            "language": "en",
            "summary": "All 19 of the world's glacier-regions experienced a net loss of mass for the third consecutive year in 2024. Five of the last six years have seen the most rapid glacier retreat on record due to climate change. According to the UN, many glaciers in western Canada, the United States, Scandinavia, central Europe, the Caucasus and New Zealand will not survive the 21st century."
        },
        {
            "published_date": "2025-03-23T11:18:25",
            "title": "South Korea's southern regions report record high March temperatures amid unusually warm winds",
            "author": "The Hans India",
            "url": "https://www.thehansindia.com/news/international/south-koreas-southern-regions-report-record-high-march-temperatures-amid-unusually-warm-winds-956486",
            "url_media": "https://assets.thehansindia.com/h-upload/2025/03/23/1535629-north-gyeongsang-province.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Gumi in North Gyeongsang Province, 200 km southeast of Seoul, recorded its highest March temperature of 28.5 degrees Celsius on Sunday. Daegu, Andong, Gyeongju, Incheon, Daejeon and Incheon also reported record-breaking March temperatures. Seoul recorded 24.0 degrees Celsius. South Korea is experiencing extreme temperatures due to a combination of factors."
        },
        {
            "published_date": "2025-03-23T11:18:00",
            "title": "Korea's southern regions set record high March temperatures amid unusually warm winds",
            "author": "",
            "url": "https://www.koreatimes.co.kr/www/nation/2025/03/281_394772.html",
            "url_media": "https://img.koreatimes.co.kr/upload/thumbnailV2/c95b8f04c41d422fa5736c8ec2d2a786.png",
            "country": "KR",
            "language": "en",
            "summary": "Gumi in North Gyeongsang Province, 200 km southeast of Seoul, recorded highest March temperature of 28.5 degrees Celsius on Sunday. Daegu at 27.9 degrees Celsius, Andong at 25.7 degrees Celsius and Gyeongju 27.8 degrees Celsius also set new records. Daejeon, Incheon and Seoul recorded their second-highest March temperatures on record of 24.0 degrees Celsius."
        },
        {
            "published_date": "2025-03-23T11:15:56",
            "title": "Scientists alarmed by 'new normal' observed on slopes of Mount Everest: 'This is a wake-up call'",
            "author": "Veronica Booth",
            "url": "https://www.yahoo.com/news/scientists-alarmed-normal-observed-slopes-111556112.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/8nYaHzz0MM6ZqTQD95COhg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/9d8b97dab1303e2d0c5a2b0629881ddd",
            "country": "US",
            "language": "en",
            "summary": "Warmer and drier climate conditions are raising the Himalayas' snow line, leading to more frequent wildfires and concerning water shortages. Nepal's wildfire season started early this year due to prolonged winter droughts. Many experts attribute super storms, bomb cyclones, atmospheric rivers, and other extreme weather events to the rapidly overheating planet."
        },
        {
            "published_date": "2025-03-23T11:15:06",
            "title": "Officials sound alarm as invisible threat creeps closer to major U.S. city: 'An issue of concern for all of us'",
            "author": "Cody Januszko",
            "url": "https://www.yahoo.com/news/officials-sound-alarm-invisible-threat-111506096.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/EZjliy8205w9exm3WnFo7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04OTk-/https://media.zenfs.com/en/the_cool_down_737/08101e3dbe192d1eff59b8ade4fab0d7",
            "country": "US",
            "language": "en",
            "summary": "Rising sea levels threaten to flood Pennsylvania's drinking water supplies. The previous plan to stop salt water from entering the drinking water intakes may not be enough to protect the supply if seawater levels are not kept under control. The global average sea level has risen by about six inches over the past century, with 3.8 inches of that coming since 1993."
        },
        {
            "published_date": "2025-03-23T11:10:59",
            "title": "Peer-Reviewed AI-Driven Study Deals a Body Blow to the Climate Scam",
            "author": "David Blackmon",
            "url": "https://blackmon.substack.com/p/peer-reviewed-ai-driven-study-deals",
            "url_media": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fblackmon.substack.com%2Ftwitter%2Fsubscribe-card.jpg%3Fv%3D728519554%26version%3D9",
            "country": "US",
            "language": "en",
            "summary": "Robert Malone, MD-MS, discusses a new peer-reviewed study on climate science conducted using advanced AI technology. The study was published Friday in the journal Climate Science Review. It finds that climate alarm'scientists' tend to wildly overstate the impacts of man-caused greenhouse gas emissions on the global climate."
        },
        {
            "published_date": "2025-03-23T11:02:26",
            "title": "AI-Led Study Says Natural Drivers Dominate Climate Variability. Human CO₂ Emissions But A Minor Component",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/ai-led-study-says-natural-drivers",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F10ce305a-4045-4df6-a467-c997e02928bb_2000x1346.heic",
            "country": "US",
            "language": "en",
            "summary": "The IPCC's Sixth Assessment Report (AR6) anchors its narrative on the premise that anthropogenic CO2 emissions have increased atmospheric CO2 concentrations from 280 ppm to 420 ppm and driven a global temperature increase of 0.8-1.1°C since pre-industrial times. A new analysis by Grok, a software company owner, a high school student, and an astrophysicist shows that the theory is not supported by the evidence."
        },
        {
            "published_date": "2025-03-23T11:00:57",
            "title": "Unicef says 1 in 10 households receives water only once a week",
            "author": "Merit Designs Consulting Group",
            "url": "https://dominicantoday.com/dr/local/2025/03/23/unicef-says-1-in-10-households-receives-water-only-once-a-week",
            "url_media": "https://dominicantoday.com/wp-content/uploads/2025/03/6437d47675289.jpeg",
            "country": "DO",
            "language": "en",
            "summary": "As part of the World Water Day commemoration, UNICEF highlighted the importance of managing water sustainably. Glaciers have been melting at an accelerated rate due to global warming. The rise in sea level causes the loss of territory and the salinization of aquifers, putting at risk the lives and health of the population. 7 out of 10 households in the Dominican Republic receive piped water. 1 in 10 households receive it only once a week."
        },
        {
            "published_date": "2025-03-23T10:45:30",
            "title": "Scientists sound the alarm after uncovering surprising factor threatening California coasts: 'The land is moving down'",
            "author": "Yei Ling Ma",
            "url": "https://www.yahoo.com/news/scientists-sound-alarm-uncovering-surprising-104530380.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/3Wk5b9bT7UHc.27b2aFIJg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/d4aa3d83750f3ea4c907f47cda01cc4a",
            "country": "US",
            "language": "en",
            "summary": "According to NASA-led study, sea levels are rising in California and land is sinking in the San Francisco Bay Area. Land sinking is caused by overpumping of groundwater used for drinking and irrigation. Human activities have polluted the atmosphere with harmful gases that prevent solar heat from escaping, warming the planet and causing sea levels to rise."
        },
        {
            "published_date": "2025-03-23T10:31:28",
            "title": "UN Chief urges all countries to invest in climate early warning systems",
            "author": "MAWUSI Afele",
            "url": "http://www.panapress.com/UN-Chief-urges-all-countries-to-a_630776627-lang2.html",
            "url_media": "https://www.panapress.com/img/logo.png",
            "country": "SN",
            "language": "en",
            "summary": "UN Secretary-General Antonio Guterres urges all countries to invest in climate early warning systems. Panafrican News Agency is based in Touba Almadies (Mamelles) in Dakar, Senegal. It's at P.O. Box 4056 - Dakar – Senegal."
        },
        {
            "published_date": "2025-03-23T10:25:00",
            "title": "Oman marks World Metrological Day",
            "author": "ONA",
            "url": "https://timesofoman.com/article/156211-oman-marks-world-metrological-day",
            "url_media": "https://shabiba.eu-central-1.linodeobjects.com/2025/03/1742725516-1742725515-y9xpjrfg6zpx-700x400.jpg",
            "country": "OM",
            "language": "en",
            "summary": "This year's World Metrological Day is themed 'Closing the early warning gap together'. It aims to minimize the effects resulting from cyclones, storms and floods. The World Meteorological Organization confirmed that 2024 was the hottest year since records began. The UN Early Warnings for All initiative aims to protect communities everywhere through a warning system by 2027. The National Multi-Hazard Early Warning Centre was established in 2004 and officially launched in 2015."
        },
        {
            "published_date": "2025-03-23T10:00:00",
            "title": "Climate change can't be canceled: It's right outside our doors",
            "author": "Mike Tidwell",
            "url": "https://www.ajc.com/opinion/mike-tidwell-climate-change-cant-be-canceled-its-right-outside-our-doors/2ZHEVG3B2FDFRH6VO3W3B4QQIY",
            "url_media": "https://www.ajc.com/resizer/v2/ZBKVFM7WLZCHHG4RYEUWHRBAMQ.jpg?auth=dc8b7a1a8c90c135736f2813ad64780f2d3ac3d012d9481353912aa945774423&width=1200&height=630&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Jimmy Carter Presidential Library and Museum canceled a lecture based on his new book about climate change. Donald Trump's administration is demanding that federal agencies delete the words 'climate change' from their websites and defund various clean energy grants. His local government in Maryland spent $45,000 to build a 200-foot-long flood berm to keep water out of the preschool in the basement of his church, a block from his house. His native Georgia is a native Georgian who grew up in Marietta. Clean energy is the solution to climate change, but we're not transitioning fast enough to clean power."
        },
        {
            "published_date": "2025-03-23T09:47:20",
            "title": "A Critical Reassessment of the Anthropogenic CO₂-Global Warming Hypothesis: Empirical Evidence Contradicts IPCC Models and Solar Forcing Assumptions",
            "author": "Joel Smalley",
            "url": "https://metatron.substack.com/p/a-critical-reassessment-of-the-anthropogenic",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5b931b1d-eec4-4101-af8c-5313456c013f_1054x435.png",
            "country": "US",
            "language": "en",
            "summary": "There is a peer-reviewed paper on alleged anthropogenic climate change with Grok3 as the lead author. The paper challenges the IPCC's consensus that human CO₂ emissions are the primary driver of observed global warming. The authors present several key arguments, including: Carbon cycle, temperature changes precede CO⁂ increases by 6-12 months, and variations in TSI better explain observed warming."
        },
        {
            "published_date": "2025-03-23T09:30:44",
            "title": "Letters: Still hope for climate  Understand homeless' plight",
            "author": "Letters to the editor",
            "url": "https://www.orlandosentinel.com/2025/03/23/letters-still-hope-for-climate-doges-hurtful-cuts-understand-homeless-plight",
            "url_media": "https://www.orlandosentinel.com/wp-content/uploads/migration/2021/07/16/KZHBTUXSMZFQRIW2HQFU4DYTMY.jpg?w=1024&h=670",
            "country": "US",
            "language": "en",
            "summary": "UN report: Past 10 years were hottest on Earth. The proposed facility which would house and provide services to the homeless who subsist near the SoDo area in Orlando should be renovated and opened as soon as possible. The homeless are human beings having fallen on hard times due to the economy, physical and mental illness, handicaps and old age. Those who oppose the facility don't realize that if it is built, they will likely see of their homeless neighbors."
        },
        {
            "published_date": "2025-03-23T09:09:50",
            "title": "Spring bird migration is underway. Here's when and what you can expect to see in NH",
            "author": "Elizabeth Weise",
            "url": "https://eu.seacoastonline.com/story/sports/outdoors/2025/03/23/spring-bird-migration-of-500-million-birds-underway-what-to-expect/82596852007",
            "url_media": "http://www.gannett-cdn.com/-mm-/ace4690b26a2f84aadcad951279e482310580fac/c=0-86-2000-1216/local/-/media/2017/09/25/Phoenix/Phoenix/636419660344976009-best-fall-things-to-do-16.jpg",
            "country": "US",
            "language": "en",
            "summary": "On peak migration days, as many as 500 million birds could be flying under cover of darkness across America. Spring migrations runs between March 1 and June 15, fall migration runs between August 1 and November 30. On March 20, 2,500 birds flew over the Seacoast."
        },
        {
            "published_date": "2025-03-23T09:09:47",
            "title": "Experts warn of impending Global Water Crisis due to Climate Change and Accelerating Ice Melt",
            "author": "Fidel Rahmati",
            "url": "https://www.khaama.com/experts-warn-of-impending-global-water-crisis-due-to-climate-change-and-accelerating-ice-melt",
            "url_media": "https://www.khaama.com/wp-content/uploads/2025/03/Afghanistan-Glaciers.jpg",
            "country": "AF",
            "language": "en",
            "summary": "Today is World Water Day. Global warming is occurring faster than previously predicted. Global temperatures could rise by 2.7°C by the end of the century unless greenhouse gas emissions are significantly reduced. Melting polar ice caps supply 70% of the world's freshwater. Global cooperation and commitment to sustainable development are the only ways to mitigate these risks."
        },
        {
            "published_date": "2025-03-23T09:04:00",
            "title": "S. Korea's southern regions set record high March temperatures amid unusually warm winds",
            "author": "Kim Seung-Yeon",
            "url": "https://en.yna.co.kr/view/AEN20250323002100315",
            "url_media": "https://img2.yna.co.kr/etc/inner/EN/2025/03/23/AEN20250323002100315_01_i_P4.jpg",
            "country": "KR",
            "language": "en",
            "summary": "Gumi in North Gyeongsang Province, 200 km southeast of Seoul, recorded highest March temperature of 28.5 C on Sunday. Daegu at 27.9 C, Andong at 25.7 C, Gyeongju 27.8 C and Incheon 26.4 C also set new records. Seoul recorded 24.0 C."
        },
        {
            "published_date": "2025-03-23T09:00:00",
            "title": "An 'uptick in song' as birds show signs of spring in Connecticut",
            "author": "Greg Hanisek",
            "url": "https://www.ctinsider.com/waterbury/article/greg-hanisek-birds-nature-spring-equinox-20230314.php",
            "url_media": "https://s.hdnux.com/photos/01/47/57/70/27196965/5/rawImage.jpg",
            "country": "PA",
            "language": "en",
            "summary": "It's spring and birds are singing. The birds' song increases after the vernal equinox. Days have been getting longer for a couple of months, so the birds' response builds gradually rather than bursting forth on the day when the sun crosses the celestial equator. Photo period is critical for birds' nesting and migration."
        },
        {
            "published_date": "2025-03-23T08:07:00",
            "title": "The state of the climate: from bad to worse",
            "author": "Carmel Cacopardo",
            "url": "https://www.independent.com.mt/articles/2025-03-23/blogs-opinions/The-state-of-the-climate-from-bad-to-worse-6736268748",
            "url_media": "https://www.independent.com.mt/file.aspx?f=180673",
            "country": "MT",
            "language": "en",
            "summary": "The ten hottest years on record have all occurred within the last decade. The Paris Climate Summit agreed threshold of limiting temperature increase to not more than 1.5 degrees Celsius above pre-industrial levels was breached in 2024. The weather is getting warmer earlier and for longer stretches and the seasons are changing. Agriculture is affected by the ever-changing rainfall pattern and the temperature changes. Carnival Cruises will be making use of the shore-to-ship energy infrastructure recently installed in Malta's Grand Harbour after a substantial EU funds."
        },
        {
            "published_date": "2025-03-23T07:42:00",
            "title": "Landmarks go dark as millions join global Earth Hour",
            "author": "Deutsche Presse-Agentur",
            "url": "https://www.dailysabah.com/life/environment/landmarks-go-dark-as-millions-join-global-earth-hour",
            "url_media": "https://idsb.tmgrup.com.tr/2020/03/12/1584014134872.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Iconic landmarks and city skylines around the world went dark on Saturday as part of the Earth Hour campaign by World Wildlife Fund (WWF) to draw attention to climate change and halt nature loss. The rolling blackout began in New Zealand, where Auckland's Sky Tower and Harbour Bridge, along with Wellington's parliament buildings, were plunged into darkness at 8:30 p.m."
        },
        {
            "published_date": "2025-03-23T07:14:06",
            "title": "The state of the climate: from bad to worse",
            "author": "The Malta Independent",
            "url": "https://article.wn.com/view/2025/03/23/The_state_of_the_climate_from_bad_to_worse",
            "url_media": "https://article.wn.com/view/2025/03/23/[]",
            "country": "US",
            "language": "en",
            "summary": "The ten hottest years on record have all occurred within the last decade, according to The State of the Global Climate 2024, a report issued annually by the. The report was published earlier this week. Each of the last ten years has been the warmest on record."
        },
        {
            "published_date": "2025-03-23T07:02:17",
            "title": "New canal projects could worsen water crisis, says CM Sindh",
            "author": "Monitoring Desk",
            "url": "https://profit.pakistantoday.com.pk/2025/03/23/new-canal-projects-could-worsen-water-crisis-says-cm-sindh",
            "url_media": "https://profit.pakistantoday.com.pk/wp-content/uploads/2019/05/Murad-Ali-Shah.jpg",
            "country": "PK",
            "language": "en",
            "summary": "On World Water Day, Sindh Chief Minister Syed Murad Ali Shah raised concerns over the declining flow of the Indus River. He warned that the worsening water crisis could severely impact agriculture, livelihoods and economic stability in the province. Shah announced a provincial strategy for water conservation and urged the public to minimize waste."
        },
        {
            "published_date": "2025-03-23T07:00:00",
            "title": "Balearic Islands panic as half of archipelago's beaches ‘could disappear' within years",
            "author": "Maria Ortega",
            "url": "https://www.express.co.uk/news/world/2029545/balearic-islands-beaches-disappear-within-years",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6034363.jpg",
            "country": "GB",
            "language": "en",
            "summary": "New research suggests that 50% of Balearic beaches could disappear before the end of the century. The blame lies with climate change and poor human habits. Sea levels in the Balearics have risen by nine centimetres since 1993. The sea temperature has also risen by up to 1.6C over the last 40 years. Extreme storms could increase in the future, raising extreme sea levels."
        },
        {
            "published_date": "2025-03-23T06:59:37",
            "title": "Climate-responsive artwork installed in Gurgaon, to melt at..., IMD predicts above normal heatwaves",
            "author": "Apurwa Amit",
            "url": "https://www.dnaindia.com/lifestyle/report-climate-responsive-artwork-installed-in-gurgaon-to-melt-at-53-c-imd-predicts-above-normal-heatwaves-3140386",
            "url_media": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2025/03/23/2684271-climate-responsive-artwork-installed-in-gurgaon.jpg",
            "country": "IN",
            "language": "en",
            "summary": "IMD's 2025 summer forecast has predicted above-normal heatwave days from March to May, with temperatures potentially rising 4.5 degrees Celsius or more above normal. Below2° is a climate-responsive art installation at Karma Lakelands, Gurgaon, created by artist Aakash Ranison with ideation and execution by the Greener Earth Foundation. It is made from 1,000 repurposed golf balls and wax that melts at 53°C."
        },
        {
            "published_date": "2025-03-23T06:23:30",
            "title": "Traffic noise makes birds aggressive, Cambridge researchers find",
            "author": "Alice Cunningham",
            "url": "https://www.bbc.com/news/articles/czxnqexdy9qo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/6ec8/live/1100fc60-072f-11f0-89cc-0d80fc5d07b9.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Birds become more aggressive when exposed to traffic noise, according to Anglia Ruskin University experts. They studied the impact of vehicle noise pollution on yellow warblers in the Galapagos Islands. The study also included experts from the Konrad Lorenz Research Centre at the University of Vienna."
        },
        {
            "published_date": "2025-03-23T06:10:11",
            "title": "Expert Canvasses Special Fund To Combat Effects Of Climate Change",
            "author": "Daily Independent",
            "url": "https://www.latestnigeriannews.com/p/4206772/expert-canvasses-special-fund-to-combat-effects-of-climate-change.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Professor Okeke Gerald Ndubuisi received the global award in the Climate Change and Environmental Sustainability category at the Global and Ambassadorship Award in Lagos. He was fielding questions from journalists at the event. He urged the government to create a special fund to combat climate change in Nigeria."
        },
        {
            "published_date": "2025-03-23T06:05:48",
            "title": "UN stresses the critical need for protecting Afghanistan's Glaciers",
            "author": "Fidel Rahmati",
            "url": "https://www.khaama.com/un-stresses-the-critical-need-for-protecting-afghanistans-glaciers",
            "url_media": "https://www.khaama.com/wp-content/uploads/2025/03/Afghanistan-galciers.jpg",
            "country": "AF",
            "language": "en",
            "summary": "Afghanistan's glaciers are one of the most crucial sources of water for agriculture and surrounding areas. The FAO has called for immediate action to protect Afghanistan's glaciers and urged sustainable planning for water resource management in the country. If serious measures are not taken to reduce the impacts of climate change and manage water resources, Afghanistan could face a severe water shortage."
        },
        {
            "published_date": "2025-03-23T06:00:20",
            "title": "'Muirburn does reduce fire risk' - Scottish fire service calls on landowners to be vigilant in wildfire season",
            "author": "Rural Affairs Correspondent",
            "url": "https://www.scotsman.com/hays-way/muirburn-does-reduce-fire-risk-scottish-fire-service-calls-on-landowners-to-be-vigilant-in-wildfire-season-5045414",
            "url_media": "https://www.scotsman.com/webimg/b25lY21zOjIyNWMzM2M3LTgwMzAtNDE0Mi04NjNhLTllYTFlYzhhMzEyODoxNWFmMmQ1YS01MTZkLTQyYjYtYjY4MS05YWUyNjkzNzUyOWU=.jpg?width=580&auto=webp&quality=75&crop=3:2,smart&trim=",
            "country": "GB",
            "language": "en",
            "summary": "Weather conditions in spring can lead to the outbreak of wildfires across Scotland. Several warnings have been issued in the last two months, with crews attending at least one wildfire near Inverness on Friday. The main cause of wildfires in Scotland is human-related. Muirburn is the controlled burning of moorland vegetation between September and March to encourage new growth. It has been used for generations to prevent wildfires."
        },
        {
            "published_date": "2025-03-23T05:52:59",
            "title": "Landmarks around the world go dark for Earth Hour",
            "author": "Staff Writers",
            "url": "https://thewest.com.au/news/environment/landmarks-around-the-world-go-dark-for-earth-hour-c-18132788",
            "url_media": "https://images.thewest.com.au/publication/C-18132788/35924a8287a453fd04a34db69206ba80995e9e3b-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "The rolling blackout began in New Zealand at 8.30 pm on Saturday. The Sydney Opera House, Singapore's Gardens by the Bay, Bangkok's Wat Arun temple, Berlin's Brandenburg Gate, Rome's Colosseum and the London Eye went dark, followed by Christ the Redeemer statue in Rio de Janeiro and the Empire State Building in New York."
        },
        {
            "published_date": "2025-03-23T05:51:01",
            "title": "Landmarks around the world go dark for Earth Hour",
            "author": "",
            "url": "https://www.newcastleherald.com.au/story/8923856/landmarks-around-the-world-go-dark-for-earth-hour",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/caf3a345-81db-4e19-a7fd-28038cb4694e.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Iconic landmarks and city skylines around the world have gone dark as millions joined Earth Hour. The rolling blackout began in New Zealand, where Auckland's Sky Tower and Harbour Bridge and Wellington's parliament buildings were plunged into darkness at 8.30pm on Saturday. The Earth Hour campaign, which began in Australia in 2007, has grown into a global movement."
        },
        {
            "published_date": "2025-03-23T05:51:01",
            "title": "Landmarks around the world go dark for Earth Hour",
            "author": "",
            "url": "https://www.bordermail.com.au/story/8923856/landmarks-around-the-world-go-dark-for-earth-hour",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/caf3a345-81db-4e19-a7fd-28038cb4694e.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Millions have joined the Earth Hour campaign by World Wildlife Fund. The campaign is calling for urgent action to tackle climate change and halt nature loss. Iconic landmarks and city skylines around the world have gone dark as a result of the campaign.  "
        },
        {
            "published_date": "2025-03-23T05:23:46",
            "title": "Water supply of 90 mn people under threat?",
            "author": "",
            "url": "https://www.ahmedabadmirror.com/water-supply-of-90-mn-people-under-threat/81887768.html",
            "url_media": "https://media.ahmedabadmirror.com/am/uploads/mediaGallery/image/1742706863857.jpg-org",
            "country": "IN",
            "language": "en",
            "summary": "Andean glaciers are thinning by 0.7 metres a year, 35% faster than the global average. The glaciers provide water for domestic consumption, hydroelectric power, industry, irrigation of arable crops and supporting livestock farming in Argentina, Chile, Bolivia, Peru, Ecuador and Colombia. A new policy brief was presented at the first-ever World Day for Glaciers hosted by UNESCO in Paris."
        },
        {
            "published_date": "2025-03-23T04:47:17",
            "title": "Building a Climate-Resilient Future: Grounded Policies and Inclusive Adaptation",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3318287-building-a-climate-resilient-future-grounded-policies-and-inclusive-adaptation",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/29_08_2024_07_31_31_1219814.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Kirti Vardhan Singh has stressed the need for policies addressing climate change to be grounded in realities and inclusive adaptation strategies across all governance levels. He was speaking at the symposium's conclusion. Experts urged for comprehensive data collection, an interdisciplinary approach, and technological advances."
        },
        {
            "published_date": "2025-03-23T04:07:09",
            "title": "World Meteorological Day:  Oman's Early Warning for All initiative",
            "author": "Observer Web Team",
            "url": "https://www.omanobserver.om/article/1168055/oman/weather/world-meteorological-day-omans-early-warning-for-all-initiative",
            "url_media": "https://www.omanobserver.om/omanobserver/uploads/images/2025/03/23/thumbs/600x600/2961830.jpg",
            "country": "OM",
            "language": "en",
            "summary": "The World Meteorological Organization (WMO) confirmed that 2024 was the hottest year since records began. The frequency of tropical cyclones, which rapidly intensify after their formation, is increasing, as are devastating rainfall, storm surges, floods, deadly droughts, and wildfires. The Early Warning for All initiative aims to protect society everywhere through a warning system by 2027."
        },
        {
            "published_date": "2025-03-23T03:47:07",
            "title": "Heavy rain and flood warning issued for PNG",
            "author": "Gregory Wesley",
            "url": "https://www.postcourier.com.pg/heavy-rain-and-flood-warning-issued-for-png",
            "url_media": "https://www.postcourier.com.pg/wp-content/uploads/2025/03/Copy-of-Add-a-subheading-2025-03-23T134548.650.png",
            "country": "PG",
            "language": "en",
            "summary": "The Papua New Guinea National Weather Service has issued a renewal of heavy rain and Potential flood warning for parts of the country. Warning areas include Western, Gulf, Central/NCD, Milne Bay, East and West Sepik, Madang and Morobe, Parts of the Highlands region and West New Britain Province. There is a potential for riverine and flash floods over the warning areas within the next 24 hours."
        },
        {
            "published_date": "2025-03-23T03:05:29",
            "title": "Village Rhapsody: Zimbabwe's bold step against climate change",
            "author": "Gary Gerald Mtombeni",
            "url": "https://www.thestandard.co.zw/standard-people/article/200039898/village-rhapsody-zimbabwes-bold-step-against-climate-change",
            "url_media": "https://cdn.thestandard.co.zw/images/thestandard/uploads/2025/03/6tQ8xFvfZ1LW68fft6WTS5aNQlR4PGholJzbGi0P.gif",
            "country": "ZW",
            "language": "en",
            "summary": "Zimbabwe is at a pivotal juncture in its development trajectory. The Climate Change Management Bill aims to provide a comprehensive and legally binding framework for climate action. The Bill's focus on mitigating greenhouse gas emissions and promoting sustainable development can stimulate economic growth and attract investment in clean energy technologies. It can also promote sustainable practices across various sectors."
        },
        {
            "published_date": "2025-03-23T02:38:08",
            "title": "Singapore's hottest year meets record rainfall in 2024, says weatherman",
            "author": "Malay Mail",
            "url": "https://malaysia.news.yahoo.com/singapore-hottest-meets-record-rainfall-023808545.html",
            "url_media": "https://media.zenfs.com/en/mmail.com.my/e57ad426a019840ec780821ad7994082",
            "country": "US",
            "language": "en",
            "summary": "Singapore experienced an exceptional year of weather extremes in 2024, with record-breaking heat and unusual rainfall patterns. The year tied with 2019 and 2016 as the hottest on record, with an annual mean temperature of 28.4°C. The total rainfall for the year stood at 2,739.8mm, exceeding the long-term average of 2,534.3mm."
        },
        {
            "published_date": "2025-03-23T02:00:00",
            "title": "S'pore weather breaks 2024 temperature and rainfall records: MSS report",
            "author": "Shabana Begum",
            "url": "https://www.straitstimes.com/singapore/spore-weather-broke-temperature-and-rainfall-records-in-2024-mss-report",
            "url_media": "https://cassette.sphdigital.com.sg/image/straitstimes/799b24b4c823f104b0baa7000840aec2577c5edc94b421cd15fef9a99623d76a",
            "country": "SG",
            "language": "en",
            "summary": "2014 was the warmest year in Singapore, tying with 2019 and 2016, with temperatures hitting an annual mean of 28.4 deg C. The wettest November in more than 40 years was recorded in 2024, with an islandwide average rainfall of 419mm. Experts say it is difficult to detect the fingerprints of climate change on rain events in Singapore."
        },
        {
            "published_date": "2025-03-23T01:33:03",
            "title": "Tyler Audubon Society recommends cleaning bird feeders during migration",
            "author": "Michael Garcia",
            "url": "https://www.ketk.com/news/outdoors/tyler-audubon-society-recommends-cleaning-bird-feeders-during-migration",
            "url_media": "https://www.ketk.com/wp-content/uploads/sites/34/2025/03/6E6961D17EF60BC6AA68B904EB9BFEA5.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "The Tyler Audubon Society is a group dedicated to preserving the habitats of local birds and wildlife. The current bird flu strain is only infecting birds raised in poultry farms. Cleaning bird feeders is a good idea no matter what. Anyone handling a bird feeder should wash their hands afterwards."
        },
        {
            "published_date": "2025-03-23T01:29:00",
            "title": "Global landmarks go dark for Earth Hour",
            "author": "Karl Sexton",
            "url": "https://uk.news.yahoo.com/global-landmarks-dark-earth-hour-012900129.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/124S9BdB24ey9cvPU6o2MA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/deutsche_welle_articles_124/3732d45f0c4b61b8db26a3c36aa2de92",
            "country": "US",
            "language": "en",
            "summary": "The Sky Tower and Harbour Bridge in Auckland, New Zealand were the first to go dark at 8:30 pm local time (7:30 am GMT) on Saturday. Other landmarks in Asia and Europe followed suit as the clock struck 8.30 pm, including the Sydney Opera House, the Gardens by the Bay park in Singapore, Wat Arun temple in Bangkok, Berlin's Brandenburg Gate, the Colosseum in Rome and the London Eye in the UK."
        },
        {
            "published_date": "2025-03-23T01:00:00",
            "title": "If you have climate crisis proof, show it",
            "author": "",
            "url": "https://bonnercountydailybee.com/news/2025/mar/23/if-you-have-climate-crisis-proof-show-it",
            "url_media": "https://hagadone.media.clients.ellingtoncms.com/static-4/dailybee/images/default-social.jpg?v=2",
            "country": "US",
            "language": "en",
            "summary": "Lawrence Fury wrote a letter in the Daily Bee on March 6, 2025. He claims there is a 97 to 99 percent consensus among climate scientists that life on earth is in imminent danger of ending due to human-caused CO 2 emissions. Monte Heil wants to know the names of the climate scientists and their qualifications."
        },
        {
            "published_date": "2025-03-23T00:46:49",
            "title": "Up in arms against more canals",
            "author": "Kamran Khamiso Khowaja",
            "url": "https://www.thenews.com.pk/tns/detail/1294299-up-in-arms-against-more-canals",
            "url_media": "https://www.thenews.com.pk/assets/uploads/tns/2025-03-23/1294299_041041_tns.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The coastal areas of Sindh have not been receiving adequate amounts of fresh water for the past two decades. The inconsistent supply of water has affected irrigated agriculture in the coastal region and triggered sea intrusion. Activists say implementation of the 1991 Water Accord has been inconsistent over the decades, which has caused economic losses to farmers and environmental degradation in Sindh."
        },
        {
            "published_date": "2025-03-23T00:32:43",
            "title": "BVI premier hails St. Martin's entry into OECS as ‘historic'",
            "author": "Sheri-Kae Mcleod",
            "url": "https://www.caribbeannationalweekly.com/news/bvi-premier-hails-st-martins-entry-into-oecs-as-historic",
            "url_media": "https://www.caribbeannationalweekly.com/wp-content/uploads/2022/04/Official-Photo-Deputy-Premier-Dr.-Hon.-Natalio-Wheatley.jpg",
            "country": "US",
            "language": "en",
            "summary": "St. Martin joined the Organisation of Eastern Caribbean States (OECS) earlier this week. It joins Guadeloupe and Martinique as French territories within the OECS. British Virgin Islands (BVI) Premier Dr. Natalio Wheatley has welcomed St. Martin's accession as it strengthens regional cooperation amid growing global challenges."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Uttarakhand facing climate change impact at ‘twice the global rate', warn experts",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/03/23/Uttarakhand_facing_climate_change_impact_at_twice_the_global",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Uttarakhand is experiencing climate change impacts at almost twice the global rate, making it one of the most disaster-prone regions in India. The concerns were raised during the unveiling of the second edition of 'Making Molehills of Mountains: Tales of Uttarakhand'."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Bihar farmers embrace climate-smart practices to combat unpredictable weather patterns",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/03/23/Bihar_farmers_embrace_climatesmart_practices_to_combat_unpre",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change has upended agriculture in Bihar. Farmers are fighting back with climate-resilient techniques that are reshaping the future of agriculture in the state. The traditional farming practices in Bihar have been thrown into disarray due to erratic rainfall, frequent droughts and devastating floods."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Walton: For SS United States, a burial at sea",
            "author": "Toledo Blade",
            "url": "https://article.wn.com/view/2025/03/23/Walton_For_SS_United_States_a_burial_at_sea",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sometime later this year, probably in the fall, the people along the Florida panhandle will bear the brunt of the storm.    “The storm will come to the panhandle later this fall or in the next few months.” "
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "We're at a turning point in world history but our leaders are distracted",
            "author": "system",
            "url": "https://article.wn.com/view/2025/03/23/Were_at_a_turning_point_in_world_history_but_our_leaders_are",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There are non-existent nuclear power stations and power bills, but pressing issues like global warming and AI are being ignored in Australia's political discourse. US retreat, global warming, AI and the great US retreat are also being ignored.   .  "
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "‘Climate-resilient farming need of hour in Bihar'",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/03/23/Climateresilient_farming_need_of_hour_in_Bihar",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change poses a serious threat to various sectors, especially agriculture in Bihar. The state's agriculture department secretary, Sanjay Kumar Agrawal, talks to TOI's Sheezan Nezami about its impact and the need for climate-resilient farming."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "2025 SPRING FARM EDITION: An uncertain year ahead for farmers – but what else is new?",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/03/23/2025_SPRING_FARM_EDITION_An_uncertain_year_ahead_for_farmers",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "South Carolina Agriculture Commissioner Hugh Weathers visited Washington, DC. Weathers discusses uncertainty in agriculture, potential bright spots, labor issues, and economic aid following visits to Washington, D.C. and South Carolina's potential future in the agriculture industry.   "
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Residents share concerns about local climate with state environmental department",
            "author": "Standard-Speaker",
            "url": "https://article.wn.com/view/2025/03/23/Residents_share_concerns_about_local_climate_with_state_envi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There's too much traffic and too little recycling, people said when asked about what worried them most about climate change in Hawkinston. The most common answer was traffic and recycling, followed by climate change. The least common one was the environment in general, and then the number of people recycling."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Manitowoc outdoors report has details of a spring migration bird hike \\u0026 more news",
            "author": "Herald Times Reporter",
            "url": "https://article.wn.com/view/2025/03/23/Manitowoc_outdoors_report_has_details_of_a_spring_migration_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Lifestyle Glacial Lakes Conservancy will hold a spring migration bird hike starting at 7:30 a.m. Bird-watching is the practice of observing, listening to, pursuing and admiring birds in their natural habitats. The conservancy's restoration projects and education programs depend on this funding."
        },
        {
            "published_date": "2025-03-23T00:00:00",
            "title": "Global cooperation, humanity's only way to avert global climate crisis, says UNFCCC executive secretary",
            "author": "Cheryl",
            "url": "https://www.newsgd.com/node_e75cadc545/23ece8aa99.shtml",
            "url_media": "https://nfassetoss.southcn.com/__asset/315a179d74/e7b7bbfdf0.jpg",
            "country": "CN",
            "language": "en",
            "summary": "Simon Stiell is the executive secretary of the UN Framework Convention on Climate Change (UNFCCC). He believes that global cooperation is humanity's only way to avert global climate crisis. He is on a visit to China from Wednesday to Saturday. China's solar energy capacity alone exceeds the combined total of the United States and Japan."
        }
    ]
}