{
    "status": "ok",
    "total_articles": 68,
    "articles": [
        {
            "published_date": "2025-03-29T23:27:47",
            "title": "Water governance for climate adaptation",
            "author": "Ali Tauqeer Sheikh",
            "url": "https://www.thenews.com.pk/tns/detail/1296447-water-governance-for-climate-adaptation",
            "url_media": "https://www.thenews.com.pk/assets/uploads/tns/2025-03-30/1296447_025338_tns.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's 2018 National Water Policy is the country's first comprehensive water governance framework. Climate change threatens Pakistan's water security. Provincial water policies show variable integration with climate imperatives. Water sector carbon footprint remains under-assessed despite its significance in Pakistan's economy."
        },
        {
            "published_date": "2025-03-29T22:50:00",
            "title": "Glaciers have lost 9,000 billion tons since 1975",
            "author": "JERUSALEM POST STAFF",
            "url": "https://www.jpost.com/science/science-around-the-world/article-847802",
            "url_media": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/656267",
            "country": "IL",
            "language": "en",
            "summary": "On March 21, the UN declared the new International Day of Glaciers to raise awareness about their vital role in the climate system. Five out of the past six years saw the most rapid glacier retreat on record. The period from 2022 to 2024 experienced the largest-ever three-year loss of glacier mass. In 2022 alone, an estimated 450 billion tons of ice was lost, making it the fourth-highest record ever observed. Glaciers hold about 70 percent of the world's freshwater reserves. They act as \"water towers\" that sustain millions of people."
        },
        {
            "published_date": "2025-03-29T21:00:05",
            "title": "Thunderstorms likely over coastal AP and Rayalaseema from April 1 to April 5",
            "author": "Laxmi Pranathi",
            "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/thunderstorms-likely-over-coastal-ap-and-rayalaseema-from-april-1-to-april-5-1869800",
            "url_media": "https://www.deccanchronicle.com/h-upload/2025/03/29/1902760-29pnm07.jpg",
            "country": "IN",
            "language": "en",
            "summary": "IMD issues weather forecast for Coastal Andhra Pradesh, Yanam, South Coastal andhra Pradesh (SCAP) and Rayalaseema from April 1 to April 5. The forecast comes amid reports of above-normal temperatures currently gripping the region, with some areas already recording highs exceeding 42°C."
        },
        {
            "published_date": "2025-03-29T20:17:14",
            "title": "Pakistan's climate hope",
            "author": "Mirza Mujtaba Baig",
            "url": "https://tribune.com.pk/story/2537128/pakistans-climate-hope",
            "url_media": "https://i.tribune.com.pk/media/images/Mirza-Mujtaba-Baig1727731269-0/Mirza-Mujtaba-Baig1727731269-0.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan is falling short of its goal to limit global temperature increases to 1.5 degrees Celsius. Developed nations are ill-equipped to handle the escalating impacts of climate change. The younger generation is preparing to take action against climate change, especially in Punjab and Gilgit-Baltistan."
        },
        {
            "published_date": "2025-03-29T19:50:00",
            "title": "Glaciers have lost 9,000 billion tons since 1975",
            "author": "JERUSALEM POST STAFF",
            "url": "https://www.msn.com/en-us/weather/topstories/glaciers-have-lost-9-000-billion-tons-since-1975/ar-AA1BUIeE",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "On March 21, the UN declared the new International Day of Glaciers to raise awareness about their vital role in the climate system. Five out of the past six years saw the most rapid glacier retreat on record. The period from 2022 to 2024 experienced the largest-ever three-year loss of glacier mass. In 2022 alone, an estimated 450 billion tons of ice was lost, making it the fourth-highest record ever observed. Glaciers, together with the ice sheets of Greenland and Antarctica, hold about 70 percent of the world's freshwater reserves."
        },
        {
            "published_date": "2025-03-29T18:34:35",
            "title": "Climate change drives malaria surge in Kigezi, experts warn of growing health risks",
            "author": "",
            "url": "https://ntv.co.ug/ug/news/national/climate-change-drives-malaria-surge-in-kigezi-experts-warn-of-growing-health-risks-4983822",
            "url_media": "https://www.ntv.co.ug/resource/blob/4983808/f0fa1ba7a7d1569d2ba26207dae35293/kabale-data.png",
            "country": "UG",
            "language": "en",
            "summary": "Climate change has had profound effects on various regions in Uganda. The Kigezi sub-region is no exception. The warming climate has expanded the breeding grounds for mosquitoes, increasing malaria transmission in highland areas. Health experts warn that if climate change trends continue, the burden of vector-borne diseases in high-altitude areas will likely worsen."
        },
        {
            "published_date": "2025-03-29T18:30:00",
            "title": "Urban Heat Islands Triggering Temp Rise In Cities: Scientist",
            "author": "Sarfaraz Ahmed",
            "url": "https://timesofindia.indiatimes.com/city/nagpur/urban-heat-islands-triggering-temp-rise-in-cities-scientist/articleshow/119722610.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-119722607,width-1070,height-580,imgsize-119320,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Dr Rizwan Ahmed is a scientist at the Aerodrome Meteorological Office, Regional Meteorological Centre, Nagpur. He was speaking at a one-day conference organised by the Disaster Management Authority of Maharashtra govt at Washim. He presented a forecast for March to May 2025, based on initial conditions from January 2025, predicting that maximum temperatures will remain above normal during this period. He also discussed the far-reaching impacts of heatwaves on public health, agriculture and the energy sector."
        },
        {
            "published_date": "2025-03-29T18:00:46",
            "title": "Antarctic sea ice shrinks to a near-record low amid climate concerns",
            "author": "JONATHAN CHADWICK",
            "url": "https://www.dailymail.co.uk/galleries/article-14547455/Antarctic-sea-ice-shrinks-near-record-low-amid-climate-concerns.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/03/28/10/96667969-0-image-a-14_1743159445329.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Antarctic sea ice has reached its minimum extent for the year on 25 February, covering 722,000 sq miles (1.87 million sq km). This is the seventh lowest minimum extent on record, tied with 2024, and eight per cent below the 1993–2010 long-term average. Experts say it's decreasing overall due to global warming, largely due to humans burning fossil fuels. Arctic sea ice reached its maximum extent on March 22, 2018."
        },
        {
            "published_date": "2025-03-29T18:00:00",
            "title": "Climate science shows Australia's weather is becoming more extreme as Dorothea Mackellar's 'country of droughts and flooding plains' takes on new meaning",
            "author": "Rob Sharpe",
            "url": "https://www.skynews.com.au/australia-news/weather/climate-science-shows-australias-weather-is-becoming-more-extreme-as-dorothea-mackellars-country-of-droughts-and-flooding-plains-takes-on-new-meaning/news-story/7572d121bbd443670bc38a5144b00a18",
            "url_media": "https://content.api.news/v3/images/bin/ac21461e7d02122f64977da1b4a9c393",
            "country": "AU",
            "language": "en",
            "summary": "This week Australia has seen record autumn heat in the west and flooding rain in Queensland as the south battles an intensifying drought. Dorothea Mackellar wrote her famous poem 'My Country' in England in 1904 when she was 19. Since then Australia has experienced a string of droughts and floods. The climate is changing faster than before Federation."
        },
        {
            "published_date": "2025-03-29T17:47:14",
            "title": "B.C. climate news: Merritt gets $60 million from B.C. government to improve flood protection  Renewable energy jumps to new high, powered by China solar boom",
            "author": "Tiffany Crawford",
            "url": "https://vancouversun.com/news/bc-climate-change-news-to-march-30-2025",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/2206653859_294677070.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The Intergovernmental Panel on Climate Change says humans are the main drivers of climate change. It warns the window to limit warming to 1.5 C above pre-industrial times is closing. The Earth is about 1.3 C warmer than it was in the 1800s. The past 10 years are the 10 warmest years on record."
        },
        {
            "published_date": "2025-03-29T17:39:38",
            "title": "Anybody have soil desiccation on their climate bingo card?Updated",
            "author": "Robpos",
            "url": "https://www.dailykos.com/stories/2025/3/29/2313301/-Anybody-have-soil-desiccation-on-their-climate-bingo-card",
            "url_media": "https://cdn.prod.dailykos.com/images/954029/story_image/DesertSunset.jpg?1622924978",
            "country": "US",
            "language": "en",
            "summary": "The amount of water stored on Earth's continents has declined at such staggering levels that changes are likely irreversible while humans are alive. The biggest losses of soil moisture occurred between 2002 and 2006, totaling about 1600 gigatons (1.6 trillion tons) of water from the land."
        },
        {
            "published_date": "2025-03-29T17:12:35",
            "title": "Latin America and the Caribbean Face Devastating Climate Impacts in 2024",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3327270-latin-america-and-the-caribbean-face-devastating-climate-impacts-in-2024",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_03_2025_15_03_35_7559626.webp?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "In 2024, the mean temperature in Latin America and the Caribbean was +0.90 °C above the 1991–2020 average. Central America and Caribbean experienced their hottest year on record, while Mexico and South America saw their first or second hottest years. Glaciers continued their alarming retreat, affecting millions who rely on them for freshwater. The growing role of renewable energy is another bright spot, with the region achieving nearly 69% renewable energy in its power mix and experiencing a 30% surge in solar and wind energy capacity."
        },
        {
            "published_date": "2025-03-29T17:00:00",
            "title": "The Paris climate agreement is dead — time to bury it for good",
            "author": "H. Sterling Burnett",
            "url": "https://www.theblaze.com/columns/opinion/the-paris-climate-agreement-is-dead-time-to-bury-it-for-good",
            "url_media": "https://www.theblaze.com/media-library/the-paris-climate-agreement-is-dead-time-to-bury-it-for-good.jpg?id=59702983&width=1200&height=600&coordinates=0%2C85%2C0%2C86",
            "country": "US",
            "language": "en",
            "summary": "The Paris climate agreement was doomed to fail from the start. The structure of the agreement itself ensured it would be ineffective in preventing greenhouse gas emissions from rising. Even if every country fully complied with its Paris agreement targets, global temperatures would still rise by 3 degrees Celsius by 2100. Of the nearly 200 countries that signed the agreement, only 10 submitted their updated carbon reduction commitments by the deadline."
        },
        {
            "published_date": "2025-03-29T16:52:39",
            "title": "Hummingbird migration tracker: See how close these tiny birds are getting to Michigan",
            "author": "Justine Lofton",
            "url": "https://www.mlive.com/life/2025/03/hummingbird-migration-tracker-see-how-close-these-tiny-birds-are-getting-to-michigan.html",
            "url_media": "https://www.mlive.com/resizer/v2/5ETXPHFGQZHDPAANALLBOLL5JE.JPG?auth=3d55736dcbdefc3b194e62bee3f5df7896f37506fce2b246a00972b38279af24&width=1280&quality=90",
            "country": "US",
            "language": "en",
            "summary": "As of Saturday, March 29, hummingbirds have been sighted as far north as Tennessee, closing in on the Kentucky border. Hummingbirds prepare for the migration by gaining 25-40% of their body weight. They travel by day, flying low to find nectar sources and up to 23 miles per day."
        },
        {
            "published_date": "2025-03-29T16:04:01",
            "title": "As the Arctic's Winter Sea Ice Hits a New Record Low",
            "author": "Slashdot",
            "url": "https://www.latestnigeriannews.com/p/4222429/as-the-arctics-winter-sea-ice-hits-a-new-record-low-what-happens-next.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "The extent of sea ice in the Arctic this winter fell to the lowest level on record, according to the National Snow and Ice Data Center. The consequences would be dire for seals, polar bears and other wildlife that depend on a stable sea ice platform to birth their young and hunt for food. Earth is missing an area large enough to cover the entire continental United States east of the Mississippi."
        },
        {
            "published_date": "2025-03-29T16:03:46",
            "title": "City of Bradenton takes First Step toward Amending Rules for Redevelopment in Coastal High Hazard Areas",
            "author": "Dawn Kitterman",
            "url": "https://thebradentontimes.com/stories/city-of-bradenton-takes-first-step-toward-amending-rules-for-redevelopment-in-coastal-high-hazard,135032",
            "url_media": "https://zeta.creativecirclecdn.com/bradenton/original/20250328-214559-f0d-BCC%20staff%20report.JPG",
            "country": "US",
            "language": "en",
            "summary": "Westminster Communities of Florida wants to expand and redevelop the Westminster Point Pleasant location in downtown Bradenton along the Manatee River near the mouth of Wares Creek. Westminster's application for a zoning change and density increase means the comprehensive plan rules would need to be changed for the applications to move forward. Bradenton's Comprehensive Plan, Future Land Use Element, Objective 1.5.2 'Hurricane Evacuation Zone' states that the city'shall deny' requests for density increases for properties within the CHHA."
        },
        {
            "published_date": "2025-03-29T16:02:04",
            "title": "As the Arctic's Winter Sea Ice Hits a New Record Low - What Happens Next?",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/as-the-arctic-s-winter-sea-ice-hits-a-new-record-low-what-happens-next-8cdc98433ec4b77f5fcddda6035977802c5ab6ca",
            "url_media": "https://a.fsdn.com/sd/topics/earth_64.png",
            "country": "FR",
            "language": "en",
            "summary": "This year sea ice fell 30% below the amount typical in the Antarctic prior to 2010. Since then, the ice has already begun to melt again, according to Nter.nter. nterntern.nest. nest.neste."
        },
        {
            "published_date": "2025-03-29T15:41:58",
            "title": "Clocks to go forward to mark the start of summer time",
            "author": "RTÉ News",
            "url": "https://www.rte.ie/news/2025/0329/1504775-clocks-forward",
            "url_media": "https://img.rasset.ie/0021e0c8-1600.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Clocks will go forward by one hour overnight in Ireland. The practice of changing the clocks was first introduced in 1916 to save energy costs during World War I. In 2019, MEPs voted to scrap the practice of adjusting clocks in the EU. Donald Trump wants to scrap daylight saving time in the United States."
        },
        {
            "published_date": "2025-03-29T15:31:12",
            "title": "Plant more trees to curb persistent heat waves, environmentalists say",
            "author": "Faith Donatus",
            "url": "https://businessday.ng/news/article/plant-more-trees-to-curb-persistent-heat-waves-environmentalists-say",
            "url_media": "https://cdn.businessday.ng/2022/03/tree-planting.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Experts in the environmental sector have stressed the need for widespread tree planting and the restoration of forest habitats across the country to mitigate the adverse effects of rising temperatures. The current heatwave has caused streams and rivers to dry up in Nigeria and farmers are suffering economic losses of up to 50 percent due to the extreme heat."
        },
        {
            "published_date": "2025-03-29T15:19:29",
            "title": "Rich nations didn't eat less and redistribute food when 35% of developing countries was hungry: Environment Minister",
            "author": "Kalyan Ray",
            "url": "https://www.deccanherald.com/india/rich-nations-didnt-eat-less-and-redistribute-food-when-35-of-developing-countries-was-hungry-environment-minister-3469017",
            "url_media": "https://images.deccanherald.com/deccanherald%2F2025-03-29%2Fv5hn9gbu%2FPTI08_05_2024_000025A.jpg?rect=0%2C0%2C3890%2C2042&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "The minister's comment comes amid global pressure on New Delhi to cut down on its fossil fuel emission citing climate change concerns. Kalyan Ray is a member of the Indian National Congress party. He is also a former member of Indian People's Party (IPP)."
        },
        {
            "published_date": "2025-03-29T14:24:36",
            "title": "Amid Hottest March on Record, Rising Temperatures Threaten India's Wheat Production",
            "author": "ETV Bharat",
            "url": "https://www.etvbharat.com/en/!bharat/rising-temperatures-threaten-india-wheat-production-amid-hottest-march-on-record-enn25032904785",
            "url_media": "https://etvbharatimages.akamaized.net/etvbharat/prod-images/29-03-2025/1200-675-23849121-38-23849121-1743254324697.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Temperatures in March exceeded 40 degrees Celsius (104°F) in many places. This is one of the hottest March months on record in India. Wheat is a staple crop in India, and the current heatwave is threatening its yield potential. The government has set a target to procure 30 million tonnes of wheat for the rabi season 2025-26. India is the second-largest producer of wheat in the world, behind China."
        },
        {
            "published_date": "2025-03-29T14:08:26",
            "title": "Eid Al-Fitr 2025: Australia Confirms Eid Celebration On Monday, March 31 As Shawwal Crescent Moon Not Sighted",
            "author": "Shashank Nair",
            "url": "https://www.freepressjournal.in/world/eid-al-fitr-2025-australia-confirms-eid-celebration-on-monday-march-31-as-shawwal-crescent-moon-not-sighted",
            "url_media": "https://media.assettype.com/freepressjournal/2025-03-29/r7ruq2jf/Disha-app-20.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The Grand Mufti of Australia and the Australian Fatwa Council announced on Saturday that Ramadan 2025 will complete 30 days with Sunday, March 30, 2025, marking the last day of the holy month of fasting from sunrise to sunset. Monday, March 31, 2025 will be the first day of Eid Al Fitr in Australia based on astronomical data and moon sighting conditions for Shawwal 1446 AH."
        },
        {
            "published_date": "2025-03-29T14:00:43",
            "title": "Global climate anxiety outpaces local concern",
            "author": "Newsroom",
            "url": "https://www.ekathimerini.com/news/environment/1265322/global-climate-anxiety-outpaces-local-concern",
            "url_media": "https://www.ekathimerini.com/wp-content/uploads/2025/03/storm_daniel_climate_crisis-960x600.jpg?v=1743097640",
            "country": "GR",
            "language": "en",
            "summary": "A global survey on public trust reveals a sharp contrast between worldwide climate anxiety and local concern. 80% of people globally and 75% of Greeks express deep worry about climate change's global impact, but only 44% fear serious consequences for their own country. Turkey reported the highest concern (96%). Greece remains among the most pessimistic, with 58% believing humanity has surpassed the point of no return. Women (70%) express more concern than men (62%)."
        },
        {
            "published_date": "2025-03-29T13:34:17",
            "title": "Transforming coastal erosion research in Ghana with Digital Earth Africa",
            "author": "Business Ghana",
            "url": "https://article.wn.com/view/2025/03/29/Transforming_coastal_erosion_research_in_Ghana_with_Digital_",
            "url_media": "https://i.ytimg.com/vi/4yZyAOJ-Go0/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Ghana's coastline is undergoing rapid transformation due to coastal erosion. The effects bear a very real cost for vulnerable communities living on the coastline and around the Keta lagoon. The government is using advanced satellite data and geospatial tools to monitor the situation."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "MP temperature drop March 29",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/mp-temperature-drop-march-29",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "Madhya Pradesh rain forecast April",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/madhya-pradesh-rain-forecast-april",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "MP weather update in Hindi",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/mp-weather-update-in-hindi",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "IMD MP forecast",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/imd-mp-forecast",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "MP cities weather March 2025",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/mp-cities-weather-march-2025",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "MP temperature chart March end",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/mp-temperature-chart-march-end",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T13:24:00",
            "title": "rainfall alert Bhopal Indore April",
            "author": "Bhupendra Singh Chundawat",
            "url": "https://udaipurkiran.com/tag/rainfall-alert-bhopal-indore-april",
            "url_media": "https://i0.wp.com/udaipurkiran.com/wp-content/uploads/2021/08/cropped-UDAIPUR-KIRAN.png?fit=32%2C32&ssl=1",
            "country": "IN",
            "language": "en",
            "summary": "There is a shift in weather conditions in Bhopal due to the rising heat in the last few days of March. The weather is getting warmer in the late March.  Read more here:    http://www.dailymail.co.uk/news/article-news/bhopal-weather-changes-occurs-due-to-the-rising-heat-in-late-March-and-a-significant-shift in weather-conditions."
        },
        {
            "published_date": "2025-03-29T11:37:12",
            "title": "Arctic sea ice has weakest winter buildup",
            "author": "Seth Borenstein",
            "url": "https://qconline.com/article_9efbefb4-d42b-569e-b687-e485443341cd.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/qconline.com/content/tncms/assets/v3/editorial/f/95/f95ec091-e970-58ba-9cc3-da2320d1609a/67e7db457bcea.image.jpg?crop=355%2C355%2C71%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Arctic sea ice had its weakest winter buildup since record-keeping began 47 years ago. The peak measurement taken Saturday was 5.53 million square miles, about 30,000 square miles smaller than the lowest previous peak in 2017. The Arctic is warming four times faster than the rest of the world."
        },
        {
            "published_date": "2025-03-29T11:15:47",
            "title": "Scientists sound the alarm as new study predicts dire consequences of human activity: 'The power to wipe out entire landscapes'",
            "author": "Timothy McGill",
            "url": "https://www.yahoo.com/news/scientists-sound-alarm-study-predicts-111547760.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/8rNvcTYTH1lR.mp_j6dIOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/4ab9ba47341f405de2e4ed0b2b051516",
            "country": "US",
            "language": "en",
            "summary": "By the end of the century, Earth's temperature will rise by 4.9 degrees Fahrenheit compared to pre-industrial times. This threshold is expected to be reached even with countries' pledges to curb pollution. The Arctic is bearing the brunt of warming, with temperatures rising four times faster than the rest of Earth."
        },
        {
            "published_date": "2025-03-29T10:45:00",
            "title": "How the Land Changes",
            "author": "Mary Palcich Keyes Historian",
            "url": "https://www.mesabitribune.com/news/community/how-the-land-changes/article_140e7717-a16b-4e81-a8b8-524216666f5a.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/mesabitribune.com/content/tncms/assets/v3/editorial/4/63/463298cf-6de9-4ba9-8a58-f07508f7f4f6/67e478b91d8aa.image.jpg?crop=1704%2C895%2C0%2C161&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The sun is slowly making its way to the north. The changing seasons remind us that we live in an interesting place. I would find it monotonous to live in a place where there weren't changes as the year rolled along. Just as the land changes and adapts to those changes, all the creatures adapt to these changes too."
        },
        {
            "published_date": "2025-03-29T10:00:00",
            "title": "John Wheeler: Early season heat has already made Arizona hot",
            "author": "In Louisiana",
            "url": "https://www.dl-online.com/weather/john-wheeler-early-season-heat-has-already-made-arizona-hot",
            "url_media": "https://cdn.forumcomm.com/dims4/default/895abe3/2147483647/strip/true/crop/860x484+0+0/resize/1894x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Finforum%2Fbinary%2Fwx%20talk_binary_907478.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in the Desert Southwest have been well into the 90s all week long. It has also been warm in the Pacific Northwest with Portland, Ore., reaching into the 80s midweek. The warm weather is due to an area of high pressure into the upper atmosphere in the southwestern region."
        },
        {
            "published_date": "2025-03-29T09:59:56",
            "title": "5 of 10 Bridges In Greene County Damaged Or Destroyed Due To Hurricane Helene Flooding",
            "author": "The Greeneville Sun",
            "url": "https://article.wn.com/view/2025/03/29/5_of_10_Bridges_In_Greene_County_Damaged_Or_Destroyed_Due_To",
            "url_media": "https://article.wn.com/view/2025/03/29/[]",
            "country": "US",
            "language": "en",
            "summary": "All 10 of Greene County's bridges spanning the Nolichucky River were closed due to Hurricane Helene in September, which closed them due to flooding caused by Helene's hurricane force winds and heavy rains. The county still needs to repair the bridges. "
        },
        {
            "published_date": "2025-03-29T09:55:47",
            "title": "I'm a Brit living in Australia - this is the oddest difference that I can't get used to",
            "author": "Jowena Riley",
            "url": "https://news.knowledia.com/all/all/articles/i-m-a-brit-living-in-australia-this-is-the-oddest-difference-that-i-cebdadfb7f65ddc0485ac2226668ada558e1018f",
            "url_media": "https://i.dailymail.co.uk/1s/2025/03/20/14/96395517-0-image-m-21_1742480956622.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Sydney Graves, a midwife from the UK, has been living in Australia for a year. She's surprised by the difference in opening and closing times between England and Australia. She also finds it odd that food shops are open on a Sunday until late at night in Australia, whereas in England they're open all the time."
        },
        {
            "published_date": "2025-03-29T09:53:13",
            "title": "Coordinated State Action to Battle Rising Heat Wave in Kerala",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3326866-coordinated-state-action-to-battle-rising-heat-wave-in-kerala",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_08_2020_14_00_16_3689141.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Kerala Chief Minister Pinarayi Vijayan has initiated a coordinated state response to manage the escalating heat wave gripping the region. Local self-governments have been instructed to issue heat wave warnings and ensure the availability of clean drinking water in public places. Treatment facilities have been prepared at taluk-level hospitals, while ASHA workers will focus on the elderly and bedridden. Street vendors and tourists are also being notified of heat-related precautions. Steps are initiated to reduce human-wildlife conflict by ensuring water availability within forest regions."
        },
        {
            "published_date": "2025-03-29T09:48:36",
            "title": "Tanzania braces for flood: Downpours cause damage, evacuations ordered in high-risk areas",
            "author": "",
            "url": "https://www.thecitizen.co.tz/tanzania/news/national/tanzania-braces-for-floods-downpours-cause-damage-evacuations-ordered-in-high-risk-areas-4983092",
            "url_media": "https://www.thecitizen.co.tz/resource/image/4983094/landscape_ratio3x2/1200/800/991f12a1f2bb325e2b20c4fc5747da62/zy/heavy.jpg",
            "country": "TZ",
            "language": "en",
            "summary": "Heavy rains in various parts of Tanzania are causing significant damage. In Ilala District, Dar es Salaam, a temporary bridge connecting Bonyokwa and Kinyerezi collapsed. In Morogoro, five students were trapped by rising waters while washing clothes by the river. Kilimanjaro authorities issue warnings."
        },
        {
            "published_date": "2025-03-29T09:10:50",
            "title": "Black carbon: the super pollutant melting Asia's glaciers",
            "author": "South China Morning Post",
            "url": "https://article.wn.com/view/2025/03/29/black_carbon_the_super_pollutant_melting_asia_x2019s_glacier",
            "url_media": "https://article.wn.com/view/2025/03/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Black carbon's warming effect is pushing Asia's glaciers past the tipping point. CO2 gets the spotlight, but black carbon's potent, short-lived warming effect has a long-term warming effect.    i.e. it can cause climate change. "
        },
        {
            "published_date": "2025-03-29T09:03:55",
            "title": "Latin America & the Caribbean in 2024: Renewable Energy and Early Warning Systems Offer Hope Amid Climate Extremes",
            "author": "Alison Kentish",
            "url": "https://news.knowledia.com/all/all/articles/latin-america-and-the-caribbean-in-2024-renewable-energy-and-early-warning-81bdd864654353414f202bf121cbab4425c3aea9",
            "url_media": "https://static.globalissues.org/ips/2025/03/JAK_IPS_28032025_LACCLIMATE-629x472.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Dominica is facing the impacts of climate change. The WMO report details the increasing threats to the region but says there is hope with renewable energy and early warning systems. The period 1991-2024 shows an average warming trend of about 0.2 degrees Celsius or higher per decade."
        },
        {
            "published_date": "2025-03-29T08:13:18",
            "title": "Heatwave in Ho Chi Minh City to end on March 30",
            "author": "SGGPO",
            "url": "https://en.sggp.org.vn/heatwave-in-ho-chi-minh-city-to-end-on-march-30-post116653.html",
            "url_media": "https://image.sggp.org.vn/1200x630/Uploaded/2025/bhtgkqztgazs/2025_03_29/z6453333763404-fdadd95b6dd5fb44af6bafee43e9f9ea-1387-3188-7546-1572.jpg",
            "country": "VN",
            "language": "en",
            "summary": "The ongoing heatwave in Ho Chi Minh City is likely to end on March 30. Water levels in the lower reaches of the Saigon and Dong Nai rivers are forecast to rise rapidly following the high tidal period at the beginning of the third lunar month. The highest tidal peak is expected between March 31 and April 1."
        },
        {
            "published_date": "2025-03-29T06:31:00",
            "title": "Greenland: Breaking the ice",
            "author": "Times Evoke",
            "url": "https://timesofindia.indiatimes.com/greenland-breaking-the-ice/articleshow/119686587.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-119686686,width-1070,height-580,imgsize-10538,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Greenland is the world's largest island. It has been colonised by Vikings, Danish missionaries and traders, the US in the mid-20th century, and the Cold War, when it was occupied by the U.S. and Denmark. Today, the island is threatened by climate change and is losing 267 billion tons of freshwater every year."
        },
        {
            "published_date": "2025-03-29T04:53:07",
            "title": "Arctic ends winter with lowest sea ice cover on record",
            "author": "Emily Beament",
            "url": "https://news.knowledia.com/all/all/articles/arctic-ends-winter-with-lowest-sea-ice-cover-on-record-scientists-24614107e92fc44c640b719d0f0041145c68714d",
            "url_media": "https://static.standard.co.uk/2025/03/27/17/27164629-3315920c-d13b-4ec4-a985-35abdd88f7e4.jpg?width=1200",
            "country": "FR",
            "language": "en",
            "summary": "Arctic sea ice is in retreat in the face of human-driven climate change, because of climate change. The Arctic Sea Ice is retreating due to climate change and human-induced factors. The decline is due to sea-ice melting due to human-caused factors."
        },
        {
            "published_date": "2025-03-29T04:36:32",
            "title": "LETTER: Heather Clay's excellent article, from Okanagan Nature Nut",
            "author": "Roseanne Van Ee",
            "url": "https://www.vernonmorningstar.com/opinion/letter-heather-clays-excellent-article-from-okanagan-nature-nut-7890880",
            "url_media": "https://www.bpmcdn.com/f/files/sylvanlake/import/2020-06/21730084_web1_Impress-AMADrilling1.jpg;w=1200;h=800;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "Heather Clay's article for Focus on Climate on Jan. 30 was spot on, straight facts and straight forward. Now look at the fossil fuels burning up in LA. Their leader's 'drill baby drill' which supports burn baby burn is beyond insanity."
        },
        {
            "published_date": "2025-03-29T04:24:00",
            "title": "The world's most isolated city has soft sand beaches and bustling markets",
            "author": "Parul Sharma",
            "url": "https://www.express.co.uk/travel/articles/2032303/worlds-most-isolated-city-perth-australia",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/25/1200x630/6047993.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Perth, the capital of Western Australia, is located 2,136 km away from the nearest major Australian city, Adelaide. The nearest major city is San Francisco, which is 3,858 km away. Iquitos in Peru is a contender for the title of the most isolated major city."
        },
        {
            "published_date": "2025-03-29T04:15:00",
            "title": "ECU Notes: Researchers record glacial melt in Antarctica",
            "author": "ECU News Services",
            "url": "https://www.reflector.com/features/local/ecu-notes-researchers-record-glacial-melt-in-antarctica/article_ed48edaf-e262-4386-a2cd-69926b64bb6c.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/reflector.com/content/tncms/assets/v3/editorial/8/3c/83cad6a1-98ea-4963-a314-0537183f5ea4/67e464d032f0c.image.jpg?crop=1421%2C746%2C382%2C0&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Researchers from East Carolina University are studying glacial melt at the Antarctic to better understand the impact of climate change in the polar region around the Earth's south pole. Tristan Bench and Regina DeWitt spent 40 days at the U.S. National Science Foundation McMurdo Station in Antarctica from November through early January."
        },
        {
            "published_date": "2025-03-29T04:00:00",
            "title": "Ecological disruptions are a risk to national security",
            "author": "Bradley J. Cardinale",
            "url": "https://www.hammondstar.com/opinion/ecological-disruptions-are-a-risk-to-national-security/article_6ea1ea1c-a0d3-587b-8fe2-ad9426fda36d.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/hammondstar.com/content/tncms/custom/image/b9c62802-d495-11e9-bdf1-0bb68a0f04ef.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "When the natural environment is stretched beyond its ability to meet basic human needs for food, clean air, drinkable water and shelter, it is not just a humanitarian concern for the world community. Research shows that these crises are a matter of national security for the U.S. and other countries. Climate change can generate flash points for global conflict, affect how troops and equipment work, and influence which defense locations are vulnerable."
        },
        {
            "published_date": "2025-03-29T02:23:12",
            "title": "World's glaciers melting at a rapid rate",
            "author": "",
            "url": "https://www.news.com.au/finance/worlds-glaciers-melting-at-a-rapid-rate/video/dc00aa0307275850bbbef5344724e05d",
            "url_media": "https://content.api.news/v3/images/bin/bdf464b46e61827b55b3152ba0459365?width=650",
            "country": "AU",
            "language": "en",
            "summary": "Glaciers in the Swiss Alps are melting at a rapid rate and could disappear within the next 100 years. The last three years have seen the largest mass loss on record. The effect of global warming on our landscape is already dire. The Paris Climate Agreement is aimed at curbing climate change."
        },
        {
            "published_date": "2025-03-29T02:14:17",
            "title": "Melting glaciers are revealing new land, but the consequences are dire",
            "author": "",
            "url": "https://dnyuz.com/2025/03/28/melting-glaciers-are-revealing-new-land-but-the-consequences-are-dire",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/03/Melting-glaciers-are-revealing-new-land-but-the-consequences-are.jpeg",
            "country": "US",
            "language": "en",
            "summary": "There are 2,500 kilometers of new coastline in the Arctic in just two decades due to glacier retreat. The new coastline is fragile and prone to landslides and rockfalls. In September 2023, a landslide in a Greenland fjord generated a tsunami nearly 200 meters tall. In 2017, a similar disaster destroyed homes in two Greenlandic settlements and killed four people."
        },
        {
            "published_date": "2025-03-29T02:00:00",
            "title": "Antarctica Just Lost a Glacier the Size of London",
            "author": "Atta Ur Rehman",
            "url": "https://www.msn.com/en-us/weather/topstories/antarctica-just-lost-a-glacier-the-size-of-london/ss-AA1BSGCo",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Antarctica recently witnessed a dramatic change in the continent's icy landscape. A glacier, comparable in size to the sprawling city of London, has detached from the mainland. The event underscores the pressing realities of climate change and its far-reaching impacts on the world."
        },
        {
            "published_date": "2025-03-29T01:30:21",
            "title": "Japan faces 99 times more heatwaves if global warming intensifies, warns report",
            "author": "Scmp S Asia Desk",
            "url": "https://www.scmp.com/week-asia/health-environment/article/3304293/japan-faces-99-times-more-heatwaves-if-global-warming-intensifies-warns-report",
            "url_media": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/03/28/69f68087-8556-47c5-a668-2563a8e04c67_1b821b11.jpg?itok=BsjT0JbZ&v=1743151813",
            "country": "HK",
            "language": "en",
            "summary": "Japan could experience once-in-a-century heatwaves every year if global warming spirals out of control, according to the country's meteorological agency. The report was co-authored by the Japan Meteorological Agency and the Ministry of Education, Culture, Sports, Science, and Technology."
        },
        {
            "published_date": "2025-03-29T01:12:43",
            "title": "Winter sea ice in the Arctic just hit a record low",
            "author": "Sarah Kaplan",
            "url": "https://www.spokesman.com/stories/2025/mar/28/winter-sea-ice-in-the-arctic-just-hit-a-record-low",
            "url_media": "https://thumb.spokesman.com/d_b-v7_I6XEfQOoNkMU3DiPSBLA=/1200x630/smart/media.spokesman.com/photos/2025/03/28/6789afd4bf482.hires.jpg",
            "country": "US",
            "language": "en",
            "summary": "The extent of sea ice in the Arctic this winter fell to the lowest level on record. March is usually the peak season for Arctic sea ice. This year's maximum ice extent was 31,000 square miles smaller than the previous record. The losses come amid rapidly warming conditions in the far north."
        },
        {
            "published_date": "2025-03-29T01:03:00",
            "title": "Another view on climate change",
            "author": "Greg Shrader",
            "url": "https://dailytimes.com/opinion/another-view-on-climate-change/article_004e5b43-29a0-43a0-8404-9a2f43a4e621.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailytimes.com/content/tncms/assets/v3/editorial/a/75/a7593b69-47b6-4ac6-9e18-87cd7b720b3f/67e7479edb58c.image.jpg?crop=799%2C420%2C0%2C149",
            "country": "US",
            "language": "en",
            "summary": "Earth Day is coming up on April 22. The Associated Press and others trot out the doom and gloom global warming pieces similar to the one published Tuesday in the Daily Times. Jonathan Overpeck was the lead author on a 2007 report to the UN's Intergovernmental Panel on Climate Change."
        },
        {
            "published_date": "2025-03-29T01:02:00",
            "title": "Extreme Weather Hits Latin America & Caribbean",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/extreme-weather-hits-latin-america-caribbean-1434984",
            "url_media": "https://wmo.int/sites/default/files/2025-03/Parque_Estadual_do_Turvo_Anderson_Cristiano_Hendgen_%2815%29.jpg",
            "country": "US",
            "language": "en",
            "summary": "The State of the Climate for Latin America and the Caribbean 2024 highlights the mounting toll of weather, climate and water extremes on lives, livelihoods and food supply chains. It was the warmest or second warmest year on record. The Bolivarian Republic of Venezuela became the second country in the world to lose all its glaciers. Solar and wind experienced a 30% increase in capacity and generation compared to 2023."
        },
        {
            "published_date": "2025-03-29T01:00:00",
            "title": "Could Volcanoes Be Used to Cool the Planet?",
            "author": "Ayman Rani Ahmed",
            "url": "https://www.msn.com/en-us/weather/topstories/could-volcanoes-be-used-to-cool-the-planet/ar-AA1BT2yc",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Volcanoes have the ability to cool the Earth's climate. 1991 eruption of Mount Pinatubo in the Philippines led to a global temperature drop of about 0.5 degrees Celsius for nearly two years. Scientists have proposed mimicking volcanic eruptions by injecting sulfate aerosols into the stratosphere. This would theoretically create a reflective shield, reducing the amount of solar energy reaching Earth's surface. Geoengineering is fraught with ethical and practical challenges. It would require sophisticated technology to deliver and disperse aerosols at high altitudes."
        },
        {
            "published_date": "2025-03-29T00:43:06",
            "title": "Extreme heat killing people with heart disease: Study",
            "author": "",
            "url": "https://www.thenewdaily.com.au/life/health/2025/03/29/extreme-heat-heart-disease",
            "url_media": "https://wp.thenewdaily.com.au/wp-content/uploads/2025/03/1743035993-EDM-pexels-BrokenHeart.jpg?resize=1200%2C630",
            "country": "AU",
            "language": "en",
            "summary": "Extreme heat is behind 7.3% of the heart disease burden in Australia. This translates to 49,483 years of healthy life lost to cardiovascular disease each year. This figure could more than double by 2050. The highest burden was in South Australia, the lowest in the Northern Territory."
        },
        {
            "published_date": "2025-03-29T00:36:42",
            "title": "Melting glaciers are revealing new land, but the consequences are dire",
            "author": "BGR",
            "url": "https://article.wn.com/view/2025/03/29/Melting_glaciers_are_revealing_new_land_but_the_consequences",
            "url_media": "https://article.wn.com/view/2025/03/29/[]",
            "country": "US",
            "language": "en",
            "summary": "The Arctic is changing faster than anywhere else on Earth. Nearly 2,500 kilometers of new coastline have emerged in just two years as a result of Arctic glacier retreat due to rising temperatures and climate change. It's a sign of the changing nature of the Arctic."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Greenland: Breaking the ice",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/03/29/Greenland_Breaking_the_ice",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greenland is in the eye of a global storm. The Earth's largest island is covered in ancient ice and has freezing temperatures all year round. There are two months of constant, unblinking'midnight sun' daylight every year, so it evokes mystical and mythical mysteries."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "John Wheeler: Early season heat has already made Arizona hot",
            "author": "The Jamestown Sun",
            "url": "https://article.wn.com/view/2025/03/29/John_Wheeler_Early_season_heat_has_already_made_Arizona_hot_9",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in lower elevations of Arizona have been well into the 90s all week long. Such temperatures are about 15 degrees warmer than average for late March. In the southern Plains, people in the Plains are already feeling the effects of the heat wave."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Scientists Sounding Alarm As World's Largest Tropical Lake Turns Green",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/03/29/Scientists_Sounding_Alarm_As_World_s_Largest_Tropical_Lake_T",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Lake Victoria is turning green because of rising temperatures and more intense rainfall. It's Africa's largest lake and the largest tropical lake in the world, spreading into three countries and supporting over 47 million people, but it's turning green due to blooms caused by cyanobacterial growth."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Min Woo Lee takes control of Houston Open with third-round 63",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/03/29/Min_Woo_Lee_takes_control_of_Houston_Open_with_thirdround_63",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Australia is a country of people living in the Middle East. It is mainly populated by people from Australia. It has a population of about 1.5 billion people. It's a nation of people. Its main territory is called Australia. Its population is mainly consists of people from that country. "
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Steering towards the blue ecosystem, marine biodiversity",
            "author": "The Philippine Star",
            "url": "https://article.wn.com/view/2025/03/29/Steering_towards_the_blue_ecosystem_marine_biodiversity",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Maritime governance, marine protection and environmental sustainability are crucial to ensuring the long-term health of our oceans and the prosperity of coastal communities, says the World Resources Institute (WRI). WRI's mission is to protect and improve the marine environment and the coastal communities."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Japan faces 99 times more heatwaves if global warming intensifies, warns report",
            "author": "South China Morning Post",
            "url": "https://article.wn.com/view/2025/03/29/Japan_faces_99_times_more_heatwaves_if_global_warming_intens",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Global warming could cause once-in-a-century heatwaves every year, according to a new report. The report was released by the World Resources Institute.   Â. Â   y   Y   i   a  "
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Unexpected sea level rise threatens coastal ecosystems and marine biodiversity",
            "author": "Gulf-Times",
            "url": "https://article.wn.com/view/2025/03/29/Unexpected_sea_level_rise_threatens_coastal_ecosystems_and_m",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sea level rise is a major global issue driven by climate change. The rise in 2024 was higher than expected. It is due to melting ice caps and the thermal expansion of seawater. It will lead to more frequent and severe coastal flooding and erosion threatening coastal infrastructure and communities."
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Fox News host suggests US ‘may have to burn bridge' with Denmark",
            "author": "The Independent",
            "url": "https://article.wn.com/view/2025/03/29/Fox_News_host_suggests_US_may_have_to_burn_bridge_with_Denma",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Fox News host suggests US'may have to burn a bridge' with Denmark over Greenland.    i   in the tweet.  in this case, the host was talking about Fox News host. in the previous tweet, he was referring to Fox News Channel. "
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Is red meat unhealthy?",
            "author": "Economist",
            "url": "https://article.wn.com/view/2025/03/29/Is_red_meat_unhealthy",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As the temperatures rise and the days grow longer, barbecue season is approaching. The barbeque season is just around the corner. It's hot and it's getting warmer.       in the coming days. It will get hotter and hotter. "
        },
        {
            "published_date": "2025-03-29T00:00:00",
            "title": "Coordination stressed to address glacial melting issue",
            "author": "Bureau report",
            "url": "https://www.thenews.com.pk/print/1296279-coordination-stressed-to-address-glacial-melting-issue",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-03-29/l_1296279_025414_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Climate change is a critical issue for Pakistan and there is an urgent need for all stakeholders to join forces through adaptation and mitigation policies across all socio-economic sectors. Pakistan's glaciers are vital to the country's water supply, providing over 60 per cent of the water to the Indus River Basin. World Water Day is observed every year on March 22."
        }
    ]
}