{
    "status": "ok",
    "total_articles": 175,
    "articles": [
        {
            "published_date": "2025-07-08T23:42:40",
            "title": "Study: Duration of Heat Waves Accelerating Faster Than Global Warming",
            "author": "Contributing Editor",
            "url": "https://mynewsla.com/education/2025/07/08/study-duration-of-heat-waves-accelerating-faster-than-global-warming",
            "url_media": "https://i0.wp.com/mynewsla.com/wp-content/uploads/2021/10/MNLA-Facebook.jpg?fit=640%2C360&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "UCLA and the Universidad Adolfo Ibaí±ez in Santiago, Chile, conducted a study on the effects of climate change on heat waves. They found that the longest heat waves will see the greatest acceleration, and the frequency of the most blistering heatwaves will increase the most. Future research is dependent on federal budgets."
        },
        {
            "published_date": "2025-07-08T23:23:33",
            "title": "UCLA Study: Duration of Heat Waves Accelerating Faster Than Global Warming",
            "author": "City News Service",
            "url": "https://pasadenanow.com/main/ucla-study-duration-of-heat-waves-accelerating-faster-than-global-warming",
            "url_media": "https://pasadenanow.com/main/wp-content/uploads/2022/01/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "UCLA and the Universidad Adolfo Ibañez in Santiago, Chile, found that the longest heat waves will see the greatest acceleration due to climate change. The duration of a heat wave exacerbates the risk to people, animals, agriculture and ecosystems. Future research dependent on federal budgets."
        },
        {
            "published_date": "2025-07-08T23:19:20",
            "title": "Tracking ice, tracking change: Satellite data reveal how melting glaciers reshape landscapes",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Tracking_ice_tracking_change_Satellite_data_reveal_how_melti",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "Across Europe and around the world, melting glaciers are reshaping landscapes and climate systems. Researchers Elzė Buslavičiūtė and Dr. Laurynas Jukna study the effects of melting glaciers on the environment and climate system."
        },
        {
            "published_date": "2025-07-08T23:07:43",
            "title": "Spain's Costa Blanca bears the scars of a real estate frenzy",
            "author": "Sandrine Morel",
            "url": "https://www.lemonde.fr/en/m-le-mag/article/2025/07/09/spain-s-costa-blanca-bears-the-scars-of-a-real-estate-frenzy_6743171_117.html",
            "url_media": "https://img.lemde.fr/2025/06/25/0/0/1500/1000/1440/960/60/0/867621f_ftp-import-images-1-ec2mgo9oum9m-388184-3428002.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Photographer and filmmaker Markel Redondo traveled across the region of Valencia from 2020 to 2021 to create a series La idea de éxito (\"The idea of success\"). He explored the relationship between people and urbanized landscapes in Castillos de arena (\"Sandcastles\")."
        },
        {
            "published_date": "2025-07-08T23:06:00",
            "title": "Fire held in Merritt off Trans Canada Highway",
            "author": "Jennifer Smith",
            "url": "https://www.surreynowleader.com/news/fire-held-in-merritt-off-trans-canada-highway-8120164",
            "url_media": "https://www.bpmcdn.com/f/files/vernon/2025-july/250710-bpd-fire.jpg;w=884;h=589;mode=crop",
            "country": "US",
            "language": "en",
            "summary": "A wildfire off Highway 5 near Merritt is being held. Firefighters are on scene of the blaze, which was sparked around 3 p.m. Tuesday, July 8. The fire is estimated .009 hectares in size and labelled Fox Farm Road. The cause is under investigation."
        },
        {
            "published_date": "2025-07-08T23:01:21",
            "title": "OBR: Economic cost of climate change likely 'more severe' than previously thought",
            "author": "Jane Thynne",
            "url": "https://www.businessgreen.com/news/4516058/obr-economic-cost-climate-change-severe-previously",
            "url_media": "https://image.chitra.live/api/v1/wps/2ccb8b8/9fe76372-9a96-4b1c-8c54-21feaafb60ff/13/iStock-2207902465-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "An increase in global temperatures of close to 3C above pre-industrial levels would damage Britain's economy more than previously assumed. According to the Office for Budget Responsibility (OBR), this is because of the negative impact on the economy of such a rise in temperature."
        },
        {
            "published_date": "2025-07-08T22:37:23",
            "title": "Antarctica's Volcanic Awakening: A Cascade of Eruptions Threatens to Unfold as Ice Recedes",
            "author": "",
            "url": "https://www.archyde.com/antarcticas-volcanic-awakening-a-cascade-of-eruptions-threatens-to-unfold-as-ice-recedes",
            "url_media": "https://www.archyde.com/wp-content/uploads/2025/05/archydegemini.jpeg",
            "country": "US",
            "language": "en",
            "summary": "There is a direct link between melting glaciers and the potential reawakening of dormant volcanoes worldwide. Research focused on the Chilean Andes suggests that the diminishing ice mass is reducing the pressure on underlying magma chambers, increasing the risk of eruptions. The relationship between glacial melt and volcanic eruptions is complex but increasingly understood. Communities near volcanoes should prepare for the possibility of renewed activity and develop thorough evacuation plans."
        },
        {
            "published_date": "2025-07-08T22:28:09",
            "title": "Unicoi County Schools leaders pleased with TCAP scores despite challenging year",
            "author": "Karen Jenkins",
            "url": "https://www.wjhl.com/news/local/unicoi-county-schools-leaders-pleased-with-tcap-scores-despite-challenging-year",
            "url_media": "https://www.wjhl.com/wp-content/uploads/sites/98/2025/07/Screenshot-2025-07-08-181308.png?w=1280",
            "country": "US",
            "language": "en",
            "summary": "Unicoi County students missed 30 instructional days due to the floods of Hurricane Helene and the winter's snow. Scores for ELA improved by 10.7% from last year, math scores rose 2.1%, science scores were up 3.2%, and social studies students improved the most with a 20.2% performance increase. Third-grade test scores dropped by 4%, but 37 students who appealed their scores due to hardships from the hurricane will be promoted to fourth grade."
        },
        {
            "published_date": "2025-07-08T22:17:57",
            "title": "The Earth's Rotation Is About to Spin Up So Much That Tomorrow Will Be Much Shorter Than Today",
            "author": "Victor Tangermann",
            "url": "https://www.yahoo.com/news/earths-rotation-spin-much-tomorrow-221757024.html",
            "url_media": "https://media.zenfs.com/en/futurism_981/9b63aff76abd28b50501993afd605085",
            "country": "US",
            "language": "en",
            "summary": "July 9, July 22, and August 5 of this year will be some of the shortest days in recent memory. The Earth's rotation is about to accelerate significantly. Since 1972, scientists have sliced a \"leap second\" from the clock a whopping 27 times thanks to a steady deceleration."
        },
        {
            "published_date": "2025-07-08T22:17:57",
            "title": "Scientists Puzzled by Earth's Rotation Speed Suddenly Increasing, Leading to Unexpectedly Short Days",
            "author": "",
            "url": "https://futurism.com/the-byte/earth-spin-days-shorter",
            "url_media": "https://wordpress-assets.futurism.com/2025/07/earth-spin-days-shorter.jpg",
            "country": "US",
            "language": "en",
            "summary": "July 9, July 22, and August 5 of this year will be some of the shortest days in recent memory. The Earth's rotation is about to accelerate. Since 1972, scientists have sliced a \"leap second\" from the clock a whopping 27 times thanks to a steady deceleration."
        },
        {
            "published_date": "2025-07-08T21:09:58",
            "title": "Bogotá's Mobility Transformation: A July 8 Update",
            "author": "",
            "url": "https://www.archyde.com/bogotas-mobility-transformation-a-july-8-update",
            "url_media": "https://imagenes.eltiempo.com/files/og_thumbnail/uploads/2025/07/08/686d52bc86934.png",
            "country": "US",
            "language": "en",
            "summary": "There is a surge in heavy rainfall across Colombia. The current weather pattern is linked to the ongoing La Niña phenomenon, which typically brings increased rainfall to the northern parts of South America. The increased rainfall has already led to the overflow of several rivers and streams, causing localized flooding in urban and rural areas. Road closures are reported in multiple locations due to landslides and debris. The government has allocated additional resources to support emergency response efforts and is working with local authorities to implement preventative measures."
        },
        {
            "published_date": "2025-07-08T21:09:18",
            "title": "Lizard Island Great Barrier Reef Loses 92% Corals in 2024 Bleaching",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/lizard-island-australias-great-barrier-reef-faces-alarming-coral-929",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "Lizard Island on Australia's Great Barrier Reef has suffered one of the world's worst coral die-offs since the 2024 bleaching event. 96% of corals were bleached and mortality averaged 92%. Some sites lost over 99%. The study's lead researcher Vincent Raoult described the mortality as \"unprecedented\"."
        },
        {
            "published_date": "2025-07-08T21:00:00",
            "title": "Guardian: European Heatwave Failing to Spur Support for Climate Action",
            "author": "Eric Worrall",
            "url": "https://wattsupwiththat.com/2025/07/08/guardian-european-heatwave-failing-to-spur-support-for-climate-action",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2023/01/Mauna-Loa-CO2-Levels.png?fit=800%2C400&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Eric Worrall's essay explains why people are less concerned about climate change and more concerned about other issues like the cost of living, immigration and the NHS. He suggests that the main reason for the drop in climate concern is that ordinary people have to prioritise short term survival over their climate concerns."
        },
        {
            "published_date": "2025-07-08T20:45:00",
            "title": "As Glaciers Retreat, Powerful Volcanoes May Erupt More Frequently Across the Planet",
            "author": "Stephanie Edwards",
            "url": "https://www.discovermagazine.com/planet-earth/as-glaciers-retreat-powerful-volcanoes-may-erupt-more-frequently-across-the",
            "url_media": "https://images.ctfassets.net/cnu0m8re1exe/tqDjMURWMOIrROPlMZY5O/c8ff7ad06369ee648b8a0597e7cad98f/Glacier-and-Volcano.JPG?fm=jpg&fl=progressive&w=1200&h=800&fit=fill",
            "country": "US",
            "language": "en",
            "summary": "As glaciers retreat due to climate change, volcanoes are likely to erupt more frequently and more explosively. The research project focused on six volcanoes located in the Chilean Andes where the Patagonian Ice Sheet has advanced and retreated over time. The study also provided new understandings of volcano behavior and how to better predict when a volcano may become active relative to glacial melting."
        },
        {
            "published_date": "2025-07-08T20:26:42",
            "title": "Bilawal grieves over loss of lives in rain-related incidents across country",
            "author": "Sajid Salamat",
            "url": "https://dailytimes.com.pk/1331934/bilawal-grieves-over-loss-of-lives-in-rain-related-incidents-across-country",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/07/Bilawal-Bhutto-copy-1.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Bilawal Bhutto Zardari has expressed profound sorrow and heartfelt condolences over the loss of precious lives and widespread damage to property caused by rain-related incidents in various parts of the country, including Balochistan, Khyber Pakhtunkhwa and the twin cities of Islamabad and Rawalpindi. He called for the National Disaster Management Authority (NDMA) and the Provincial Disaster Management Agency (PDMA) to jointly initiate relief operations in the rain-affected districts."
        },
        {
            "published_date": "2025-07-08T20:12:30",
            "title": "Why Some Young Australians Avoid AI: The Reason Behind This Photo",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/why-some-young-australians-avoid-ai-the-reason-behind-this-photo",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/07/Some-young-Aussies-refuse-to-use-AI-because-of-what039s.au2Ffs2F101279a1-56d7-4fae-8f2a-7f52fa505ddf.jpeg",
            "country": "NG",
            "language": "en",
            "summary": "Some young Australians are choosing not to use generative AI tools like ChatGPT or Google Gemini due to concerns about their potential environmental impact. Generative AI models need a lot of computational power to run, so they rely on data centres. Data centres consumed more electricity than all of Australia in 2022."
        },
        {
            "published_date": "2025-07-08T20:05:44",
            "title": "Column - Global warming is a threat to all",
            "author": "Staff Reports",
            "url": "https://www.suffolknewsherald.com/2025/07/08/column-global-warming-is-a-threat-to-all",
            "url_media": "https://www.suffolknewsherald.com/wp-content/uploads/sites/19/2025/03/suffolk-logo.jpg",
            "country": "US",
            "language": "en",
            "summary": "Earth is warming faster than it did in the past. There's been a rise in sea level by 7-8 inches since 1900. Mass coral bleaching events have become five times more common worldwide over the past 40 years. Global floods and extreme rainfall have increased by more than 50% in the last decade. We need to limit the rise in global temperature to 1.5 degrees Centigrade (2.7 degrees Fahrenheit)."
        },
        {
            "published_date": "2025-07-08T20:05:31",
            "title": "Nandidurga Road gets 10 saplings; motorists get new obstacles",
            "author": "DHNS",
            "url": "https://www.deccanherald.com/india/karnataka/bengaluru/nandidurga-road-gets-10-saplings-motorists-get-new-obstacles-3621561",
            "url_media": "https://media.assettype.com/deccanherald%2F2025-07-08%2F4ttlbe36%2Ffile81f2pytcj0h12lz574se.jpg?rect=0%2C18%2C481%2C253&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "The move has irked others, who believe the saplings encroach upon road space and pose risks to motorists as they grow bigger. The saplings could damage the surface and pose a risk to motorists if they grow too big for the road.   "
        },
        {
            "published_date": "2025-07-08T20:00:00",
            "title": "Tuvalu: The World's Smallest Country Faces Extinction As Rising Seas Swallow Nation",
            "author": "R. J. Manuel",
            "url": "https://www.msn.com/en-my/news/other/tuvalu-the-world-s-smallest-country-faces-extinction-as-rising-seas-swallow-nation/ar-AA1Idd2j",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The island nation of Tuvalu is one of the most vulnerable countries to climate change. It is the fourth-smallest country in the world by land area, measuring just 26 square kilometers (10 square miles). It consists of nine coral atolls and reef islands scattered across the Pacific Ocean. Its highest point is less than 5 meters above sea level, making the entire country susceptible to minor rises in ocean levels. Scientists warn that if current trends in global warming continue, large parts of the country could become uninhabitable within the next 20 to 30 years. The government initiated a project in 2022 aimed at establishing the world's first digital nation."
        },
        {
            "published_date": "2025-07-08T20:00:00",
            "title": "Aron's Down Under from Denmark",
            "author": "Adam Palombi",
            "url": "https://www.sheppnews.com.au/news/arons-down-under-from-denmark",
            "url_media": "https://imengine.public.prod.mmg.navigacloud.com?uuid=a5c3c9f1-aabe-5a32-81a9-aa911b9705d7&function=original&type=preview",
            "country": "AU",
            "language": "en",
            "summary": "Aron Jurak, 17, is returning home after a year-long stay in Yarrawonga, Australia. He visited the Great Barrier Reef, Jarvis Bay, Uluru and the Northern Territory. He trained with the Mulwala Lions and saw the Geelong Cats play at the MCG. He wants to study bioengineering or become a veterinarian."
        },
        {
            "published_date": "2025-07-08T19:38:14",
            "title": "Eno Arts Mill closes indefinitely after Chantal flooding, Orange County officials say",
            "author": "Matthew Sockol",
            "url": "https://www.cbs17.com/news/local-news/orange-county-news/eno-arts-mill-closes-indefinitely-after-chantal-flooding-orange-county-officials-say",
            "url_media": "https://www.cbs17.com/wp-content/uploads/sites/29/2025/07/GvWby4AXkAET2YT.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "The home of the Orange County Arts Commission is closed indefinitely because of flooding from Tropical Depression Chantal. The Eno Arts Mill was damaged by the flooding and will need to be demolished and restored. Several artists lost decades of work because of the flooding. Anyone who wishes to support the artists can visit the Orange Country Arts Commission website."
        },
        {
            "published_date": "2025-07-08T19:37:08",
            "title": "Earth's Rotation To Force Shorter Days This Summer. Here's Why",
            "author": "Matt Wadleigh",
            "url": "https://www.yahoo.com/news/earth-rotation-force-shorter-days-193708363.html",
            "url_media": "https://media.zenfs.com/en/men_s_journal_718/73249c73e9081d884123251e63d08370",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation will make the days shorter on July 9, July 22 and August 5 because the Earth will be spinning faster than normal. The position of the moon is expected to affect Earth's rotation so that each day is between 1.3 and 1.51 milliseconds shorter than normal on these dates."
        },
        {
            "published_date": "2025-07-08T19:30:00",
            "title": "Congress must make America more resilient to increasingly devastating disasters",
            "author": "Rep. Yvette D. Clarke",
            "url": "https://thehill.com/opinion/energy-environment/5389211-disaster-federal-government-preparedness",
            "url_media": "https://thehill.com/wp-content/uploads/sites/2/2025/07/AP25188632711290.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "According to an internal review, the Federal Emergency Management Agency isn't ready to help Americans this year. Trump plans to dismantle the agency entirely by December. Since 1979, FEMA has been a life-saving service, helping Americans get through the worst of a disaster. The last couple of years have broken historical records for the total number of billion-dollar disasters from extreme weather due to global warming."
        },
        {
            "published_date": "2025-07-08T19:26:00",
            "title": "Authorities searching for missing 23-year-old woman reported missing in Graham: Police",
            "author": "Jeremy Vernon",
            "url": "https://www.wfmynews2.com/article/news/local/authorities-searching-for-missing-23-year-old-woman-reported-missing-graham-police/83-b8bba97e-86cd-422d-9aa0-f40547c53b60",
            "url_media": "https://media.wfmynews2.com/assets/WFMY/images/aff680ba-14d8-459b-84e2-1dc81145f3eb/20250708T023737/aff680ba-14d8-459b-84e2-1dc81145f3eb_1140x641.jpg",
            "country": "US",
            "language": "en",
            "summary": "Alamance County officials are searching for a 23-year-old woman who went missing during heavy rains caused by Tropical Storm Chantal in Graham, N.C. The woman has not been identified yet.    .     "
        },
        {
            "published_date": "2025-07-08T19:00:00",
            "title": "Lions v Brumbies preview: expect a direct approach in chilly Canberra as tourists move into Test match mode",
            "author": "Rúaidhri O’Connor in Canberra",
            "url": "https://www.independent.ie/sport/rugby/lions-v-brumbies-preview-expect-a-direct-approach-in-chilly-canberra-as-tourists-move-into-test-match-mode/a480153289.html",
            "url_media": "https://focus.independent.ie/thumbor/4gliMNHL4ChdjmwMElkicHjrXu8=/629x460/smart/prod-mh-ireland/b3d62bde-fe8f-4480-a62d-356e63cb5867/1c7b6474-cd10-42b0-9e55-96fb83b53c96/RUGBYU%20L%20%28104%29.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Everybody in Australia says the cold cuts differently in Canberra. By kick-off on Wednesday night local time, there'll be no mistaking that this is winter Down Under after all.    \"It's cold in Canberra.\"  \"The cold cuts in Canberra are different.\" "
        },
        {
            "published_date": "2025-07-08T18:57:07",
            "title": "Eastern states shivered through a chilly June, is a warmer winter still on the cards?",
            "author": "Tyne Logan",
            "url": "https://www.abc.net.au/news/2025-07-09/weather-june-temperatures-winter-forecast-records/105495642",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/9809e15278182cb7aed693e809fd04e9?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=337&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "It is two weeks past the winter solstice and many parts of Australia have been feeling the cold. It is the 48th coldest June on record, but not the coldest by historical standards. Since 1910, Australia's average temperature has warmed by more than 1.5C, which means all seasons are getting warmer on average."
        },
        {
            "published_date": "2025-07-08T18:48:21",
            "title": "Carl Edsel Murray, 88",
            "author": "Www.Wydaily.Com Http",
            "url": "https://portcitydaily.com/obits/2025/07/08/carl-edsel-murray-88",
            "url_media": "https://images.portcitydaily.com/wp-content/uploads/2022/01/pexels-photo-7048014-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Carl Edsel Murray, 88, passed from his earthly life to his eternal rest Sunday, July 6, 2025 at Lower Cape Fear LifeCare in Wilmington. Carl was born March 17, 1937, in Pender County, North Carolina, the son of Bruce Murray and Rena Marshburn Murray. Carl is survived by his daughter Donna Murray Burnette (Clinton Ray), his granddaughter Shelby Burnette, and his brother Milton Murray. For a number of years, Carl served proudly in the NC National Guard and was a member of Mt. Holly Baptist Church. The funeral service will take place on Wednesday, July 9, 2025, at 12:00 p.m. at Quinn-McGowen"
        },
        {
            "published_date": "2025-07-08T18:16:10",
            "title": "Commentary: The Texas floods were made worse by climate denialism",
            "author": "Michael R. Bloomberg",
            "url": "https://www.kansascity.com/opinion/us-viewpoints/article310231515.html",
            "url_media": "https://www.mcclatchy-wires.com/incoming/oj8q8u/picture310231370/alternates/LANDSCAPE_1140/abb02978-9bbb-497f-ac3f-e3fc26c666f1",
            "country": "US",
            "language": "en",
            "summary": "Flooding in central Texas killed more than 100 people. The death toll from the Fourth of July floods is now at 100. The scientific evidence is clear that the more frequent extreme weather we are experiencing is being driven by climate change. The Trump administration is actively thwarting efforts to address climate change and help communities cope with its harms."
        },
        {
            "published_date": "2025-07-08T17:23:03",
            "title": "Water storage in dams has caused minute shifts in Earth's poles, study finds",
            "author": "Samson Reiny",
            "url": "https://www.msn.com/en-us/weather/topstories/water-storage-in-dams-has-caused-minute-shifts-in-earth-s-poles-study-finds/ar-AA1Id3mu",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The construction of nearly 7,000 dams from 1835 to 2011 shifted Earth's poles slightly away from the planet's axis of rotation. Together, these dams hold enough water to fill the Grand Canyon twice. The results show that researchers need to take water impoundment into consideration when calculating future sea level rise."
        },
        {
            "published_date": "2025-07-08T17:18:07",
            "title": "Not all species flee heat: New hypothesis explains surprising movements in nature",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Not_all_species_flee_heat_New_hypothesis_explains_surprising",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "As the climate warms, animals and plants are expected to move to cooler areas. They will move up hill, toward the poles as a result of the warming climate.    .   i   in the future, they will move towards the poles. "
        },
        {
            "published_date": "2025-07-08T17:18:07",
            "title": "Food trade regimes harm people and the planet: How the G20 can drive improvements",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Food_trade_regimes_harm_people_and_the_planet_How_the_G20_ca",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "African food systems face daunting challenges in the face of climate change. They must ensure fair access to food for residents of African countries, as well as for people living in the affected areas.    for climate change adaptation and adaptation to food security in Africa. "
        },
        {
            "published_date": "2025-07-08T17:01:34",
            "title": "J.J. Watt and Wife Donate $100,000 to Kerrville, Texas Eatery Assisting Flood Victims",
            "author": "Source",
            "url": "https://hoodline.com/2025/07/j-j-watt-and-wife-donate-100-000-to-kerrville-texas-eatery-assisting-flood-victims",
            "url_media": "https://img.hoodline.com/2025/7/jj-watt-and-wife-donate-dollar100000-to-kerrville-texas-eatery-assisting-flood-victims-21.webp",
            "country": "US",
            "language": "en",
            "summary": "There was recent flooding in Kerrville, Texas. J.J. Watt and his wife, Kealia Ohai-Watt, donated $100,000 to the GoFundMe page of the local restaurant, Grape Juice. The restaurant is known for providing first responders with food."
        },
        {
            "published_date": "2025-07-08T17:00:00",
            "title": "Climate Oscillations 7: The Pacific Mean SST",
            "author": "Andy",
            "url": "https://wattsupwiththat.com/2025/07/08/climate-oscillations-7-the-pacific-mean-sst",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/07/figure-2-1.png?fit=871%2C569&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The North Pacific Index (NPI) is the most correlated with HadCRUT5, but it only ranked 7th overall. Pacific Oscillations are useful in explaining past climate and weather events in the Pacific Basin and explaining many environmental processes. The Pacific Ocean covers 33% of Earth's surface, compared to 8% for the North Atlantic Ocean. The ERSST5 AMO is 80% correlated."
        },
        {
            "published_date": "2025-07-08T16:53:19",
            "title": "HEADLINE: 'Sustainability Magazine's Heat Wave Hype: Grid Struggles Stem from Policy, Not Climate' ANTHONY WATTS",
            "author": "Stephen Heins",
            "url": "https://stephenheins.substack.com/p/headline-sustainability-magazines",
            "url_media": "https://substackcdn.com/image/fetch/$s_!LWMG!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F50df8ff8-6279-4fca-86e6-b15b78986fdf_720x577.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Sustainability Magazine claims that human-caused climate change is increasing the frequency and intensity of heat waves, which are placing strain on power grids worldwide. Data does not support the notion that heat waves are increasing in frequency or intensity on a global scale. Evidence suggests that localized temperature increases are driven by the Urban Heat Island (UHI) effect, not global climate change. The article's claim that 2025 has already seen heat waves striking China, the United States, Canada, France, and the United Kingdom is presented as though this constitutes evidence of a crisis."
        },
        {
            "published_date": "2025-07-08T16:50:50",
            "title": "Wildfire in France shuts down Marseille airport",
            "author": "Vanguard",
            "url": "https://www.latestnigeriannews.com/p/4369774/wildfire-in-france-shuts-down-marseille-airport.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Scientists say human-induced climate change is increasing the intensity, length and frequency of the extreme heat that causes some forest fires. The fire in France has closed down Marseille airport.      Â. Â   vanguard news reports."
        },
        {
            "published_date": "2025-07-08T16:46:02",
            "title": "Inuit podcast takes us inside the Arctic meltdown",
            "author": "Sonal Gupta",
            "url": "https://www.stcatharinesstandard.ca/news/canada/inuit-podcast-takes-us-inside-the-arctic-meltdown/article_1a08baf1-ac63-5fc2-b330-b64e8f1738fa.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/stcatharinesstandard.ca/content/tncms/assets/v3/editorial/8/65/865ee2ae-8f29-542c-8958-64cd36ecd4ea/686d4d8f3eabe.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Siila Watt-Cloutier is a renowned Inuk leader and Nobel nominee known for linking Arctic climate change to human rights and championing Indigenous voices on the world stage. She is a member of the St. Catherine's standard. She has immigrated to Canada."
        },
        {
            "published_date": "2025-07-08T16:44:31",
            "title": "Experts ponder on sharing formula of IMOs carbon tax",
            "author": "Chuks Oyema-Aziken",
            "url": "https://www.latestnigeriannews.com/p/4369753/experts-ponder-on-sharing-formula-of-imos-carbon-tax.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Some climate advocates fear developing countries may bear the burden of the world maritime transition with the implementation of landmark carbon levy. IMO is poised to adopt a global emissions pricing mechanism under its Net-Zero Framework, projected to be effective by 2020.    "
        },
        {
            "published_date": "2025-07-08T16:40:00",
            "title": "List of road closures across Alamance County after Tropical Storm Chantal: NCDOT",
            "author": "Taylor Ford",
            "url": "https://www.wfmynews2.com/article/traffic/road-closures-in-alamance-county/83-f7a9da2f-b176-4c40-a3c6-1ef62ec58f92",
            "url_media": "https://media.wfmynews2.com/assets/WFMY/images/39af1af7-4a9b-46c4-9da0-7c5337d6f188/20250707T205754/39af1af7-4a9b-46c4-9da0-7c5337d6f188_1140x641.jpg",
            "country": "US",
            "language": "en",
            "summary": "Tropical Storm Chantal has closed many roads in Alamance County and throughout North Carolina. Phibbs Road near NC 87 is closed due to flooding. Southern High School Road near Bellemont Mount Hermon Road and NC-119 near Corbett Road are closed. Church Road near Swepsonville Saxapahaw Road and Jimmie Kerr Road near Cherry Lane Road are also closed."
        },
        {
            "published_date": "2025-07-08T16:36:25",
            "title": "INDONESIA DROUGHT",
            "author": "ACW",
            "url": "https://n.news.naver.com/mnews/article/091/0009950532",
            "url_media": "https://imgnews.pstatic.net/image/091/2025/07/08/PEP20250708125501009_P2_20250708163625590.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Dry season in Aceh is expected to last until August. It is affecting the agriculture sector in the province. Newly grown rice begins to die in a cracked rice field due to a long drought.      Â   e."
        },
        {
            "published_date": "2025-07-08T16:32:00",
            "title": "Melting Glaciers Could Set Off Volcanoes in Chain Reaction, Scientists Sound Chilling Alarm",
            "author": "Satyaki Baidya",
            "url": "https://www.news18.com/world/melting-glaciers-could-set-off-volcanoes-in-chain-reaction-scientists-sound-chilling-alarm-ws-dl-9428390.html",
            "url_media": "https://images.news18.com/ibnlive/uploads/2025/07/glacier-melt-2025-07-8fe131e695bb6f7f99992d1e9cd67c61-16x9.png",
            "country": "IN",
            "language": "en",
            "summary": "Ice cover delays volcanic eruptions, allowing magma to build up heat and pressure underground. When released, this leads to far more powerful and destructive explosions. Scientists warn that this marks the beginning of a perilous chain reaction with the potential to affect the entire planet.  "
        },
        {
            "published_date": "2025-07-08T16:12:40",
            "title": "Staying inside and cattle dying: the real risks of climate change to UK",
            "author": "Jane Merrick",
            "url": "https://inews.co.uk/news/politics/staying-inside-cattle-dying-risks-climate-change-uk-3794969",
            "url_media": "https://inews.co.uk/wp-content/uploads/2025/07/SEI_256357104.jpg?w=1200&h=675&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "People in the UK could be forced to stay at home to shelter from extreme weather due to climate change, according to the government's Chronic Risks Analysis. The document is a 132-page detailed assessment of persistent threats facing the country, from artificial intelligence to terrorism."
        },
        {
            "published_date": "2025-07-08T16:05:39",
            "title": "Climate shocks threaten livelihood patterns of Bengaluru's communities, finds report",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/news/cities/bangalore/climate-shocks-threaten-livelihood-patterns-of-bengalurus-communities-finds-report/article69788587.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/lr3lbs/article69788846.ece/alternates/LANDSCAPE_1200/_KMK0638.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Report by Bengaluru Sustainability Forum (BSF) and Socratus highlights the impact of climate change on the city's vulnerable communities. The report highlights how poor housing conditions heightened climate risk. It also points to how damage to housing caused significant mental and financial distress among communities. Water insecurity was another factor which increased vulnerability and lower adaptive capacities of communities."
        },
        {
            "published_date": "2025-07-08T16:03:39",
            "title": "Prefers trees to development - The West Volusia Beacon",
            "author": "chaille",
            "url": "https://www.beacononlinenews.com/articles/opinion-letters_to_editor/prefers-trees-to-development",
            "url_media": "https://www.beacononlinenews.com/wp-content/uploads/images/2025-04-29/Letter-To-The-Editor.jpg",
            "country": "US",
            "language": "en",
            "summary": "Chaille is a former full-time DeLand resident and a current part-time resident. She dedicated 26 years to the Florida environment and eight years to youth environmental education for Volusia County. DeLand might still pride itself as a caring community-oriented town, but Big Money has a different priority."
        },
        {
            "published_date": "2025-07-08T16:02:26",
            "title": "Volcano Eruption Causes Flight Delays in Popular Vacation Destination",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/volcano-eruption-causes-flight-delays-in-popular-vacation-destination",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/07/Flight-delays-after-volcano-erupts-in-popular-holiday-hotspot.au2Ffs2Fa552b8f8-b1bc-4d45-8f4a-56366da1e57e.jpeg",
            "country": "NG",
            "language": "en",
            "summary": "Some flights between Australia and Bali have been delayed due to Mount Lewotobi Laki-Laki's eruption. Virgin Australia has postponed two morning departures from Brisbane and Melbourne to Denpasar this afternoon. Meteorologists are monitoring the ash cloud's movements. Jetstar and Qantas flights are expected to operate as normal."
        },
        {
            "published_date": "2025-07-08T15:42:00",
            "title": "Africa's most disaster prone country - and it's not one you might expect",
            "author": "Schannell Kanyora",
            "url": "https://www.express.co.uk/news/world/2079180/africas-most-disaster-prone-country",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6281194.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Mozambique has a World Risk Index Total (WRI) of 34.4. This is calculated by the geometric mean of a country's exposure to natural hazards and its vulnerability. Mozambique is highly susceptible to natural disasters due to a combination of geographical, climatic, and socio-economic factors."
        },
        {
            "published_date": "2025-07-08T15:40:55",
            "title": "Intense downpours like those in Texas are more frequent, but there's no telling where they'll happen",
            "author": "Associated Press",
            "url": "https://www.readingeagle.com/2025/07/08/climate-texas-floods",
            "url_media": "https://www.readingeagle.com/wp-content/uploads/2025/07/Texas_Floods_Extreme_Weather_61363.jpg?w=1024&h=682",
            "country": "US",
            "language": "en",
            "summary": "Experts say human-caused climate change is setting the stage for floods, according to a report by the Rev.Content Feed. It was originally published on July 8, 2025 at 11:40 AM EDT. It has been updated to reflect that it was updated on July 9, 2025."
        },
        {
            "published_date": "2025-07-08T15:36:52",
            "title": "Number of homeless people in Toronto more than doubled between 2021 and 2024: report",
            "author": "The Canadian Press",
            "url": "https://www.thepeterboroughexaminer.com/news/ontario/number-of-homeless-people-in-toronto-more-than-doubled-between-2021-and-2024-report/article_492fb949-e4d9-58bb-aaf6-a2bebba5d824.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thepeterboroughexaminer.com/content/tncms/assets/v3/editorial/b/1b/b1bd15c7-639e-50e4-a6dd-9afa05614a23/686d3e450ce97.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Outreach worker Lorraine Lam distributes cold weather supplies to a tented resident as temperatures plummet in Toronto on Wednesday, Jan. 8, 2025. The poster is sponsored by The Peterborough Examiner, a website based in Peterborough, New York.  "
        },
        {
            "published_date": "2025-07-08T15:32:31",
            "title": "Kashmir's summer sizzle: AC sales soar as valley copes with record temperatures",
            "author": "Nh Digital",
            "url": "https://www.nationalheraldindia.com/national/kashmirs-summer-sizzle-ac-sales-soar-as-valley-copes-with-record-temperatures",
            "url_media": "https://media.assettype.com/nationalherald%2F2025-07-08%2Fik8utned%2FGvTl1HPWkAAQmYe.jpeg?rect=0%2C0%2C1067%2C560&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "Kashmir has experienced unprecedented temperature spikes this year. On 5 July, Srinagar recorded 37.4°C, the highest July temperature in over 70 years. In June, Qazigund and Kupwara saw temperatures climb 6–8°C above normal, prompting the IMD to issue heatwave warnings."
        },
        {
            "published_date": "2025-07-08T15:27:22",
            "title": "What are the UK weather records for July?",
            "author": "Ian Jones",
            "url": "https://www.standard.co.uk/news/environment/met-office-lincolnshire-london-kew-gardens-cambridge-b1237068.html",
            "url_media": "https://static.standard.co.uk/2025/07/08/16/0e37f02a422e2dc94392b6d158d435d2Y29udGVudHNlYXJjaGFwaSwxNzUyMDczNTg4-2.80863579.jpg?width=1200&auto=webp&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "Temperatures above 40C have been officially recorded anywhere in the country for the first time in the history of the country, and so far only the date on which it was recorded in the UK. It was the highest temperature ever recorded in this part of the world."
        },
        {
            "published_date": "2025-07-08T15:16:51",
            "title": "Climate crisis hits critical tipping point as temperatures soar",
            "author": "bnm Gulf bureau",
            "url": "https://www.intellinews.com/climate-crisis-hits-critical-tipping-point-as-temperatures-soar-389985",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/Untitled_design_-_2025-07-08T114432.732.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to Ahad Vazifeh, head of the National Climate Centre and Drought Crisis Management at the Meteorological Organisation, Iran's average temperature has increased between 2 to 2.5 degrees Celsius over the past 50 years, reaching 3 degrees in central plateau regions. Annual rainfall in Iran has declined from 255mm in past decades to around 200mm currently, and evaporation potential has increased from approximately 1,100mm in the past to 1,350mm. If current conditions are not controlled and temperatures rise by 8 degrees, many cities bordering deserts will no longer have suitable living conditions."
        },
        {
            "published_date": "2025-07-08T15:15:06",
            "title": "New Study: The Arctic Was 9°C Warmer Than Today During The Holocene Thermal Maximum",
            "author": "Kenneth Richard",
            "url": "https://notrickszone.com/2025/07/08/new-study-the-arctic-was-9c-warmer-than-today-during-the-holocene-thermal-maximum",
            "url_media": "https://notrickszone.com/wp-content/uploads/2025/07/Svalbard-Arctic-temps-9C-warmer-than-today-during-the-Holocene-Thermal-Maximum-Auer-2025.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Holocene (11,700 to 8,200 years ago) Arctic temperatures were up to 9°C higher than today. Svalbard then cooled as CO2 rose for the next 8,000 years. This contradicts the rising-CO2-drives-Arctic-warmth narrative."
        },
        {
            "published_date": "2025-07-08T15:02:03",
            "title": "Not all species flee heat: New hypothesis explains surprising movements in nature",
            "author": "Science X staff",
            "url": "https://www.msn.com/en-us/news/technology/not-all-species-flee-heat-new-hypothesis-explains-surprising-movements-in-nature/ar-AA1IcmPL",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "As the climate warms, animals and plants are moving downhill, toward the equator or into shallower waters. Scientists from UNSW Sydney argue that as the climate changes, so too does the relationships between species. Understanding these dynamics is crucial for conservationists and land managers trying to predict how wildlife will respond to global warming."
        },
        {
            "published_date": "2025-07-08T15:00:25",
            "title": "Why is the Earth spinning faster? Is time speeding up? Australia's experts give us their second opinion",
            "author": "Petra Stock",
            "url": "https://www.theguardian.com/environment/2025/jul/09/why-is-the-earth-spinning-faster-is-time-speeding-up-australias-experts-give-us-their-second-opinion",
            "url_media": "https://i.guim.co.uk/img/media/44db4e9e27489e2ea17a0017cd293832862840a5/0_0_2500_2000/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d3e0d0802c817fe4240700783b1b2166",
            "country": "GB",
            "language": "en",
            "summary": "On 9 July, 22 July and 5 August, the Earth's rotation will quicken relative to the sun, truncating the days by a millisecond or more. Before the 1950s, the length of a day was defined by the Earth’s rotation and the apparent position of the sun. Today, the institute keeps track of time using atomic clocks, which are synchronised globally to Coordinated Universal Time (UTC)."
        },
        {
            "published_date": "2025-07-08T14:42:26",
            "title": "Climate change is slowing Earth's spin: How melting ice and shifting water are subtly stretching our days",
            "author": "Divya Danu",
            "url": "https://newsable.asianetnews.com/international/climate-change/climate-change-slowing-earth-spinning-melting-ice-shifting-water-stretching-days-articleshow-thbo2bs",
            "url_media": "https://static-gi.asianetnews.com/images/01jzn78t55qk5te2ygyy3apgn1/image---2025-07-08t195929.881--1--1751985186981_1280x720xt.png",
            "country": "IN",
            "language": "en",
            "summary": "In 2020, Earth was spinning faster than at any point since records began in the 1970s. On July 5, 2024, we had the shortest recorded day, which was 1.66 milliseconds shorter than the standard 24 hours. Earth's rotation is influenced by many forces, the moon, earthquakes, seasons, and now, climate change."
        },
        {
            "published_date": "2025-07-08T14:37:49",
            "title": "Nags Head Democratic Precinct to host Public Meeting on Emergency Preparedness",
            "author": "Submitted Story",
            "url": "https://www.outerbanksvoice.com/2025/07/08/nags-head-democratic-precinct-to-host-public-meeting-on-emergency-preparedness",
            "url_media": "https://www.outerbanksvoice.com/wp-content/uploads/2021/06/hurrican-preparednessdrwepearson22.jpg",
            "country": "US",
            "language": "en",
            "summary": "Nags Head Democratic Precinct to host Public Meeting on Emergency Preparedness on July 10, 2025 at 6:00 p.m. at the Nags Head Town Hall Meeting Room. Special guest speaker is Drew Pearson, Emergency Management Director for Dare County. His presentation will focus on how Dare County is preparing for hurricane season."
        },
        {
            "published_date": "2025-07-08T14:36:22",
            "title": "Manage disaster, reduce risks – government, coastal communities told",
            "author": "Jonathan L. Mayuga",
            "url": "https://businessmirror.com.ph/2025/07/08/manage-disaster-reduce-risks-government-coastal-communities-told",
            "url_media": "https://businessmirror.com.ph/wp-content/uploads/2024/07/BusinessMirror-KnowMore-2.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Oceana is calling on local government leaders to restore and protect mangrove forests and the establishment and management of local coastal greenbelt zones. Oceana believes that climate change is a serious threat to coastal communities and their livelihoods. This July is the National Disaster Resilience Month and World Mangrove Day."
        },
        {
            "published_date": "2025-07-08T14:29:50",
            "title": "Shortest day in history set for TOMORROW as Earth's rotation unexpectedly speeds up",
            "author": "CHRIS MELORE",
            "url": "https://www.dailymail.co.uk/sciencetech/article-14885815/Shortest-day-history-TOMORROW-Earths-rotation.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/07/08/14/100112035-0-image-m-14_1751981190018.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Wednesday could be the shortest day of your life as Earth's rotation is expected to move quicker than ever before. Three days this summer, July 9, July 22, and August 5 are expected to be 1.3 to 1.51 milliseconds shorter than the standard day. The fastest day recorded so far was one year ago on July 5, 2024, when Earth spun 1.66 milliseconds faster than standard 24 hours. Earth recorded its shortest day on June 30."
        },
        {
            "published_date": "2025-07-08T14:27:42",
            "title": "Extreme Heat Could Raise Death Risk For Pet Dogs By 10%, Warns Study",
            "author": "Nikhil Pandey",
            "url": "https://www.ndtv.com/science/extreme-heat-could-kill-your-dog-death-risk-rises-by-10-study-warns-pet-owners-8844332",
            "url_media": "https://c.ndtvimg.com/2025-07/gj288ccs_golden-retrievers_625x300_08_July_25.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Extreme heat can increase the risk of death in pet dogs by nearly 10%. The research highlights the growing dangers that human-induced climate change poses not just to people, but also to animals. The study analyzed 20 years of veterinary data from New South Wales and found that public holidays and Sundays carry the greatest risk for dogs."
        },
        {
            "published_date": "2025-07-08T14:25:03",
            "title": "Wednesday will be 1.30 milliseconds shorter than 24 hours.",
            "author": "طقس العرب",
            "url": "https://www.arabiaweather.com/en/content/wednesday-will-be-130-milliseconds-shorter-than-24-hours",
            "url_media": "https://iresizer.devops.arabiaweather.com/resize?url=http://adminassets.devops.arabiaweather.com/sites/default/files/field/image/60be0f8e4236041ae865f139.png&size=800x450&force_webp=1",
            "country": "JO",
            "language": "en",
            "summary": "On Wednesday, July 9, 2025, Earth will witness a unique phenomenon: a day will be shorter than 24 hours due to a slight acceleration in Earth's rotation around its axis. People won't notice this change in their daily lives, but it is closely monitored by experts in earth sciences and timekeeping."
        },
        {
            "published_date": "2025-07-08T14:14:51",
            "title": "Study: Melting Glaciers could cause more volcanic eruptions",
            "author": "Andrew Sookdeo",
            "url": "https://www.yahoo.com/news/study-melting-glaciers-could-cause-141451814.html",
            "url_media": "https://media.zenfs.com/en/united_press_international_articles_356/086a8d02bfaa5e9c47778763825ff36e",
            "country": "US",
            "language": "en",
            "summary": "The melting of glaciers due to climate change could make volcanic eruptions more catastrophic than before. The study placed six volcanoes in Chile under crystal analysis to determine how the shifting of the Patagonia Ice Sheet impacted the strength and frequency of previous eruptions. It found that following deglaciation, the volcano starts to erupt more often and changes composition."
        },
        {
            "published_date": "2025-07-08T14:12:00",
            "title": "Earth to rotate faster, making some days slightly shorter in July and August",
            "author": "arabtimes",
            "url": "https://www.arabtimesonline.com/news/earth-to-rotate-faster-making-some-days-slightly-shorter-in-july-and-august",
            "url_media": "https://www.arabtimesonline.com/arabtimes/uploads/images/2025/07/08/thumbs/400x400/77520.jpg",
            "country": "KW",
            "language": "en",
            "summary": "July 9, July 22, and August 5 will be between 1.3 and 1.51 milliseconds shorter than the typical 24-hour day on Earth. The expected shorter days in 2025 are linked to the moon reaching its furthest distance from Earth's equator. The Earth's rotation is not constant and can be influenced by a variety of factors."
        },
        {
            "published_date": "2025-07-08T14:11:06",
            "title": "Clarendon residents live in fear of rain",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/esponsored/20250708/clarendon-residents-live-fear-rain",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/07/08/beryl_victim.jpg?itok=2F43PZAB",
            "country": "JM",
            "language": "en",
            "summary": "Glenda Wright's house in Portland Cottage, Clarendon, had its roof torn off by Hurricane Beryl last year. Patrick Osbourne's three-bedroom house was reduced to one after the storm. Darol Myrie has been unable to live in his childhood home for nearly a year."
        },
        {
            "published_date": "2025-07-08T14:11:04",
            "title": "Earth to spin faster this summer; three days will be shorter than normal",
            "author": "Tags",
            "url": "https://www.naturalnews.com/2025-07-08-earth-spin-summer-days-shorter.html",
            "url_media": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/07/Background-Ball-Blue-Cartography-Continent-Earth-Geography.jpg",
            "country": "US",
            "language": "en",
            "summary": "Earth will spin faster on July 9, July 22, and August 5 this summer, making each day up to 1.51 milliseconds shorter than usual. The moon's position farthest from Earth's equator reduces gravitational drag on the planet. The Earth's rotation has been slowing over geologic time due to tidal friction caused by the moon's retreat, but recent observations reveal unexpected accelerations."
        },
        {
            "published_date": "2025-07-08T14:09:37",
            "title": "Tundra fire on Alaska's North Slope is among the biggest in recent years",
            "author": "",
            "url": "https://www.adn.com/alaska-news/2025/07/08/tundra-fire-on-alaskas-north-slope-is-among-the-biggest-in-recent-years",
            "url_media": "https://www.adn.com/resizer/v2/WW3QM3ZWFRCWNG5QVJDHCNGLOY.png?smart=true&auth=65d183be44953c5e339296f28655b35748281a28c1d0b158c26ce3ec21ab02d1&width=1200&height=630",
            "country": "US",
            "language": "en",
            "summary": "Ikpikpuk Fire has burned 2,000 acres of Arctic Alaska tundra since June 22. It's the biggest North Slope tundrra fire since 2017, when Ketik River fire east of Wainwright burned 2.870 acres. Wildfires north of the Brooks Range are becoming more common and bigger, according to scientists. The frequency of significant wildfires on the North Slopes has tripled recently."
        },
        {
            "published_date": "2025-07-08T13:54:38",
            "title": "Can you trust climate information? How and why powerful players are misleading the public",
            "author": "Klaus Bruhn Jensen",
            "url": "https://theconversation.com/can-you-trust-climate-information-how-and-why-powerful-players-are-misleading-the-public-260251",
            "url_media": "https://images.theconversation.com/files/678307/original/file-20250704-56-2w83zj.jpg?ixlib=rb-4.1.0&rect=0%2C134%2C7063%2C3531&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Ten years ago, the world committed itself to keeping global warming well below 2°C (and preferably below 1.5°C) above the pre-industrial era. This would be done by reducing greenhouse gas emissions significantly by 2030 and ending all human-caused emissions by 2050. Today, there's a disconnect between stated policies and actual practices. Media and communication researchers focus on environmental communication. Their study found that the human response to the climate crisis is being obstructed by the production and circulation of misleading information."
        },
        {
            "published_date": "2025-07-08T13:42:04",
            "title": "The End of the Green Panic – [your]NEWS",
            "author": "Restoration News Staff",
            "url": "https://yournews.com/2025/07/08/3597345/the-end-of-the-green-panic",
            "url_media": "https://cdn.yournews.com/wp-content/uploads/2025/07/climate-justice-protester.jpg",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump's election has given cover for leaders to back away from green energy boondoggles. Nobody believes the fundamental premise of global warming anyway, despite the decades of panic fomented by globalists, totalitarians, and grifters hoping to cash in."
        },
        {
            "published_date": "2025-07-08T13:19:58",
            "title": "Why ex-NOAA chief thinks DOGE cuts may have hurt flood response",
            "author": "Daniel Lewis",
            "url": "https://www.cnn.com/2025/07/08/us/video/texas-flood-doge-trump-cuts-spinrad-digvid",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/richard-spinrad.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "Rick Spinrad, a former NOAA Administrator, believes the government staffing cuts implemented by the Trump administration may have hindered the response to the devastating floods in Texas. CNN has reached out to the NOAA for comment on the matter but no comment has yet been returned. "
        },
        {
            "published_date": "2025-07-08T13:07:52",
            "title": "Acropolis closes as Greece sizzles under another severe heatwave",
            "author": "Al Jazeera",
            "url": "https://article.wn.com/view/2025/07/08/Acropolis_closes_as_Greece_sizzles_under_another_severe_heat",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "Greece has shut down the Acropolis and halted outdoor work across the country due to high temperatures. The heatwave scorches the region, pushing temperatures to above 40C (104F) and leading to fire alerts and severe weather warnings across the Balkans."
        },
        {
            "published_date": "2025-07-08T13:07:30",
            "title": "Human Negligence Behind 90% of Bulgaria's Forest Fires",
            "author": "Web",
            "url": "https://www.novinite.com/articles/233301/Human+Negligence+Behind+90+of+Bulgaria%E2%80%99s+Forest+Fires",
            "url_media": "https://www.novinite.com/media/images/2025-07/photo_verybig_233301.jpg",
            "country": "BG",
            "language": "en",
            "summary": "More than 1.1 million acres of land have burned in Bulgaria over the past 15 years. Since 2010, there have been more than 7,000 forest fires in Bulgaria. The regions most affected include the Rhodopes, Strandzha, Pirin, and Sakar mountains. The cost of dealing with the damages this year has surpassed the total expenditure for the previous seven years combined."
        },
        {
            "published_date": "2025-07-08T13:01:24",
            "title": "Texas Camp Tradition Survives Flood: 2025 Resilience",
            "author": "James Carter",
            "url": "https://www.archyde.com/texas-camp-tradition-survives-flood-2025-resilience",
            "url_media": "https://i.guim.co.uk/img/media/1c75bba93dc1e8e3e3650aa984eef93c6f130001/458_0_4583_3667/master/4583.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8cd37b1e8f0da62c80ac6459a3bd0be8",
            "country": "US",
            "language": "en",
            "summary": "The recent flooding in the Texas Hill Country killed many people and disrupted lives. Climate change is increasing the frequency and severity of extreme weather events. The recent tragedy at Camp Mystic raised questions about emergency preparedness and communication. People and communities can take steps to mitigate flood risks."
        },
        {
            "published_date": "2025-07-08T12:30:00",
            "title": "Letter: Denying global warning isn't cool",
            "author": "",
            "url": "https://www.postbulletin.com/opinion/letters/letter-denying-global-warning-isnt-cool",
            "url_media": "https://cdn.forumcomm.com/dims4/default/147eb48/2147483647/strip/true/crop/940x788+0+0/resize/1272x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fpostbulletin%2Fbinary%2FLetter%20to%20the%20Editor_binary_5041151.png",
            "country": "US",
            "language": "en",
            "summary": "The two hottest years ever recorded globally were 2023 and 2024. This year could exceed them. The U.S. is the second-largest greenhouse gas emitter. The government is denying there is a problem to solve. Years of work to rely less on fossil fuels and plan for the coming crisis are being dismantled."
        },
        {
            "published_date": "2025-07-08T12:22:08",
            "title": "Hemsby coastal erosion scheme aims to rehome households",
            "author": "Owen Sennitt",
            "url": "https://edp24.co.uk/news/25297358.hemsby-coastal-erosion-scheme-aims-rehome-households",
            "url_media": "https://www.edp24.co.uk/resources/images/17532781.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Great Yarmouth Borough Council proposes investing £1.6m in developing a project to provide new housing for people living in Hemsby, Norfolk. Up to 30 homes in high risk areas in the village could be demolished and replaced with new housing built on farmland. Council will meet to discuss the project on July 15."
        },
        {
            "published_date": "2025-07-08T12:17:10",
            "title": "Brits urged to do 1 simple garden task during the heatwave",
            "author": "Vita Molyneux",
            "url": "https://www.mirror.co.uk/lifestyle/how-to-help-garden-birds-35519931",
            "url_media": "https://i2-prod.mirror.co.uk/article35519930.ece/ALTERNATES/s1200/0_a-sparrow-bathing-in-a-stony-bird-bath.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Temperatures are set to soar to 30 degrees in some parts of the UK. People are being urged to help birds in their gardens to cope with the hot weather. The main food that garden birds need at this time of year is invertebrates, including caterpillars, flying insects, earthworms, snails and snails."
        },
        {
            "published_date": "2025-07-08T12:03:19",
            "title": "Sonia Rao",
            "author": "Sonia Rao",
            "url": "https://www.sierraclub.org/sierra/authors/sonia-rao",
            "url_media": "https://www.sierraclub.org/sites/default/files/styles/sierra_half_column_width/public/2025-07/sierra-david-reid-tn.jpeg.webp?itok=hQ5JLdAJ",
            "country": "US",
            "language": "en",
            "summary": "The impact of Hurricane Helene will linger for years, but the region's woods are resilient, as shown by the damage caused by Helene's winds and rain. The area's forests are very resilient.      Â   y  "
        },
        {
            "published_date": "2025-07-08T11:59:51",
            "title": "KPK bears brunt as Pakistan's most vulnerable to monsoon floods",
            "author": "",
            "url": "https://www.nation.com.pk/08-Jul-2025/kpk-bears-brunt-as-pakistan-s-most-vulnerable-to-monsoon-floods",
            "url_media": "https://www.nation.com.pk/digital_images/large/2025-07-08/kpk-bears-brunt-as-pakistan-s-most-vulnerable-to-monsoon-floods-1751975980-8594.png",
            "country": "PK",
            "language": "en",
            "summary": "Khyber Pakhtunkhwa (KPKP) is the most vulnerable province in Pakistan to the ongoing monsoon crisis. It has been hit the hardest, with over 29 lives lost, many injured, and extensive destruction to infrastructure. KPK has endured similar disasters before. Climate change intensifies these extreme weather events. Pakistan contributes only 0.88% of global emissions, but ranks fifth globally in climate vulnerability."
        },
        {
            "published_date": "2025-07-08T11:56:17",
            "title": "‘Rubbish': Taxpayers fund $1.5 million climate summit trip despite increased carbon emissions",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/andrew-bolt/rubbish-taxpayers-fund-15-million-climate-summit-trip-despite-increased-carbon-emissions/video/170d8ebee35a24b421ce0e03be339842",
            "url_media": "https://content.api.news/v3/images/bin/791265c6d96bb0741b2d1ba6769301a3",
            "country": "AU",
            "language": "en",
            "summary": "$1.5 million was spent for 75 public servants to attend a UN climate change summit. Senator Matt Canavan is critical of the amount spent and the fact that carbon emissions continue to go up. He doesn't think the taxpayer should be funding the event."
        },
        {
            "published_date": "2025-07-08T11:45:00",
            "title": "Communities across US struggle with new threats emerging beneath their feet: 'When you walk, you feel like you're on jelly'",
            "author": "Alyssa Ochs",
            "url": "https://www.yahoo.com/news/communities-across-us-struggle-threats-114500981.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/lB2Xl7RMNdwT80.7ugXMQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/080e1bef811cc1018d4657e760741186",
            "country": "US",
            "language": "en",
            "summary": "Indigenous people living in coastal areas of the U.S. are being displaced by extreme weather and rising seas. In Alaska, permafrost thawing and riverbank erosion is eating away land from underneath the villages. Indigenous knowledge can provide insights into drought-resistant crops, sustainable water management practices, and responsible land stewardship."
        },
        {
            "published_date": "2025-07-08T11:38:30",
            "title": "Just Energy Transition and the Global South: Yes, but only on our terms",
            "author": "Opinion",
            "url": "https://iol.co.za/technology/opinion/2025-07-08-just-energy-transition-and-the-global-south-yes-but-only-on-our-terms",
            "url_media": "https://iol-prod.appspot.com/image/512e554cacfcf3e32da672ba975c3135da154630/2144/jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "Climate change poses significant challenges for countries in the Global South. The Global South is more susceptible to extreme weather events such as hurricanes, cyclones, floods, droughts, and heatwaves. The costs of adapting to climate change and recovering from climate-related disasters can strain national budgets. Global North created and continues to exacerbate the climate crisis. Developing nations should seek support from developed nations to address climate challenges."
        },
        {
            "published_date": "2025-07-08T11:22:16",
            "title": "Pakistan: Neglect, mismanagement leave Sindh drowning in climate chaos",
            "author": "Asianet Newsable English",
            "url": "https://newsable.asianetnews.com/world/pakistan-neglect-mismanagement-leave-sindh-drowning-in-climate-chaos-articleshow-m3s0ffg",
            "url_media": "https://static-gi.asianetnews.com/images/ani20250708110102/image-341e02b6-e22e-4b78-9ee8-d321fe4b6071_1280x720xt.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is devastating communities across Pakistan, especially in Sindh. Extreme weather events, food insecurity, and health crises are growing with alarming intensity. Pakistan is among the most vulnerable nations to climate change, owing to its arid climate, agrarian economy, and heavy reliance on glacial water from the Himalayas."
        },
        {
            "published_date": "2025-07-08T11:20:38",
            "title": "Tomorrow The Earth Will Spin Faster Than Normal Making The Day 1.30 Milliseconds Shorter",
            "author": "James Felton",
            "url": "https://www.iflscience.com/nobody-expected-this-earths-rotation-will-speed-up-tomorrow-bucking-the-downward-trend-79905",
            "url_media": "https://assets.iflscience.com/assets/articleNo/79905/aImg/84973/spin-meta.png",
            "country": "GB",
            "language": "en",
            "summary": "Tomorrow on July 9, the first of three especially short days, it is expected to be 1.30 milliseconds shorter than usual. This year in July and August, we are predicted to have some shorter days again. Since 1972, there have been 27 leap seconds added to account for the decreased rotation rate of the Earth. Since 2016, no leap second has been necessary. Nobody is sure why the Earth's rotation has been speeding up again."
        },
        {
            "published_date": "2025-07-08T11:20:19",
            "title": "World News  Pakistan: Neglect, Mismanagement Leave Sindh Drowning in Climate Chaos",
            "author": "ANI",
            "url": "https://www.latestly.com/agency-news/world-news-pakistan-neglect-mismanagement-leave-sindh-drowning-in-climate-chaos-6981345.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250708110102-588x441.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is devastating communities across Pakistan, especially in Sindh, where extreme weather events, food insecurity, and health crises are growing with alarming intensity. Sindh was hit hardest during the 2022 floods, receiving over 400 per cent more rainfall than the 30-year average. The deluge destroyed nearly 1.9 million homes, 83 per cent of the national total, and caused 799 fatalities, including 338 children. The flooding damaged over 4.4 million acres of farmland and killed 8,00,000 livestock, devastating the rural economy. The floods worsened existing poverty, with districts like Badin reporting poverty rates of 53.4 per cent."
        },
        {
            "published_date": "2025-07-08T11:18:55",
            "title": "Sindh Launches Climate Action Plan to Confront Escalating Environmental Crisis",
            "author": "",
            "url": "https://paktribune.com/sindh-launches-climate-action-plan-to-confront-escalating-environmental-crisis",
            "url_media": "https://paktribune.com/wp-content/uploads/2025/02/paktribune-site-icon--32x32.png",
            "country": "PK",
            "language": "en",
            "summary": "The Sindh government has unveiled a comprehensive climate action strategy to address the province's environmental challenges. The province is experiencing extreme heat, drought, flooding, and coastal erosion. The plan includes expanding mangrove plantations in the Indus Delta and large-scale reforestation under the Green Sindh initiative to absorb carbon and reduce flood impact."
        },
        {
            "published_date": "2025-07-08T11:17:46",
            "title": "Heat and heavy metals are changing the way that bees buzz",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Heat_and_heavy_metals_are_changing_the_way_that_bees_buzz",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "There is ongoing research into the effect of environmental change on the buzzing of bees. High temperatures may be a factor in the buzzing, according to the research.    .      in high temperatures are bad for bees' health, as well as for humans."
        },
        {
            "published_date": "2025-07-08T11:07:38",
            "title": "Climate Crisis: Sindh's Battle with Extreme Weather",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/international/3496928-climate-crisis-sindhs-battle-with-extreme-weather",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_07_2025_16_37_30_3056746.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is wreaking havoc on communities across Pakistan, particularly in Sindh. Pakistan's geographic and economic factors make it one of the most climate-vulnerable nations globally. Floods demolished nearly 1.9 million homes and claimed 799 lives, including those of 338 children. Over 4.4 million acres of farmland damaged and 800,000 livestock lost."
        },
        {
            "published_date": "2025-07-08T11:03:40",
            "title": "Balkans Battled by Extreme Weather: Hailstorms and Wildfires Ravage Region",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3496926-balkans-battled-by-extreme-weather-hailstorms-and-wildfires-ravage-region",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/03_07_2025_15_03_40_6261495.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A hailstorm hit Split, damaging roofs and uprooting trees and causing extensive material damage. Serbia is battling over 600 wildfires and drought. Meteorologists warn of continued severe weather conditions in the region due to climate change. The Balkans, along with much of Europe, endured a severe heatwave in early July."
        },
        {
            "published_date": "2025-07-08T11:00:12",
            "title": "Lizard Island on Australia's Great Barrier Reef faces alarming coral loss following 2024 bleaching",
            "author": "The Hans India",
            "url": "https://www.thehansindia.com/news/international/lizard-island-on-australias-great-barrier-reef-faces-alarming-coral-loss-following-2024-bleaching-986316",
            "url_media": "https://assets.thehansindia.com/h-upload/2025/07/08/1566154-izard.jpg",
            "country": "IN",
            "language": "en",
            "summary": "92 per cent of surveyed corals on Lizard Island on Australia's Great Barrier Reef died after the 2024 bleaching event. It is one of the highest coral mortality rates ever documented globally. Lizard Island's reefs remain fragile after years of repeated damage. Scientists will monitor them through 2026 for signs of recovery."
        },
        {
            "published_date": "2025-07-08T10:59:23",
            "title": "Climate Change in America: Local Solutions Making a Difference",
            "author": "Hannah Swanson",
            "url": "https://www.newsmax.com/platinum/climate-change-states-cities/2025/06/18/id/1215581",
            "url_media": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=015abaf7-78a8-472a-b226-b1ec4f918849&SiteName=Newsmax",
            "country": "US",
            "language": "en",
            "summary": "In 2024, the world experienced its hottest year on record since tracking began in 1850, according to Climate.gov. Climate change is driven by pollution from human activity. Its impacts are becoming more visible and personal every day, as hurricanes grow stronger, wildfires rage longer and global temperatures climb."
        },
        {
            "published_date": "2025-07-08T10:58:42",
            "title": "Deadly floods could be new normal as Trump guts federal agencies, experts warn",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/08/Deadly_floods_could_be_new_normal_as_Trump_guts_federal_agen_v",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "The deadly Texas floods could signal a new norm in the US, as Donald Trump and his allies dismantle crucial federal agencies. The threat from extreme weather grows due to the human-caused climate crisis, as a result of climate change, according to the IPCC."
        },
        {
            "published_date": "2025-07-08T10:53:10",
            "title": "Greece shuts the Acropolis due to high temperatures",
            "author": "",
            "url": "https://www.bastillepost.com/global/article/5012356-greece-shuts-the-acropolis-due-to-high-temperatures",
            "url_media": "https://image.bastillepost.com/640x/wp-content/uploads/global/2025/07/ea91302a3e25bb9491ed2a9151ffe6b1_Greece_Heat_Wave_Weather_73038_FB.jpg",
            "country": "CN",
            "language": "en",
            "summary": "Authorities closed the Acropolis for several hours Tuesday due to high temperatures. Work restrictions remained in effect in other parts of Greece. The measures started Monday for outdoor workers. Those who don't comply face a 2,000 euro ($2,350) fine per worker. Authorities said the risk of wildfires is expected to increase during the week."
        },
        {
            "published_date": "2025-07-08T10:48:51",
            "title": "Chantal Flooding, Davis Eyes Senate, Charter School Clash",
            "author": "Steve Anthony",
            "url": "https://wbt.com/1421310/chantal-flooding-davis-eyes-senate-charter-school-clash",
            "url_media": "https://wbt.com/wp-content/uploads/sites/84/2024/09/17267529852336.jpg?quality=80&strip=all&w=700&crop=0,0,100,400px",
            "country": "US",
            "language": "en",
            "summary": "The U.S. has extended a trade deadline and increased tariffs on goods from Japan and South Korea. Tropical Storm Chantal has caused historic flooding across central North Carolina. Congressman Don Davis is exploring a run for the U.s. Senate seat being vacated by Thom Tillis. In Davidson County, a student has won a free speech case after being disciplined for using the term 'illegal aliens' in class. The State Board of Education is pushing back against a new charter school bill."
        },
        {
            "published_date": "2025-07-08T10:47:02",
            "title": "Heatwaves, droughts and wildfires costing Europe billions each year",
            "author": "",
            "url": "https://ddnews.gov.in/en/heatwaves-droughts-and-wildfires-costing-europe-billions-each-year",
            "url_media": "https://ddnews.gov.in/wp-content/uploads/2024/04/favicon.png",
            "country": "IN",
            "language": "en",
            "summary": "Extreme heat and drought are gripping large parts of Europe, sparking wildfires, triggering red alerts and intensifying global calls for effective climate actions. Europe has faced an alarming rise in climate-driven calamities like extreme weather conditions, particularly heatwaves and wildfires. In 2023, climate-related disasters cost around 45 billion euros to 38 European countries, including EU, other European Economic Area (EEA) members and cooperating countries. Germany, Italy, France and Spain faced the highest economic losses."
        },
        {
            "published_date": "2025-07-08T10:45:00",
            "title": "Scientists make worrying discovery after studying killer whale behavior: 'Such shifts highlight potential implications'",
            "author": "Laurelle Stelle",
            "url": "https://www.yahoo.com/news/scientists-worrying-discovery-studying-killer-104500878.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/bQfCZSGPE1JaOzfi55Gt.A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/6b788795fe76a441a3abf5565ec564b4",
            "country": "US",
            "language": "en",
            "summary": "Melting Arctic ice has grave implications for the planet. It means rising sea levels and helping lock in higher temperatures. It also has a dramatic effect on the marine life that has evolved to rely on an icy northern climate. Researchers examined 20 years of data on orca sightings and found a worrying trend linked to the receding ice. Killer whales are spending almost twice as long in the area now as they were 20 years ago."
        },
        {
            "published_date": "2025-07-08T10:26:18",
            "title": "Yorkshire households first to face hosepipe ban as hot dry summer bites",
            "author": "Emily Beament",
            "url": "https://www.standard.co.uk/business/business-news/west-yorkshire-england-environment-agency-united-utilities-people-b1236962.html",
            "url_media": "https://static.standard.co.uk/2025/07/08/11/d26917950585c1e435ad9b69794f2a4fY29udGVudHNlYXJjaGFwaSwxNzUyMDU1Nzk2-2.68169487.jpg?width=1200&auto=webp&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "England has experienced the hottest spring from March to May on record and the driest in over a century. It has also had the hottest June on record, with two searing heatwaves hitting parts of the country in the second part of the month and into July."
        },
        {
            "published_date": "2025-07-08T10:14:16",
            "title": "When the Earth burned for 5 million years: Great Dying could happen again with just as deadly results, scientists warn",
            "author": "Debbie Graham",
            "url": "https://www.discoverwildlife.com/environment/great-dying-two",
            "url_media": "https://c02.purpledshub.com/uploads/sites/62/2025/07/great-dying.jpg?w=1200",
            "country": "GB",
            "language": "en",
            "summary": "The Great Dying took place 250 million years ago, when 81% of marine species and 70% of vertebrate terrestrial animals went extinct. The cause of the mass extinction is thought to have been a massive increase in volcanic activity in present day Siberia. The loss of plant cover in The Great Dying, argues the paper, made the bad atmospheric situation worse."
        },
        {
            "published_date": "2025-07-08T10:05:34",
            "title": "Guyana fully committed to Caricom's push for regional integration, climate action, food security",
            "author": "GTIMES",
            "url": "https://guyanatimesgy.com/guyana-fully-committed-to-caricoms-push-for-regional-integration-climate-action-and-food-security-president-ali",
            "url_media": "https://guyanatimesgy.com/wp-content/uploads/2025/07/caricomday.jpg",
            "country": "GY",
            "language": "en",
            "summary": "Guyana's President Dr Irfaan Ali has sent a message on CARICOM Day calling for regional integration, tackling climate change and strengthening food and energy security across the Caribbean. Jamaica's Prime Minister Dr Andrew Holness addressed the 49th Regular Meeting of the Caricom Heads of Government in Montego Bay, Jamaica, from July 6-8, 2025."
        },
        {
            "published_date": "2025-07-08T10:04:00",
            "title": "Extreme Heat Linked To Increased Pet Dog Deaths",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/extreme-heat-linked-to-increased-pet-dog-deaths-1492173",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/def_rota/news2.jpeg",
            "country": "US",
            "language": "en",
            "summary": "New UNSW-led research confirms man's best friend is at risk from human-induced climate change. The study analyses 20 years of veterinary data from New South Wales and finds that public holidays and Sundays carry the greatest risk for dogs. The highest mortality rates were recorded on New Year's Day, followed by Christmas Day. High temperatures can lead to heat stroke in both humans and dogs."
        },
        {
            "published_date": "2025-07-08T10:01:11",
            "title": "To reduce disaster risk, coastal towns urged to create greenbelt zones",
            "author": "Iya Gozum",
            "url": "https://www.rappler.com/philippines/dilg-order-coastal-towns-create-greenbelt-zones",
            "url_media": "https://www.rappler.com/tachyon/2025/06/Lapus-Lapus-Macapagao1.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Department of Interior and Local Government (DILG) has come up with new guidelines directing coastal local governments to establish, reforest, and protect coastal greenbelt zones. Greenbelt zones are defined as strips of natural or planted coastal vegetation such as mangroves and beach forests that act as buffers for coastal communities against hazards. Oceana's data shows that there are at least 20 areas across the country that established coastal greenbelts."
        },
        {
            "published_date": "2025-07-08T09:44:04",
            "title": "Global 3C warming would hurt UK economy much more than previously predicted, OBR says",
            "author": "Reuters",
            "url": "https://www.reuters.com/sustainability/cop/global-3c-warming-would-hurt-uk-economy-much-more-than-previously-predicted-obr-2025-07-08",
            "url_media": "https://www.reuters.com/resizer/v2/6B7RXX47GFNTJARUPTIWKCBMEQ.jpg?auth=3e8e459d64ef8a5b3d5978d0a190759136dfc750e4346f7e8e1d8c5453dda555&height=1005&width=1920&quality=80&smart=true",
            "country": "GB",
            "language": "en",
            "summary": "A rise in global temperatures to almost 3 degrees Celsius (5.4 degrees Fahrenheit) above pre-industrial levels would hurt Britain's economy much more than previously assumed. The combined fiscal impacts of climate damage and mitigation could add 74% of GDP to government debt by the early 2070s."
        },
        {
            "published_date": "2025-07-08T09:41:34",
            "title": "Türkiye reduces fire response time as forest area continues to grow",
            "author": "Daily Sabah With Aa",
            "url": "https://www.dailysabah.com/turkiye/turkiye-reduces-fire-response-time-as-forest-area-continues-to-grow/news",
            "url_media": "https://idsb.tmgrup.com.tr/ly/uploads/images/2025/07/08/thumbs/1200x675/390706.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Türkiye's forest volume grew from 935 million cubic meters to 1.8 billion cubic meters since 1973. Since 1973, the country has expanded its forest area from 20.2 million hectares to 23.4 million hectares. The share of productive forests increased from 44% to 59% in the same period, while forest volume nearly doubled. Since the 1970s, the world has experienced a net loss in forest area, with approximately 420 million hectares converted to other land uses between 1990 and 2020. The decline is attributed partly to reforestation and rehabilitation efforts in countries like China, India and T Turkey."
        },
        {
            "published_date": "2025-07-08T09:38:02",
            "title": "Rising Global Temperatures: A Costly Economic Impact for Britain",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3496779-rising-global-temperatures-a-costly-economic-impact-for-britain",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/25_06_2025_11_49_41_9426561.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Office for Budget Responsibility has warned about the economic repercussions of global warming. Their report anticipates a 74% GDP increase in government debt by the early 2070s due to combined climate damage and mitigation measures. UN report from October last year predicts that current climate policies could lead to global warming exceeding 3 degrees Celsius by century's end."
        },
        {
            "published_date": "2025-07-08T09:26:00",
            "title": "Heat Stress Alters Chicken Fat Metabolism",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/heat-stress-alters-chicken-fat-metabolism-1492542",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1517048676732-d65bc937f952%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Broiler chickens, bred for rapid growth, accumulate more fat under chronic heat stress, which reduces meat quality and production efficiency. Heat stress costs the poultry industry US$128-165 million annually. A recent study from Shinshu University, Japan, suggests new strategies to mitigate heat stress-related losses in poultry production amidst global warming."
        },
        {
            "published_date": "2025-07-08T09:21:40",
            "title": "Third of chip production could face copper supply disruptions by 2035, PwC report says",
            "author": "The Economic Times",
            "url": "https://article.wn.com/view/2025/07/08/Third_of_chip_production_could_face_copper_supply_disruption",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change may severely impact global chip production, according to a new report. Copper supply is crucial for semiconductors, which are sensitive to changes in the environment.      Â   .   in this case, it may affect the production of chips. "
        },
        {
            "published_date": "2025-07-08T09:10:56",
            "title": "‘Vigorous, urgent need' to strengthen regional collaboration, trade –President Ali",
            "author": "Staff Reporter",
            "url": "https://guyanachronicle.com/2025/07/08/vigorous-urgent-need-to-strengthen-regional-collaboration-trade-president-ali",
            "url_media": "https://guyanachronicle.com/wp-content/uploads/2025/07/caricom.jpg",
            "country": "GY",
            "language": "en",
            "summary": "President Irfaan Ali is in Kingston for the 49th Meeting of the Conference of Heads of Government of CARICOM. He is promoting intra-regional trade as a driver of economic stability and growth within the Caribbean Community (CARICOM). Barbados Prime Minister Mia Mottley reports that at least two member states are in the process of acquiring cargo planes to transport goods within the region."
        },
        {
            "published_date": "2025-07-08T09:07:52",
            "title": "Arte: How do heatwaves reveal social inequalities?",
            "author": "Szerzo Bozso-Agnes",
            "url": "https://telex.hu/english/2025/07/08/arte-how-do-heatwaves-reveal-social-inequalities",
            "url_media": "https://assets.telex.hu/images/20250708/1751965458-temp-BnKEDD_facebook.jpg",
            "country": "HU",
            "language": "en",
            "summary": "Heatwaves affecting Europe are going to become longer, more frequent and more intense. Poorer people are more at risk of suffering from related health issues and less likely to have access to green spaces. Some European countries are already testing new methods for fighting the heat. This programme is produced by the European platform ARTE and available in 10 languages."
        },
        {
            "published_date": "2025-07-08T09:06:39",
            "title": "Melting glaciers may trigger volcanic eruptions",
            "author": "Web Desk",
            "url": "https://www.thenews.com.pk/latest/1327124-melting-glaciers-may-trigger-volcanic-eruptions",
            "url_media": "https://www.thenews.com.pk/assets/uploads/updates/2025-07-08/1327124_021057_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Scientists warn that melting glaciers may cause volcanic eruptions to become more frequent and powerful, possibly worsening climate change. This warning is based on a recent study of six volcanoes in southern Chile during the last ice age. The researchers will present their findings on Wednesday (July 8) at the 2025 Goldschmidt Conference in Prague."
        },
        {
            "published_date": "2025-07-08T08:48:27",
            "title": "Reading public to have their say on climate change",
            "author": "Olivia Endellion Mowl",
            "url": "https://www.readingchronicle.co.uk/news/25296227.reading-public-say-climate-change",
            "url_media": "https://www.readingchronicle.co.uk/resources/images/19601386.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Draft Reading Climate Emergency Plan 2025-2030 is available now. Reading Climate Change Partnership invites the public to comment on it before the end of July. You can visit the stakeholder review page at: https://rdguk.info/YPFOx."
        },
        {
            "published_date": "2025-07-08T08:47:00",
            "title": "People urged to do 1 simple task in all gardens during hot weather",
            "author": "Vita Molyneux",
            "url": "https://www.express.co.uk/life-style/garden/2078885/help-birds-in-garden-during-heatwave",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/13/1200x630/6279653.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Temperatures are forecast to hit 30C in parts of the UK this week. Bird's chance of survival for the whole year drops by 63% on average when the weather gets hotter than 1C. Lucy Taylor, a garden wildlife expert at Vine House Farm Bird Foods recommends providing birds with dried mealworms soaked in water to keep them healthy."
        },
        {
            "published_date": "2025-07-08T08:38:16",
            "title": "Earth 'could have once been like Saturn' for this reason and it changes everything",
            "author": "Sinead Butler",
            "url": "https://www.indy100.com/science-tech/earth-saturn-ring-science-discovery-2672941794",
            "url_media": "https://www.indy100.com/media-library/image.png?id=53652805&width=1200&height=600&coordinates=0%2C117%2C0%2C237",
            "country": "US",
            "language": "en",
            "summary": "21 asteroid craters from 466 million years ago were found in an area close to the equator. The theory suggests tidal forces caused the asteroid to break up and form a debris ring around Earth, just like Saturn's ring system. Such a ring would've cast a shadow on Earth and blocked sunlight, which could have had climate implications."
        },
        {
            "published_date": "2025-07-08T08:37:05",
            "title": "Scientists Find That Melting Glaciers Can Cause Volcanic Eruptions",
            "author": "Priya Pathak",
            "url": "https://www.republicworld.com/science/scientists-find-that-melting-glaciers-can-cause-volcanic-eruptions",
            "url_media": "https://img.republicworld.com/all_images/several-flights-cancelled-in-indonesia-due-to-volcano-eruption-1742576449521-16_9.webp",
            "country": "US",
            "language": "en",
            "summary": "As glaciers melt around the planet, this might cause additional volcanic eruptions. There are volcanoes under glaciers in Antarctica, Alaska, Pacific Northwest, New Zealand, The Kamchatka Peninsula in Russia and Iceland. If warming keeps going at its current rate, these places could see more volcanic activity in the next few decades. This is why scientists think we need to cut down on greenhouse gas emissions."
        },
        {
            "published_date": "2025-07-08T08:18:52",
            "title": "Sierra Leone Islanders Despair As Rising Ocean Threatens Survival",
            "author": "ETV Bharat",
            "url": "https://www.etvbharat.com/en/!offbeat/sierra-leone-islanders-despair-as-rising-ocean-threatens-survival-enn25070802546",
            "url_media": "https://etvbharatimages.akamaized.net/etvbharat/prod-images/08-07-2025/1200-675-24544031-963-24544031-1751962685676.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Hassan Kargbo's island of Nyangai off Sierra Leone has been destroyed by rising sea levels due to climate change. The island has lost two-thirds of its surface area in less than 10 years. It measures only about 200 metres long and 100 metres wide. The majority of the island's residents have lost their belongings and homes several times over."
        },
        {
            "published_date": "2025-07-08T08:17:42",
            "title": "Time is running faster: 3 days will be shorter",
            "author": "Marc Menendez-Roche",
            "url": "https://euroweeklynews.com/2025/07/08/time-is-running-faster-scientists-reveal-why-these-3-days-this-summer-will-be-shorter",
            "url_media": "https://cdn.euroweeklynews.com/wp-content/uploads/2025/07/3-days-this-summer-2025-will-be-shorter.jpg",
            "country": "ES",
            "language": "en",
            "summary": "July 9, July 22, and August 5, 2025, will be slightly shorter than usual because of the Moon's gravitational pull. The Earth's rotation will shave off between 1.3 and 1.51 milliseconds on those days. The Moon's position will make each day slightly shorter on those dates. Climate change is also changing how fast our planet turns."
        },
        {
            "published_date": "2025-07-08T08:06:36",
            "title": "Philippines Faces Urgent Call for Climate-Resilient School Infrastructure",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/education/3496671-philippines-faces-urgent-call-for-climate-resilient-school-infrastructure",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/22_05_2025_08_49_23_7812709.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Philippines is facing a shortage of classrooms, exacerbated by the effects of climate change. Over 165,000 classrooms are needed. UNICEF reports that 96% of Filipino children face multiple climate-related hazards. Teachers advocate for increased budget allocations to build and repair facilities."
        },
        {
            "published_date": "2025-07-08T08:00:00",
            "title": "Letters July 8: Heat domes; Oak Bay should do its part",
            "author": "The Times Colonist",
            "url": "https://www.timescolonist.com/opinion/letters-july-8-heat-domes-oak-bay-should-do-its-part-10912542",
            "url_media": "https://www.vmcdn.ca/f/files/victoriatimescolonist/json/2025/07/web1_06262022-hot-vancouver.jpg;w=1000;h=750;mode=crop",
            "country": "US",
            "language": "en",
            "summary": "The June 2021 heat dome in Victoria was extremely rare and extreme. It was 39.8 C at Victoria Gonzales, which was 4 C hotter than the previous record temperature for that location. Urbanization and urban heat island effect are to blame for the rise in heat dome-related deaths since 1850."
        },
        {
            "published_date": "2025-07-08T07:57:12",
            "title": "Sierra Leone islanders despair as rising ocean threatens survival",
            "author": "AFP",
            "url": "https://www.thehindu.com/sci-tech/energy-and-environment/sierra-leone-islanders-despair-as-rising-ocean-threatens-survival/article69786737.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/an6x8/article69786758.ece/alternates/LANDSCAPE_1200/AFP_62UZ93Q.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Hassan Kargbo's island off Sierra Leone has been destroyed by rising sea levels due to climate change. The inhabitants of Nyangai, located in the Turtle Islands off southern Sierra Leone, have made no contribution to global warming, but they are considered the country's first people displaced by it. The island has lost two-thirds of its surface area in less than 10 years."
        },
        {
            "published_date": "2025-07-08T07:53:06",
            "title": "Climate change is shrinking India's weather forecast window, says IMD chief",
            "author": "Vijay C. Roy",
            "url": "https://www.livemint.com/news/india/climate-change-is-shrinking-india-s-weather-forecast-window-says-imd-chief-11751945726398.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/07/08/1600x900/PTI07-06-2025-RPT355B-0_1751960626577_1751960640225.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is making it harder to forecast India's weather with the same lead time as in the past. The IMD's forecast accuracy has improved significantly over the last decade. In the first nine months of 2024, India recorded extreme weather on 93% of the time."
        },
        {
            "published_date": "2025-07-08T07:48:00",
            "title": "Antarctica's hidden threat: Melting ice could spark hundreds of explosive volcanoes",
            "author": "TOI Science Desk",
            "url": "https://timesofindia.indiatimes.com/science/antarcticas-hidden-threat-melting-ice-could-spark-hundreds-of-explosive-volcanoes/articleshow/122310577.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-122310583,width-1070,height-580,imgsize-103672,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Glaciers and ice caps melt and volcanoes erupt due to climate change. The biggest concern lies beneath Antarctica's thick ice sheet, where at least 100 volcanoes remain buried. Scientists warn that the loss of this ice could unleash significant volcanic activity in the region. Other regions such as North America, New Zealand and Russia could also be at risk."
        },
        {
            "published_date": "2025-07-08T07:40:59",
            "title": "Melting glaciers could ignite volcanic eruptions: Study",
            "author": "",
            "url": "https://www.newsbytesapp.com/news/science/climate-change-may-trigger-volcanic-eruptions/story",
            "url_media": "https://i.cdn.newsbytesapp.com/images/l75220250708131018.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Study was conducted in Chile. West Antarctica is particularly vulnerable to volcanic eruptions due to the melting of glaciers and ice caps. The research was presented at the Goldschmidt geochemistry conference in Prague and is currently under review by an academic journal. The study involved fieldwork in the Andes mountains among active and dormant volcanoes."
        },
        {
            "published_date": "2025-07-08T07:25:00",
            "title": "[날씨] '폭염경보' 서울 37.1도..7월 기온 관측 117년만에 최고치",
            "author": "",
            "url": "http://breaknews.com/1131224",
            "url_media": "http://www.breaknews.com/data/breaknews_com/mainimages/202507/2025070826423461.jpg",
            "country": "KR",
            "language": "en",
            "summary": "In 2025, the world will be 25% different than it is in today's reality. The year is 1908, the year is 1939, and the year 1908 is    117. The years are written in Korean, English and German. The date is  7.07.07, "
        },
        {
            "published_date": "2025-07-08T07:16:47",
            "title": "Oceana to LGUs: Protect mangroves, set up coastal greenbelts",
            "author": "Jel Santos",
            "url": "https://mb.com.ph/2025/07/08/oceana-to-lgus-protect-mangroves-set-up-coastal-greenbelts",
            "url_media": "https://mb.com.ph/manilabulletin/uploads/images/2025/07/08/25054.webp",
            "country": "PH",
            "language": "en",
            "summary": "Oceana urged newly elected officials of coastal local government units (LGUs) to prioritize mangrove restoration and the creation of coastal greenbelt zones. Oceana acting vice president Atty. Rose-Liza Eisma Osorio called the new guidelines from the Department of the Interior and Local Government 'important milestones' in climate resilience efforts."
        },
        {
            "published_date": "2025-07-08T07:16:44",
            "title": "Antarctic water is dramatically getting saltier. It's not good news",
            "author": "",
            "url": "https://www.indiatoday.in/environment/story/antarctic-water-is-dramatically-getting-saltier-its-not-good-news-2752504-2025-07-08",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202507/antarctic-244736510-16x9.png?VersionId=k9UA7J6efD6o73gxK4CK0vuAGYi8uf7i",
            "country": "IN",
            "language": "en",
            "summary": "Antarctica has lost an area of sea ice comparable to Greenland since 2015. Since then, the Southern Ocean surface waters south of 50 S latitude have grown saltier. The increase in surface salinity is altering the ocean's structure. The loss of Antarctic sea ice has far-reaching implications."
        },
        {
            "published_date": "2025-07-08T07:14:17",
            "title": "今年高温：或持续到8月底甚至九月_手机网易网",
            "author": "和讯网",
            "url": "https://m.163.com/news/article/K3V2HM1H0519D4UH.html",
            "url_media": "https://nimg.ws.126.net/?url=https%3A%2F%2Fstatic.ws.126.net%2Ff2e%2Fwap%2Fcommon%2Fimages%2Fweixinfixed1200low.jpg&thumbnail=750x2147483647&quality=75&type=jpg",
            "country": "CN",
            "language": "en",
            "summary": "The content above is uploaded and posted by a user of NetEase Hao, which is a social media platform and only provides information storage services. The content above (including the pictures and videos if any) is uploaded by a member of this platform. "
        },
        {
            "published_date": "2025-07-08T07:09:30",
            "title": "June recorded as hottest month ever recorded in several countries including Pakistan",
            "author": "The News International",
            "url": "https://article.wn.com/view/2025/07/08/June_recorded_as_hottest_month_ever_recorded_in_several_coun",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "June was the hottest month ever recorded in 12 countries, including Pakistan, Spain, Nigeria, and Japan. 26 others experienced exceptionally high temperatures, according to an AFP analysis of Copernicus data, the European meteorological agency's data. The hottest month was recorded in Pakistan and Spain."
        },
        {
            "published_date": "2025-07-08T07:08:49",
            "title": "Tourism Boom in Antarctica: Balancing Growth and Environmental Protection",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3496604-tourism-boom-in-antarctica-balancing-growth-and-environmental-protection",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/31_05_2024_13_09_00_860635.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "There will be nearly 125,000 tourists visiting Antarctica in the 2023-24 season. This increase poses risks to the continent's fragile ecosystem. The Antarctic Treaty System has been slow to enforce binding tourism rules. The proposed solutions include tourism taxes and cap-and-trade systems."
        },
        {
            "published_date": "2025-07-08T06:58:43",
            "title": "June 2025 Becomes Hottest Month on Record in Pakistan",
            "author": "Arsalan Khattak",
            "url": "https://propakistani.pk/2025/07/08/june-2025-becomes-hottest-month-on-record-in-pakistan",
            "url_media": "https://propakistani.pk/wp-content/uploads/2025/06/Lahore-temperature.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan experienced its hottest June ever in 2025, with temperatures breaking previous records across the country. A total of 12 countries, including Pakistan, Japan, Nigeria, and Spain, witnessed their hottest June in history. The extreme heat affected nearly 800 million people across Europe, Asia, and Africa."
        },
        {
            "published_date": "2025-07-08T06:40:00",
            "title": "Top Court Urges Crackdown on Fossil Fuels, Australia Next?",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/top-court-urges-crackdown-on-fossil-fuels-1492064",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1526256262350-7da7584cf5eb%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Fossil fuel exporters such as Australia are under scrutiny. A human rights court ruled on Friday that countries in the Organization of American States are obliged to protect people from climate harms. Australia is a major fossil-fuel exporter. Since 2000, Australia has approved more than 700 oil, gas and coal projects. Chris Bowen is in the Pacific this week to promote Australia's commitment to climate action. "
        },
        {
            "published_date": "2025-07-08T05:56:00",
            "title": "June recorded as hottest month ever recorded in several countries including Pakistan",
            "author": "AFP",
            "url": "https://www.thenews.com.pk/latest/1327093-june-recorded-as-hottest-month-ever-recorded-in-several-countries-including-pakistan",
            "url_media": "https://www.thenews.com.pk/assets/uploads/updates/2025-07-08/1327093_101900_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "June was the hottest month ever recorded in 12 countries, including Pakistan, Spain, Nigeria, and Japan. It was the second hottest on record after 2024 in the Central African Republic, South Sudan, Cameroon, Democratic Republic of Congo and Ethiopia. In South Sudan temperatures passed the normal June average by 2.1°C."
        },
        {
            "published_date": "2025-07-08T05:54:31",
            "title": "Plans developed to help Hemsby homes threated by erosion",
            "author": "Neve Gordon-Farleigh",
            "url": "https://www.bbc.com/news/articles/cx2l57dj7ylo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/deee/live/41c56d00-d3df-11ef-a305-1f7b3341a92d.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Environment Agency gave £1.6m to Great Yarmouth Borough Council, in Norfolk, to develop plans for people living in Hemsby and Winterton-on-Sea. The east Norfolk coast is on the frontline of erosion and the effects of climate change. The council needs to get creative to \"adapt to the inevitable\"."
        },
        {
            "published_date": "2025-07-08T05:46:27",
            "title": "Antarctica's hidden threat: Melting ice could spark hundreds of explosive volcanoes",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/08/Antarctica_s_hidden_threat_Melting_ice_could_spark_hundreds_",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "A new study has found a link between climate change and increased volcanic activity. The rapid melting of glaciers and ice caps, especially in regions like West Antarctica, could trigger hundreds of explosive eruptions, according to the study.    .   in West Antarctica."
        },
        {
            "published_date": "2025-07-08T05:39:16",
            "title": "S.Leone islanders despair as rising ocean threatens survival",
            "author": "France 24",
            "url": "https://www.france24.com/en/live-news/20250708-s-leone-islanders-despair-as-rising-ocean-threatens-survival",
            "url_media": "https://s.france24.com/media/display/e27799a6-5bbd-11f0-8520-005056a97e36/w:1280/p:16x9/f91e20b0d4918b511d20e9a62cc049fc384e7e45.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Nyangai in the Turtle Islands off southern Sierra Leone has lost two-thirds of its surface area in less than 10 years due to climate change. Fewer than 300 people remain on the island, which is overcrowded, with no water, electricity or health clinics."
        },
        {
            "published_date": "2025-07-08T05:15:27",
            "title": "This place in India\\u0026#039;s neighbouring country may become first major city to run out of ...",
            "author": "DNA India",
            "url": "https://article.wn.com/view/2025/07/08/This_place_in_India_u0026_039s_neighbouring_country_may_beco",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "Experts blame climate change for poor economic performance.    for climate change and poor economic growth. For more information, go to: http://www.cnn.com/news/environment/environmental-change/climate-change-and-poor-economic-growth."
        },
        {
            "published_date": "2025-07-08T04:55:18",
            "title": "Unexpected Southern Ocean changes may speed up climate impacts",
            "author": "Eloise Gibson",
            "url": "https://www.nzherald.co.nz/nz/unexpected-southern-ocean-changes-may-speed-up-climate-impacts/M3K65X2LAJCY3NBD2WSDAAY3AI",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/QQDYC6V2I5EX7IDSLNEVPJM7IQ.jpg?auth=9a7678f388967a57b1384aafb35cbebce4e122df71dbd4faa4ea2b0622d7bf58&width=1200&height=675&quality=70&focal=3756%2C1684&smart=false",
            "country": "NZ",
            "language": "en",
            "summary": "Researchers have found evidence of a shift in the circulation of the Southern Ocean, which could accelerate climate change for the whole planet. The sea ice around Antarctica could be in 'terminal decline', according to the study, led by the University of Cambridge.   "
        },
        {
            "published_date": "2025-07-08T04:31:12",
            "title": "Record-breaking heat in June around the world",
            "author": "Yonhap",
            "url": "https://www.koreaherald.com/article/10526869",
            "url_media": "https://wimg.heraldcorp.com/news/cms/2025/07/08/news-p.v1.20250708.0ab639e44f5c4e30bc08ddeeb274c481_T1.jpg",
            "country": "KR",
            "language": "en",
            "summary": "The month of June was the hottest ever recorded in 12 countries and exceptionally warm in 26 other countries. 790 million people around Europe, Asia and Africa experienced their hottest June to date. Around 15 countries, including Switzerland, Italy and every Balkan state, saw temperatures rise to 3 degrees Celsius above the June average between 1981 and 2010. Japan also had its hottest June on record since data collection began in 1898. South Korea and North Korea also experienced their warmest June since records began."
        },
        {
            "published_date": "2025-07-08T04:30:00",
            "title": "David W Higgins: Why we need to keep close eye on how Donald Trump's tariff deals affect EU-China relationship",
            "author": "David W Higgins",
            "url": "https://www.independent.ie/opinion/comment/david-w-higgins-why-we-need-to-keep-close-eye-on-how-donald-trumps-tariff-deals-affect-eu-china-relationship/a1423018792.html",
            "url_media": "https://focus.independent.ie/thumbor/g1LlzGdoNIbN6XWN8p1nrQfFFc4=/0x0:2590x1727/629x0/prod-mh-ireland/b6577926-0607-4a91-88fc-eb028d341b4d/e4e938c5-6dc7-4a1d-a021-eab6232fb8e5/b6577926-0607-4a91-88fc-eb028d341b4d.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Travelling to Australia fills people with a mix of excitement and dread. Some trips to Australia are for weeks at a time, so you might be able to use a cheat to break up the journey like I used to do when going there last year. "
        },
        {
            "published_date": "2025-07-08T04:03:14",
            "title": "'Unprecedented' changes around Antarctic",
            "author": "Eloise Gibson",
            "url": "https://www.odt.co.nz/star-news/star-national/unprecedented-changes-around-antarctic",
            "url_media": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2025/07/gettyimages-157580637-170667a.jpg?itok=LDm0CSAZ",
            "country": "NZ",
            "language": "en",
            "summary": "Researchers have found evidence of a major shift in the circulation of the Southern Ocean which could accelerate climate change for the whole planet. They say the finding has caught them off-guard and that the sea ice around Antarctica could be in \"terminal decline\". The Southern Ocean plays an essential role in regulating the Earth's heat and carbon."
        },
        {
            "published_date": "2025-07-08T03:53:01",
            "title": "Warning Southern Ocean changes will affect planet",
            "author": "Eloise Gibson",
            "url": "https://www.odt.co.nz/news/national/warning-southern-ocean-changes-will-affect-planet",
            "url_media": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2025/07/gettyimages-157580637-170667a.jpg?itok=LDm0CSAZ",
            "country": "NZ",
            "language": "en",
            "summary": "Researchers have found evidence of a major shift in the circulation of the Southern Ocean which could accelerate climate change for the whole planet. They say the finding has caught them off-guard and that the sea ice around Antarctica could be in \"terminal decline\". The Southern Ocean plays an essential role in regulating the Earth's heat and carbon."
        },
        {
            "published_date": "2025-07-08T03:24:07",
            "title": "The burning Earth: From Japan to Spain, and Pakistan to Nigeria, June hottest ever in 12 countries",
            "author": "",
            "url": "https://www.firstpost.com/world/the-burning-earth-from-japan-to-spain-and-pakistan-to-nigeria-june-hottest-ever-in-12-countries-13904058.html",
            "url_media": "https://images.firstpost.com/uploads/2025/04/Representational-Image-2025-04-01T194456.490-2025-04-027b3fa98985eb7ade7b5d22e10ced22.jpg?im=FitAndFill=(1200,675)",
            "country": "IN",
            "language": "en",
            "summary": "The increased temperatures in June affected nearly 800 million people across over a dozen nations in Europe, Asia and Africa. The month was second-hottest for other nations, including Britain, China, France, Democratic Republic of Congo and Ethiopia. A late June heatwave baked western and southern Europe, with scorching temperatures hitting Paris, Belgium, and the Netherlands. About 15 countries, including Switzerland, Italy, and all Balkan nations, saw temperatures 3°C above the 1981–2010 June average. Spain, Bosnia, and Montenegro recorded their hottest June ever. Japan also endured its hottest June since records began in 1898."
        },
        {
            "published_date": "2025-07-08T03:20:24",
            "title": "Sea Ice Loss Linked To Salty Southern Ocean Surface – Expert Reaction",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/07/08/sea_ice_loss_linked_to_salty_southern_ocean_surface_x2013_ex",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "Satellite data shows sea ice is getting saltier as Antarctic sea ice coverage has dropped in the last decade. Previous, cooler surface waters had helped sea ice expand for more than 30 years, but this reversed a decade ago, when the surface got saltier."
        },
        {
            "published_date": "2025-07-08T03:14:23",
            "title": "Australian Federal Police Warns Travellers Using Fake IDs May Face Jail",
            "author": "The Epoch Times",
            "url": "https://article.wn.com/view/2025/07/08/Australian_Federal_Police_Warns_Travellers_Using_Fake_IDs_Ma",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "The number of people trying to board domestic flights in Australia using false identification documents has increased this year. AFP warns that they'll be cracking down on the practice soon.   Â. Â   y.  y   .   i"
        },
        {
            "published_date": "2025-07-08T02:55:49",
            "title": "Arabian Sea Cyclones Double in 15 Years, Goa's Coastal Communities Bear the Brunt",
            "author": "Herald Team",
            "url": "https://www.heraldgoa.in/goa/goa/arabian-sea-cyclones-double-in-15-years-goas-coastal-communities-bear-the-brunt/424741",
            "url_media": "https://media.assettype.com/heraldgoa-main%2F2025-07-08%2F5ljs2zfb%2FScreenshot-2025-07-08-082311.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "30-35 citizens from across Goa gathered to address the ecological destruction and climate crisis impacts affecting the State. Soumya Dutta, an international climate change expert and NACEJ member, revealed alarming statistics about Arabian Sea weather patterns. She criticised the Centre's response to climate disasters."
        },
        {
            "published_date": "2025-07-08T02:49:07",
            "title": "How climate change influenced the Texas flooding",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/07/how-climate-change-influenced-the-texas-flooding-nbc-connecticut-2",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "by | | Climate Change is a website dedicated to the study of climate change. For more information, visit: http://www.climatalkin.org/news/environment/environmental-change/chimatockexchange.html."
        },
        {
            "published_date": "2025-07-08T02:13:24",
            "title": "‘Habagat' to still drench parts of the Philippines",
            "author": "Manila Standard",
            "url": "https://article.wn.com/view/2025/07/08/8216habagat_8217_to_still_drench_parts_of_the_philippines",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "The southwest monsoon or 'habagat' is less likely to bring heavy rainfall over the western section of Northern Luzon, according to the PAGASA. The monsoon is still expected to bring significant heavy rainfall there.    - PGAASA"
        },
        {
            "published_date": "2025-07-08T01:39:00",
            "title": "Sea Ice Loss Linked To Salty Southern Ocean Surface",
            "author": "Aggregate",
            "url": "https://www.scoop.co.nz/stories/SC2507/S00022/sea-ice-loss-linked-to-salty-southern-ocean-surface-expert-reaction.htm",
            "url_media": "https://img.scoop.co.nz/stories/images/1512/smcnz.small.png",
            "country": "NZ",
            "language": "en",
            "summary": "Satellite data shows saltier water from deep in the Southern Ocean has started rising to the surface, bringing up more carbon dioxide. The past 10 years have seen a precipitous decline in Antarctic sea ice, with the Ross Sea leading the change. The Southern Ocean absorbs more than half of the additional heat and 2/5 of the excess carbon dioxide from human activities."
        },
        {
            "published_date": "2025-07-08T01:31:36",
            "title": "'Legendary' Cold Chisel rocker cops speeding warning",
            "author": "Miklos Bolza",
            "url": "https://www.bordermail.com.au/story/9010900/legendary-cold-chisel-rocker-cops-speeding-warning",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/9fa1091b-1cb3-4457-919f-8d9240dc0f86.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Cold Chisel guitarist Ian Moss will have to watch his speed when he's taking the last car out of Sydney or passing flame trees as a weary driver.    i.amonthewall@mailonline.co.uk for more information on Ian Moss. "
        },
        {
            "published_date": "2025-07-08T01:24:40",
            "title": "How climate change is worsening flooding and heavy rainfall",
            "author": "Amal Ahmed",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-change-is-worsening-flooding-and-heavy-rainfall-35f8efac87cb48f69d250210996030083b6045fe",
            "url_media": "https://grist.org/wp-content/uploads/2025/07/disaster-101-flooding.png?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "Flooding is one of the most common natural disasters that can devastate a community. Between 2000 and 2019, nearly 1.6 billion people globally were impacted by floods. In the U.S., the Federal Emergency Management Agency has been criticized for outdated and incomplete maps that severely underestimate the number of people living in high flood risk areas."
        },
        {
            "published_date": "2025-07-08T01:24:40",
            "title": "How climate change may be affecting tornadoes",
            "author": "Amal Ahmed",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-change-may-be-affecting-tornadoes-3b9009d7fd1f5f6d1979b556fd2e64c37fa7fc15",
            "url_media": "https://grist.org/wp-content/uploads/2025/07/disaster-101-tornado.png?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "This is part of the Disaster 101 toolkit, a guide to extreme weather preparation, response, and recovery. Human-caused climate change is making some disasters more dangerous and more frequent. The burning of fossil fuels releases carbon dioxide into the atmosphere, where it traps heat, warms the planet, and alters the conditions in which extreme weather forms."
        },
        {
            "published_date": "2025-07-08T01:24:40",
            "title": "How climate change is worsening extreme heat",
            "author": "Amal Ahmed",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-change-is-worsening-extreme-heat-6b6e73958a6ec8ba8f4153b3015667cc3122ef8b",
            "url_media": "https://grist.org/wp-content/uploads/2025/07/disaster-101-heat.png?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "According to scientific research, human-caused climate change is making some disasters more dangerous and more frequent. The planet has already warmed 2 degrees Fahrenheit compared to pre-industrial times, and most heat waves we've experienced since have either been caused or strengthened by that."
        },
        {
            "published_date": "2025-07-08T01:24:40",
            "title": "How climate change is supercharging wildfires",
            "author": "Amal Ahmed",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-change-is-supercharging-wildfires-0087564e941e2740b66c20ede8bcd6307846c182",
            "url_media": "https://grist.org/wp-content/uploads/2025/07/disaster-101-wildfire.png?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "According to scientific research, human-caused climate change is making some disasters more dangerous and more frequent. The burning of fossil fuels releases carbon dioxide into the atmosphere, which warms the planet and alters the conditions in which extreme weather forms. Wildfires themselves release carbon when trees and vegetation go up in flames."
        },
        {
            "published_date": "2025-07-08T01:24:40",
            "title": "How climate change is intensifying hurricanes",
            "author": "Amal Ahmed",
            "url": "https://news.knowledia.com/all/all/articles/how-climate-change-is-intensifying-hurricanes-bf93ba1eb6c5b8813bdb7fd001cca5078aa6cf26",
            "url_media": "https://grist.org/wp-content/uploads/2025/07/disaster-101-hurricane.png?quality=75&strip=all",
            "country": "FR",
            "language": "en",
            "summary": "This is part of the Disaster 101 toolkit, a guide to extreme weather preparation, response, and recovery. Human-caused climate change is making some disasters more dangerous and more frequent. Every spring, NOAA releases its forecast for the upcoming hurricane season, which lasts from June 1 through November 30. Most seasonal predictions are now what NOAA considers \"above\"."
        },
        {
            "published_date": "2025-07-08T01:00:00",
            "title": "Unnatural tragedy",
            "author": "Maria Omar",
            "url": "https://www.thenews.com.pk/print/1327052-unnatural-tragedy",
            "url_media": "https://www.thenews.com.pk/assets/front/img/no-img-fb.jpg",
            "country": "PK",
            "language": "en",
            "summary": "There was a tragedy in Swat where an entire family was swept away due to a sudden surge in the river. The rise in temperatures is accelerating glacial melt in the northern areas, leading to unpredictable and deadly floods. It is time to stop treating such events as isolated accidents and recognise them as symptoms of a much larger, human-driven problem."
        },
        {
            "published_date": "2025-07-08T00:44:13",
            "title": "Oak launches ‘Heat Your OAK' campaign to promote choccy milk as a hot drink",
            "author": "Matthew Leong",
            "url": "https://mumbrella.com.au/oak-launches-heat-your-oak-campaign-to-promote-choccy-milk-as-a-hot-drink-880674",
            "url_media": "https://mumbrella.com.au/wp-content/uploads/2025/07/Foakn-Cold-As-Syd-scaled.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Oak is encouraging Aussies to try their favourite flavoured milk heated, with a new national campaign, Heat Your OAK. OAK is part of Lactalis Australia's portfolio of well-known local brands. The campaign runs nationally throughout June and July."
        },
        {
            "published_date": "2025-07-08T00:20:45",
            "title": "Rainfall intesity up 21% in the Triangle, data says",
            "author": "WRAL",
            "url": "https://www.wral.com/video/rainfall-intesity-up-21-in-the-triangle-data-says/22078256",
            "url_media": "https://wwwcache.wral.com/asset/weather/2025/07/07/22078257/3278369-liz-DMID1-67k9uwow4-640x480.jpg",
            "country": "US",
            "language": "en",
            "summary": "Nearly 9 inches of rain fell in Chapel Hill and close to a foot in Chatham County. Climate change is fueling higher rainfall intensity, experts say. Rainfall in the Triangle is up 21% in the last year.       .  "
        },
        {
            "published_date": "2025-07-08T00:06:18",
            "title": "Melting glaciers and ice caps could unleash wave of volcanic eruptions, study says",
            "author": "The Observer",
            "url": "https://article.wn.com/view/2025/07/08/Melting_glaciers_and_ice_caps_could_unleash_wave_of_volcanic",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "The loss of ice releases the pressure on underground magma chambers and makes eruptions more likely, according to the study. The findings suggest volcanoes will erupt more frequently and more explosively.       .   \"As glaciers retreat due to climate change, our findings suggest these volcanoes go on to erupt more often and explosively\""
        },
        {
            "published_date": "2025-07-08T00:04:01",
            "title": "Tackling Sindh's climate crisis",
            "author": "Nasir Ali Panhwar",
            "url": "https://www.dawn.com/news/1922701/tackling-sindhs-climate-crisis",
            "url_media": "https://www.dawn.com/_img/social-default.jpg",
            "country": "PK",
            "language": "en",
            "summary": "According to an intergovernmental panel on climate change, the least-developed and developing countries are expected to suffer more due to climate change than the developed ones. Pakistan's Sindh province is particularly vulnerable to natural disaster events due to its geographical location, socio-economic vulnerability, and climatic conditions. In 2022, Sindh received rainfall in excess of 400% over the 30-year average. Sindh has been disproportionately affected by the 2022 floods."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "(LEAD) Seoul posts record temperature of 37.7 C for early July",
            "author": "Yonhap News",
            "url": "https://article.wn.com/view/2025/07/08/LEAD_Seoul_posts_record_temperature_of_377_C_for_early_July",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Seoul soared to 37.7 C at around 3 PM on July 8th, according to Yonhap news agency. The temperature in Seoul is currently 37 C at 3 PM in South Korea. The weather is expected to get warmer later. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Australia head coach Joe Schmidt suffers huge blow as starting out-half Noah Lolesio is ruled out of the Lions",
            "author": "Irish Independent",
            "url": "https://article.wn.com/view/2025/07/08/Australia_head_coach_Joe_Schmidt_suffers_huge_blow_as_starti",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Australia is a country of people living in the Middle East. It is mainly populated by people from Australia. It has a population of about 1.5 billion people. It's a nation of people. Its main territory is called Australia. Its population is mainly consists of people from that country."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Forests' vanishing snow is also bad news for carbon storage",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/07/08/Forests_vanishing_snow_is_also_bad_news_for_carbon_storage",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The loss of snow cover in temperate forests is set to slow their growth and reduce their ability to remove carbon from the atmosphere, a consequence of climate change, according to the World Resources Institute (WRI). WRI reports that this is due to climate change."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "S.Leone islanders despair as rising ocean threatens survival",
            "author": "PATRICK MEINHARDT",
            "url": "https://www.dailygazette.com/news/national/s-leone-islanders-despair-as-rising-ocean-threatens-survival/article_a593d6c0-b342-5610-bbd6-c2fa9ea2ed5b.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/8/2b/82b40284-18e3-5d73-ba7c-b210183534c5/686cb7f5b554f.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Hassan Kargbo's island off Sierra Leone is being eroded by the ocean. The island used to have a big football field, but the water destroyed it. Javascript is required for you to be able to read premium content on this website. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "S.Leone islanders despair as rising ocean threatens survival",
            "author": "PATRICK MEINHARDT",
            "url": "https://starlocalmedia.com/news/national/s-leone-islanders-despair-as-rising-ocean-threatens-survival/article_10df4f61-005c-514e-8361-be065fdc98cd.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/starlocalmedia.com/content/tncms/assets/v3/editorial/4/22/4229fa72-84ef-5f48-815e-39b5ae1e7a77/686cb7ce5b197.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Hassan Kargbo is walking through water up to his knees on his island off Sierra Leone. The ocean is eroding the land and imperilling the residents' survival on the island. Javascript is required for you to be able to read premium content."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Lizard Island on Australia's Great Barrier Reef faces alarming coral loss following 2024 bleaching",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250708/7f362326d1024eb58361616148c43597/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "92 percent of surveyed corals lost after the 2024 bleaching event at Lizard Island on Australia's Great Barrier Reef. It is one of the highest coral mortality rates ever documented globally. Lizard Island's reefs remain fragile after years of repeated damage. Scientists will monitor them through 2026 for signs of recovery."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "(2nd LD) Seoul posts record temperature of 37.7 C for early July, marking hottest day ...",
            "author": "Yonhap News",
            "url": "https://article.wn.com/view/2025/07/08/2nd_LD_Seoul_posts_record_temperature_of_377_C_for_early_Jul",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Seoul soared to 37.7 C at around 3 PM on July 8th, according to Yonhap news agency. The temperature in Seoul is currently 37 C at 3 PM in South Korea. The weather is expected to get warmer later. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "British and Irish Lions tour: Australia",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/07/08/British_and_Irish_Lions_tour_Australia",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Australia is a country of people living in the Middle East. It is mainly populated by people from Australia. It has a population of about 1.5 billion people. It's a nation of people. Its main territory is called Australia. Its population is mainly consists of people from that country."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Athens closes the Acropolis and Cyprus faces 'Titanic' wildfire battle while search for Brit missing ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/07/08/Athens_closes_the_Acropolis_and_Cyprus_faces_Titanic_wildfir",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greece is scorched by a 42C heatwave. Athens has been forced to close the Acropolis. Temperatures in the country are expected to reach 42C (107.6 Fahrenheit) on Tuesday with a maximum of 38C in Athens. Cyprus is facing a 'titanic' battle with wildfires."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Melting Glaciers Could Unleash a Barrage of Volcanic Eruptions Worldwide, Scientists Warn",
            "author": "Gizmodo",
            "url": "https://article.wn.com/view/2025/07/08/Melting_Glaciers_Could_Unleash_a_Barrage_of_Volcanic_Eruptio",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Glacial retreat caused a wave of volcanic activity in southern Chile as the last Ice Age came to an end, according to new research from the U.S. Geological Survey. The activity was caused by the glacial retreat.   Â   "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Why the Texas Floods Were So Deadly",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/07/08/Why_the_Texas_Floods_Were_So_Deadly",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists say a hotter planet is driving more intense storms. Experts say the U.S. is not doing enough to adapt to increasingly intense floods, which is also a concern of scientists.   Â      in this regard, the United States does not do enough. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "\"Nobody Expected This\": Earth's Rotation Will Speed Up Tomorrow, Bucking The Downward Trend",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/07/08/Nobody_Expected_This_Earths_Rotation_Will_Speed_Up_Tomorrow_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Earth is predicted to increase its rotation speed in July and August. Tomorrow on July 9, the first of three especially short days, it is expected to be 1.30 milliseconds shorter than usual. This lack of need for leap seconds was not predicted. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "‘Cooperation is humanity's greatest innovation,' UN chief declares at BRICS summit (UNOG - United Nations Office at Geneva)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/07/08/Cooperation_is_humanity_s_greatest_innovation_UN_chief_decla",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "UN Secretary-General António Guterres warned that the environment is being attacked on all fronts. He called on the international community to tackle the intersection of health and climate issues. He was speaking at the BRICS summit in Rio de Janeiro, Brazil."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "More Explosive Volcanoes Expected As Glaciers Melt",
            "author": "Newsweek",
            "url": "https://article.wn.com/view/2025/07/08/More_Explosive_Volcanoes_Expected_As_Glaciers_Melt",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hundreds of dormant volcanoes across the globe could become more active thanks to climate change, especially in Antarctica, because of climate change.    in Antarctica and in the rest of the world's continents, particularly in Africa and Asia, there are many volcanoes."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Rain events could cause major failure of Waikīkī storm drainage by 2050",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Rain_events_could_cause_major_failure_of_Waikiki_storm_drain",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sea level rise models for coastal cities often overlook the impacts of rainfall on infrastructure, according to researchers at the University of Hawai'i. The models are based on sea level rise projections for the future of coastal cities.       .  "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Heat wave duration is accelerating faster than global warming, researchers find",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Heat_wave_duration_is_accelerating_faster_than_global_warmin",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New research finds that not only will climate change make heat waves, but so will human activity.    .   in this way, we will have more frequent and intense heat waves. In this way we will be more vulnerable to climate change, and more prone to heatwaves. "
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Can you trust climate information? How and why powerful players are misleading the public",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/08/Can_you_trust_climate_information_How_and_why_powerful_playe",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world committed itself to keeping global warming well below 2.5 degrees Celsius above the pre-industrial era ten years ago, and below 1.5 degree C above the previous era. This is according to the UN's Kyoto Protocol on Climate Change (IPCC)."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "7 common items Brits should never leave inside a hot car including popular kids' gadget ...",
            "author": "The Sun",
            "url": "https://article.wn.com/view/2025/07/08/7_common_items_Brits_should_never_leave_inside_a_hot_car_inc",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Motoring experts outline seven common items that Brits shouldn't leave in their cars in the heat, especially when they are hot. They include a potentially dangerous kids gadget and a hot item that could melt, warp, overheat or even pose a fire risk."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Sadhguru interview: world-famous yogi says there are 25 years to save Britain's soil and farming industry",
            "author": "The Scotsman",
            "url": "https://article.wn.com/view/2025/07/08/Sadhguru_interview_worldfamous_yogi_says_there_are_25_years_",
            "url_media": "https://article.wn.com/view/2025/07/08/[]",
            "country": "US",
            "language": "en",
            "summary": "There are 25 years to save Britain's soil otherwise it will turn into a desert and end farming as we know it, according to an environmental campaigner and Indian guru, who is concerned about the future of farming in the UK and the environment in general. He tells NationalWorld."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Full Episode: Proposed NOAA budget cuts concern local forecasters, and Trump administration says 'no amnesty' for farmworkers",
            "author": "Holly Gregory",
            "url": "https://baynews9.com/fl/tampa/political-connections/2025/07/08/noaa-budget-cuts---no-amnesty--for-migrant-farmworkers",
            "url_media": "https://s7d2.scene7.com/is/image/TWCNews/ap21190803628596-2_09022022",
            "country": "US",
            "language": "en",
            "summary": "Experts warn that $2 billion in proposed cuts to the National Oceanic and Atmospheric Administration's budget will hamper local forecasts. Trump administration wants to close the Atlantic Oceanographic & Meteorological Laboratory in Miami. There will not be a carve-out in immigration removals for farmworkers found in the country illegally."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "Food insecure populations, June 2025",
            "author": "Hillary Bett",
            "url": "https://the-star.co.ke/news/infographics/2025-07-08-food-insecure-populations-june-2025",
            "url_media": "https://cdn.radioafrica.digital/image/2025/07/063e1934-55f6-41bc-b28a-15a44db3c5ef.jpeg?1752005045002",
            "country": "KE",
            "language": "en",
            "summary": "Conflict, climate shocks, and economic instability are the main drivers of food insecurity in East and Central Africa. Sudan, South Sudan, Somalia, Ethiopia, and the Democratic Republic of Congo are most affected. Drought and flooding have severely impacted crop production and livestock. Displacement and limited humanitarian access worsened the crisis."
        },
        {
            "published_date": "2025-07-08T00:00:00",
            "title": "NOAA budget cuts; 'no amnesty' for migrant farmworkers",
            "author": "",
            "url": "https://mynews13.com/fl/orlando/political-connections/2025/07/08/noaa-budget-cuts---no-amnesty--for-migrant-farmworkers",
            "url_media": "https://s7d2.scene7.com/is/image/TWCNews/ap21190803628596-2_09022022",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration proposes $2 billion in cuts to the National Oceanic and Atmospheric Administration's budget for the next budget year. Experts warn that the accuracy and speed of hurricane forecasting will be affected by the proposed cuts. The deadline for Congress to pass the federal budget is October 1."
        }
    ]
}