{
    "status": "ok",
    "total_articles": 127,
    "articles": [
        {
            "published_date": "2025-07-07T23:17:10",
            "title": "Climate tipping point might have been crossed before the ‘Great Dying'",
            "author": "",
            "url": "https://dnyuz.com/2025/07/07/climate-tipping-point-might-have-been-crossed-before-the-great-dying",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/07/1751930224_Climate-tipping-point-might-have-been-crossed-before-the-‘Great.jpg",
            "country": "US",
            "language": "en",
            "summary": "Fossils from the time period known as the 'Great Dying' have revealed that the climate tipping point had likely already been crossed before the event began. The demise and slow recovery of tropical forests limited what we call carbon sequestration. This is the process where carbon dioxide is removed from the atmosphere and held in plants and the soil."
        },
        {
            "published_date": "2025-07-07T23:00:47",
            "title": "Tourism, tragedy and the climate warning",
            "author": "Amjad Jamal",
            "url": "https://pakobserver.net/tourism-tragedy-and-the-climate-warning",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/07/Amjad-Jamal.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Tourism in Pakistan is becoming more dangerous due to climate change and climate change. The 2025 season has already seen many tragic incidents, including a car plunging into a ravine in Lower Kohistan, a family swept away on the Swat River, and four friends disappearing during a night drive in Gilgit-Baltistan. Pakistan needs to make rainwater harvesting a national priority."
        },
        {
            "published_date": "2025-07-07T23:00:00",
            "title": "Melting Ice Caps Could Bring Dormant Volcanoes to Life, Research from the Chilean Andes Shows",
            "author": "Bob Berwyn",
            "url": "https://insideclimatenews.org/news/07072025/global-warming-could-waken-dormant-volcanoes",
            "url_media": "https://insideclimatenews.org/wp-content/uploads/2025/07/GettyImages-942609764-1024x683.jpg",
            "country": "US",
            "language": "en",
            "summary": "Some volcanoes in Antarctica could accelerate ice melt from below, while others could be so explosive they could send climate-altering material into the atmosphere. University of Wisconsin–Madison geoscientist Brad Singer studied the chemistry of rocks at six volcanoes of the Chilean Andes to study changes in the magma."
        },
        {
            "published_date": "2025-07-07T22:50:00",
            "title": "Man had 'never even won a meat tray', now he's $100k richer after Lotto win",
            "author": "",
            "url": "https://www.dailyadvertiser.com.au/story/9010656/young-man-wins-100k-in-lucky-lotteries-jackpot",
            "url_media": "https://www.dailyadvertiser.com.au/images/transform/v1/crop/frm/yKyzS5MkFCYtCA2z8EAGJL/7f88c05a-c737-497a-b7d6-af44a8a312b5.jpg/r0_447_2990_2017_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "\"It's freezing cold where I am and I'm not coping. I might've been here all my life, but I still haven't gotten used to it. I've had some friends move to Queensland and it's looking very promising.    "
        },
        {
            "published_date": "2025-07-07T22:04:28",
            "title": "Fireflies on the rise? Montrealers spotting more lightning bugs in their backyards",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6823344",
            "url_media": "https://i.cbc.ca/ais/c3fcd5fd-59ab-4555-8130-8cd076e76790,1751925686602/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1280%2C720%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "Experts say the rain and humidity are contributing to the increase in firefly population in Eastern Canada. The sightings have some asking if the insects are returning or if they just went unnoticed. The reports of the sightings are not confirmed yet.    .  "
        },
        {
            "published_date": "2025-07-07T21:36:00",
            "title": "Get the Facts: Deadliest floods in the U.S.",
            "author": "Katrina Ventura",
            "url": "https://www.wmur.com/article/get-the-facts-deadliest-floods-in-the-us/65321053",
            "url_media": "https://kubrick.htvapps.com/vidthumb/06730b6e-aab0-4876-afa7-1a0d5fd3a1ff/thumb_1920x1080_00002_1751883209_30746.jpg?crop=1xw:1xh;center,top&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "At least 82 people have died and dozens remain missing after heavy rain caused catastrophic flooding in parts of Central Texas. The death toll from the flooding is expected to surpass the 30-year average of 89. The deadliest flood fatality on record is Hurricane Katrina in August 2005, which led to 1,833 fatalities."
        },
        {
            "published_date": "2025-07-07T21:05:57",
            "title": "June 2025 among hottest on record in Jordan",
            "author": "//Petra// AF",
            "url": "https://petra.gov.jo/Include/InnerPage.jsp?ID=73303&lang=en&name=en_news&cat=en_news",
            "url_media": "https://petra.gov.jo/upload/images/favicon.ico",
            "country": "JO",
            "language": "en",
            "summary": "Jordan experienced significantly higher-than-average temperatures during June 2025 due to the influence of several contrasting weather systems. It was the fourth hottest June in the past 30 years and the third hottest in the last decade, according to the Jordan Meteorological Department. The highest temperature was recorded in Ghor Al-Safi (Southern Jordan Valley) on June 29, peaking at 44.5 C, while the lowest was at Shoubak weather station in Ma'an Governorate on June 5."
        },
        {
            "published_date": "2025-07-07T21:03:18",
            "title": "When academia, CSOs converged to boost action on climate resilience",
            "author": "Helen Oji",
            "url": "https://blueprint.ng/when-academia-csos-converged-to-boost-action-on-climate-resilience",
            "url_media": "https://blueprint.ng/wp-content/uploads/2023/11/climate-change-1.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Experts recently gathered at the National Universities Commission to discuss climate resilience and nature-based solutions across communities in Nigeria. The Minister of Environment, Balarabe Lawal, reaffirmed the ministry's commitment to initiatives aligned with Nigeria's Nationally Determined Contributions (NDCs) under Paris Agreement."
        },
        {
            "published_date": "2025-07-07T21:00:00",
            "title": "Sustainability Magazine's Heat Wave Hype: Grid Struggles Stem from Policy, Not Climate",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/07/07/sustainability-magazines-heat-wave-hype-grid-struggles-stem-from-policy-not-climate",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/08/174617519_twitter-post_normal_none.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Sustainability Magazine claims that human-caused climate change is increasing the frequency and intensity of heat waves, which are placing strain on power grids worldwide. Data does not support the notion that heat waves are increasing in frequency or intensity on a global scale. The Urban Heat Island (UHI) effect is mainly responsible for the localized temperature increases in urban areas where power grids are concentrated. The article glosses over it in favor of advocating more renewable energy. The real problem is energy policy failures."
        },
        {
            "published_date": "2025-07-07T20:37:44",
            "title": "Strategies to mitigate GLOF risk reduction in northern Pakistan",
            "author": "Sajid Salamat",
            "url": "https://dailytimes.com.pk/1331078/strategies-to-mitigate-glof-risk-reduction-in-northern-pakistan",
            "url_media": "https://dailytimes.com.pk/wp-content/plugins/pwa-for-wp/images/logo-512x512.png",
            "country": "PK",
            "language": "en",
            "summary": "Glaciers in northern Pakistan are rapidly melting due to increasing temperatures. There are over 3,000 glacial lakes in Khyber Pakhtunkhwa and Gilgit Baltistan. Nearly 33 of them are life-threatening for tourists, residents and trekkers. There have been flash floods recently in Swat Valley and Chitral."
        },
        {
            "published_date": "2025-07-07T20:26:41",
            "title": "Temperatures Soar in Andhra Pradesh Following Continuous Rainfall",
            "author": "Dc Correspondent",
            "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/temperatures-soar-in-andhra-pradesh-following-continuous-rainfall-1890094",
            "url_media": "https://www.deccanchronicle.com/h-upload/2025/03/03/1909824-summertemperaturesinandhrapradesh.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Andhra Pradesh is experiencing a sharp rise in temperatures after days of continuous rainfall. Tirupati recorded the highest temperature at 38°C on Monday. Several districts across the state registered temperatures rising 1-2 degrees, reaching above 35°C. The IMD predicted thunderstorms accompanied by lightning are likely at isolated places across North Coastal Andhra Pradesh and Yanam for the next five days. Strong winds with speeds up to 50 kmph are also expected."
        },
        {
            "published_date": "2025-07-07T20:00:29",
            "title": "Lives washed away",
            "author": "News Desk",
            "url": "https://pakobserver.net/lives-washed-away",
            "url_media": "https://pakobserver.net/wp-content/uploads/2022/11/editorial-1.jpg",
            "country": "PK",
            "language": "en",
            "summary": "72 people died and 130 were injured in Pakistan due to flash floods and heavy rains triggered by this year's monsoon season. The highest number of deaths was recorded in Khyber Pakhtunkhwa, followed by Punjab with 22, Sindh with 15, Balochistan with seven and Azad Jammu & Kashmir (AJK) with four. Monsoon floods are no longer occasional disruptions but a chronic threat due to climate change. Pakistan is among the most climate-vulnerable countries in the world."
        },
        {
            "published_date": "2025-07-07T19:58:26",
            "title": "A top court has urged nations to clamp down on fossil fuel production. When will Australia finally start listening?",
            "author": "Gillian Moon",
            "url": "https://theconversation.com/a-top-court-has-urged-nations-to-clamp-down-on-fossil-fuel-production-when-will-australia-finally-start-listening-259996",
            "url_media": "https://images.theconversation.com/files/678484/original/file-20250707-56-95gipu.jpg?ixlib=rb-4.1.0&rect=0%2C112%2C894%2C447&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Fossil fuel exporters such as Australia are under scrutiny. The Inter-American Court of Human Rights ruled that people have the right to a stable climate and that states should regulate fossil fuel extraction and exploration. Australia has approved more than 700 oil, gas and coal projects since 2000, including Woodside's North West Shelf project off Western Australia. The UN and others are calling on countries to phase out fossil fuel production. The International Court of Justice is considering a request to clarify countries' obligations under international law to protect Earth's climate."
        },
        {
            "published_date": "2025-07-07T19:16:00",
            "title": "Extreme Heat Warning issued July 7 at 12:16PM PDT until July 10 at 8:00PM PDT by NWS San Diego CA",
            "author": "National Weather Service",
            "url": "https://kesq.com/weather/alerts-weather/2025/07/07/extreme-heat-warning-issued-july-7-at-1216pm-pdt-until-july-10-at-800pm-pdt-by-nws-san-diego-ca",
            "url_media": "https://kesq.b-cdn.net/2023/08/kesq-860x484.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures of 114 to 118 degrees are expected in Coachella Valley and San Diego County Deserts from 10 AM Wednesday to 8 PM Thursday. Heat-related illnesses increase significantly during extreme heat events. People sensitive to heat should drink plenty of fluids, stay in an air-conditioned room and stay out of the sun."
        },
        {
            "published_date": "2025-07-07T19:15:12",
            "title": "T.N. State Planning Commission's report shows increase in built-up area over 30 years has fuelled heat stress",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-state-planning-commissions-report-shows-increase-in-built-up-area-over-30-years-has-fuelled-heat-stress/article69784360.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/ui2zao/article69785139.ece/alternates/LANDSCAPE_1200/BVR_2222.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures are putting people, ecosystems, and infrastructure at risk in Tamil Nadu. The study was submitted to Chief Minister M.K. Stalin on Monday. Tamil Nadu could experience annual air temperature increases of 0.9°C to 2.7°C by 2050."
        },
        {
            "published_date": "2025-07-07T19:11:05",
            "title": "Act against dumping in salt pans: Forum",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/07/Act_against_dumping_in_salt_pans_Forum",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Illegal dumping of debris and land-filling is taking place in the salt pans near the Calangute-Arpora bridge in Goa. The area is ecologically sensitive and plays a critical role in flood regulation, biodiversity conservation and cultural heritage. CCF has complained to the Goa Coastal Zone Management Authority."
        },
        {
            "published_date": "2025-07-07T18:59:50",
            "title": "Explained: What's contributing to record-breaking heat in Kashmir",
            "author": "Srishti Singh Sisodia",
            "url": "https://www.ndtv.com/india-news/explained-whats-contributing-to-record-breaking-heat-in-kashmir-8839866",
            "url_media": "https://c.ndtvimg.com/2025-07/on31tcc_kashmir_625x300_08_July_25.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Kashmir experienced a record-breaking heat recently. Deforestation, vandalism of water bodies, and unplanned urbanisation have contributed to the increased temperatures. A prolonged dry spell has also led to a 50% rainfall deficit, triggering the heatwave and impacting agriculture, particularly paddy crops."
        },
        {
            "published_date": "2025-07-07T18:38:00",
            "title": "Rising seas, shifting lives and a test of democratic values",
            "author": "Bhoomika Choudhury",
            "url": "https://www.thehindu.com/opinion/op-ed/rising-seas-shifting-lives-and-a-test-of-democratic-values/article69784425.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/2jta0q/article69784433.ece/alternates/LANDSCAPE_1200/10018_8-8-2020_12-12-24_1_CHELLANAM_01.JPG",
            "country": "IN",
            "language": "en",
            "summary": "The intensifying impacts of climate change are reshaping India's coastline. Communities dependent on agriculture, fishing, and coastal ecosystems are being displaced by rising seas, saltwater intrusion, and the cumulative effects of unregulated development. The displaced populations are getting absorbed into the informal economy as construction workers, brick kiln labourers and domestic workers in urban centres such as Bhubaneswar, Chennai, Hyderabad and Mumbai. The absence of a coherent legal framework on climate-induced migration exacerbates this crisis."
        },
        {
            "published_date": "2025-07-07T18:34:39",
            "title": "Wildfire smoke brings forgotten danger to the Arctic: black carbon",
            "author": "Danielle Bochove",
            "url": "https://calgaryherald.com/news/wildfire-smoke-brings-dangerous-soot-to-the-arctic",
            "url_media": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2025/07/salym-petroleum-development-nv-gas-and-oil-operations.jpg",
            "country": "CA",
            "language": "en",
            "summary": "In 2023, the Canada wildfires incinerated more than 17 million hectares (42 million acres) of boreal forest. The heat created vast columns of rising air with dust, volatile organic compounds and black carbon particles. Black carbon is a pollution formed by the incomplete combustion of fossil fuels or biomass such as trees. It's a risk to human health, having been linked to respiratory and cardiovascular diseases, and a potent short-term warming agent."
        },
        {
            "published_date": "2025-07-07T18:19:11",
            "title": "Pakistan among 12 countries records hottest June ever — analysis",
            "author": "AFP",
            "url": "https://www.arabnews.com/node/2607265/pakistan",
            "url_media": "https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/07/07/4619059-1110756948.jpg?itok=RD9v-xbQ",
            "country": "SA",
            "language": "en",
            "summary": "The month of June was the hottest ever recorded in 12 countries and exceptionally warm in 26 other countries. 790 million people around Europe, Asia and Africa experienced their hottest June to date. Around 15 countries, including Switzerland, Italy, and every Balkan state, saw temperatures rise to three degrees Celsius above the June average between 1981 and 2010. Japan also had its hottest June on record since data collection began in 1898. South Korea and North Korea experienced their warmest June since records began."
        },
        {
            "published_date": "2025-07-07T18:01:14",
            "title": "The hidden reason Earth stayed super hot, study found",
            "author": "Amit Malewar",
            "url": "https://www.techexplorist.com/earth-warming-world-252-million-years-ago/100011",
            "url_media": "https://www.techexplorist.com/wp-content/uploads/2025/07/earth-caught-fire.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The Permian–Triassic Mass Extinction happened 252 million years ago. The main trigger was volcanic eruptions in what is now Siberia. Tropical forests play a key role in carbon sequestration. When they disappeared, Earth lost one of its main tools for cooling down. The planet stayed extremely hot for millions of years after the extinction."
        },
        {
            "published_date": "2025-07-07T17:58:24",
            "title": "Meteorologist Debunks ABC News' ‘Absurd' Claim Linking Climate Change To Sleep Apnea",
            "author": "Anthony Watts",
            "url": "https://climatechangedispatch.com/climate-change-temperatures-sleep-apnea",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/07/sleep-apnea-snore.jpg",
            "country": "US",
            "language": "en",
            "summary": "In a recent article, ABC News claimed that climate change is making it harder for people to sleep because of rising temperatures. This is not the case. A large portion of the temperature rise in cities is due to the Urban Heat Island effect, not long-term climate change. The main risk factors for sleep apnea are obesity, thick neck circumference, narrowed airways, family history, use of alcohol or sedatives, smoking and certain medical conditions."
        },
        {
            "published_date": "2025-07-07T17:19:25",
            "title": "Record-Breaking Temperatures In June Around The World",
            "author": "Agence France-Presse",
            "url": "https://www.ndtv.com/world-news/record-breaking-temperatures-in-june-around-the-world-8839513",
            "url_media": "https://c.ndtvimg.com/2025-07/hoj0nhgg_europe-heatwave-_625x300_01_July_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
            "country": "IN",
            "language": "en",
            "summary": "The month of June was the hottest ever recorded in 12 countries and exceptionally warm in 26 other countries. 790 million people around Europe, Asia and Africa experienced their hottest June to date. 15 countries, including Switzerland, Italy, and every Balkan state, saw temperatures rise to three degrees Celsius above the June average between 1981 and 2010. Spain, Bosnia, and Montenegro had the hottest June ever. Japan also had its hottest June on record since data collection began in 1898. South Korea and North Korea also experienced their warmest June since records began. In China, 102 weather stations logged the hottest-ever June day, with some measuring temperatures above 40 degrees Celsius."
        },
        {
            "published_date": "2025-07-07T17:12:59",
            "title": "10 drivers of global river delta changes identified—scientists warn urgent climate action need",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/07/10_drivers_of_global_river_delta_changes_identified_scientis",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "New research from Southampton scientist has identified the causes of changes affecting river deltas around the world. There is an urgent need to tackle them through climate adaptation. Delta are low-lying areas that form as rivers empty. They are the most complex coastal systems in the world and recognizing these multiple drivers is fundamental to finding solutions."
        },
        {
            "published_date": "2025-07-07T17:12:59",
            "title": "Growing surface meltwater in East Antarctica signals new risks for global sea levels",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/07/Growing_surface_meltwater_in_East_Antarctica_signals_new_ris",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "University of Liverpool has produced the first Antarctic-wide, high-resolution monthly dataset of surface meltwater in East Antarctica. It shows an increasing sensitivity of East Antarctica to meltwater ponding, according to the research.       .  "
        },
        {
            "published_date": "2025-07-07T17:07:06",
            "title": "Wildfires are ‘disaster waiting to happen', farmers warn",
            "author": "Samuel Montgomery",
            "url": "https://www.yahoo.com/news/wildfires-disaster-waiting-happen-farmers-170706651.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/C0SD9ud9jH7DZO7mxkwJCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_telegraph_818/a378d7d7555c8472cbd02978994250ae",
            "country": "US",
            "language": "en",
            "summary": "There is a third heatwave in four weeks and seven red 'very high' UV alerts issued by the Met Office. It follows the UK's warmest spring on record and driest for more than 50 years. Gareth Wyn Jones, a sheep farmer and campaigner from Llanfairfechan, has sounded the alarm over the threat of wildfires on arid UK farmland."
        },
        {
            "published_date": "2025-07-07T16:48:00",
            "title": "CS Ruku meets global centre on adaptation leaders ahead of Nairobi groundbreaking",
            "author": "PERPETUA ETYANG",
            "url": "https://www.the-star.co.ke/news/realtime/2025-07-07-cs-ruku-meets-global-center-on-adaptation-leaders-ahead-of-nairobi-groundbreaking",
            "url_media": "https://cdn.radioafrica.digital/image/2025/07/5341a5fa-77d6-4f70-a57b-eb51b4ff3bfe.jpg?1751915534162",
            "country": "KE",
            "language": "en",
            "summary": "CS Geoffrey Ruku held high-level discussions with senior leaders of the Global Center on Adaptation (GCA) on Monday. The talks brought together GCA Chairperson and former President of Senegal Macky Sall, GCA CEO and University of Nairobi Chancellor Patrick Verkooijen, and Principal Secretary in the State Department for Foreign Affairs Korir Sing'Oei. The meeting focused on final preparations for the establishment of the GCA's new African headquarters at the Kenya School of Government, which falls under CS Ruku's ministry."
        },
        {
            "published_date": "2025-07-07T16:07:05",
            "title": "How climate change is affecting local Maryland communities",
            "author": "SASHA ALLEN",
            "url": "https://baltimorefishbowl.com/stories/climate-change-is-a-local-issue-and-heres-whats-happening-in-every-part-of-maryland",
            "url_media": "https://baltimorefishbowl.com/wp-content/uploads/2025/07/blackwater-1736.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Maryland have risen 2.5 degrees Fahrenheit since the 20th century. The state is experiencing increasing precipitation, a higher probability of summer droughts, more extreme weather events and rising sea levels. Communities on the Eastern Shore and Baltimore's city neighborhoods are at particular risk because of climate change."
        },
        {
            "published_date": "2025-07-07T15:49:39",
            "title": "Africa: Sharing Seedlings With Neighboring and West African Countries Makes the Initiative Pan",
            "author": "Ephrew ANDARAGCHEW",
            "url": "https://allafrica.com/stories/202507070674.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Climate change is a worldwide phenomenon with negative consequences for ecosystems, human health, and the economy. It is distinguished by rising temperatures, changed weather patterns, and increased frequency of extreme weather events. The Ethiopian government has developed the Green Legacy Initiative to address the negative effects of climate change. It aims to plant billions of trees across Ethiopia to rehabilitate degraded lands, increase biodiversity, and combat deforestation."
        },
        {
            "published_date": "2025-07-07T15:34:57",
            "title": "SANBI secures major climate adaptation funding to protect South Africa's most vulnerable communities",
            "author": "",
            "url": "https://southafricatoday.net/environment/sanbi-secures-major-climate-adaptation-funding-to-protect-south-africas-most-vulnerable-communities",
            "url_media": "https://southafricatoday.net/wp-content/uploads/2025/05/sat-default-photo.webp",
            "country": "ZA",
            "language": "en",
            "summary": "South Africa is set to benefit from a grant of USD 40.1 million from the Green Climate Fund (GCF) to assist in the country's climate change adaptation efforts. This landmark investment will support the implementation of the project called, 'Scaling up ecosystem-based approaches to managing climate intensified disaster risks in vulnerable regions of South Africa', or the Eco-DRR project. The project will directly benefit around 366,000 people and reach more than 5 million South Africans indirectly, particularly those living in areas affected by floods, droughts and wildfires."
        },
        {
            "published_date": "2025-07-07T14:40:00",
            "title": "The Trump administration is undercutting our ability to track climate change",
            "author": "",
            "url": "https://madison.com/news/state-regional/weather/article_3a009092-d360-41f1-89d3-4836cf71574b.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/madison.com/content/tncms/assets/v3/editorial/3/a0/3a009092-d360-41f1-89d3-4836cf71574b/686b00a04070d.preview.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The U.S. National Climate Assessment is mandated by the Global Change Research Act of 1990. The assessment has been conducted every four years since 2000. The fifth NCA5 was completed in November 2023. The Trump administration is dismantling the government's ability to monitor a rapidly changing climate."
        },
        {
            "published_date": "2025-07-07T14:39:54",
            "title": "Greenland-sized sea ice lost in Antarctica, with no signs of return",
            "author": "Daily Sabah",
            "url": "https://article.wn.com/view/2025/07/07/Greenlandsized_sea_ice_lost_in_Antarctica_with_no_signs_of_r",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Antarctica has lost sea ice equivalent in area to Greenland since 2015. This event is now considered one of the most significant in recent history. It has not returned yet, according to new satellite data from 2015. The event is considered to be very dangerous."
        },
        {
            "published_date": "2025-07-07T14:31:49",
            "title": "Himachal's Battle Against Cloudbursts: Strengthening Disaster Preparedness",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3495898-himachals-battle-against-cloudbursts-strengthening-disaster-preparedness",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_08_2024_11_25_44_7402245.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Himachal Pradesh has been hit hard by recent cloudbursts and flash floods. Chief Minister Sukhvinder Singh Sukhu ordered a study on high-risk glacial lakes and a new disaster training institute at Palampur. The Rs 891 crore project dedicated to disaster risk reduction is slated for completion in March 2030."
        },
        {
            "published_date": "2025-07-07T14:11:25",
            "title": "CariCOF warns of intense heat and active hurricane season across the Caribbean",
            "author": "Joanne Clark",
            "url": "https://www.caribbeannationalweekly.com/news/caricof-warns-of-intense-heat-and-active-hurricane-season-across-the-caribbean",
            "url_media": "https://www.caribbeannationalweekly.com/wp-content/uploads/2025/03/heatwaves.jpg",
            "country": "US",
            "language": "en",
            "summary": "Caribbean Climate Outlook Forum (CariCOF) is forecasting neutral El Niño-Southern Oscillation conditions for the Pacific and a highly active heat and rainfall season across the region. CariCOF predicts 25 or more hot spell days between July and September for several territories, including The Bahamas, Grand Cayman, northwest and southeast Jamaica, Dominica, Martinique, St Lucia, St Martin and St Croix."
        },
        {
            "published_date": "2025-07-07T14:01:19",
            "title": "Sukhu calls for urgent study on rising cloudbursts",
            "author": "Tribune News Service",
            "url": "https://www.tribuneindia.com/news/himachal/sukhu-calls-for-urgent-study-on-rising-cloudbursts",
            "url_media": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYWZkZDhmM2QwLTViM2EtMTFmMC05MTIyLTg5YjRhMjgyZWQzNS5qcGc=",
            "country": "IN",
            "language": "en",
            "summary": "Chief Minister Sukhvinder Singh Sukhu has expressed serious concern over the increasing frequency of cloudbursts in the state. Mandi district experienced 123% excess rainfall and Shimla 105% excess rain in recent days, leading to widespread devastation. The state government is strengthening the SDRF, establishing a new campus at Palampur and setting up a State Institute of Disaster Management."
        },
        {
            "published_date": "2025-07-07T13:54:46",
            "title": "Explained: What Is Heat Anxiety And Why Is It On The Rise In India",
            "author": "Srishti Singh Sisodia",
            "url": "https://www.ndtv.com/feature/explained-what-is-heat-anxiety-and-why-is-it-on-the-rise-in-india-8838339",
            "url_media": "https://c.ndtvimg.com/2025-07/52tmb6e4_heat-anxiety_625x300_07_July_25.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "\"Heat anxiety\" refers to worry, discomfort or apprehension triggered by hot weather or high temperatures. It is also known as \"heat stress\" or \"heat-related anxiety\". Exposure to long durations of heat puts the human body in a stressful state. People start avoiding outdoor activities or social events due to the fear of heat-related discomfort. People with existing mental health conditions may feel worse during extremely hot weather."
        },
        {
            "published_date": "2025-07-07T13:38:06",
            "title": "Trump faces scrutiny over climate funding cuts amid Texas floods",
            "author": "",
            "url": "https://egypt.shafaqna.com/EN/AL/7026280",
            "url_media": "https://egypt.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Trump's cuts to climate change research come under more scrutiny after deadly Texas floods. President Trump's climate change funding cuts come under scrutiny after the floods in Texas. Trump's cuts come amid scrutiny over climate funding cuts amid Texas floods, which killed more than a dozen people."
        },
        {
            "published_date": "2025-07-07T13:36:26",
            "title": "World Population Day: How rising population is impacting climate change",
            "author": "",
            "url": "https://www.newsbytesapp.com/news/lifestyle/the-hidden-impact-of-population-growth-on-climate-change/story",
            "url_media": "https://i.cdn.newsbytesapp.com/images/l92620250707190448.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "On World Population Day, we need to focus on population growth and its impact on climate change. Every person added to the global population needs light, heat, transportation, and technology. Growing populations need land for homes, farming, and industry. Deforestation disrupts rainfall patterns and biodiversity. Sprawling urban areas often increase car dependency. Poorly planned cities encroach on green spaces."
        },
        {
            "published_date": "2025-07-07T13:31:40",
            "title": "Greece orders five hour stop orders as temperatures hit 40C",
            "author": "Robert Rowlands",
            "url": "https://www.cornwalllive.com/news/uk-world-news/greece-orders-five-hour-stop-10325412",
            "url_media": "https://i2-prod.cornwalllive.com/incoming/article10325379.ece/ALTERNATES/s1200/0_greecebuildings.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Temperatures in Greece are expected to soar above 40C. The Labour Ministry has called for a halt in work from midday to 5pm in some areas. No emergency measures have been put into place in Athens. Greece is implementing long-term strategies to combat the impacts of climate change."
        },
        {
            "published_date": "2025-07-07T13:19:28",
            "title": "Here's how to see the Delta Aquariid meteor shower just around the corner",
            "author": "Josh Milton",
            "url": "https://metro.co.uk/2025/07/07/see-delta-aquariid-meteor-shower-just-around-corner-23599142",
            "url_media": "https://metro.co.uk/wp-content/uploads/2025/07/SEI_258146183-ca47_1751894375.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "The next meteor shower is Delta Aquariid, also known as the Southern Delta Aquarius. It will be visible from July 12 to August 23, peaking on the night of July 30. It's caused by Comet 96P Machholz, which orbits the Sun every 5.3 years. The next time it will pass over Earth is in June 2028."
        },
        {
            "published_date": "2025-07-07T13:02:49",
            "title": "Trump faces scrutiny over climate funding cuts amid Texas floods",
            "author": "",
            "url": "https://www.aljazeera.com/video/newsfeed/2025/7/7/trump-faces-scrutiny-over-climate-funding-cuts-amid-texas-floods",
            "url_media": "https://www.aljazeera.com/wp-content/uploads/2025/07/image-1751893345.jpg?resize=1920%2C1080&quality=80",
            "country": "QA",
            "language": "en",
            "summary": "Trump's cuts to climate change research come under more scrutiny. Authorities are facing questions about whether enough warnings were given ahead of the deadly Texas floods, as President Trump's climate change cuts are under scrutiny as well as the cuts to the research budget are also under scrutiny."
        },
        {
            "published_date": "2025-07-07T12:47:18",
            "title": "Extreme heat waves in June plagued millions of people in Europe, Asia and Equatorial Africa",
            "author": "",
            "url": "https://en.protothema.gr/2025/07/07/extreme-heat-waves-in-june-plagued-millions-of-people-in-europe-asia-and-equatorial-africa",
            "url_media": "https://en.protothema.gr/wp-content/uploads/2025/07/24575321-1.jpg-1.jpg",
            "country": "GR",
            "language": "en",
            "summary": "There was a record heatwave in 12 countries and extremely high temperatures in 26 others in June. 790 million people were affected by the heat wave in Europe, Asia, and Africa. In China, 102 weather stations recorded daily record-breaking heat in June, with some temperatures exceeding 40°C. Japan experienced the warmest June since records began being kept in 1898."
        },
        {
            "published_date": "2025-07-07T12:40:43",
            "title": "GCC sees 40% surge in rainfall and soaring temperatures amid solar energy boom",
            "author": "Staff Writer",
            "url": "https://www.arabianbusiness.com/culture-society/gcc-sees-40-surge-in-rainfall-and-soaring-temperatures-amid-solar-energy-boom",
            "url_media": "https://www.arabianbusiness.com/wp-content/uploads/sites/3/2025/07/gcc-rain-heat-temperature.jpg",
            "country": "AE",
            "language": "en",
            "summary": "Gulf Cooperation Council (GCC) countries experienced a dramatic 39.6% rise in rainfall in 2023. The region recorded its highest average temperature in recent years. The number of dams collecting surface water increased modestly to 861, up from 854 the year before. Solar power production from solar energy has skyrocketed in the past decade. GCC countries have implemented national strategies for disaster risk reduction."
        },
        {
            "published_date": "2025-07-07T12:35:00",
            "title": "Greenland-sized sea ice lost in Antarctica, with no signs of return",
            "author": "Daily Sabah With Agencies",
            "url": "https://www.dailysabah.com/life/environment/greenland-sized-sea-ice-lost-in-antarctica-with-no-signs-of-return",
            "url_media": "https://idsb.tmgrup.com.tr/ly/uploads/images/2025/07/07/thumbs/1200x675/390512.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Antarctica has lost sea ice equivalent in area to Greenland since 2015. This event is considered one of the most significant global environmental changes of the past decade. Sea surface salinity began rising in 2015, coinciding with the period of accelerated sea ice loss. Scientists warn that this is creating a powerful feedback loop, further accelerating ice melt."
        },
        {
            "published_date": "2025-07-07T12:32:11",
            "title": "Himachal CM Stresses Urgency in Addressing Climate Disasters",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3495696-himachal-cm-stresses-urgency-in-addressing-climate-disasters",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_07_2025_18_01_52_195252.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Sukhvinder Singh Sukhu is the Chief Minister of Himachal Pradesh. He expressed concerns over the alarming rate of cloud bursts and erratic rainfall in the state. He urged the need for improved disaster response strategies and scientific muck disposal to prevent further damage. Groundbreaking initiatives are underway to enhance the state's disaster preparedness."
        },
        {
            "published_date": "2025-07-07T12:22:41",
            "title": "Climate scientists weigh in on deadly Texas flooding",
            "author": "",
            "url": "https://www.thenewdaily.com.au/life/science/environment/2025/07/07/texas-floods-climate-scientists",
            "url_media": "https://wp.thenewdaily.com.au/wp-content/uploads/2025/07/1751851522-texas-flooding.jpg?resize=1200%2C630",
            "country": "AU",
            "language": "en",
            "summary": "At least 82 people died in Texas floods, 68 of them in Kerr County. They include 10 girls, a counsellor and a camp counselor. Some local officials blame the weather service, but meteorologists and climate scientists refute the claims. They concur that human-caused global heating is causing stronger and more frequent extreme weather events."
        },
        {
            "published_date": "2025-07-07T12:20:00",
            "title": "The mysterious black dust speeding up Arctic ice melt: What's behind it?",
            "author": "Global Desk",
            "url": "https://economictimes.indiatimes.com/news/international/canada/the-mysterious-black-dust-speeding-up-arctic-ice-melt-whats-behind-it/articleshow/122294536.cms",
            "url_media": "https://img.etimg.com/thumb/msid-122294543,width-1200,height-630,imgsize-122916,overlay-economictimes/articleshow.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Soot from Canada's record-breaking wildfires is darkening the region's ice and snow, speeding up its melt. The Arctic is already warming four times faster than the rest of the planet. Scientists call for urgent action to curb greenhouse gas emissions and address the growing threat of wildfire soot."
        },
        {
            "published_date": "2025-07-07T12:07:00",
            "title": "Families asked to 'help with tray' this week if they see house martins",
            "author": "Steven Smith",
            "url": "https://www.express.co.uk/life-style/garden/2078529/families-house-martins-gardens-asked-help-tray-week",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/13/1200x630/6277973.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Britain is bracing itself for its third heatwave of the year this week. When arid periods become just 1C warmer, birds' annual survival prospects plummet by approximately 63%. Lucy Taylor, a garden wildlife specialist at Vine House Farm Bird Foods, explains how homeowners can help their feathered friends during the current dry spell."
        },
        {
            "published_date": "2025-07-07T12:01:36",
            "title": "Premier attends CARICOM Conference in Jamaica",
            "author": "",
            "url": "https://bvinews.com/premier-attends-caricom-conference-in-jamaica",
            "url_media": "https://bvinews.com/wp-content/uploads/2024/05/Screenshot-2024-05-30-at-6.53.39 AM-1024x767.png",
            "country": "US",
            "language": "en",
            "summary": "Dr Natalio Wheatley is attending the 49th Regular Meeting of the Conference of Heads of Government of the Caribbean Community (CARICOM) in Montego Bay, Jamaica. The meeting focuses on regional security, food and nutrition security, and climate change under the theme, 'People, Partnerships, Property: Promoting a Secure and Sustainable Future.' Dr Wheatley said the Virgin Islands remains committed to regional collaboration."
        },
        {
            "published_date": "2025-07-07T11:58:31",
            "title": "People with robins and blackbirds in gardens asked to do five things this week",
            "author": "Steven Smith",
            "url": "https://www.walesonline.co.uk/lifestyle/people-robins-blackbirds-gardens-asked-32008990",
            "url_media": "https://i2-prod.walesonline.co.uk/article32009021.ece/ALTERNATES/s1200/0_pexels-georg-wietschorke-684125185-18370111.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The UK is preparing for its third heatwave this week. The main food that garden birds need at this time of the year is invertebrates, including caterpillars, flying insects, earthworms and snails. House sparrows and house martins can have a second or even a third brood during the breeding season, so it's still time to help them."
        },
        {
            "published_date": "2025-07-07T11:55:25",
            "title": "Urgent need for deeper collaboration on trade, food security and democracy – President Ali says in CARICOM Day message",
            "author": "Editor",
            "url": "https://newsroom.gy/2025/07/07/urgent-need-for-deeper-collaboration-on-trade-food-security-and-democracy-president-ali-says-in-caricom-day-message",
            "url_media": "https://newsroom.gy/wp-content/uploads/2024/02/COLLAGE-1-9.jpg",
            "country": "GY",
            "language": "en",
            "summary": "It's CARICOM Day. President Irfaan Ali wishes warmest wishes to all Guyanese and their brothers and sisters across the Caribbean Community. Guyana is committed to regional integration and will not rescind its principled commitment from which his government will not recede."
        },
        {
            "published_date": "2025-07-07T11:52:53",
            "title": "Too hot to work - Greece makes midday breaks mandatory between 12pm and 5pm",
            "author": "News Desk",
            "url": "https://english.mathrubhumi.com/news/world/greece-makes-midday-breaks-mandatory-between-12pm-and-5pm-ohf89k7r",
            "url_media": "https://img.mathrubhumi.com/view/acePublic/alias/contentid/1kcsqt05250pe0oj8k4/0/athens-heatwave-jpg.jpeg?f=16%3A9&w=1200&q=0.75",
            "country": "IN",
            "language": "en",
            "summary": "Temperatures are forecast to exceed 40°C (104°F) in parts of Greece. The Labour Ministry ordered mandatory work stoppages in areas most affected. The measures aim to protect workers from heat-related illness during the hottest hours of the day. There are no emergency restrictions in Athens."
        },
        {
            "published_date": "2025-07-07T11:41:43",
            "title": "Türkiye warns Israel's Gaza war may trigger global consequences",
            "author": "Daily Sabah",
            "url": "https://article.wn.com/view/2025/07/07/Turkiye_warns_Israel_s_Gaza_war_may_trigger_global_consequen",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Türkiye warned that Israel's war in Gaza has undone decades of development in the Middle East and could trigger global consequences if its aggression is not curbed. If Israel's aggression isn't curbed, there will be global consequences. If.  "
        },
        {
            "published_date": "2025-07-07T11:36:01",
            "title": "Africa contributes least to emissions yet suffers most, Tinubu tells BRICS summit, calls for global reforms",
            "author": "The Sun",
            "url": "https://www.latestnigeriannews.com/p/4368143/africa-contributes-least-to-emissions-yet-suffers-most-tinubu-tells-brics-summit.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "President Bola Tinubu delivered a powerful message at the 17th BRICS Summit in Rio de Janeiro. Africa has contributed the least to global emissions but suffers the most, he declared. He called for urgent reforms in global warming policies.      "
        },
        {
            "published_date": "2025-07-07T11:27:26",
            "title": "Heatwaves Last Longer as Globe Warms Rapidly",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/heatwaves-last-longer-as-globe-warms-rapidly",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/07/Heatwaves-Last-Longer-as-Globe-Warms-Rapidly-1751887649.jpg",
            "country": "TR",
            "language": "en",
            "summary": "As global temperatures rise, so too does the duration of heatwaves. This is due to the interplay between rising mean temperatures and intrinsic temporal correlations of weather variability. The study suggests that the impacts of sustained heat will compound more rapidly than previously anticipated, posing escalating risks to human health, agriculture, infrastructure, and ecosystems."
        },
        {
            "published_date": "2025-07-07T10:51:07",
            "title": "Compulsory breaks for food delivery riders as Greece heatwave persists",
            "author": "Anna Loren",
            "url": "https://www.independent.co.uk/bulletin/news/greece-heatwave-mandatory-work-breaks-40c-b2783910.html",
            "url_media": "https://static.independent.co.uk/2025/07/07/11/Greece_Heat_Wave_Weather_43788.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Greece has introduced mandatory work breaks for outdoor manual labour and food delivery services in regions where temperatures are forecast to exceed 40 degrees Celsius. This measure comes as a heatwave is set to grip the country until Thursday. Greece has recently battled significant wildfires, including one on Crete that necessitated the evacuation of 5,000 tourists."
        },
        {
            "published_date": "2025-07-07T10:39:01",
            "title": "Greece Enforces Work Breaks Amid Soaring Temperatures",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3495529-greece-enforces-work-breaks-amid-soaring-temperatures",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/27_06_2024_13_51_40_517961.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Temperatures in Greece exceeded 40 degrees Celsius. The labor ministry has mandated a halt to outdoor manual work and food delivery from midday to 5:00 pm. Employers are encouraged to allow remote work options to ensure employee safety. No emergency actions are planned for Athens."
        },
        {
            "published_date": "2025-07-07T10:38:05",
            "title": "Albanese's ‘bizarre' speech hurting Australia's relationship with US",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/albaneses-bizarre-speech-hurting-australias-relationship-with-us/video/527d536adb34b512e377fa4d46632a1c",
            "url_media": "https://content.api.news/v3/images/bin/5ac38ef87901deddb898a6a0a0e07626",
            "country": "AU",
            "language": "en",
            "summary": "Greg Sheridan is the Australian's Foreign Editor. He is concerned that Australia is drifting away from the United States in their relations. Albanese made a bizarre speech. He may have been trying to provoke the Americans into killing off AUKUS. The American alliance is very popular."
        },
        {
            "published_date": "2025-07-07T10:36:00",
            "title": "Greek authorities order work breaks as temperatures soar past 40C",
            "author": "Associated Press Reporter",
            "url": "https://www.irishexaminer.com/world/arid-41665016.html",
            "url_media": "https://www.irishexaminer.com/cms_media/module_img/9387/4693838_1_seoimageog_2e06975280c748b99afe7fbc14cae552.jpg.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Temperatures are expected to exceed 40C in parts of Greece on Monday. The heatwave is forecast to last until Thursday. The work stoppage is for outdoor manual labour and food delivery services in central Greece and on several islands. Employers were asked to offer remote work options."
        },
        {
            "published_date": "2025-07-07T10:30:48",
            "title": "Consultation opens on 100 year Jersey coastal defence plans",
            "author": "Jake Wallace",
            "url": "https://www.bbc.com/news/articles/c3en035pzxqo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/df1b/live/67159080-5b16-11f0-a7cb-992f82c2d299.jpg",
            "country": "GB",
            "language": "en",
            "summary": "A public consultation has been launched into government plans to protect a Jersey bay against flooding and climate change for the next 100 years. The Havre des Pas Coastal Flood Alleviation Scheme aims to protect the area by extending the coastline and integrating sea defences. About 350 properties in the area are at risk from a one in 200-year flood event, which could rise to 1000 properties by the year 2120 without changes. The £100m project includes promenades, safe cycle routes, landscaped coastal gardens, and enhanced wildlife habitats. Drop-in sessions are being held at the Lido from Tuesday 22 to Thursday 24 July."
        },
        {
            "published_date": "2025-07-07T10:23:42",
            "title": "The mysterious black dust speeding up Arctic ice melt: What's behind it?",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/07/The_mysterious_black_dust_speeding_up_Arctic_ice_melt_What_s_7",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Soot from Canada's wildfires darkens ice and snow, which speeds up melting. Arctic faces a new threat due to the albedo effect of the smoke from the wildfires on the snow and ice, which increases its melting speed.   . "
        },
        {
            "published_date": "2025-07-07T10:16:13",
            "title": "Wildfires erupt across Mediterranean as heatwave worsens",
            "author": "",
            "url": "https://saudi.shafaqna.com/EN/AL/1764602",
            "url_media": "https://saudi.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Wildfires break out in France, Greece, Turkiye and Syria due to heatwave. Several countries are on high alert due to the weather conditions.   Â      in Europe and the Middle East are experiencing the worst of the heat wave."
        },
        {
            "published_date": "2025-07-07T10:11:49",
            "title": "10 Countries Where \"Normal Weather\" Is a Thing of the Past",
            "author": "Marcel Kuhn",
            "url": "https://www.msn.com/en-us/weather/topstories/10-countries-where-normal-weather-is-a-thing-of-the-past/ss-AA1I6Kl3",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Pakistan is the world's most climate-vulnerable country, ranking first in the 2025 Climate Risk Index with economic losses worth $30 billion from extreme weather events in 2022 alone. Pakistan experienced severe monsoon flooding in 2022 that affected 33 million people, caused over 1,700 deaths and $15 billion in damage."
        },
        {
            "published_date": "2025-07-07T10:07:25",
            "title": "Italy: High temperatures are making 'inhumane conditions' worse for migrant workers in Puglia",
            "author": "",
            "url": "https://www.infomigrants.net/en/post/65599/italy-high-temperatures-are-making-inhumane-conditions-worse-for-migrant-workers-in-puglia",
            "url_media": "https://scd.infomigrants.net/media/resize/my_image_small/df2f1194dce47d3e47585d079c6bb75037d4a716.jpg",
            "country": "FR",
            "language": "en",
            "summary": "A union in Italy FLAI CGIL based in Foggia has spoken out against the living conditions of migrants living in the Borgo Mezzanone makeshift camp in Puglia. Migrants there are forced to live in makeshift aluminum huts with temperatures reaching over 40 degrees celsius and lacking all basic services. According to the union, the camp houses almost 5,000 migrants, many of them from Nigeria, Mali and Gana and working in the fields surrounding the camp."
        },
        {
            "published_date": "2025-07-07T10:03:51",
            "title": "BMKG: Climate Change Fuels Unpredictable Extreme Weather",
            "author": "Defara Dhanya",
            "url": "https://en.tempo.co/read/2025477/bmkg-climate-change-fuels-unpredictable-extreme-weather",
            "url_media": "https://statik.tempo.co/data/2024/06/09/id_1308877/1308877_720.jpg?rand=2",
            "country": "ID",
            "language": "en",
            "summary": "The Earth's warming is 1.55 degrees Celsius above the 1850-1900 pre-industrial baseline period. The impact is visible across many parts of the world, including Indonesia. Effective spatial planning and infrastructure management are crucial for mitigating the adverse effects of hydrometeorological disasters. Farmers need to adapt their farming strategies."
        },
        {
            "published_date": "2025-07-07T10:00:00",
            "title": "‘Unsustainable tourism' or an ‘economic opportunity?' Here is what we know about plans to make Georgian Bay a UNESCO Geopark",
            "author": "Julian Orlando Chaves",
            "url": "https://www.parrysound.com/news/unsustainable-tourism-or-an-economic-opportunity-here-is-what-we-know-about-plans-to-make/article_e7f4221a-beb2-5dae-9d12-10b8c89802d5.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/parrysound.com/content/tncms/assets/v3/editorial/e/42/e4233449-3f92-5ace-b44e-8da57e7c65cb/686825e1af0e6.image.jpg?crop=1762%2C925%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Margaret Hastings is concerned about the lack of consultation with West Parry Sound communities about the Georgian Bay Geopark initiative. She thinks Georgian Bay is under threat.      Â   .   - Georgian Bay Aspiring Geoparks."
        },
        {
            "published_date": "2025-07-07T09:51:38",
            "title": "Atlanta is embracing a cheap, effective way to beat urban heat: ‘cool roofs'",
            "author": "Grist",
            "url": "https://article.wn.com/view/2025/07/07/Atlanta_is_embracing_a_cheap_effective_way_to_beat_urban_hea",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Walk outside in 100-degree heat wearing a black shirt and you'll feel a lot hotter than if you were wearing white. If your roof is dark, it's soaking up more of the sun's energy and radiating that heat. It's far easier to change a local climate than a global one."
        },
        {
            "published_date": "2025-07-07T09:51:38",
            "title": "How climate change is worsening extreme heat",
            "author": "Grist",
            "url": "https://article.wn.com/view/2025/07/07/How_climate_change_is_worsening_extreme_heat",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather seems to make the headlines almost every week, as disasters strike out of season, break records and hit places they never have before. Scientific research has proven that human-caused climate change is to blame for extreme weather events, as well as for heat waves."
        },
        {
            "published_date": "2025-07-07T09:23:12",
            "title": "The ocean's currents are shifting. Why?",
            "author": "Hannah Chinn",
            "url": "https://www.wrvo.org/2025-07-07/the-oceans-currents-are-shifting-why",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/9e7d922/2147483647/strip/true/crop/5326x2796+0+100/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2025%2F07%2F03%2Fsea-camp-1_wide-f5c6a9935bb0ae47f22bb62d3b7178f7460a91a6.jpg",
            "country": "US",
            "language": "en",
            "summary": "This is the first episode of Short Wave's summer series exploring the intriguing and otherworldly depths of the ocean. Follow us every Monday through August as we travel from the sunlit zone to the sea floor. Listen to every episode sponsor-free and support our work at NPR by signing up for Short Wave+."
        },
        {
            "published_date": "2025-07-07T09:07:50",
            "title": "Climate crisis grips coastal Sindh, Thatta, Badin at high risk in monsoon",
            "author": "",
            "url": "https://www.app.com.pk/national/climate-crisis-grips-coastal-sindh-thatta-badin-at-high-risk-in-monsoon",
            "url_media": "https://www.app.com.pk/wp-content/uploads/2025/07/Climate-crisis-grips-coastal-Sindh-Thatta-Badin-at-high-risk-in-monsoon.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan is one of the countries most exposed to the consequences of climate change. This year's rainfall is expected to exceed average levels by 13%. The warning signs are most alarming in the coastal districts of Thatta and Badin. The structure of precipitation events has altered significantly in recent years. Institutional reforms are crucial to improve coordination between meteorological departments and local authorities."
        },
        {
            "published_date": "2025-07-07T09:03:40",
            "title": "As development surges in northern New Hanover County, will wetlands pay the price?",
            "author": "Gareth McGrath",
            "url": "https://www.starnewsonline.com/story/news/local/2025/07/07/can-development-and-wetlands-coexist-in-northern-new-hanover-county/84342323007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/07/03/NSTN/84463886007-sid-2.jpg?auto=webp&crop=3987,2243,x0,y379&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Residents and environmentalists are concerned about the development and loss of wetlands in Northern New Hanover County, North Carolina. The Sledge Forest project, a proposed 4,000-acre development and a slew of new developments are proposed in the Castle Hayne area. The Supreme Court ruled in May 2023 that the definition of Waters of the States, commonly called WOTUS, includes navigable waters, their tributaries and adjacent wetlands without a surface connection to the waters."
        },
        {
            "published_date": "2025-07-07T08:38:37",
            "title": "Israel's Gaza war may trigger global consequences, Turkish FM warns at BRICS summit",
            "author": "Anadolu Agency",
            "url": "https://article.wn.com/view/2025/07/07/Israel_s_Gaza_war_may_trigger_global_consequences_Turkish_FM",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "The Turkish foreign minister warned that Israel's war in Gaza has reversed decades of development in the region and could have global consequences if its aggression is not curbed. If Israel's aggression and expansionism are not brought under control, the consequences will be felt globally."
        },
        {
            "published_date": "2025-07-07T08:19:41",
            "title": "Fire that triggered evacuations and shut Kelowna, B.C., airport brought under control",
            "author": "The Canadian Press",
            "url": "https://www.thepeterboroughexaminer.com/news/canada/fire-that-triggered-evacuations-and-shut-kelowna-b-c-airport-brought-under-control/article_a7f81341-4af7-59b5-8b72-f958aabe4492.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thepeterboroughexaminer.com/content/tncms/assets/v3/editorial/8/ff/8ffe4f67-a956-5e7b-8a90-c6859509e05d/686b85f91995c.image.jpg?crop=1665%2C874%2C0%2C102&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Burned trees are seen above a neighbourhood in West Kelowna, B.C. on Friday, Aug. 25, 2023. The Peterborough Examiner is published on the website of the Peterborough Herald Examiner. The website's domain is cms.site.custom."
        },
        {
            "published_date": "2025-07-07T08:18:15",
            "title": "Glaciers in Crisis: From Alpine Rockslides to Global Ice Melt",
            "author": "Sundram Kumar",
            "url": "https://www.newsx.com/photos/glaciers-in-crisis-from-alpine-rockslides-to-global-ice-melt-14966",
            "url_media": "https://www.newsx.com/wp-content/uploads/2025/07/glacier-image-pic.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In Switzerland's Lötschental valley, the village of Blatten was devastated after permafrost thaw triggered a glacier collapse and massive rock-ice landslide. In mid‑2025, alarming incidents and scientific findings underscored the accelerating threat posed by glacier melting worldwide."
        },
        {
            "published_date": "2025-07-07T08:07:22",
            "title": "Cyprus, Southern Europe on high wildfire risk alert",
            "author": "Angelos Nicolaou",
            "url": "https://in-cyprus.philenews.com/local/cyprus-wildfire-preparedness-eu-climate-change-fire-risk",
            "url_media": "https://in-cyprus.philenews.com/wp-content/uploads/2025/04/Authorities-blame-arsonists-for-multiple-wildfires-in-Cypruss-Paphos-region.jpg",
            "country": "CY",
            "language": "en",
            "summary": "Cyprus has placed itself on heightened wildfire alert as climate change drives fire risks across the Mediterranean. The Eastern Mediterranean represents Europe's fastest-warming region with temperature increases at nearly double the global average rate. EU data shows total burned area across the bloc reached 9% above the 2006-2023 average and fires exceeding 30 hectares increased 51%. Cyprus recorded 77 forest fires from January to May 2025, burning 22 hectares compared to a decade average of 400 hectares. "
        },
        {
            "published_date": "2025-07-07T07:55:16",
            "title": "Why this is the number one test of a successful home",
            "author": "Robyn Willis",
            "url": "https://www.smh.com.au/lifestyle/health-and-wellness/why-this-is-the-number-one-test-of-a-successful-home-20250707-p5md3m.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.369%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_0%2C$y_31/t_crop_custom/q_62%2Cf_auto/3daedcce7778e88132875741d9f6d1dca39fc64f",
            "country": "AU",
            "language": "en",
            "summary": "Antony Martin is a Melbourne-based architect. He says natural light is the number one element he looks for in a dwelling. The sun appears higher in the sky in summer and lower in winter. For Australians, northern light is most desirable because it is consistent and can be effectively managed all year round."
        },
        {
            "published_date": "2025-07-07T07:55:16",
            "title": "Why this is the No.1 test of a successful home",
            "author": "Robyn Willis",
            "url": "https://www.smh.com.au/lifestyle/health-and-wellness/why-this-is-the-number-one-test-of-a-successful-home-20250707-p5md3m.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.369%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_0%2C$y_31/t_crop_custom/q_62%2Cf_auto/3daedcce7778e88132875741d9f6d1dca39fc64f",
            "country": "AU",
            "language": "en",
            "summary": "Antony Martin is a Melbourne-based architect. He says natural light is the No.1 element he looks for in a dwelling. The sun appears higher in the sky in summer and lower in winter. For Australians, northern light is most desirable because it is consistent and can be effectively managed all year round. Western orientation is the worst for winter."
        },
        {
            "published_date": "2025-07-07T07:50:01",
            "title": "Travel chaos as Australian flights to Bali are cancelled as volcano erupts in Indonesia",
            "author": "CHARLOTTE MCINTYRE",
            "url": "https://expressdigest.com/travel-chaos-as-australian-flights-to-bali-are-cancelled-as-volcano-erupts-in-indonesia",
            "url_media": "https://i.dailymail.co.uk/1s/2025/07/07/08/100065791-14881293-image-a-18_1751874504720.jpg",
            "country": "US",
            "language": "en",
            "summary": "Indonesia's Mount Lewotobi Laki-Laki volcano erupted on Monday for the second time in as many months. At least three Virgin Australia-operated flights and two Jetstar flights were cancelled. Qantas passengers can expect long delays with QF43 from Sydney and QF45 from Melbourne delayed until at least 8pm AEST."
        },
        {
            "published_date": "2025-07-07T07:39:44",
            "title": "A blob in Atlantic Ocean is mysteriously cooling while the world warms",
            "author": "",
            "url": "https://www.indiatoday.in/science/story/a-blob-in-atlantic-ocean-is-mysteriously-cooling-while-the-world-warms-2751949-2025-07-07",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202507/boat-073156414-16x9_1.jpg?VersionId=ip9pzpxC9OPAuznU3E.nYXHOSFjrk1vJ",
            "country": "IN",
            "language": "en",
            "summary": "There is a persistent cold spot in the North Atlantic Ocean south of Greenland. The origin is tied to a slowdown in the Atlantic Meridional Overturning Circulation (AMOC), a vast system of ocean currents that acts like a conveyor belt, transporting warm, salty water from the tropics northward. AMOC is crucial for regulating global climate."
        },
        {
            "published_date": "2025-07-07T07:35:00",
            "title": "Italy braced for more extreme weather after deadly storms",
            "author": "ANSA English Desk",
            "url": "https://www.ansa.it/english/news/2025/07/07/italy-braced-for-more-extreme-weather-after-deadly-storms_a424254f-2b84-4ba4-820e-d60da0a025e9.html",
            "url_media": "https://www.ansa.it/webimages/img_1129x635/2025/7/7/5ea2f8113788e6b7437f7f446ae884aa.jpg",
            "country": "IT",
            "language": "en",
            "summary": "A 63-year-old woman was killed by a falling tree near Milan on Sunday. The north of the country was battered by violent storms. Many areas not affected by storms are still suffering the effects of a long and intense heatwave. Scientists say the climate crisis caused by human greenhouse gas emissions is making extreme weather events more frequent and more intense."
        },
        {
            "published_date": "2025-07-07T06:54:40",
            "title": "Climate Change ignorance puts rural Ghana at risk",
            "author": "emmakd",
            "url": "https://www.ghanabusinessnews.com/2025/07/07/climate-change-ignorance-puts-rural-ghana-at-risk",
            "url_media": "https://www.ghanabusinessnews.com/wp-content/uploads/2018/07/climate-change.jpg",
            "country": "GH",
            "language": "en",
            "summary": "According to the 2022 Afrobarometer survey, only 22% of Ghanaians have heard of climate change and understood what it means. The EPA estimates that by 2080, average temperatures could rise by 2.5°C, while rainfall may decline by up to 30%. The changes would devastate Ghana's agriculture sector, especially in the Northern, Upper East, and Upper West Regions, where smallholder farmers depend on rainfed agriculture."
        },
        {
            "published_date": "2025-07-07T06:49:40",
            "title": "‘Death and destruction': Labor at sea on marine crisis",
            "author": "Sarah Hanson-Young",
            "url": "https://www.afr.com/policy/energy-and-climate/death-and-destruction-labor-at-sea-on-marine-crisis-20250707-p5md47",
            "url_media": "https://static.ffx.io/images/$zoom_0.5877%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/eeedc727b97bffd205fefdf55d4f91c22d2ff886",
            "country": "AU",
            "language": "en",
            "summary": "A climate change-fuelled algal bloom has killed tens of thousands of fish, stingrays, sharks and other sea life in South Australian waters in recent months. Many of the dead animals have washed up on Adelaide's beaches. South Australia's Labor government wants the Commonwealth to use its national disaster powers to deal with the problem."
        },
        {
            "published_date": "2025-07-07T06:18:54",
            "title": "‘Disaster': Senator's desperate plea to PM",
            "author": "Duncan Evans",
            "url": "https://au.news.yahoo.com/disaster-senator-desperate-plea-pm-052230414.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/romO2QrnGq5WFXu0ReSW3w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/nca_newswire_424/4fb391e73c413fc8574acf846cd52dee",
            "country": "US",
            "language": "en",
            "summary": "Greens senator Sarah Hanson-Young has written to Prime Minister Anthony Albanese to ask for more federal support to deal with the toxic algae bloom along South Australia's coastline. The algae bloom has killed and polluted marine wildlife and produced discoloured water and foam along vast stretches of the state. It is having a devastating economic impact on the state's $500m fisheries industry. The Coalition has flagged its support for a parliamentary inquiry into the event."
        },
        {
            "published_date": "2025-07-07T06:00:43",
            "title": "Türkiye among nations facing brunt of Mediterranean drought: Report",
            "author": "",
            "url": "https://www.hurriyetdailynews.com/turkiye-among-nations-facing-brunt-of-mediterranean-drought-report-211185",
            "url_media": "https://image.hurimg.com/i/hurriyet/75/200x200/686b8cb78c0a000618447394.jpg",
            "country": "TK",
            "language": "en",
            "summary": "Drought is exacerbating across the Mediterranean, with Türkiye, Spain and Morocco most prominently bearing the brunt of the crisis, according to a new international report. Mediterranean countries represent canaries in the coal mine for all modern economies. Long-term drought has accelerated groundwater depletion, triggering dangerous sinkholes and reducing the long-term capacity of aquifers in the country. Recent weeks, filled with soaring temperatures nationwide have added to the pressure."
        },
        {
            "published_date": "2025-07-07T06:00:00",
            "title": "A wild goose chase",
            "author": "Matt Seward",
            "url": "https://www.cadillacnews.com/news/a-wild-goose-chase/article_c79e67b7-5f5d-4a8f-9219-d9ae22d6afa8.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/cadillacnews.com/content/tncms/assets/v3/editorial/d/1d/d1db3453-cb66-4275-b6af-cbd5060e1229/6866ef958f44c.image.jpg?crop=1899%2C997%2C0%2C47&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "More than 50 Canada geese were banded on Lake Cadillac on Wednesday as part of an annual statewide effort to monitor and manage migratory bird populations in Michigan. The aluminum leg bands help biologists monitor migration, reproduction and survival rates. The data informs decisions about hunting seasons, bag limits and conservation strategies."
        },
        {
            "published_date": "2025-07-07T05:09:00",
            "title": "Greens Senator Sarah Hanson-Young writes to PM for algae bloom disaster declaration",
            "author": "Duncan Evans",
            "url": "https://www.news.com.au/technology/environment/greens-senator-sarah-hansonyoung-writes-to-pm-for-algae-bloom-disaster-declaration/news-story/b3bbb16ffa67f8aec8ac9d3250ad08d1",
            "url_media": "https://content.api.news/v3/images/bin/90bea671a42b498b6ee73ea7e5b18eda",
            "country": "AU",
            "language": "en",
            "summary": "Greens senator Sarah Hanson-Young has written to the Prime Minister Anthony Albanese to ask for more federal support to deal with the toxic algae bloom along South Australia's coastline. The algae bloom has killed and polluted marine wildlife and produced discoloured water and foam along vast stretches of the state's coastline for months. It is having a devastating economic impact on the $500m fisheries industry. The Coalition supports a parliamentary inquiry into the event."
        },
        {
            "published_date": "2025-07-07T05:00:54",
            "title": "Southern Ocean current reverses for first time, signalling risk of climate system collapse",
            "author": "Robin Westenra",
            "url": "https://seemorerocks.substack.com/p/this-is-hardly-reported-at-all",
            "url_media": "https://substackcdn.com/image/fetch/$s_!uJZo!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6ffd6cca-7c8b-4edf-a2f4-96f06b2ecabf_900x510.jpeg",
            "country": "US",
            "language": "en",
            "summary": "A major ocean current in the Southern Hemisphere has reversed direction for the first time in recorded history. The development has triggered widespread alarm among climate scientists due to its potential to accelerate global warming and destabilise weather patterns worldwide. The Mediterranean Sea is currently 6.21°C above the 1982–2015 average. A Spanish metrological buoy recorded a sea temperature of 31C on July 4."
        },
        {
            "published_date": "2025-07-07T05:00:00",
            "title": "UAH v6.1 Global Temperature Update for June, 2025: +0.48 deg. C",
            "author": "Guest Blogger",
            "url": "https://wattsupwiththat.com/2025/07/06/uah-v6-1-global-temperature-update-for-june-2025-0-48-deg-c",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/07/UAH_LT_1979_thru_June_2025_v6.1_20x9-scaled-1.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The Version 6.1 global average lower tropospheric temperature (LT) anomaly for June, 2025 was +0.48 deg. C departure from the 1991-2020 mean, down slightly from the May, 2025 anomaly of -0.50 deg C. Global area-averaged linear temperature trend (January 1979 through June 2025) now stands at + 0.16 deg/ C/decade."
        },
        {
            "published_date": "2025-07-07T04:50:00",
            "title": "Extreme Heat Warning issued July 6 at 9:50PM PDT until July 10 at 8:00PM PDT by NWS San Diego CA",
            "author": "National Weather Service",
            "url": "https://kesq.com/weather/alerts-weather/2025/07/06/extreme-heat-warning-issued-july-6-at-950pm-pdt-until-july-10-at-800pm-pdt-by-nws-san-diego-ca",
            "url_media": "https://kesq.b-cdn.net/2023/08/kesq-860x484.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures up to 115 degrees are possible in Coachella Valley and San Diego County Deserts from 10 AM Wednesday to 8 PM PDT Thursday. Heat-related illnesses increase significantly during extreme heat events. Drink plenty of fluids, stay in an air-conditioned room, stay out of the sun and check up on relatives and neighbors."
        },
        {
            "published_date": "2025-07-07T04:23:26",
            "title": "New Study Shows Speed Of Antarctic Ice Melt, Govt Fans Climate Flames",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/07/07/New_Study_Shows_Speed_Of_Antarctic_Ice_Melt_Govt_Fans_Climat",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "'This is a clear and urgent signal that the climate crisis is accelerating, and a critical tipping point may have already been passed. It's not a distant threat to think about somewhere down the line, but it's here now and it's a real threat."
        },
        {
            "published_date": "2025-07-07T04:15:50",
            "title": "Experts warn of 'cascading' climate tipping points that will kill the climate without immediate global action",
            "author": "Ben Aris in Berlin",
            "url": "https://www.intellinews.com/experts-warn-of-cascading-climate-tipping-points-that-will-kill-the-climate-without-immediate-global-action-389574",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/bneGeneric_bneGreen_global_warming_climate_crisis_temperature_hot_earth_from_space_Satellite__Cropped_1.png",
            "country": "US",
            "language": "en",
            "summary": "Global warming is on track to exceed 1.5°C within the next few years. Tropical coral reefs have already crossed their tipping point and are experiencing unprecedented dieback. The Amazon rainforest could face 'large-scale collapse' by 2050, according to research released last year. Europe is currently experiencing a heatwave. European Commission has proposed changes to the EU's long-term budget to better account for the economic impact of climate change."
        },
        {
            "published_date": "2025-07-07T04:01:00",
            "title": "Have We Reached Late-Stage Climate Hysteria?",
            "author": "I Editorial Board",
            "url": "https://issuesinsights.com/2025/07/07/have-we-reached-late-stage-climate-hysteria",
            "url_media": "https://i0.wp.com/issuesinsights.com/wp-content/uploads/2025/07/hysteria-mob-3-e1751804445859.png?fit=1024%2C590&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "A UN report issued last month calls for the criminalization of spreading 'disinformation and misinformation' about global warming. The alarmists have been dreaming about a 21st-century inquisition of those who hold dissenting views for more than a decade. They'd rather silence heterodoxy with jail time, prison sentences, and sanctions."
        },
        {
            "published_date": "2025-07-07T04:00:26",
            "title": "Brevard County Property Appraiser Shares Key Updates About Tax Changes, Incorporation Proposals",
            "author": "Space Coast Daily",
            "url": "https://spacecoastdaily.com/2025/07/brevard-county-property-appraiser-shares-key-updates-about-tax-changes-incorporation-proposals",
            "url_media": "https://spacecoastdaily.com/wp-content/uploads/2025/06/Dana-Blickley-600-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Brevard County Property Appraiser Dana Blickley recently presented a comprehensive overview to the Space Coast Patriots. Brevard County spans more than 1,500 square miles, with nearly 35 percent comprised of water, and boasts 72 miles of pristine beaches. It is the tenth-largest county in Florida by both population and parcel count."
        },
        {
            "published_date": "2025-07-07T03:58:26",
            "title": "Chantal causes epic flooding in several NC counties; Haw River at Bynum could hit major flood stage",
            "author": "Cruz A. Medina",
            "url": "https://abc11.com/post/tracking-chantal-haw-river-chatham-county-other-parts-north-carolina-hit-hard-flooding-tropical-depression/16993572",
            "url_media": "https://cdn.abcotvs.com/dip/images/16994096_HawRiverGfx.png?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Tropical Depression Chantal continues its assault on Central North Carolina. Chatham County was hit especially hard with an estimated 6-8\" of rain that has led to multiple closed roads and flooding of Eastgate Shopping Center in Chapel Hill. The Haw River at Bynum is expected to reach major flood stage overnight with a crest expected around 21.2 feet. The record crest of the Haw River was 21.8 feet back on September 6, 1996."
        },
        {
            "published_date": "2025-07-07T03:45:19",
            "title": "Big question remains over wind farm 'risk' as major projects begin in Australia",
            "author": "Michael Dahlstrom",
            "url": "https://au.news.yahoo.com/big-question-remains-as-scientists-tackle-mystery-of-wind-farm-risk-as-major-australian-projects-begin-034518339.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/O_TuOhhyJOe.t2BLQ6V4_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://s.yimg.com/os/creatr-uploaded-images/2025-07/b4cd9d30-5ae5-11f0-b4e9-a45a5b05ba2a",
            "country": "US",
            "language": "en",
            "summary": "Monash University's Dr Mark Miller and his team studied how high, fast and at what time of day iconic migratory species like albatrosses, petrels, shearwaters and storm-petrels tend to fly. Their newly published study indicates the risk could be low. The distance between the bottom of the blade and the sea surface is around 35 metres. Once the farms are installed it will be too late to modify them and they'll sit for 20 to 40 years."
        },
        {
            "published_date": "2025-07-07T03:11:22",
            "title": "Bising, habagat affect over 27,000 families across Luzon – NDRRMC",
            "author": "The Philadelphia Inquirer",
            "url": "https://article.wn.com/view/2025/07/07/Bising_habagat_affect_over_27000_families_across_Luzon_NDRRM",
            "url_media": "https://article.wn.com/view/2025/07/07/[]",
            "country": "US",
            "language": "en",
            "summary": "More than 27,000 families in Luzon have been affected by the combined effects of Typhoon Bising and the southwest monsoon or habagat, according to the National Disaster Risk Reduction and Management Agency (NDRRMA).   .  "
        },
        {
            "published_date": "2025-07-07T03:08:00",
            "title": "New Study Shows Speed Of Antarctic Ice Melt, Govt Fans Climate Flames",
            "author": "Green Party",
            "url": "https://www.scoop.co.nz/stories/PA2507/S00047/new-study-shows-speed-of-antarctic-ice-melt-govt-fans-climate-flames.htm",
            "url_media": "http://img.scoop.co.nz/stories/images/1908/scoop_image.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "There is a new report showing that sea ice around Antarctica is melting at unprecedented speed. Marama Davidson, Green Party co-leader, says the Government is undermining global climate efforts at every opportunity in the name of short-term thinking and profit. The Green Party is calling on the Government to honour the global commitments they have signed up to."
        },
        {
            "published_date": "2025-07-07T02:51:00",
            "title": "Rapid urbanisation fuels alarming heat surge in Bihar",
            "author": "",
            "url": "https://timesofindia.indiatimes.com/city/patna/rapid-urbanisation-fuels-alarming-heat-surge-in-bihar/articleshow/122283083.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-122283081,width-1070,height-580,imgsize-35734,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "According to a recent study, Indian cities are warming at nearly twice the rate of their surrounding regions. The urban heat island effect (UHI) is reshaping the climate profile of cities like Patna. Patna ranks among India's top ten cities most impacted by UHI."
        },
        {
            "published_date": "2025-07-07T02:05:47",
            "title": "Top Comments: Lessons About Global Warming from the Permian Extinction",
            "author": "gizmo59",
            "url": "https://www.dailykos.com/story/2025/7/6/2331951/-Top-Comments-Lessons-About-Global-Warming-from-the-Permian-Extinction",
            "url_media": "https://cdn.prod.dailykos.com/images/1453125/story_image/download-5.jpg?1751771247",
            "country": "US",
            "language": "en",
            "summary": "The Permian Extinction occurred 252 million years ago. It was followed by a period of elevated temperatures that lasted 5 million years. A new study suggests that the demise of tropical forests, and their slow recovery, limited carbon sequestration. If rapid warming causes tropical forests to collapse in a similar way, then we should not expect the climate to cool to preindustrial levels even if we stop emitting CO2."
        },
        {
            "published_date": "2025-07-07T01:56:00",
            "title": "Antarctic Ice Melt Accelerates, Govt Fuels Climate Crisis",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/antarctic-ice-melt-accelerates-govt-fuels-1491585",
            "url_media": "https://assets.nationbuilder.com/themes/5da52e1a4764e8f8c8d01cf2/attachments/original/1686022593/default-excerpt-image.jpg?1686022593",
            "country": "US",
            "language": "en",
            "summary": "Green Party co-leader Marama Davidson says the Government is undermining global climate efforts at every opportunity in the name of short-term thinking and profit. Sea ice around Antarctica is melting at unprecedented speed. The Green Party is calling on the Government to show real climate leadership."
        },
        {
            "published_date": "2025-07-07T01:51:48",
            "title": "Phoenix Scorches with Record-Breaking 100+ Degree Streak as Deaths Soar",
            "author": "Source",
            "url": "https://hoodline.com/2025/07/phoenix-scorches-with-record-breaking-100-degree-streak-as-deaths-soar",
            "url_media": "https://img.hoodline.com/2025/7/phoenix-scorches-with-record-breaking-100-degree-streak-as-deaths-soar.webp",
            "country": "US",
            "language": "en",
            "summary": "Phoenix is experiencing extreme heat conditions due to climate change. The city withstood 113 consecutive days in 2024 with temperatures reaching 100 degrees or higher, the longest streak in recorded history. Maricopa County lost 645 lives due to the heat in 2023, constituting over half the country's heat-related deaths. The urban heat island effect has raised both temperatures and concerns over air quality."
        },
        {
            "published_date": "2025-07-07T01:40:38",
            "title": "Study warns 1.5-degree warming limit too high for glaciers",
            "author": "",
            "url": "https://www.ctpublic.org/shows/newshour/clip/tipping-point-1751835380",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/7c412d1/2147483647/strip/true/crop/2160x1134+0+109/resize/1200x630!/quality/90/?url=https%3A%2F%2Fimage.pbs.org%2Fvideo-assets%2FcBGXm1g-asset-mezzanine-16x9-owxauPK.jpg",
            "country": "US",
            "language": "en",
            "summary": "The 2015 Paris agreement's goal of limiting global warming to 1.5 degrees Celsius was thought to be the threshold for averting severe climate change impacts. New research says even that level is too high to prevent the catastrophic consequences of sea level rise due to melting glaciers. John Yang speaks with Chris Stokes, one of the study's authors."
        },
        {
            "published_date": "2025-07-07T01:33:55",
            "title": "Texas flood highlights deadly climate risk from extreme weather",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/07/texas-flood-highlights-deadly-climate-risk-from-extreme-weather-los-angeles-times-2",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "by | | Climate Change is a website dedicated to the study of climate change. For more information, visit: http://www.climatalkin.org/news/environment/environmental-change/chimatockexchange.html."
        },
        {
            "published_date": "2025-07-07T01:18:00",
            "title": ", BUSHFIRES NT MESSAGE: Planned Burn Advice",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/bushfires-nt-message-planned-burn-advice-4-1491570",
            "url_media": "https://treasury.nt.gov.au/__data/assets/image/0011/807509/Parliament-House.jpg",
            "country": "US",
            "language": "en",
            "summary": "Bushfires NT are conducting a planned burn on vacant crown land at NT Port 1718, 1717, 1713, Cox Peninsula Road, DARWIN RIVER. The operation will commence after 12:30. It is expected that the fire will smoulder overnight. Smoke from the fire may affect visibility."
        },
        {
            "published_date": "2025-07-07T01:00:49",
            "title": "Flaws in 150 Years of Global Temperature Data Blow Holes in Global Warming Narrative",
            "author": "Antonio Graceffo",
            "url": "https://www.thegatewaypundit.com/2025/07/flaws-150-years-global-temperature-data-blow-holes",
            "url_media": "https://www.thegatewaypundit.com/wp-content/uploads/2025/07/global_warming_1.1c.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to liberals, average global temperatures have risen by 1.1°C to 1.3°C since the pre-industrial era (1850–1900). The National Oceanic and Atmospheric Administration reports an increase of about 1°C (2.0°F) since 1880. Most of the temperature stations used to measure climate change fail to meet the NOAA's standards for 'acceptable' and uncorrupted placement. The transition from mercury thermometers to digital sensors between the 1980s and 2000s introduced discontinuities in the data."
        },
        {
            "published_date": "2025-07-07T00:30:00",
            "title": "US plans to shut observatory that captured ‘reality' of climate change",
            "author": "Alex Sen Gupta",
            "url": "https://www.thehindu.com/sci-tech/science/us-plans-to-shut-observatory-that-captured-reality-of-climate-change/article69779903.ece",
            "url_media": "https://th-i.thgim.com/public/sci-tech/science/ysridp/article69779894.ece/alternates/LANDSCAPE_1200/1cwMauna_Loa_taken_from_the_9300_ft_level_on_the_ascent_of_Mauna_Kea.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Donald Trump wants to defund the Mauna Loa observatory recording the data on global CO₂ levels. If it closes, other observatories such as Australia's Kennaook/Cape Grim will become even more vital. The first scientific paper linking carbon dioxide levels in the atmosphere with climate change was published in 1896. Mauna loa has been collecting data for more than 65 years."
        },
        {
            "published_date": "2025-07-07T00:21:40",
            "title": "THEY ARE NOT GOING TO STOP. THIS IS WEATHER MODIFICATION BULLSHIT & HAARP JUST LIKE NORTH CAROLINA",
            "author": "Alicia Lutz-Rolow",
            "url": "https://alicialutzrolow.substack.com/p/they-are-not-going-to-stop-this-is",
            "url_media": "https://substackcdn.com/image/youtube/w_728,c_limit/xzzH5z-vMdE",
            "country": "US",
            "language": "en",
            "summary": "This is not Mother Nature, it's called DePOPOPULATION BY DESIGN. How many people have to die because of this design? How long have we lived in the U.S. before we started dealing with this stupid political correctness? "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Disease-carrying ticks are coming for us  and they're likely to hang around longer too",
            "author": "The Irish Times",
            "url": "https://article.wn.com/view/2025/07/07/Diseasecarrying_ticks_are_coming_for_us_and_they_re_likely_t",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tick-borne disease risks are on the rise globally, according to the European Commission's environment directorate. Their increase is one of the many ways in which climate change is altering our world. Anyone who spends time outdoors should protect themselves against tick bites.   "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Flights to Bali cancelled after Indonesian volcano erupts again",
            "author": "system",
            "url": "https://article.wn.com/view/2025/07/07/Flights_to_Bali_cancelled_after_Indonesian_volcano_erupts_ag",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Multiple international flights between Australia and Bali have been cancelled due to the eruption of Mount Lewotobi Laki-Laki volcano. This is the second time in as many months that this has happened due to this volcano's eruption. The flights were scheduled to depart from Bali."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Ocean current scientists are very upset and you should be too",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/07/Ocean_current_scientists_are_very_upset_and_you_should_be_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It's bad news for the Antarctic sea ice and everyone who relies on it being there, including everyone who rely on it to be there. It's bad for the sea ice as well as everyone who depends on it, including the people who depend on it. "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Climate Change ignorance puts rural Ghana at risk",
            "author": "Ghana Business News",
            "url": "https://article.wn.com/view/2025/07/07/Climate_Change_ignorance_puts_rural_Ghana_at_risk",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There are signs of man-made climate change in Ghana. Rising temperatures are the result of climate change, which is caused by human activity. It's a common Ghanaian adage that what you don't know won't kill you, but ignorance is proving dangerous."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Process engineers urged to reinforce cooling capacity",
            "author": "Hydrocarbon Engineering",
            "url": "https://article.wn.com/view/2025/07/07/Process_engineers_urged_to_reinforce_cooling_capacity",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Unseasonably high spring temperatures are making it difficult for process engineers to operate their equipment. They are being forced to change their processes due to the weather.   Â      in the process engineers are being affected by this fact. "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Tropical Storm Chantel hits NC over Fourth of July weekend: What's next for hurricane season?",
            "author": "Gaston Gazette",
            "url": "https://article.wn.com/view/2025/07/07/Tropical_Storm_Chantel_hits_NC_over_Fourth_of_July_weekend_W_w",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tropical Storm Chantal has weakened to a tropical depression and is moving across the Atlantic Ocean. It is not unusual for July for a tropical system to develop in the short term. Homegrown tropical systems usually form in the southwestern Atlantic and the Caribbean."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "How climate change is supercharging wildfires",
            "author": "Grist",
            "url": "https://article.wn.com/view/2025/07/07/How_climate_change_is_supercharging_wildfires",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather makes the headlines almost every week. Human-caused climate change is making some disasters more dangerous and more frequent. There are solutions in our knowledge and in our management approaches that can help restore ecosystems and can also benefit the public.    "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Germany's Green Party struggling to establish new identity",
            "author": "Muskat Daily",
            "url": "https://article.wn.com/view/2025/07/07/Germany_s_Green_Party_struggling_to_establish_new_identity",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Cologne and Hamburg hit 37 degrees Celsius (98.6 degrees Fahrenheit) earlier this week. Radio stations give advice on how to cope with the heat wave. Climate change is to blame for the unusual heat wave so early in the summer, radio stations say."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "UN rapporteur calls for ban on fossil fuel ads and criminalizing of disinformation",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/07/07/UN_rapporteur_calls_for_ban_on_fossil_fuel_ads_and_criminali",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Elisa Morgera is the U.N. special rapporteur on human rights and climate change. She presented her 23-page report at the UNGA. She called for an urgent shift away from fossil fuels by the global economy and a ban on advertisements or promotions."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "At BRICS summit, Turkish FM warns of global consequences if Israel's aggression, expansionism left unchecked",
            "author": "Press TV",
            "url": "https://article.wn.com/view/2025/07/07/At_BRICS_summit_Turkish_FM_warns_of_global_consequences_if_I",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hakan Fidan warned of global consequences if Israel's aggression and expansionism are not brought under control. He was speaking during a session at the 17th BRICS summit in Brazil. He warned that the consequences will be felt globally if the Israeli regime's aggressive and expansionist policies are not stopped."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Plunging snowpack levels may be curbing carbon storage capabilities of trees: Study",
            "author": "The Hill",
            "url": "https://article.wn.com/view/2025/07/07/Plunging_snowpack_levels_may_be_curbing_carbon_storage_capab",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Declining snow accumulation in the mountains of the Northeastern U.S. will reduce the ability of forests to act as a carbon sink. The shrinking snowpack and destructive freeze-thaw cycles are damaging roots and decreasing rates of nutrient and carbon uptake. Current models omit the full complexity of winter climate change effects."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Dhaka builds for a wetter future",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/07/Dhaka_builds_for_a_wetter_future_in_pictures",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " to the climate crisis in Bangladeshi megacity, where designers are adapting to climate crisis.    for the climate change crisis in the megacity.  for climate change in Bangladesh.  For more information on climate crisis  on CNN.com. "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "APTOPIX Greece Heat Wave Weather",
            "author": "Citrus County Chronicle",
            "url": "https://article.wn.com/view/2025/07/07/APTOPIX_Greece_Heat_Wave_Weather",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are expected to edge over 40 degrees Celsius (104 degrees Fahrenheit) in the next few days in the Glyfada suburb, south of Athens, Greece, on Sunday, July 6, 2025, as people take a shower in the late afternoon."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Cyprus, Southern Europe on high wildfire risk alert",
            "author": "Philenews",
            "url": "https://article.wn.com/view/2025/07/07/Cyprus_Southern_Europe_on_high_wildfire_risk_alert",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cyprus has placed itself on heightened wildfire alert as climate change drives fire risks across the Mediterranean. Rising temperatures and prolonged drought create optimal conditions for severe blazes. Scientific studies indicate the situation will deteriorate further as southern Mediterranean gets warmer.     "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Swiss weather havoc forces Swedes to change training plan",
            "author": "Straits Times",
            "url": "https://article.wn.com/view/2025/07/07/Swiss_weather_havoc_forces_Swedes_to_change_training_plan",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": ". Sweden had to change their planned training session due to soaring temperatures.    in Switzerland. Â.  yest. yest. yest in Switzerland,   thun, Switzerland, and thun. Yest in Thun, "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "From Global to Local: Our human-made problems can and must be unmade",
            "author": "The Recorder",
            "url": "https://article.wn.com/view/2025/07/07/From_Global_to_Local_Our_humanmade_problems_can_and_must_be_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In the summer of 2023 researchers watched 250 of the most-rated movies of the past 10 years for climate research purposes. A mere 13 percent of films made mention of climate-related topics.       \"A movie a day is not enough\"  "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "How climate change is intensifying hurricanes",
            "author": "Grist",
            "url": "https://article.wn.com/view/2025/07/07/How_climate_change_is_intensifying_hurricanes",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather seems to make the headlines almost every week. Human-caused climate change is making some disasters more dangerous and more frequent, according to scientific research. We would have had zero Category 5 storms without human-causes climate change, according the IPCC."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "Explained: What's contributing to record-breaking heat in Kashmir",
            "author": "NDTV",
            "url": "https://article.wn.com/view/2025/07/07/Explained_Whats_contributing_to_recordbreaking_heat_in_Kashm",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In the Kashmir region, all crops are sensitive to a rise in temperatures. Maize, saffron and apple crops are especially sensitive to the rise in the temperature. The temperature is expected to rise in Kashmir region in the next few days.   "
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "As heatwaves intensify, Morocco ups effort to warn residents",
            "author": "Abdel Majid BZIOUAT",
            "url": "https://www.dailygazette.com/news/national/as-heatwaves-intensify-morocco-ups-effort-to-warn-residents/article_3d703661-9cd0-5a9a-a9ec-c6c9a59a0a67.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/8/54/8546fc07-bb64-509d-a559-6afde1b55d92/686c8dc8e11b5.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Lhoussaine Youabd is a meteorological engineer at the national weather service in Morocco. He goes on the media every time a weather alert is issued to warn Moroccans of growing climate-related risks. He knows nearly all the languages spoken in the country."
        },
        {
            "published_date": "2025-07-07T00:00:00",
            "title": "It's going to get worse",
            "author": "Kevin Crupi",
            "url": "https://www.miningjournal.net/opinion/letters-to-the-editor/2025/07/its-going-to-get-worse",
            "url_media": "https://d14e0irai0gcaa.cloudfront.net/www.miningjournal.net/images/2016/11/15192946/fblike.jpg",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather events are becoming more common due to the global warming/climate change. The Intergovernmental Panel on Climate Change has conclusively determined that human activity (burning fossil fuels, deforestation and land use changes) is the cause of these increasing concentrations of greenhouse gases. The Inflation Reduction Act was passed in 2022 to help reduce America's greenhouse gas emissions 40% by 2030. The IRA provided incentives to use more clean energy and invest in green technology to boost manufacturing."
        }
    ]
}