{
    "status": "ok",
    "total_articles": 226,
    "articles": [
        {
            "published_date": "2025-07-10T23:52:25",
            "title": "Re-evaluating America's Response to Extreme Weather",
            "author": "",
            "url": "https://www.archyde.com/re-evaluating-americas-response-to-extreme-weather",
            "url_media": "https://dims.apnews.com/dims4/default/4495ca3/2147483647/strip/true/crop/3279x1844+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F8f%2F52d5bb72f055727a25d64b21631c%2F02da301c0e9f46a18f25e4b2bf87bafe",
            "country": "US",
            "language": "en",
            "summary": "There are mass layoffs and planned cuts at government agencies responsible for climate study and disaster management. Experts warn that the loss of experienced and learned personnel from these institutions could take years to recover from, leaving the country less equipped to handle the growing challenges posed by a changing climate."
        },
        {
            "published_date": "2025-07-10T23:15:19",
            "title": "How ‘alert fatigue' impacts communities during natural disasters",
            "author": "Gustaf Kilander",
            "url": "https://www.independent.co.uk/bulletin/news/texas-floods-victims-alert-fatigue-b2786878.html",
            "url_media": "https://static.independent.co.uk/2025/07/10/19/49/SEI258574918.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "At least 121 people have died and over 170 are missing after the Guadalupe River overflowed in central Texas. Many people did not receive emergency warnings due to a lack of mobile phone service, silenced notifications, or not having their devices present. FCC is developing improvements like muted alerts for less severe situations, but these changes are not anticipated until 2028."
        },
        {
            "published_date": "2025-07-10T23:06:13",
            "title": "UK weather: Is this heat 'just summer'?",
            "author": "Sarah Keith-Lucas",
            "url": "https://www.bbc.com/weather/articles/cwyrw66jkkko",
            "url_media": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/cc05/live/fe790540-5cb7-11f0-ae37-a7df7603ca40.jpg",
            "country": "GB",
            "language": "en",
            "summary": "2025 is already shaping up to be an extraordinary year for weather records in parts of the UK. The first half of summer has followed hot on the heels of spring, with UK temperatures since the start of June also reaching record highs in some areas. The highest temperature of the year so far was recorded on 1 July, when 35.8C was measured in Faversham, Kent. Global temperatures have risen by over 1.3 Celsius since the industrial revolution."
        },
        {
            "published_date": "2025-07-10T23:00:38",
            "title": "Letters: Only the GOP denies humanity's effect on climate change",
            "author": "Letters To The Editor",
            "url": "https://www.mercurynews.com/2025/07/10/letters-gop-denies-humanitys-effect-climate",
            "url_media": "https://www.mercurynews.com/wp-content/uploads/2025/07/Texas_Flooding_95922.jpg?w=1024&h=632",
            "country": "US",
            "language": "en",
            "summary": "GOP alone denies man-made climate change. It's important to keep NIH and NSF funding to reap training benefits for students. The future will tell the truth about Donald Trump. Santa Clara County should change its charter to prevent people over 75 from running for elected office."
        },
        {
            "published_date": "2025-07-10T22:46:37",
            "title": "As L.A. bakes, duration of heat waves is accelerating faster than climate change, UCLA study shows",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/07/as-l-a-bakes-duration-of-heat-waves-is-accelerating-faster-than-climate-change-ucla-study-shows-los-angeles-times-2",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": " the duration of heat waves is accelerating faster than climate change, according to a UCLA study.    in Los Angeles Times.  in the study. In the study, the study found that the study was based on the data from the data of the data. "
        },
        {
            "published_date": "2025-07-10T22:45:11",
            "title": "As SoCal bakes, UCLA study shows duration of heat waves is accelerating faster than climate change",
            "author": "Clara Harter",
            "url": "https://www.latimes.com/california/story/2025-07-10/ucla-study-heat-wave-duration-faster-than-global-warming",
            "url_media": "https://ca-times.brightspotcdn.com/dims4/default/b580b0f/2147483647/strip/true/crop/3852x2022+0+252/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2Fb7%2F530ba3d846f9b6e8161cbfc35a81%2F1193284-me-sept-heat-wave-3-gmf.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are getting hotter and the duration of heat waves is increasing faster than global warming. Longer heat waves will dry out vegetation and increase the danger of wildfires in Southern California. They pose a serious threat to farming, as many crops will die at sustained high temperatures. This pattern will become more common around the globe, especially in tropical regions close to the equator."
        },
        {
            "published_date": "2025-07-10T22:39:15",
            "title": "How climate change is affecting prized tea-growing regions in China and Taiwan",
            "author": "",
            "url": "https://www.mainepublic.org/npr-news/2025-07-10/how-climate-change-is-affecting-prized-tea-growing-regions-in-china-and-taiwan",
            "url_media": "https://www.mainepublic.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "Bangor Studio/Membership Department63 Texas Ave. Bangor, ME 04401, Lewiston Studio1450 Lisbon St. Lewiston, ME 04240, Portland Studio323 Marginal Way Portland, ME 014101, and On Air Now Playing Maine Public Classical are located in Maine."
        },
        {
            "published_date": "2025-07-10T21:49:08",
            "title": "Japan weather bureau says 40% chance of La Nina in autumn",
            "author": "",
            "url": "https://japantoday.com/category/national/japan-weather-bureau-says-40-chance-of-la-nina-emerging-in-autumn",
            "url_media": "https://japantoday.com/images/japan-today-social.jpg",
            "country": "JP",
            "language": "en",
            "summary": "Japan's weather bureau says there is a 40% chance of the La Nina phenomenon emerging in the Northern Hemisphere autumn. There is a greater, 60% chance that normal weather patterns will continue. La Nina weather event is characterized by unusually cold ocean temperatures in the equatorial Pacific Ocean region."
        },
        {
            "published_date": "2025-07-10T21:40:05",
            "title": "Bernard Hickey, Peter Bale, Cathrine Dyer, Jonathan Boston & Wolfgang Rack ‘Hoon' around the news of the week to July 11",
            "author": "Peter Bale",
            "url": "https://thekaka.substack.com/p/bernard-hickey-peter-bale-cathrine-fb5",
            "url_media": "https://substackcdn.com/image/fetch/$s_!4Lgw!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F06da702c-f02f-423c-a618-98e7b581ea16_1048x530.heic",
            "country": "US",
            "language": "en",
            "summary": "Bernard Hickey, Peter Bale and Cathrine Dyer talk about the week's news in geopolitics and climate with special guests Professor Jonathan Boston from Victoria University of Wellington and Professor Wolfgang Rack from University of Canterbury. The Hoon won the silver award for best current affairs podcast in this year's New Zealand Podcast awards."
        },
        {
            "published_date": "2025-07-10T21:18:56",
            "title": "FAO and the Government of Saint Lucia launch USD $16.7 Million FISH-ADAPT Project to Strengthen Climate Resilience in the Fisheries Sector",
            "author": "",
            "url": "https://www.sknvibes.com/news/newsdetails.cfm/126202",
            "url_media": "https://www.sknvibes.com/news/gfxz/image/FAO5.png",
            "country": "KN",
            "language": "en",
            "summary": "The FISH-ADAPT Project aims to transform Saint Lucia's fisheries sector by making fishing safer and more productive despite a changing climate. The project is funded by the Green Climate Fund (GCF) with a contribution of USD 14.75 million and co-financed by the Ministry of Agriculture (USD 307,250) and Ministry of Finance (USD 1.66 million). Over its five-year implementation period, it will target approximately 75,000 beneficiaries, including 13,000 direct and 62,000 indirect participants. Direct beneficiaries include marine fishers, sea-moss farmers, fish vendors and processors, inland aquaculture farmers and their families."
        },
        {
            "published_date": "2025-07-10T21:14:40",
            "title": "CNN polling guru surprised majority of Americans 'aren't afraid' of climate change",
            "author": "Rachel del Guidice",
            "url": "https://www.msn.com/en-us/weather/topstories/cnn-polling-guru-surprised-majority-of-americans-aren-t-afraid-of-climate-change/ar-AA1ImM06",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Harry Enten, CNN's chief data analyst, was surprised that most Americans aren't afraid of climate change. According to the network's data, 35% of Americans were \"greatly worried\" about climate change in 1989. In 2000, the number jumped five percentage points to 40%. In 2025, the percentage dropped again to 40%, the same as in 2000."
        },
        {
            "published_date": "2025-07-10T21:13:40",
            "title": "Atlantic Blue Stain: A Deciphered Enigma",
            "author": "",
            "url": "https://www.archyde.com/atlantic-blue-stain-a-deciphered-enigma",
            "url_media": "https://www.pieuvre.ca/wp-content/uploads/2025/07/rechauffement-blueBlob-2015_NASA_NOAA.jpg",
            "country": "US",
            "language": "en",
            "summary": "Mysterious Atlantic 'Cold Blob' has defied the planet-wide rise in sea surface temperatures observed over the past century. Greenland Melt and Shifting Air Currents Identified as Key Drivers. Atlantic Meridional Overturning Circulation (Amoc) is a vital system of ocean currents responsible for transporting warm, salty water from the tropics northward. California-based researchers have confirmed a slowdown in the Amoc between 1900 and 2005. Melting Greenland ice disrupts the balance of salinity and density that drives Amoc's circulation. The weakening Amoc has a cascading effect on atmospheric conditions, leading to drier and colder air patterns over the North Atlantic. This ampl"
        },
        {
            "published_date": "2025-07-10T21:11:16",
            "title": "Why are so many Irish people moving to Australia?",
            "author": "Natascha Rivera",
            "url": "https://euroweeklynews.com/2025/07/10/why-are-so-many-irish-people-moving-to-australia",
            "url_media": "https://cdn.euroweeklynews.com/wp-content/uploads/2025/07/dan-freeman-7Zb7kUyQg1E-unsplash-scaled.jpg",
            "country": "ES",
            "language": "en",
            "summary": "There are over 100,000 Irish-born citizens living in Australia. The main motivation for emigrating to Australia is economic. There has been a significant Irish presence in Australia since the arrival of The First Fleet in 1788 and the beginning of the European colonisation of the land. The Australian lifestyle is relaxed and laid back."
        },
        {
            "published_date": "2025-07-10T20:02:22",
            "title": "UN warns extreme heat poses severe risks for older populations",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/extreme-heat-put-older-people-high-risk-warns-un-390",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "The Frontiers 2025 Report warns of increased health risks for older people as a result of climate change. The report is released as communities across China, Japan, India, Europe, the US and elsewhere face weeks of extreme heat and flooding. The annual heat-related deaths among older people have risen by an estimated 85 per cent since the 1990s."
        },
        {
            "published_date": "2025-07-10T19:54:42",
            "title": "Councillor calls man-made global warming a 'hoax'",
            "author": "Hugh Casswell",
            "url": "https://au.news.yahoo.com/councillor-calls-man-made-global-195442918.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Y4sn5yX9xKwnzp7GHPqKEA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/bbc_us_articles_995/d85a2cdcf2710f7e29af546fd537dcc7",
            "country": "US",
            "language": "en",
            "summary": "Bert Bingham, a councillor for Transport and Environment at Nottinghamshire County Council, made the comments during a public meeting on Thursday. He was speaking during a debate on a motion tabled by Labour councillors which called for the authority to recommit to becoming carbon neutral by 2030. Council leader Mick Barton is happy for Bingham to continue in his cabinet role."
        },
        {
            "published_date": "2025-07-10T19:54:38",
            "title": "Reform UK councillor calls man-made global warming a 'hoax'",
            "author": "Hugh Casswell",
            "url": "https://www.bbc.com/news/articles/c0j458q00e2o",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/24f1/live/5d8df410-5dc5-11f0-8328-5fcabfbdb3e1.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Bert Bingham, a councillor for Transport and Environment at Nottinghamshire County Council, made the comments during a public meeting on Thursday. He was speaking during a debate on a motion tabled by Labour councillors calling for the authority to recommit to becoming carbon neutral by 2030. Council leader Mick Barton is happy for Bingham to continue in his cabinet role."
        },
        {
            "published_date": "2025-07-10T19:46:31",
            "title": "Extreme heat could lead to 30,000 deaths a year in England and Wales by 2070s, ...",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/10/Extreme_heat_could_lead_to_30000_deaths_a_year_in_England_an_b",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "Worst-case scenario of 4.3C of warming could result in fiftyfold rise in heat-related deaths, researchers say. More than 30,000 people a year in England and Wales could die from heat- related causes by the 2070s, according to a new report."
        },
        {
            "published_date": "2025-07-10T19:46:18",
            "title": "Europe Faces Earlier Stronger Heatwaves Due to Climate Change",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/europe-facing-earlier-stronger-heatwaves-climate-scientist-149",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "Europe is experiencing earlier and more intense heatwaves due to climate change, according to Julien Nicolas, senior scientist at the EU-funded Copernicus Climate Change Service. June was a record-hot June in Western Europe, with average temperatures 2.81 degrees above the 1991-2020 norm. Mediterranean Sea remains a climate change hotspot, with a more rapid and persistent warming trend."
        },
        {
            "published_date": "2025-07-10T19:46:00",
            "title": "Vermont updates its Climate Action Plan",
            "author": "Keith Whitcomb",
            "url": "https://www.rutlandherald.com/news/local/vermont-updates-its-climate-action-plan/article_7042303c-0fbe-4ca3-b396-146950e46f33.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/rutlandherald.com/content/tncms/custom/image/21fa4cf2-cde4-11eb-949b-3b99a2a8f984.jpg?resize=600%2C600",
            "country": "US",
            "language": "en",
            "summary": "The Climate Action Plan, adopted four years ago, was updated July 1. After two years of historic floods and a radically changed political landscape, Vermont's plan for a changing climate has received its first update.       .   in Vermont."
        },
        {
            "published_date": "2025-07-10T19:36:10",
            "title": "Fingerprints of change",
            "author": "MDGluon16",
            "url": "https://www.dailykos.com/stories/2025/7/10/2322559/-Fingerprints-of-change",
            "url_media": "https://cdn.prod.dailykos.com/images/1431365/story_image/InstaTheWhaleClimateCrisis.png?1746898212",
            "country": "US",
            "language": "en",
            "summary": "There was a catastrophic flooding in Central Texas on the Fourth of July, which killed 95 people, 27 of whom were girls and counselors at a Christian summer camp. The recent flood has the fingerprint of climate change, human caused climate change. People should prepare for the climate change and decouple from oil, coal, gas as much as possible."
        },
        {
            "published_date": "2025-07-10T19:33:09",
            "title": "U.S. faces more frequent extreme weather events, but attitudes, actions aren't keeping up",
            "author": "Wire Service",
            "url": "https://www.dallasnews.com/news/weather/2025/07/10/us-faces-more-frequent-extreme-weather-events-but-attitudes-actions-arent-keeping-up",
            "url_media": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/HRCX5KW6S5DMPBHTBVKMIMFQJM.jpg?auth=a01e21a47e1e38cdaacc307d36a6e3ba0bf39cbd642488ee053b1dd77439e391&quality=80&width=1200&height=630&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Climate change is making extreme weather events more frequent and intense, according to climate scientists and government data. The 10-year summer average of the National Oceanic and Atmospheric Administration's climate extreme index is 58% higher than it was in the 1980s. People need to shift how they think about disasters, even if they don't live in the most disaster-prone locations."
        },
        {
            "published_date": "2025-07-10T19:30:43",
            "title": "Groundbreaking discovery reveals Southern Ocean's circulation has reversed",
            "author": "capeetc",
            "url": "https://www.capetownetc.com/world/groundbreaking-discovery-reveals-southern-oceans-circulation-has-reversed",
            "url_media": "https://www.capetownetc.com/wp-content/uploads/2024/07/image-1280x720-56.png",
            "country": "ZA",
            "language": "en",
            "summary": "For the first time in recorded history, researchers have identified a reversal in ocean circulation within the Southern Ocean. Since 2016, the region between the polar and sub-polar gyres of the Antarctic Ocean has experienced a sustained increase in surface salinity. Since 2015, Antarctica has lost an area of sea ice equivalent to Greenland."
        },
        {
            "published_date": "2025-07-10T19:26:41",
            "title": "Climate change: We're running out of time, Akume warns",
            "author": "Oluyemi Ogunseyin",
            "url": "https://guardian.ng/news/climate-change-were-running-out-of-time-akume-warns",
            "url_media": "https://guardian.ng/wp-content/themes/guardian_ng/assets/build/images/favicon/apple-touch-icon.png",
            "country": "NG",
            "language": "en",
            "summary": "The Secretary to the Government of the Federation (SGF) has warned that the country is running out of time due to climate change. He made the remarks yesterday in Abuja during a high-level stakeholder and policy engagement visit on Climate Change, Sustainable Land Use, and Agriculture organized by ACCARD and African Climate Foundation."
        },
        {
            "published_date": "2025-07-10T19:17:44",
            "title": "'Big Beautiful Bill' supercharges Coast Guard's Arctic icebreaker fleet",
            "author": "Trevor Hughes",
            "url": "https://www.msn.com/en-us/news/world/big-beautiful-bill-supercharges-coast-guard-s-arctic-icebreaker-fleet/ar-AA1IkjN8",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "New federal spending law includes funding for 17 icebreakers, 21 cutters, more than 40 helicopters and six large patrol airplanes. It could take as long as 15 years to get the first of the large ships commissioned. The Coast Guard currently has one heavy icebreaker, the USCGC Polar Star, almost 20 years beyond its expected service life."
        },
        {
            "published_date": "2025-07-10T19:15:42",
            "title": "Chantal flooding shows NC still has much to learn from Helene tragedy",
            "author": "Alex Nettles",
            "url": "https://www.newsobserver.com/opinion/article310296285.html",
            "url_media": "https://www.newsobserver.com/latest-news/w48khz/picture310372825/alternates/LANDSCAPE_1140/RAL_20250803-DURHAM-CHANTAL-FLOODINGE-TEL-19.JPG",
            "country": "US",
            "language": "en",
            "summary": "Tropical Depression Chantal caused flooding in inland parts of North Carolina last weekend. Residents died, homes were destroyed and storefronts are waterlogged. The same factors that caused Hurricane Helene likely caused the flooding. North Carolina needs to do more to fight climate change. The state passed a bill delaying the goal of reducing carbon dioxide output by 70% by 2030."
        },
        {
            "published_date": "2025-07-10T19:09:00",
            "title": "Ambassadors urge focused global action to combat climate change",
            "author": "Uniindia News Service",
            "url": "https://uniindia.com/~/ambassadors-urge-focused-global-action-to-combat-climate-change/States/news/3512154.html",
            "url_media": "http://www.uniindia.com/cms/gall_content/LargePhoto//2025/7/2025_7$LargePhoto10_Jul_2025_10072025181619.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Ambassadors and diplomats from eight countries are in Bhubaneswar for the inaugural session of the two-day international conclave on 'Climate Change and Global Warming—Issues and Prospects' organized by SOA Deemed to be University here. They are Alberto Guani (Uruguay), Javier Paulinich (Peru), Fernando Bucheli (Ecuador), Omar Castaneda Solares (Guatemala), Antonio Bartoli (Italy), Lalatiana Accouche (Seychelles), and Kayshav Tewari from the High Commission of Guyana are among them."
        },
        {
            "published_date": "2025-07-10T19:00:00",
            "title": "Nuclear is off the table. But we should be paying more for our energy",
            "author": "Millie Muroi",
            "url": "https://www.smh.com.au/business/the-economy/nuclear-is-off-the-table-but-we-should-be-paying-more-for-our-energy-20250710-p5mdye.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.261%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_91%2C$y_60/t_crop_custom/q_62%2Cf_auto/adce66773476113147331649556eaba3e8d02c80",
            "country": "AU",
            "language": "en",
            "summary": "Sims argues that it's a myth to say no one else is trying or that we're all lacking in ambition on climate change. He points out that China is building coal-fired and nuclear electricity generation facilities, but 80% of China's new electricity-generating capacity last year was solar and wind-powered. The European Union has introduced a price on carbon. Australia is the biggest supplier of coal and gas combined in the world, but its contribution to emission is more than three times higher. Australia has a chance to step up as a maker and exporter of goods such as iron and steel. The Liberal Party's defeat was a sign the political appetite is just not there for"
        },
        {
            "published_date": "2025-07-10T19:00:00",
            "title": "We should be paying more for our energy. Here's why",
            "author": "Millie Muroi",
            "url": "https://www.smh.com.au/business/the-economy/nuclear-is-off-the-table-but-we-should-be-paying-more-for-our-energy-20250710-p5mdye.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.261%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_91%2C$y_60/t_crop_custom/q_62%2Cf_auto/adce66773476113147331649556eaba3e8d02c80",
            "country": "AU",
            "language": "en",
            "summary": "Sims argues that it's a myth to say no one else is trying or that we're all lacking in ambition. China is building huge electricity generation facilities. 80% of China's new electricity-generating capacity last year was solar and wind-powered. The European Union has introduced a price on carbon. Australia is the biggest supplier of coal and gas combined in the world, but its contribution to emission is more than three times higher. Australia has a chance to step up as a maker and exporter of goods such as iron and steel. Most of Australia's iron ore is shipped to north-east Asia. It's expensive to export green hydrogen."
        },
        {
            "published_date": "2025-07-10T18:56:30",
            "title": "Is Earth's rotation speeding up? Why these 3 summer days may be shorter than usual",
            "author": "Eric Lagatta",
            "url": "https://www.yahoo.com/news/earths-rotation-speeding-why-3-185630719.html",
            "url_media": "https://media.zenfs.com/en/the-providence-journal/83a92aa10322ebac64fae6c11a9b197c",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation is speeding up and shortening the length of days this summer. On Wednesday, July 9, Earth spun a bit faster than usual. On July 22 and Aug. 5, the next two shortened days will be even more truncated. On these days, the moon will be at its furthest from the Earth's equator, changing its gravitational pull and causing the planet to spin a little bit faster."
        },
        {
            "published_date": "2025-07-10T18:39:15",
            "title": "How climate change is affecting prized tea-growing regions in China and Taiwan",
            "author": "",
            "url": "https://www.delawarepublic.org/npr-headlines/2025-07-10/how-climate-change-is-affecting-prized-tea-growing-regions-in-china-and-taiwan",
            "url_media": "https://www.delawarepublic.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "Changing weather patterns and higher temperatures are affecting some of the most prized tea-growing regions in China and Taiwan, affecting the production of tea.    .  Â      - 2025 NPR Facebook, Twitter, LinkedIn, and email."
        },
        {
            "published_date": "2025-07-10T18:37:27",
            "title": "Climate Crisis: A Mirror to Our Inner State",
            "author": "Acharya Prashant",
            "url": "https://www.dailypioneer.com/2025/columnists/climate-crisis--a-mirror-to-our-inner-state.html",
            "url_media": "https://www.dailypioneer.com/uploads/2025/story/images/big/climate-crisis--a-mirror-to-our-inner-state-2025-07-11.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In 2024, global temperatures reached the highest levels ever observed. Carbon dioxide in the atmosphere has climbed past 420 ppm. Sea levels are rising as glaciers and ice sheets melt. Antarctica is losing ice at a rapid pace. Glaciers worldwide have lost around 9,000 Gigatons of ice since 1975."
        },
        {
            "published_date": "2025-07-10T18:25:05",
            "title": "'Drunk' seagulls in Cornwall as Flying Ant Day arrives",
            "author": "Shannon Brown Reporter",
            "url": "https://www.cornwalllive.com/news/cornwall-news/drunk-seagulls-cornwall-flying-ant-10336837",
            "url_media": "https://i2-prod.plymouthherald.co.uk/incoming/article10336846.ece/ALTERNATES/s1200/0_IMG_7633.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Flying Ant Day has arrived in parts of Cornwall and thousands of ants have emerged to swarm in a mating ritual known as the 'nuptial flight'. Escaping them becomes impossible as they leave their nests to mate. Seagulls are known to feast on these ants."
        },
        {
            "published_date": "2025-07-10T18:23:00",
            "title": "Letter: Man-made climate change, like evolution, is just a lot of worthless fluff",
            "author": "",
            "url": "https://www.echopress.com/opinion/letters/letter-man-made-climate-change-like-evolution-is-just-a-lot-of-worthless-fluff",
            "url_media": "https://cdn.forumcomm.com/dims4/default/6f6f19f/2147483647/strip/true/crop/1200x800+0+0/resize/1599x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fc3%2F00%2F79110117451e8a1c248610b4f5a4%2Fep-letters.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2010, Sierra Club shut down 160 coal plants, but there was no change in CO2 levels. The whole 'net zero carbon' movement is just another scam for picking the pockets of taxpayers and ratepayers. Xcel's website explains how man's atmospheric gases can jerk the global climate system around."
        },
        {
            "published_date": "2025-07-10T18:20:33",
            "title": "Faster Earth Rotation on Three Summer Days Could Shift How We Track Time",
            "author": "Abdul Moeed",
            "url": "https://greekreporter.com/2025/07/10/earth-rotation-faster-three-summer-days",
            "url_media": "https://greekreporter.com/wp-content/uploads/2025/07/experts-confirm-the-world-spins-faster-for-3-days-straight-credit-nasa-cc-by-nc-20.jpg",
            "country": "GR",
            "language": "en",
            "summary": "The world is spinning faster for 3 days this summer. Earth completed its rotation slightly quicker on July 9, and is expected to do so again on July 22 and August 5. On these days, the Earth's rotation is forecast to shorten each day by just over one millisecond. Modern timekeeping depends on atomic clocks, which measure time down to a nanosecond."
        },
        {
            "published_date": "2025-07-10T18:00:49",
            "title": "Heatwaves could cause 34,000 deaths per YEAR in the UK by 2070, scientists predict – 50 times higher than previously thought",
            "author": "XANTHA LEATHAM",
            "url": "https://www.dailymail.co.uk/sciencetech/article-14893247/Heatwaves-deaths-YEAR-UK-scientists-warming.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/07/10/12/99538563-0-Scientists_say_that_climate_change_is_to_blame_for_the_UK_s_heat-a-35_1752148790508.jpg",
            "country": "GB",
            "language": "en",
            "summary": "In a worst-case scenario, there could be 34,000 annual heat-related deaths in England and Wales by 2070. This is 50 times higher than today's baseline of 634 annual deaths. Even under the most optimistic scenario, the number of deaths will increase up to six times. The population is expected to age significantly over the next 50 years, with the greatest increase for those aged 65 and above."
        },
        {
            "published_date": "2025-07-10T18:00:44",
            "title": "Extreme heat could lead to 30,000 deaths a year in England and Wales by 2070s, say scientists",
            "author": "Anna Bawden",
            "url": "https://www.theguardian.com/environment/2025/jul/10/extreme-heat-death-rate-england-wales-by-2070-climate-change",
            "url_media": "https://i.guim.co.uk/img/media/322840e5f44735ca8b3d00109fc51732e4460d25/563_0_2689_2151/master/2689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5f568876cab55af2130d46daef72809",
            "country": "GB",
            "language": "en",
            "summary": "There were 634 heat-related deaths in England and Wales between 1981 and 2021. In the worst-case scenario of 4.3C of warming by the end of the century, the number of heat deaths will increase 16 times in the 2050s and exceed 34,000 by the 2070s. Older people are more vulnerable in hot weather and they will be exposed to dangerous levels of heat by 2050."
        },
        {
            "published_date": "2025-07-10T18:00:00",
            "title": "Heat deaths could rise up to 50-fold by 2070s due to climate change",
            "author": "Emily Beament",
            "url": "https://www.independent.co.uk/climate-change/news/england-wales-london-university-college-london-issues-b2786729.html",
            "url_media": "https://static.independent.co.uk/2025/07/10/19/77b1be0de9e7ead9d933cbbeb77827d9Y29udGVudHNlYXJjaGFwaSwxNzUyMjMyMDc1-2.68264505.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Heat-related deaths in England and Wales could rise up to 50-fold in the next 50 years as a result of climate change, according to a new study by scientists at University College London and The London School of Hygiene and Tropical Medicine. Experts are calling for efforts to adapt homes and cities to the threat of extreme heat, with measures ranging from green roofs and shady urban forests to better building ventilation and air conditioning."
        },
        {
            "published_date": "2025-07-10T18:00:00",
            "title": "Weekend wine guide: Cyclone Gabrielle's lasting impact on Hawke's Bay 2023 chardonnays",
            "author": "Michael Cooper",
            "url": "https://www.nzherald.co.nz/the-listener/life/weekend-wine-guide-cyclone-gabrielles-lasting-impact-on-hawkes-bay-2023-chardonnays/GENMPXNQMJBRVNDEVAPEXSZXFM",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/I6YKKRGFTRBSVBWJL3477BAEIA.png?auth=7c2029bc454b94c1d85c209daedd8f82ba7931563d7926ad9edf42939d0e146b&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "Tropical Cyclone Gabrielle devastated the North Island from February 12-16, 2023. In Hawke's Bay, the cyclone destroyed about 25% of the harvest. 2023 was predicted to yield aromatic wines with fresh acidity and moderate alcohol levels."
        },
        {
            "published_date": "2025-07-10T18:00:00",
            "title": "UK heat deaths to rise 500% by 2050 - in best-case scenario",
            "author": "Tom Bawden",
            "url": "https://inews.co.uk/news/uk-heat-deaths-to-rise-500-by-2050-in-best-case-scenario-3798858",
            "url_media": "https://inews.co.uk/wp-content/uploads/2025/07/SEI_257505536_c6e676.jpg?w=1200&h=675&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "Heat-related deaths in England and Wales are forecast to rise from 634 a year to at least 3,007 in the next three decades. Rising temperatures will be the main driver of heat deaths over the next 50 years, but an ageing population and changing climate will also play a role."
        },
        {
            "published_date": "2025-07-10T17:39:24",
            "title": "Global climate troublemaker La Niña may arrive later in 2025",
            "author": "Doyle Rice",
            "url": "https://www.yahoo.com/news/global-climate-troublemaker-la-ni-173924614.html",
            "url_media": "https://media.zenfs.com/en/usa_today_news_641/7d5c4dd2d9529538097b6772ebbe3ec0",
            "country": "US",
            "language": "en",
            "summary": "Early signs of a possible La Niña fall and winter are emerging in some climate models, federal forecasters announced July 10. Japan's weather bureau announced there is a 40% chance of La Niña emerging in the fall. La Niño is a natural climate pattern marked by cooler-than-average seawater in the central and eastern Pacific Ocean. It's the opposite of El Niño, which occurs when Pacific Ocean water is at least 0.9 degree warmer than average for three months."
        },
        {
            "published_date": "2025-07-10T17:38:24",
            "title": "Al Jazeera Hypes False Climate Change Link In Southern European Heatwaves",
            "author": "Linnea Lueken",
            "url": "https://climatechangedispatch.com/southern-europe-heatwaves-climate-change",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/07/al-jazeera-headline.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a recent heatwave in parts of southern Europe. Al Jazeera claims that climate change is making heatwaves more intense. The urban heat island (UHI) effect is a major contributor, but Al Jazeera downplays its role in recent trends and the evidence concerning temperature-related deaths. The Lancet study found that deaths due to cold outnumber heat deaths by ten to one."
        },
        {
            "published_date": "2025-07-10T17:34:37",
            "title": "NDMA issues alert of rain, wind, storm in various parts of the country",
            "author": "",
            "url": "https://www.radio.gov.pk/10-07-2025/ndma-issues-alert-of-rain-wind-storm-in-various-parts",
            "url_media": "https://newsimage.radio.gov.pk/20250710/12225157521752168745.jpg",
            "country": "PK",
            "language": "en",
            "summary": "NDMA issues an alert of rain, wind, storm and Glacial Lake Outburst Flood in Northern Areas of the country for the next twelve hours. A significant increase in temperature has been observed in northern regions of Pakistan, particularly in Gilgit Baltistan and upper Khyber Pakhtunkhwa. The areas that require vigilant attention are the Ghujerab River and Shimshal River at Hunza, Braldu River at Shigar, Husher and Saltaro rivers at Ghancha, and Uzhnu Gol in Chitral."
        },
        {
            "published_date": "2025-07-10T17:33:03",
            "title": "Warmer seas could bring more sharks to popular beaches",
            "author": "",
            "url": "https://www.perthnow.com.au/news/animals/warmer-seas-could-bring-more-sharks-to-popular-beaches-c-19318151",
            "url_media": "https://images.perthnow.com.au/publication/C-19318151/9cc2804fae8c176073d9037466f593fbc8c75ffb-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Sharks are spending longer than ever off the coast of popular Australian beaches due to warmer water temperatures caused by climate change. Last month, a 16-year-old surfer was bitten by a bull shark at northern NSW's Cabarita Beach. NSW installs shark nets at 51 beaches each summer to protect swimmers and surfers."
        },
        {
            "published_date": "2025-07-10T17:30:22",
            "title": "Warmer seas could bring more sharks to popular beaches",
            "author": "Alex Mitchell",
            "url": "https://www.newcastleherald.com.au/story/9013501/warmer-seas-could-bring-more-sharks-to-popular-beaches",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/3670a056-57d4-4312-82bf-da8df1635789.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Sharks are spending longer than ever off the coast of popular Australian beaches, increasing the risk of interactions between the apex predators and humans. Last month, a 16-year-old surfer survived a bull shark bite at northern NSW's Cabarita Beach. James Cook University experts warned the rising water temperatures in NSW have increased the potential for human-shark encounters."
        },
        {
            "published_date": "2025-07-10T17:30:22",
            "title": "Warmer seas could bring more sharks to popular beaches",
            "author": "Alex Mitchell",
            "url": "https://www.theleader.com.au/story/9013501/warmer-seas-could-bring-more-sharks-to-popular-beaches",
            "url_media": "https://www.theleader.com.au/images/transform/v1/crop/frm/silverstone-feed-data/3670a056-57d4-4312-82bf-da8df1635789.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Sharks are spending longer off the coast of some popular Australian beaches increasing the risk of interactions between the apex predators and humans, as reported by the Australian Marine Resources Council.       .   \"Shark infestations are on the increase. "
        },
        {
            "published_date": "2025-07-10T17:30:00",
            "title": "How unpredictable weather conditions are leading to dangerous fishing conditions and an increase in price at the local fish markets",
            "author": "Fred Hooper",
            "url": "https://www.abc.net.au:443/pacific/programs/pacific-prepared/pacific-prepared/105499008",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/f05e0412cbb85f1e30d71204e0f94b4c?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Pacific Prepared is produced by ABC International Development with funding from the Australian Department of Foreign Affairs and Trade. In this edition, Pacific Prepared talks about a Fijian village flooded by rising rivers, coastal villages in Papua New Guinea and fish market traders in Samoa."
        },
        {
            "published_date": "2025-07-10T17:30:00",
            "title": "Extreme UV Radiation in Mérida: High Risk of Skin Cancer from Unprotected Sun Exposure",
            "author": "Yucatan Times",
            "url": "https://theyucatantimes.com/2025/07/extreme-uv-radiation-in-merida-high-risk-of-skin-cancer-from-unprotected-sun-exposure",
            "url_media": "https://theyucatantimes.com/wp-content/uploads/2023/04/sun-setting-sun-sunset-water-68768.webp",
            "country": "MX",
            "language": "en",
            "summary": "Extreme temperatures in Mérida raise UV radiation to dangerous levels. Lack of sun protection increases the risk of skin diseases and skin cancer among the population. It's vital to apply broad-spectrum sunscreen, preferably water-resistant and long-lasting, and to be alert for signs such as new spots or abnormal moles."
        },
        {
            "published_date": "2025-07-10T17:05:41",
            "title": "Paddy-cum-crab farming boosts Assam women farmers' mission to check climate impact",
            "author": "Sumir Karmakar",
            "url": "https://www.deccanherald.com/india/assam/paddy-cum-crab-farming-boosts-assam-women-farmers-mission-to-check-climate-impact-3624849",
            "url_media": "https://media.assettype.com/deccanherald%2F2025-07-10%2Fwy7qkfo2%2FWOMEN-FARMERS-ASSAM.jpg?rect=0%2C0%2C8064%2C4234&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "A group of women farmers in North Assam's flood-prone Lakhimpur district have taken to crab-cum-local paddy cultivation. The farmers are called Krishi Sakhis. They live in the area's coastal areas. They are known for their local delicacies."
        },
        {
            "published_date": "2025-07-10T16:45:20",
            "title": "OPINION - Climate change-driven heatwaves caused 263 deaths in London ...Tech & Science Daily podcast",
            "author": "Rachelle Abbott",
            "url": "https://ca.news.yahoo.com/opinion-climate-change-driven-heatwaves-164520579.html",
            "url_media": "https://media.zenfs.com/en/evening_standard_239/5443329fc48b607e8811f3a1fd0b8e92",
            "country": "US",
            "language": "en",
            "summary": "Summer heatwaves caused 263 deaths in London. Samsung has unveiled a new generation of foldable phones. Linda Yaccarino, the CEO of X, has resigned. Chimpanzees have been observed copying quirky social behaviours from one another. AI surgery could be trialled on humans within a decade."
        },
        {
            "published_date": "2025-07-10T16:39:01",
            "title": "Climate change: We are running out of time, Akume warns",
            "author": "The Nation",
            "url": "https://www.latestnigeriannews.com/p/4372410/climate-change-we-are-running-out-of-time-akume-warns.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "George Akume warns Nigerians against the dangers of climate change. He says the country is running out of time to combat it. The Secretary to the Government of the Federation (SGF), George Akume has warned Nigerians about the dangers. The Nation Newspaper."
        },
        {
            "published_date": "2025-07-10T16:36:52",
            "title": "Earth's Rotation Sped Up on July 9—and We're Not Sure Exactly Why",
            "author": "Alice Gibbs",
            "url": "https://www.msn.com/en-us/news/technology/earth-s-rotation-sped-up-on-july-9-and-we-re-not-sure-exactly-why/ar-AA1Im6jn",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation is speeding up, making some days slightly shorter than the standard 24-hour period. The Moon's gravitational pull and the Earth's rotation isn't perfectly constant, so scientists monitor it using atomic clocks. A negative leap second may be required to keep our clocks in sync with the Sun, which would be a problem for timekeeping systems."
        },
        {
            "published_date": "2025-07-10T16:34:00",
            "title": "Study finds people back climate policies when weather hits home",
            "author": "Gugulethu Mashinini",
            "url": "https://www.timeslive.co.za/news/south-africa/2025-07-10-study-finds-people-back-climate-policies-when-weather-hits-home",
            "url_media": "https://lh3.googleusercontent.com/WApMr9aqC-s-SFhNsYrGB7W6rQO95Gj2y0LiqbtQDPltT7ifzFy8g2pCPbKT1gMsidlyl9gX7Qj1Tv_G83NotXVbTq2WD_Bs_Vc=s1000",
            "country": "ZA",
            "language": "en",
            "summary": "People are more likely to support climate policies when they believe extreme weather events are caused by climate change. The study collected data from 68 countries. It found that support for climate policies was highest for protecting forested and land areas (82%) and increasing the use of sustainable energy (75%). Proposals to raise taxes on carbon-intensive foods and fossil fuels drew the least support."
        },
        {
            "published_date": "2025-07-10T16:31:35",
            "title": "Friday's weather: Cold, wet, windy conditions as cold front hits SA",
            "author": "news24",
            "url": "https://www.news24.com/southafrica/weather/fridays-weather-cold-wet-windy-conditions-as-cold-front-hits-sa-20250710-0991",
            "url_media": "https://news24cobalt.24.co.za/resources/029b-1e342ea2e995-a59a1c1b85da-1000/format/inline/rain_1_.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Damaging winds and waves, cold and rain are forecast for Northern Cape and Western Cape, but it will be fine and cool elsewhere. Yellow level 2 warning: Damaging waves resulting in difficulty in navigation at sea and small vessels at risk of taking on water and capsizing is expected between Hondeklip Bay and Plettenberg Bay until Saturday afternoon. Extremely cold, wet and windy conditions are expected over the southern parts of the Northern Cape, Witzenberg and Breede Valley municipalities, and the Koue Bokkeveld of the Western Cape. Free State: Fine and cool to cold weather will transition to partly cloudy and windsy conditions in the extreme eastern areas. Limpop"
        },
        {
            "published_date": "2025-07-10T16:05:19",
            "title": "Climate Change as a Trigger for Conflict in Somalia: From Drought to Discord",
            "author": "Abdirahman Yusuf",
            "url": "https://wardheernews.com/climate-change-as-a-trigger-for-conflict-in-somalia-from-drought-to-discord",
            "url_media": "https://wardheernews.com/wp-content/uploads/2023/11/Climate-change-extremes-Somalia.jpg",
            "country": "SO",
            "language": "en",
            "summary": "Climate change is a significant driver of conflict and instability in fragile states such as Somalia. Somalia has experienced an increase in temperature of 1-1.5°C since 1991, and it is more than likely to rise by 3-3°C by 2100. Somalia's coping systems are ill-equipped to manage the compounding pressures of climate change and conflict. The future stability of Somalia depends on how decisively and collaboratively we act."
        },
        {
            "published_date": "2025-07-10T16:03:00",
            "title": "LETTER: Land use ads, meetings are important",
            "author": "",
            "url": "https://www.yoursun.com/charlotte/opinion/letters_to_editor/letter-land-use-ads-meetings-are-important/article_925bf66f-1b72-4e15-852a-3abbd090f6b4.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/yoursun.com/content/tncms/custom/image/4d8ebfa6-5831-11ec-a20e-ebb43d093524.jpg",
            "country": "US",
            "language": "en",
            "summary": "The editor suggests his neighbors in Charlotte County to closely examine the public notices in the paper \"Future Land Use Matters\".       .   \"Future land use matters\" is printed under the heading \"Land Use Matters\" in the newspaper. "
        },
        {
            "published_date": "2025-07-10T15:56:06",
            "title": "Climate change: We are running out of time, Akume warns",
            "author": "Faith Yahaya",
            "url": "https://thenationonlineng.net/climate-change-we-are-running-out-of-time-akume-warns",
            "url_media": "https://cdn.thenationonlineng.net/wp-content/uploads/2025/06/28234417/aKUME.png",
            "country": "NG",
            "language": "en",
            "summary": "George Akume, Secretary to the Government of the Federation (SGF), has warned Nigerians about the dangers of climate change. He said the country is running out of time to combat its impact. He reaffirmed President Bola Tinubu's commitment to supporting climate change, safe, healthy food initiatives aimed at resilient living, sustainability, and prosperity for all Nigerian citizens."
        },
        {
            "published_date": "2025-07-10T15:55:15",
            "title": "Unusual summer sip: Central India cools, Himalayas scorch",
            "author": "",
            "url": "https://www.indiatoday.in/diu/story/unusual-summer-sip-central-india-cools-himalayas-scorch-2753912-2025-07-10",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202507/unusual-summer-sip-central-india-cools--himalayas-scorch-100315124-16x9_0.jpeg?VersionId=dSQjpCIY1ngCbOs.v.EsKCbjytOH4RwV",
            "country": "IN",
            "language": "en",
            "summary": "Jaipur, New Delhi, and Shimla saw a temperature drop below the 30-year average for June this year. In the hill states, Shimla warmed up by 0.6C, drenched in 186 mm more rain than usual, and Srinagar was 2.6 C hotter. India's average temperature rose 0.62C per century from 1901 to 2020. The 2020s are already shaping up to be India's warmest decade."
        },
        {
            "published_date": "2025-07-10T15:52:39",
            "title": "Diary farmer's warning amid 'worst drought in 41 years'",
            "author": "",
            "url": "https://www.bbc.com/news/articles/cj4el71q490o",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/79bf/live/5f744310-5d7f-11f0-a6b8-21ace6496903.png",
            "country": "GB",
            "language": "en",
            "summary": "Richard Cornock, a dairy farmer in Gloucestershire, is running out of grass to feed his cows due to drought. He has been farming for 41 years and he's never known a drought like this. Gloscemshire is the driest county in the West Country with less rainfall than Wiltshire, Somerset and Bristol."
        },
        {
            "published_date": "2025-07-10T15:40:28",
            "title": "Climate change trebled heat deaths in European heatwave",
            "author": "bnm Gulf bureau",
            "url": "https://www.intellinews.com/climate-change-trebled-heat-deaths-in-european-heatwave-390466",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/Untitled_design_-_2025-07-10T163656.610.jpg",
            "country": "US",
            "language": "en",
            "summary": "There were 1,500 heat-related deaths during Europe's recent heatwave, with 65% of those deaths directly attributable to climate change. The study examined 12 European cities during the severe heatwave that struck Western Europe in late June and early July. In 10 of the 12 locations studied, climate change increased extreme temperatures by 2°C to 4°C."
        },
        {
            "published_date": "2025-07-10T15:30:00",
            "title": "Editorial cartoon for Thursday, July 10, 2025",
            "author": "",
            "url": "https://www.postbulletin.com/opinion/cartoons/editorial-cartoon-for-thursday-july-10-2025",
            "url_media": "https://cdn.forumcomm.com/dims4/default/314b8bd/2147483647/strip/true/crop/1875x1285+0+0/resize/1555x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F25%2F22%2F0641d4b547f69b962174ed8faafa%2F070625texasfloodr.jpg",
            "country": "US",
            "language": "en",
            "summary": "The two hottest years ever recorded globally were 2023 and 2024. This year could exceed them. My grandchildren have no clear idea that this is a problem, but they soon will. They hear about wildfires, hurricanes, floods, drought and warming temperatures but they can't connect the dots quite yet."
        },
        {
            "published_date": "2025-07-10T15:28:56",
            "title": "Earth's Accelerating Spin To Shorten Two More Days",
            "author": "Isabel Van Brugen",
            "url": "https://www.newsweek.com/earth-spinning-faster-summer-2097215",
            "url_media": "https://d.newsweek.com/en/full/2680490/earth-seen-distance.jpg",
            "country": "US",
            "language": "en",
            "summary": "Earth recorded one of its shortest days on record on Wednesday. On July 22 and August 5, Earth's spin is projected to speed up, shortening each day by about 1.3 to 1.5 milliseconds from the standard 86,400 seconds that make up a 24-hour day. The moon's position could be the reason for Earth's increased rotational speed."
        },
        {
            "published_date": "2025-07-10T15:25:40",
            "title": "Yesterday was (almost) the shortest day in history. Here's why",
            "author": "Matt Brickman",
            "url": "https://www.nbcnewyork.com/weather/weather-stories/shortest-day-leap-second/6331636",
            "url_media": "https://media.nbcnewyork.com/2025/07/image_2684d6.png?resize=1200%2C675&quality=85&strip=all",
            "country": "US",
            "language": "en",
            "summary": "Wednesday was one of the shortest days in history, 1.42 milliseconds short of 24 hours. The shortest recorded day was last year, July 5, 2024. Since 1949, Earth's rotation has been slightly slower than 24 hours, so a leap second was added to the calendar to make up for it. Since 1972, 27 leap seconds have been added. In the last few years, Earth has registered the fastest days on record."
        },
        {
            "published_date": "2025-07-10T15:08:36",
            "title": "Turns Out Americans Really Don't Care About Climate Change After All",
            "author": "Nicole Silverio",
            "url": "https://dailycaller.com/2025/07/10/americans-climate-change-cnn-harry-enten",
            "url_media": "https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Screenshot-2025-07-10-at-10.57.11%e2%80%afAM-e1752159471986.png",
            "country": "US",
            "language": "en",
            "summary": "Gallup poll found that 40% of Americans are 'greatly worried about climate change' and 32% are worried about being a natural disaster victim. A minority of Americans of each political party believe that climate change will impact their home areas, including only 27% of Democrats."
        },
        {
            "published_date": "2025-07-10T14:44:44",
            "title": "Global envoys call for urgent climate action at international conclave in Bhubaneswar",
            "author": "",
            "url": "https://www.theweek.in/wire-updates/national/2025/07/10/cal26-od-diplomat-climate-change.html",
            "url_media": "https://www.theweek.in/content/dam/week/wire-updates/pti-preview-theweek.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Ambassadors and diplomats from eight countries are concerned about the impact of climate change and global warming. They are calling for urgent and focused global action to protect the planet. Spain's ambassador Juan Antonio March Pujol said: \"It is not a distant threat, it stands as a huge challenge before humanity.\""
        },
        {
            "published_date": "2025-07-10T14:38:36",
            "title": "Diplomats focus on action to save the planet from climate change, global warming",
            "author": "Statesman News Service",
            "url": "https://www.thestatesman.com/india/diplomats-focus-on-action-to-save-the-planet-from-climate-change-global-warming-1503456175.html",
            "url_media": "https://www.thestatesman.com/wp-content/uploads/2025/07/SOA-conclave.webp",
            "country": "IN",
            "language": "en",
            "summary": "Ambassadors and diplomats from eight different countries addressed the inaugural session of the 2-day international conclave on 'Climate Change and Global Warming—Issues and Prospects' organised by SOA Deemed to be University here. They expressed concern over the impact of climate change and global warming in the world."
        },
        {
            "published_date": "2025-07-10T14:33:44",
            "title": "Global Leaders Unite to Combat Climate Change Crisis: Call for Urgent Action",
            "author": "Bhubaneswar",
            "url": "https://www.devdiscourse.com/article/science-environment/3499823-global-leaders-unite-to-combat-climate-change-crisis-call-for-urgent-action",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/06_04_2025_05_22_30_2430362.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Diplomats from Spain, Uruguay, and Italy called for immediate global action on climate change at an international conclave on Thursday. India Meteorological Department's Director General, Mrutyunjay Mohapatra, emphasized the role of human-induced greenhouse gas emissions in the escalating crisis. Smaller nations like Seychelles and Guyana, which suffer disproportionately from climate change, demanded global recognition for their conservation efforts."
        },
        {
            "published_date": "2025-07-10T14:32:58",
            "title": "Summer heat is increasingly affected by climate change",
            "author": "Sara I. Belled",
            "url": "https://www.surinenglish.com/spain/summer-heat-increasingly-affected-climate-change-20250710163257-nt.html",
            "url_media": "https://s3.ppllstatics.com/rc/www/multimedia/2025/07/08/fotolead-calor-1200x840.jpg",
            "country": "ES",
            "language": "en",
            "summary": "This June in Spain was the hottest in history and the extreme temperatures were five times more likely due to climate change caused by human beings. The Mediterranean sea reached 26.1 degrees, according to Aemet - two degrees above the average for the month. There was an upsurge of mega-fires, like the one at the beginning of June in Lleida, causing two deaths."
        },
        {
            "published_date": "2025-07-10T14:32:15",
            "title": "Last week's heatwave killed 2,300 people across Europe: Study",
            "author": "Presstv",
            "url": "https://www.presstv.ir/Detail/2025/07/10/750950/Fossil-fuels-linked-1,500-heatwave-deaths-Europe-study",
            "url_media": "https://cdn.presstv.ir/Photo/2025/7/10/eea7d707-e9a5-4184-90ba-7d2c8536d79f.png",
            "country": "IR",
            "language": "en",
            "summary": "There were 2,300 heat-related deaths in Europe during the recent heatwave from June 23 to July 2. About two-thirds of these deaths were directly attributable to the additional warming caused by climate change. London saw the highest temperature rise, nearly 4 degrees Celsius, while Lisbon experienced a smaller rise of about 1 degree Celsius due to the Atlantic Ocean's cooling effect."
        },
        {
            "published_date": "2025-07-10T14:16:44",
            "title": "Opinion: Climate change is very real, and we must adapt",
            "author": "Cnw Contributor",
            "url": "https://www.caribbeannationalweekly.com/opinion/opinion-climate-change-is-very-real-and-we-must-adapt",
            "url_media": "https://www.caribbeannationalweekly.com/wp-content/uploads/2025/07/Texas-flooding-BI-780x439-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "There was flooding in central Texas, killing more than 100 people, including 27 adult counselors and girls at a summer youth camp. The flooding is linked to climate change. 97% of climate scientists agree that the Earth's climate is changing due to human activity, especially the burning of fossil fuels that release greenhouse gases."
        },
        {
            "published_date": "2025-07-10T14:09:15",
            "title": "UK Heatwave: Temperatures Soar to 34C This Weekend!",
            "author": "James Carter",
            "url": "https://www.archyde.com/uk-heatwave-temperatures-soar-to-34c-this-weekend",
            "url_media": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/650d/live/bb4ffe60-5d64-11f0-9040-f9c2d19390ca.jpg",
            "country": "US",
            "language": "en",
            "summary": "25 days of heatwaves have already been experienced in the UK this year. The Met Office's definition of a heatwave is only in place since 2019. The long-term trend is a warmer, potentially drier climate. The future of dealing with extreme heat requires proactive measures."
        },
        {
            "published_date": "2025-07-10T14:01:33",
            "title": "Jet stream no wavier than before",
            "author": "John Robson",
            "url": "https://johnrobson.substack.com/p/jet-stream-no-wavier-than-before",
            "url_media": "https://substackcdn.com/image/fetch/$s_!rxUN!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2c8e17-77cf-47e5-82d1-bb2ff01f4379_4696x3320.jpeg",
            "country": "US",
            "language": "en",
            "summary": "As we often say, with climate change you can say anything. Warm winter? That's due to climate change. Cold winter? Arctic warming causes the jet stream to become wavier so Arctic air flows further south in the winter and we end up with cold winters."
        },
        {
            "published_date": "2025-07-10T14:01:00",
            "title": "One of the world's deadliest sharks is developing a taste for Sydney",
            "author": "Angus Dalton",
            "url": "https://www.smh.com.au/national/nsw/one-of-the-world-s-deadliest-sharks-is-developing-a-taste-for-sydney-20250710-p5me0n.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.204%2C$multiply_1.545%2C$ratio_1.5%2C$width_756%2C$x_5%2C$y_0/t_crop_custom/q_62%2Cf_auto/f1e9815426141fa922753d5d0166024ab47eaa6b",
            "country": "AU",
            "language": "en",
            "summary": "Sydney's bull shark season has expanded due to ocean waters warming under climate change. The sharks spend an extra 15 days in and around Sydney Harbour each year. They leave Sydney in April or May to spend their winters in warmer seas off Queensland. They return around November."
        },
        {
            "published_date": "2025-07-10T14:01:00",
            "title": "One of the world's deadliest sharks is developing a taste for Sydney",
            "author": "Angus Dalton",
            "url": "https://www.watoday.com.au/national/nsw/one-of-the-world-s-deadliest-sharks-is-developing-a-taste-for-sydney-20250710-p5me0n.html",
            "url_media": "https://static.ffx.io/images/$zoom_0.4996%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_96/t_crop_custom/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/aec4b61a055b33d82365d42ac6ffbec311ad0f79",
            "country": "AU",
            "language": "en",
            "summary": "Sydney's bull shark season has expanded due to ocean waters warming under climate change. The sharks are delaying their northward migrations and spend an extra 15 days in and around Sydney Harbour each year. They leave Sydney in April or May to spend their winters in warmer seas off Queensland and return around November."
        },
        {
            "published_date": "2025-07-10T14:00:00",
            "title": "Museum offers behind-the-scenes tours",
            "author": "Staff Report",
            "url": "https://www.newsminer.com/features/latitude_65/museum-offers-behind-the-scenes-tours/article_6f3a51f6-1bc9-4501-8a4b-d3c254166b5b.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/newsminer.com/content/tncms/assets/v3/editorial/1/32/13228c52-ee21-4af4-8471-664a73a505f3/6838ee8e5287e.image.jpg?crop=1700%2C893%2C0%2C54&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Museum of the North design lead Tamara Martz mounts a year-long timeseries of Bering Sea Ice at the UAMN. UAMn photo taken by Roger Topp.    - UAM nt's website is: www.uamn.org."
        },
        {
            "published_date": "2025-07-10T13:45:09",
            "title": "Tamil Nadu hill stations warming up due to construction surge and forest decline",
            "author": "Dtnext Bureau",
            "url": "https://www.dtnext.in/news/tamilnadu/tamil-nadu-hill-stations-warming-up-due-to-construction-surge-and-forest-decline-839673",
            "url_media": "https://media.dtnext.in/h-upload/2024/09/06/841194-temperature.jfif",
            "country": "IN",
            "language": "en",
            "summary": "The holiday-favourite hill regions across Tamil Nadu are warming up due to increasing construction and declining green cover. Tamil Nadu has lost over 3,025 sq km of forest since 2000. The state report classifies 90 terrain blocks across the state, areas located above 330 metres in elevation."
        },
        {
            "published_date": "2025-07-10T13:33:16",
            "title": "How climate change is creating refugees across the world",
            "author": "New Delhi",
            "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/how-climate-change-is-creating-refugees-across-the-world-10118567",
            "url_media": "https://images.indianexpress.com/2025/07/Climate-refugees.jpg",
            "country": "IN",
            "language": "en",
            "summary": "By 2050, 141 countries are projected to experience at least one major natural disaster, potentially affecting 200 million people. Climate refugees are people who are forced to migrate and seek refuge elsewhere due to ecological threats caused by climate change. They fall in grey areas in both international protection frameworks."
        },
        {
            "published_date": "2025-07-10T13:30:44",
            "title": "Extreme Chinese Floods Test Aging Infrastructure and Agricultural Resilience",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3499704-extreme-chinese-floods-test-aging-infrastructure-and-agricultural-resilience",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/17_06_2025_14_37_56_8434899.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "10,000 people have been evacuated in southwestern China due to flooding caused by heavy rains. The flooding is linked to climate change. The Ministry of Water Resources warns that ten southwestern rivers are at imminent risk of breaching their banks. The Chishui River in Guizhou province has the highest water levels since 1953."
        },
        {
            "published_date": "2025-07-10T13:30:00",
            "title": "Poll: How Americans think the government should respond to natural disasters",
            "author": "Michel Fortier",
            "url": "https://www.stltoday.com/news/nation-world/government-politics/article_5b28537e-00d6-50b4-97e5-3811fee2f552.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/5/b2/5b28537e-00d6-50b4-97e5-3811fee2f552/686eba4e72e3d.preview.jpg?crop=1701%2C893%2C13%2C234&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Most Americans who have experienced major flooding in the past five years think climate change was at least a partial cause. Americans generally had high confidence in the National Weather Service and their local weather report. Americans want the government to play a major role in preparing for and responding to natural disasters, but less so in combating climate change."
        },
        {
            "published_date": "2025-07-10T13:30:00",
            "title": "Global grill: What other countries throw on the fire when it's hot outside",
            "author": "Mandy Applegate",
            "url": "https://www.the-messenger.com/news/national/article_057d6629-68df-5984-a6f1-3e6f58af16a6.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/the-messenger.com/content/tncms/custom/image/9d5cc87c-32a1-11e6-80ab-4b58aaff17ae.png",
            "country": "US",
            "language": "en",
            "summary": "Argentina's asado ribs, Türkiye's kofta and Togo's kimchi are some of the dishes that other countries are cooking on the grill when the weather gets hot outside.    i.e. when it's hot outside, it's time to skip the usual."
        },
        {
            "published_date": "2025-07-10T13:29:11",
            "title": "West Africa: Nigeria Urges Brics to Champion Climate Financing",
            "author": "Joshua Odeyemi",
            "url": "https://allafrica.com/stories/202507100403.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Nigeria's Minister of Foreign Affairs, Ambassador Yusuf Tuggar, has urged BRICS to increase climate financing support to developing nations. Africa is disproportionately affected by climate change and health inequity, he said. He spoke on behalf of Nigeria's President Bola Ahmed Tinubu and the Nigerian delegation."
        },
        {
            "published_date": "2025-07-10T13:29:00",
            "title": "Threats facing climate Justice Movements in Kenya",
            "author": "Njeru Lennox",
            "url": "https://www.the-star.co.ke/news/infographics/2025-07-10-threats-facing-climate-justice-movements-in-kenya",
            "url_media": "https://cdn.radioafrica.digital/image/2025/07/e744109c-a2df-486e-b5d2-999f557ae15e.jpeg?1752157411509",
            "country": "KE",
            "language": "en",
            "summary": "Climate justice movements in Kenya are facing significant challenges. The biggest hurdle is limited resources, followed by political interference, lack of goodwill and poor coordination mechanisms. The data underscores an urgent need for government and stakeholders to invest in institutional support, align climate advocacy with policy and ensure collaborative coordination."
        },
        {
            "published_date": "2025-07-10T13:23:00",
            "title": "Persistent rain threatens horticulture in South Bengal",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9749095/persistent-rain-threatens-horticulture-in-south-bengal",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0012.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "Rainfall in West Bengal is likely to continue for the next seven days. Orange alert remains for districts like South 24-Parganas, East Burdwan, Hooghly, Bankura, and West Midnapore due to forecasts of heavy rainfall. The continuous downpour over the past 24 hours has left an impact on agriculture and worsened urban road conditions."
        },
        {
            "published_date": "2025-07-10T13:17:03",
            "title": "Threatened by the rising waters of climate change, an iconic Norfolk museum is fighting back",
            "author": "Jim Morrison",
            "url": "https://www.pilotonline.com/2025/07/10/chrysler-museum-climate-change",
            "url_media": "https://www.pilotonline.com/wp-content/uploads/2025/03/TVC-L-GLASS-STUDIO1.jpeg?w=1024&h=768",
            "country": "US",
            "language": "en",
            "summary": "Chrysler Museum of Art in Norfolk is at risk of flooding due to climate change. Erik Neil, the president of the museum, has developed a master plan to protect the museum and its collection. The museum has made modifications to the main building, created a floodgate, moved the art in storage to the second floor and created plans to raise walkways and streets."
        },
        {
            "published_date": "2025-07-10T13:13:33",
            "title": "Europe is warming fast",
            "author": "Yeni Şafak",
            "url": "https://www.yenisafak.com/en/news/europe-is-warming-fast-3704727",
            "url_media": "https://img.piri.net/piri/upload/3/2025/7/10/98bae2d6-6it323gr778c2giscgpyaq.jpeg",
            "country": "TR",
            "language": "en",
            "summary": "Europe is experiencing unprecedentedly early and intense heatwaves caused by climate change. Europe has become the fastest-warming continent on Earth. The Mediterranean Sea is absorbing heat at a rapid rate, contributing to prolonged and severe summer heatwaves. The consequences of this extreme heat have been devastating in Spain and France."
        },
        {
            "published_date": "2025-07-10T13:01:29",
            "title": "Bloomberg: Floods were made worse by climate denialism",
            "author": "Class",
            "url": "https://www.columbian.com/news/2025/jul/10/bloomberg-floods-were-made-worse-by-climate-denialism",
            "url_media": "https://www.columbian.com/wp-content/themes/columbian2/static/img/og/default-2022.jpg",
            "country": "US",
            "language": "en",
            "summary": "Flooding in central Texas has killed more than 100 people. The scientific evidence is clear that more frequent extreme weather is being driven by climate change and it's only going to get worse. Elected officials in Washington, D.C. refuse to recognize that climate change carries a death penalty."
        },
        {
            "published_date": "2025-07-10T13:00:01",
            "title": "Trump officials axed an online portal for its key climate report. Read it in full here",
            "author": "Oliver Milman",
            "url": "https://www.theguardian.com/us-news/2025/jul/10/national-climate-assessment-published",
            "url_media": "https://i.guim.co.uk/img/media/b1dd8fb8e21774f1837db6c3b5111f38a17f28b3/263_0_3334_2667/master/3334.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a783cbc490503bb916f15f7b8cef7f4f",
            "country": "GB",
            "language": "en",
            "summary": "The Trump administration has deleted the website that housed the periodic, legally mandated assessments that have been produced by scientists over the past two decades. Five national climate assessments have been compiled since 2000 by researchers across a dozen US government agencies and outside scientists. The latest assessment, conducted in 2023, can be found deep on the National Oceanic and Atmospheric Administration's website. It is more than 1,800 pages long and warns that the effects of human-caused climate change are already far-reaching and worsening across every region of the US."
        },
        {
            "published_date": "2025-07-10T13:00:00",
            "title": "ABC News' Claim that Climate Change Is Causing Sleep Apnea Is Absurd",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/07/10/abc-news-claim-that-climate-change-is-causing-sleep-apnea-is-absurd",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/07/ABCNews-apnea-absurd.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "ABC News published an article claiming that climate change is making it harder for people to sleep. There is no scientific evidence to support this claim. The Urban Heat Island effect can be easily mistaken for broader climate warming if not properly controlled for. The main risk factors for sleep apnea are obesity, thick neck circumference, narrowed airways, family history, use of alcohol or sedatives, smoking, nasal congestion, and certain medical conditions such as high blood pressure."
        },
        {
            "published_date": "2025-07-10T12:48:30",
            "title": "Global warming contributed to 1,500 more deaths during Europe's heat wave, study says",
            "author": "Alexander Smith",
            "url": "https://news.knowledia.com/all/all/articles/global-warming-contributed-to-1-500-more-deaths-during-europe-s-heat-3dca55d9c8eef1f2e3ba10a60775b8bc645090bc",
            "url_media": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-07/250709-eur-heatwave-rs-352956.jpg",
            "country": "FR",
            "language": "en",
            "summary": "At least 1,500 people died in a European heat wave last week. England and Spain recorded their hottest June on record, schools closed across France and wildfires raged in Sardinia. Around 2,300 people died across 12 European cities, including London, Paris, Barcelona and Rome."
        },
        {
            "published_date": "2025-07-10T12:45:54",
            "title": "Barbados warns of deepening climate frustration ahead of COP30",
            "author": "Emmanuel Joseph",
            "url": "https://barbadostoday.bb/2025/07/10/barbados-warns-of-deepening-climate-frustration-ahead-of-cop30",
            "url_media": "https://barbadostoday.bb/wp-content/uploads/2025/07/Kerrie-Symmonds.jpg",
            "country": "BB",
            "language": "en",
            "summary": "Barbados is preparing for the COP30 United Nations Climate Change Conference in Belém, Brazil, from November 10 to 21. Kerrie Symmonds, Minister of Foreign Affairs, said the world's most vulnerable countries are losing patience with wealthy nations' failure to deliver on climate finance commitments. He warned that climate inaction is a matter of life and death for the Caribbean."
        },
        {
            "published_date": "2025-07-10T12:40:00",
            "title": "Reader's View: Fix global warming now",
            "author": "",
            "url": "https://www.duluthnewstribune.com/opinion/letters/readers-view-fix-global-warming-now",
            "url_media": "https://cdn.forumcomm.com/dims4/default/477eef7/2147483647/strip/true/crop/1800x1125+0+0/resize/1706x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fduluthnewstribune%2Fbinary%2FReader%27s%20View_binary_2722040.jpg",
            "country": "US",
            "language": "en",
            "summary": "Jace Harkness is a fifth-grader at William Kelley Elementary School in Silver Bay. He visited Sea Change Expeditions, a North Shore boating and voyaging program that offers education about Lake Superior's characteristics, vulnerabilities, and beauty. Email your opinion to: letters@duluthnews.com."
        },
        {
            "published_date": "2025-07-10T12:25:39",
            "title": "Yakutia to assess potential damage to climatically vulnerable facilities",
            "author": "TASS",
            "url": "https://tass.com/economy/1987867",
            "url_media": "https://tass.com/img/blocks/common/tass_logo_share_eng.png",
            "country": "RU",
            "language": "en",
            "summary": "Experts of Yakutia's Arctic Research Center will assess potential damage to climatically vulnerable state-owned facilities in the region. In early 2025, the center's experts completed an assessment of climate risks for Yakutian municipal districts and economic zones. Highest climate risks are in the northeast and east. The average number of risks in this group is 15.9 out of 25. The regional climate change adaptation plan is for 2025-2027."
        },
        {
            "published_date": "2025-07-10T12:22:34",
            "title": "Dams Disrupt Earth's Magnetic Field",
            "author": "",
            "url": "https://www.archyde.com/dams-disrupt-earths-magnetic-field",
            "url_media": "https://envirotecmagazine.com/wp-content/uploads/2025/07/Kariba-Dam-1200px.jpg",
            "country": "US",
            "language": "en",
            "summary": "The construction of nearly 7,000 dams worldwide between 1835 and 2011 has shifted Earth's rotational poles. Dams in North America and Europe shifted the North Pole towards the 103rd meridian east (Russia, Mongolia, China) and the 117th meridian west (western North America, South Pacific). The impounded water also contributed to a 21-millimeter (0.83-inch) drop in global sea levels. The research highlights the significant impact of human activities on the planet and emphasizes the need to consider water impoundment when modeling future sea level rise."
        },
        {
            "published_date": "2025-07-10T12:10:15",
            "title": "Earth Is Going To Spin Much Faster Over The Next Few Months",
            "author": "",
            "url": "https://www.2oceansvibe.com/2025/07/10/earth-is-going-to-spin-much-faster-over-the-next-few-months",
            "url_media": "https://media.2oceansvibe.com/wp-content/uploads/2025/01/cropped-IMG_0280-32x32.jpg",
            "country": "ZA",
            "language": "en",
            "summary": "On July 22 and August 5, the moon will be at its furthest distance from Earth's equator. This will make the planet's rotation faster and make the days shorter. Earth's rotation is affected by the positions of the sun and moon, changes to Earth's magnetic field, and the balance of mass on the planet."
        },
        {
            "published_date": "2025-07-10T12:06:40",
            "title": "Days are getting shorter as Moon is making Earth spin faster",
            "author": "",
            "url": "https://www.indiatoday.in/visualstories/science/days-are-getting-shorter-as-moon-is-making-earth-spin-faster-248291-10-07-2025",
            "url_media": "https://cf-img-a-in.tosshub.com/sites/visualstory/wp/2025/07/earth-10ITG-1752148875028.jpg?size=*:900",
            "country": "IN",
            "language": "en",
            "summary": "Earth is experiencing its shortest days on record this July, with July 9, 22, and August 5, 2025 each ending about 1.3 to 1.5 milliseconds faster than usual. The phenomenon is linked to the Moon's unique alignment this month, as it reaches its furthest point from Earth's equator. When the Moon is farther from the equator and closer to the poles, its gravitational pull changes, slightly boosting the planet's spin rate. Global timekeeping agencies are monitoring the situation."
        },
        {
            "published_date": "2025-07-10T11:56:09",
            "title": "Climate Disasters Are Catnip for Cynical Republicans",
            "author": "",
            "url": "https://dnyuz.com/2025/07/10/climate-disasters-are-catnip-for-cynical-republicans",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/07/Climate-Disasters-Are-Catnip-for-Cynical-Republicans.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Climate change has fallen out of political debates in the U.S. over the last few years, but rising temperatures have been delivering destruction with muzzle velocity across the country. For more and more people in the United States, climate change is a kitchen table and/or life-and-death issue. In rich, Western countries, climate activism has imagined global warming as a far-off threat to be remedied by the rich. For millions of Americans, it's already an affordability crisis that's showing up in their mortgage payments, rent, and monthly bills."
        },
        {
            "published_date": "2025-07-10T11:50:33",
            "title": "Himachal floods: How can Himalayan region safeguard its people, heritage, ecosystems from climate change?",
            "author": "Anjal Prakash",
            "url": "https://indianexpress.com/article/opinion/columns/himachal-floods-himalaya-climate-change-10118288",
            "url_media": "https://images.indianexpress.com/2025/06/himachal-pradesh.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Floods in Himachal Pradesh exemplify the destructive power of climate change-driven weather patterns. In the last decade, India's Himalayan states have experienced increasingly extreme weather events due to climate change. The Himalayan region is particularly vulnerable because of its complex topography and melting glaciers."
        },
        {
            "published_date": "2025-07-10T11:49:01",
            "title": "Climate change tripled European heatwave deaths in June, study finds",
            "author": "Philenews",
            "url": "https://article.wn.com/view/2025/07/10/Climate_change_tripled_European_heatwave_deaths_in_June_stud",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "There was a European heatwave in late June that killed an estimated 2,300 people across 12 major cities. Climate change is likely to make heatwaves more frequent and intense in a warming world, according to scientists studying the impact of planetary heating on extreme weather."
        },
        {
            "published_date": "2025-07-10T11:16:28",
            "title": "'Climate risks demand immediate attention': How extreme weather could wipe almost five per cent off Europe's GDP",
            "author": "Emily Lee",
            "url": "https://www.businessgreen.com/news-analysis/4516161/climate-risks-demand-immediate-attention-extreme-weather-wipe-cent-europes-gdp",
            "url_media": "https://image.chitra.live/api/v1/wps/b8e4bc1/660afb47-37e3-42fc-b920-ddc31ec18ea5/2/iStock-465781850-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "A series of climate change-driven extreme weather events could wipe almost 5% off Europe's projected GDP over the next five years. Such damages could be avoided if the climate change can be largely controlled.    - European Union's economic growth is projected to be 5% higher than expected. "
        },
        {
            "published_date": "2025-07-10T11:00:00",
            "title": "The 2026 World Cup's dirty side",
            "author": "sportsunlimitednews.com",
            "url": "https://www.msn.com/en-ae/news/other/the-2026-world-cup-s-dirty-side/ss-AA1IjOtm",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The 2026 FIFA World Cup is set to be the most climate-damaging ever, according to research by Scientists for Global Responsibility (SFRR). FRR: The 2026 World Cup will make history by becoming the most damaging to the environment ever."
        },
        {
            "published_date": "2025-07-10T11:00:00",
            "title": "Extreme weather could cause 5% drop in eurozone GDP, bank watchdogs find",
            "author": "Virginia Furness",
            "url": "https://www.timeslive.co.za/news/sci-tech/2025-07-10-extreme-weather-could-cause-5-drop-in-eurozone-gdp-bank-watchdogs-find",
            "url_media": "https://lh3.googleusercontent.com/4fgNYRk8Uu-aQRS8eEHx9klaSkG2Ztvz78ykyZOw50YyHz81PZItNXXR_T-TnFOq_IzLN_UhdpSyoDB-3VTvBnhqXe8ZWjg=s1000",
            "country": "ZA",
            "language": "en",
            "summary": "Extreme weather events could wipe as much off eurozone GDP in the next five years as the global financial crisis or the Covid-19 pandemic. The findings are based on a new set of tools designed by the NGFS, a group of central bankers and supervisors working to address climate-risk in the financial sector and economy."
        },
        {
            "published_date": "2025-07-10T10:40:23",
            "title": "European wind, cool temps prolonged Finland's birch pollen season",
            "author": "Yle News",
            "url": "https://yle.fi/a/74-20172002",
            "url_media": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_121,w_5804,h_3258/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1715928564/39-12865216646f986d0886",
            "country": "FI",
            "language": "en",
            "summary": "Finland's birch pollen season has come to an end. The season was unusually long this year due to the early arrival of pollen from southern Europe and a prolonged pollen season in Finland due to a cool early summer. Up to one-fifth of people in Finland are sensitive to birch allergies."
        },
        {
            "published_date": "2025-07-10T10:14:00",
            "title": "Melting Ice Will Strengthen Monsoon In Northern Australia - But Cause Drier Conditions North Of Equator",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/melting-ice-will-strengthen-monsoon-in-northern-1493824",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1505751172876-fa1923c5c528%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "As the world gets hotter, the Indo-Australian monsoon will intensify and northern Australia will get wetter. Monsoon is the annual arrival of intense rains in areas north and south of the Equator. A sediment core from Girraween Lagoon on the outskirts of Darwin provides a 150,000-year-old record of environmental change in Australia's northern savannahs."
        },
        {
            "published_date": "2025-07-10T10:12:00",
            "title": "‘We are not going to act like victims'",
            "author": "",
            "url": "https://www.jamaicaobserver.com/2025/07/10/not-going-act-like-victims",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/07/6e9d93425241c5b7c18bd861e989d295.jpg",
            "country": "JM",
            "language": "en",
            "summary": "Dr Terrance Drew is in line to assume the chairmanship of Caricom when Jamaica's Prime Minister Dr Andrew Holness completes his term at the end of this year. Dr Drew stressed that the Caribbean suffers 'significantly' from climate change. Holness said efforts to lobby for help in the push for climate justice will continue."
        },
        {
            "published_date": "2025-07-10T09:50:57",
            "title": "Why Switzerland is among the ten fastest-warming countries in the world",
            "author": "Swissinfo",
            "url": "https://article.wn.com/view/2025/07/10/Why_Switzerland_is_among_the_ten_fastestwarming_countries_in",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "June 2025 was the second-warmest month in Switzerland since temperature records began. Switzerland is affected by climate change as average temperatures are rising faster than in most other countries, according to long-term data from the World Meteorological Organisation.     "
        },
        {
            "published_date": "2025-07-10T09:30:40",
            "title": "I quit my job as an easyJet pilot because of the climate crisis. Here's how we can transform aviation",
            "author": "George Hibberd",
            "url": "https://www.theguardian.com/commentisfree/2025/jul/10/pilot-climate-crisis-aviation-industry-flying",
            "url_media": "https://i.guim.co.uk/img/media/cac6ec10707eba8f8330a0aefca4b3efcfe60635/613_0_1993_1596/master/1993.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=01ed98ed8420744fc240bb8190842577",
            "country": "GB",
            "language": "en",
            "summary": "George Hibberd is a former airline pilot and works with Safe Landing to run workers' assemblies. He is concerned about the impact of the aviation industry on the climate. He wants to create a non-negotiable emissions budget that would set limits on the total amount of greenhouse gases and carbon dioxide aviation can produce."
        },
        {
            "published_date": "2025-07-10T09:30:40",
            "title": "Climate anxiety meant I could no longer work as a pilot. But I love flying – and I know we can transform aviation",
            "author": "George Hibberd",
            "url": "https://amp.theguardian.com/commentisfree/2025/jul/10/pilot-climate-crisis-aviation-industry-flying",
            "url_media": "https://i.guim.co.uk/img/media/cac6ec10707eba8f8330a0aefca4b3efcfe60635/613_0_1993_1596/master/1993.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=01ed98ed8420744fc240bb8190842577",
            "country": "GB",
            "language": "en",
            "summary": "George Hibberd is a former airline pilot and works with Safe Landing to run workers' assemblies. He is concerned about the impact of the aviation industry on the climate. He wants to create a non-negotiable emissions budget that would set limits on the total amount of greenhouse gases and carbon dioxide aviation can produce."
        },
        {
            "published_date": "2025-07-10T09:24:42",
            "title": "Dismantle Israel? No. Dismantle Australia",
            "author": "Susan J. Berkson",
            "url": "https://blogs.timesofisrael.com/dismantle-israel-no-dismantle-australia",
            "url_media": "https://static-cdn.toi-media.com/blogs/uploads/2025/07/cd5c4042-a0ff-43b1-89e2-e92240f7a574_259x194.webp",
            "country": "IL",
            "language": "en",
            "summary": "Clementine Ford wants to dismantle Australia. Mike Burgess is the head of the Australian Security Intelligence Organization. Australia's social cohesion is eroding in a stew of intolerance, political violence, and misinformation. There were 2,062 documented antisemitic incidents in Australia in 2024 alone – a 316% increase from the year before."
        },
        {
            "published_date": "2025-07-10T09:13:16",
            "title": "Spear fisher's close call with great white shark in Sydney",
            "author": "",
            "url": "https://www.smh.com.au/national/spear-fishers-close-call-with-great-white-shark-in-sydney-20250710-p5me3z.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/f8dabeab6e04e68dcda7214f557801a5a39b8ec1",
            "country": "AU",
            "language": "en",
            "summary": "A spear fisher has been circled by a great white at Maroubra by a shark. The encounters with sharks off Sydney are increasing.    - nj.com.au.  -  - iReport.com  - iReport  "
        },
        {
            "published_date": "2025-07-10T09:00:50",
            "title": "YOU SAID IT: Cracks in sidewalk maintenance",
            "author": "Letters to the Editor",
            "url": "https://ottawasun.com/opinion/letters/you-said-it-cracks-in-sidewalk-maintenance",
            "url_media": "https://smartcdn.gprod.postmedia.digital/ottawasun/wp-content/uploads/2025/07/concrete-heave_jo03_296395617.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The city is too busy funding special-interest groups and projects we don't need instead of spending on things we've been told we need to be taxed for. The city has pressing infrastructure issues, such as roads and sidewalks. Planting more trees would help shade the roads, sidewalks and help with cooling overall. Canadians are being punished for the miniscule amount of global greenhouse gas emissions we produce."
        },
        {
            "published_date": "2025-07-10T09:00:43",
            "title": "Latest European heatwave ‘hotter and deadlier'",
            "author": "",
            "url": "https://www.newsofbahrain.com/world/115456.html",
            "url_media": "https://www.newsofbahrain.com/admin/post/upload/A_GiYlsDKTyv_2025-07-10_1752134043resized_pic.jpg",
            "country": "BH",
            "language": "en",
            "summary": "The recent European heatwave was caused by human-caused climate change, according to a study by over a dozen researchers from five European institutions. It was the hottest June on record in western Europe. Some schools and tourist sites were shuttered as the mercury soared."
        },
        {
            "published_date": "2025-07-10T09:00:00",
            "title": "SC could see 'devastating' impacts if hurricane research is cut, experts say",
            "author": "Julio Cortez/AP",
            "url": "https://www.postandcourier.com/politics/hurricane-trump-research-clyburn-experts-cuts/article_aa03269d-ae76-4cd9-b925-bff5c992c271.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/3/b1/3b109042-9114-441d-865d-b719363c30ff/686ed53ddcf9e.image.jpg?crop=1762%2C925%2C0%2C176&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Three former leaders of federal weather agencies warn of the dangers of deep budget cuts to weather-related research under the Trump administration. Robert Atlas, James Franklin and Frank Marks are concerned about the impact of such cuts on the weather services. The three former leaders addressed the media in the aftermath of the fatal flooding in Texas over the July 4th weekend that killed 119 people."
        },
        {
            "published_date": "2025-07-10T09:00:00",
            "title": "Adrian Raeside cartoon: Preventing misbehaviour on B.C. Ferries vessels",
            "author": "Adrian Raeside",
            "url": "https://www.timescolonist.com/opinion/adrian-raeside-cartoon-preventing-misbehaviour-on-bc-ferries-vessels-10924203",
            "url_media": "https://www.vmcdn.ca/f/files/victoriatimescolonist/json/2025/07/web1_thumbnail_raeside_07102025_web(1)-thumb.png;w=343;h=229;mode=crop",
            "country": "US",
            "language": "en",
            "summary": "B.C.'s migrant farm workers face scorching heat in the fields and in their housing. About 24 hours ago, a comment was posted on this blog. It said that B.C.’s migrant workers face hot conditions in their fields and their homes. "
        },
        {
            "published_date": "2025-07-10T08:58:00",
            "title": "Bushfires NT: Planned Burn at Maryfield Station",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/bushfires-nt-planned-burn-at-maryfield-station-1493747",
            "url_media": "https://treasury.nt.gov.au/__data/assets/image/0011/807509/Parliament-House.jpg",
            "country": "US",
            "language": "en",
            "summary": "A planned burn is scheduled for 10/07/25 14:30 hours at Maryfield Station, NT Por 6365, Stuart Highway, Birdum, BIRDUM. There are risks to people in the area, such as smoke affecting visibility and active fire close to the roadside."
        },
        {
            "published_date": "2025-07-10T08:50:00",
            "title": "Net Migration Loss To Australia In 2024",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/net-migration-loss-to-australia-in-2024-1493737",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/newsdevelopments-image.jpg",
            "country": "US",
            "language": "en",
            "summary": "There was a net migration loss of 30,000 people from New Zealand to Australia in the December 2024 year, according to provisional estimates released by Stats NZ today. The loss in 2024 is the largest for a calendar year since 2012, but below the record loss of 43,700 in the March 2012 year. The annual migrant departures from Australia to New Zealand was 62,800."
        },
        {
            "published_date": "2025-07-10T08:48:00",
            "title": "Reefs Heritage Status at Risk, Australias Policy Key",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/reefs-heritage-status-at-risk-australias-policy-1493734",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2017/11/news-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "The World Heritage Committee wants Australia to set an ambitious climate target consistent with limiting global temperature increases to 1.5°C. The Committee's next annual meeting in mid-2026 could decide to place the Great Barrier Reef on the \"in Danger\" List. Australia is due to announce its 2035 target in September. There have been six mass coral bleaching events on the Reef in the past decade. UNESCO predicted that under a worst case scenario, the reef would experience two severe bleaches events per decade by 2035."
        },
        {
            "published_date": "2025-07-10T08:45:27",
            "title": "Southwestern China's Rivers Rage: A Flooding Crisis Amidst Climate Change",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3499199-southwestern-chinas-rivers-rage-a-flooding-crisis-amidst-climate-change",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/19_06_2025_17_28_09_5235077.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "10,000 people have been evacuated in southwestern China due to heavy flooding caused by former typhoon Danas. The Chishui River in Guizhou showed the highest water levels since 1953. Health officials in Beijing have expressed concerns over potential contamination risks from the combination of torrential rain, high temperatures, and humidity."
        },
        {
            "published_date": "2025-07-10T08:42:31",
            "title": "G20 take note: Climate adaptation today will ensure Africa's thriving future",
            "author": "Tafadzwanashe Mabhaudhi",
            "url": "https://mg.co.za/thought-leader/2025-07-10-g20-take-note-climate-adaptation-today-will-ensure-africas-thriving-future",
            "url_media": "https://mg.co.za/wp-content/uploads/2019/10/c3b48ea6-00-the-horror-tales-of-climate-change.jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "South Africa is the current president of the G20. The theme is Solidarity, Equality, Sustainability. Africa has the highest rate of hunger and 53% of the global population will be facing hunger by 2030. Africa's adaptation to climate change has been slow and insufficient. The international community needs to support Africa in bridging the existing climate adaptation funding gap."
        },
        {
            "published_date": "2025-07-10T08:36:00",
            "title": "Labor Cosying Up To Greens Leaves Tasmanians In Cold",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/labor-cosying-up-to-greens-leaves-tasmanians-in-1493731",
            "url_media": "https://tas.liberal.org.au/sites/default/files/headers/laborisgreen.jpg",
            "country": "US",
            "language": "en",
            "summary": "A senior Labor MP confirmed that a Labor Government would seek to ban wood heaters as they position to do a deal with the Greens. Ms Haddad confirmed in an ABC interview that it's \"inevitable\" that the heaters would be banned."
        },
        {
            "published_date": "2025-07-10T08:30:00",
            "title": "The delusions plagueing Britain's warming summers",
            "author": "The Economist",
            "url": "https://www.economist.com/podcasts/2025/07/10/the-delusions-plagueing-britains-warming-summers",
            "url_media": "https://www.economist.com/content-assets/images/20250705_PDD004.jpg",
            "country": "GB",
            "language": "en",
            "summary": "A handpicked article read aloud from the latest issue of The Economist. Britain's summers are getting hotter, but people's expectations haven't adjusted to the new reality yet.       .   i   in the Economist.  in The Economist "
        },
        {
            "published_date": "2025-07-10T08:18:26",
            "title": "The Aged's Sunset Years Will Be Bedevilled by Lethal Heatwaves",
            "author": "Manipadma Jena",
            "url": "https://www.ipsnews.net/2025/07/for-the-aged-their-sunset-years-will-be-bedeviled-by-lethal-heatwaves",
            "url_media": "https://www.ipsnews.net/Library/2025/07/IPS-1-UNEP-Frontier-Report.jpg",
            "country": "IT",
            "language": "en",
            "summary": "There has been an 85 percent increase since 1990 in annual heat-related deaths of adults aged above 65. Global temperatures are on track to reach 2.7°C by the end of the century, up from 1.14°C above pre-industrial levels in 2013-2022. The past 11 years have been the 11 warmest on record since records began in 1880. UN Environment Programme (UNEP) warns of heightened health risks for older persons in the Frontiers 2025 Report."
        },
        {
            "published_date": "2025-07-10T08:14:00",
            "title": "Be Part Of Australia's Pavilion At COP30",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/be-part-of-australias-pavilion-at-cop30-1493721",
            "url_media": "https://www.dcceew.gov.au/sites/default/files/images/eoi-australia-pavilion-at-cop30.jpg",
            "country": "US",
            "language": "en",
            "summary": "COP30 is the 30th annual meeting of the United Nations Conference of the Parties. It will be held in Belém, Brazil, from 10-21 November 2025. The Australian Pavilion at COP30 is a chance to showcase home-grown climate change solutions at the world's largest annual climate summit."
        },
        {
            "published_date": "2025-07-10T08:10:28",
            "title": "Europe's Early Summer Heatwave Leaves 2,300 Dead",
            "author": "Sher Alam",
            "url": "https://propakistani.pk/2025/07/10/europes-early-summer-heatwave-leaves-2300-dead",
            "url_media": "https://propakistani.pk/wp-content/uploads/2025/07/2025-14.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Europe experienced a severe heatwave since late June that has caused over 2,300 deaths. About 65% of the deaths were directly linked to climate change. The affected cities experienced temperature increases of up to 4°C above normal levels during the period studied. The European Union's Copernicus Climate Change Service reported that June 2025 was the third-warmest June on record globally."
        },
        {
            "published_date": "2025-07-10T08:01:24",
            "title": "Earth's rotation speeding up again, Scientists predict shorter days this Summer",
            "author": "Nillohit Bagchi",
            "url": "https://www.indiatimes.com/trending/earths-rotation-speeding-up-again-scientists-predict-shorter-days-this-summer-663493.html",
            "url_media": "https://im.indiatimes.in/content/template/share/663493.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Earth is spinning a little faster than usual this month. July 9 saw Earth shave off around 1.3 milliseconds from the usual 24-hour cycle. July 22 and August 5 are expected to do the same, so there will be shorter days on record. Since 2020, Earth has been spinning slightly faster since the International Earth Rotation and Reference Systems Service."
        },
        {
            "published_date": "2025-07-10T07:59:51",
            "title": "No. of heat-related patients surges at record pace amid extreme heat wave",
            "author": "Korea Times",
            "url": "https://article.wn.com/view/2025/07/10/No_of_heatrelated_patients_surges_at_record_pace_amid_extrem_g",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "The number of heat-related illness cases is rising at the fastest pace on record this summer. A total of 1,228 patients have visited the hospital so far this year. Health authorities urge vulnerable groups to take extra precautions to prevent the spread of the illness."
        },
        {
            "published_date": "2025-07-10T07:53:15",
            "title": "Scientists have ‘grim outlook' on Doomsday Glacier as main countries at risk if it collapses revealed",
            "author": "Joe Harker",
            "url": "https://www.ladbible.com/news/world-news/doomsday-glacier-scientists-countries-at-risk-715215-20250710",
            "url_media": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/bltca87354450c741c1/686f6be7e1c885165aa861a3/doomsday-glacier-countries-risk.png",
            "country": "GB",
            "language": "en",
            "summary": "Scientists are worried about the fate of the Thwaites Glacier in the Antarctic. Global warming is increasing the melting of glaciers and sea levels. If the glacier collapses, it will cause a significant rise in sea levels and submerge some parts of the world. The worst affected countries are coastal nations that are rather flat."
        },
        {
            "published_date": "2025-07-10T07:36:35",
            "title": "Most regions in Türkiye see above-average temperatures in June",
            "author": "Daily Sabah With Aa",
            "url": "https://www.dailysabah.com/turkiye/most-regions-in-turkiye-see-above-average-temperatures-in-june/news",
            "url_media": "https://idsb.tmgrup.com.tr/ly/uploads/images/2025/07/10/thumbs/1200x675/390982.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The average air temperature across Türkiye in June reached 23 degrees Celsius (73.4 degrees Fahrenheit), which is 1.2 degrees Celsius above the seasonal norm of 21.8 degrees Celsius. It was the fourth hottest June in the past 55 years. In most parts of the Marmara region, temperatures were above seasonal norms. In the Mediterranean Region, temperatures exceeded seasonal averages in most areas."
        },
        {
            "published_date": "2025-07-10T07:25:27",
            "title": "Kenya Met Lists Regions Set To Experience Rain And Cold Weather Over The Next 5 Days",
            "author": "Getrude Mathayo",
            "url": "https://sokodirectory.com/2025/07/kenya-met-lists-regions-set-to-experience-rain-and-cold-weather-over-the-next-5-days",
            "url_media": "https://sokodirectory.com/wp-content/uploads/2019/03/rain.jpg",
            "country": "KE",
            "language": "en",
            "summary": "Kenya Met has issued a comprehensive five-day weather forecast for Tuesday, July 8 to Saturday, July 12. Some regions are likely to experience persistent rain, chilly temperatures, and gusty winds, while others will remain largely sunny but breezy. The affected counties include Nyandarua, Laikipia, Nyeri, Kirinyaga, Murang'a, Kiambu, Meru, Embu, Tharaka and Nairobi."
        },
        {
            "published_date": "2025-07-10T07:19:00",
            "title": "Brrrrrrrrrr",
            "author": "",
            "url": "https://www.bluemountainsgazette.com.au/story/9013384/blackheath-shivers-through-freezing-conditions",
            "url_media": "https://www.bluemountainsgazette.com.au/images/transform/v1/crop/frm/8bGEiHWLyUjrk3bpemiXyX/feaafdb0-b329-4bf7-8dad-7e5688695144_rotated_270.JPG/r0_1222_3024_2810_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "It was minus 7.9 degrees in Blackheath on July 10. The wind gusts - up to 70 km/h - brought in a chill factor straight off Antarctica. There were snow flurries at lunchtime. The forecast is cheerier with the winds easing and a balmy 10 degrees predicted for July 11."
        },
        {
            "published_date": "2025-07-10T07:00:00",
            "title": "Extreme heat and drought are Switzerland's top climate change risks",
            "author": "Simon Bradley",
            "url": "https://www.swissinfo.ch/eng/climate-solutions/extreme-heat-and-drought-are-switzerlands-top-climate-change-risks/89653416",
            "url_media": "https://www.swissinfo.ch/content/wp-content/uploads/sites/13/2025/07/250702_Heat-risks-Simon.jpg?ver=be51a551&fit=354,630",
            "country": "CH",
            "language": "en",
            "summary": "Swiss authorities have identified dozens of climate-related risks in the coming decades. In the next 30 years, Swiss heatwaves will more frequent and get more extreme, resulting in hotter cities and economic stress from water shortages. Adapting will require global cooperation and smart investments."
        },
        {
            "published_date": "2025-07-10T07:00:00",
            "title": "Why Switzerland is among the ten fastest-warming countries in the world",
            "author": "Luigi Jorio",
            "url": "https://www.swissinfo.ch/eng/climate-adaptation/why-switzerland-is-among-the-ten-fastest-warming-countries-in-the-world/89646710",
            "url_media": "https://www.swissinfo.ch/content/wp-content/uploads/sites/13/2025/07/662474936_highres.jpg?ver=80d5a703&fit=1200,801",
            "country": "CH",
            "language": "en",
            "summary": "June 2025 was the second-warmest month in Switzerland since temperature measurements began in 1864. According to early predictions, 2025 is expected to be slightly less warm than last year. There is a strong chance that new records will be set in the coming years. Switzerland is among the world's fastest-warming nations according to United Nations data."
        },
        {
            "published_date": "2025-07-10T06:44:25",
            "title": "Africa CDC Launches Framework to Combat Health Impact of Climate Change",
            "author": "",
            "url": "https://allafrica.com/stories/202507100091.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "The Africa Centre for Disease Control and Prevention (Africa CDC) has launched a strategic framework to address the health impacts of climate change. Climate change is already wreaking havoc across Africa, driving extreme weather events, shifting disease patterns, food insecurity, and waterborne illnesses. It is projected to cause an additional 14.5 million deaths, over two billion healthy life years lost, and $12.5 trillion in economic losses globally by 2050."
        },
        {
            "published_date": "2025-07-10T06:33:27",
            "title": "Animals in hot weather",
            "author": "Nam",
            "url": "https://en.yna.co.kr/view/PYH20250710153400315",
            "url_media": "https://img9.yna.co.kr/photo/yna/YH/2025/07/10/PYH2025071015340031500_P4.jpg",
            "country": "KR",
            "language": "en",
            "summary": "Meerkats eat ice blocks with mealworms in the hot summer weather at a zoo in Seoul on July 10, 2025, in order to survive the heat in the zoo. It's July 10th today in Seoul.   Â   yonhap."
        },
        {
            "published_date": "2025-07-10T06:24:20",
            "title": "As Marseille reels from early summer wildfire, France rolls back environmental protections",
            "author": "François Picard",
            "url": "https://www.france24.com/en/video/20250710-as-marseille-reels-from-early-summer-wildfire-france-rolls-back-environmental-protections",
            "url_media": "https://s.france24.com/media/display/4e0ca0a2-5d54-11f0-b2d5-005056a90284/w:1280/p:16x9/EN-20250709-175959-180749-CS.jpg",
            "country": "FR",
            "language": "en",
            "summary": "2,300 people died in heatwave caused by European heatwave. Paris' red-light district Pigalle turned into hipster heaven. French police raid far-right party HQ over campaign financing. Macron's UK visit focused on politics, migration issues. EU member states make asylum agreements with other countries."
        },
        {
            "published_date": "2025-07-10T06:22:56",
            "title": "Climate shocks could cost eurozone 5 percent of GDP",
            "author": "",
            "url": "https://www.hurriyetdailynews.com/climate-shocks-could-cost-eurozone-5-percent-of-gdp-211315",
            "url_media": "https://image.hurimg.com/i/hurriyet/75/200x200/686f866b19611fdddfb6a1fa.jpg",
            "country": "TK",
            "language": "en",
            "summary": "Climate disasters could slash up to 5 percent off the eurozone's GDP by 2030. The total shock could be similar to the economic impact of the Global Financial Crisis. Europe would face back-to-back waves of extreme heat, droughts and wildfires starting in 2026 and destructive floods and storms."
        },
        {
            "published_date": "2025-07-10T06:12:47",
            "title": "Global warming of 1.5 degrees doesn't sound extreme but effects can be chilling",
            "author": "The Irish Times",
            "url": "https://article.wn.com/view/2025/07/10/Global_warming_of_15_degrees_doesn_t_sound_extreme_but_effec",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "Time is running out to prevent global warming from breaching the critical 1.5-degree threshold, according to climate scientists. Without rapid action, the world will overshoot the Paris Agreement goal in a matter of years.    .   i   for confidential."
        },
        {
            "published_date": "2025-07-10T05:50:00",
            "title": "Cleveland can lead Midwest's fight against climate change",
            "author": "Crain's Cleveland Business",
            "url": "https://www.crainscleveland.com/crains-forum-climate-change/cleveland-can-lead-fight-against-climate-change-opinion",
            "url_media": "https://www.crainscleveland.com/s3/files/styles/1200x630/s3/GettyImages-2212772279.jpg",
            "country": "US",
            "language": "en",
            "summary": "Cleveland has a temperate climate and abundant freshwater. Last year was the warmest on record. The city is experiencing more extreme weather events, such as last June's heatwave and last August's tornadoes. Climate change is already taking a toll on Clevelanders. The Mayor's Office of Sustainability and Climate Justice has released an updated Climate Action Plan in April. It includes more than 150 actions to make Cleveland a healthy, resilient, thriving green city on a blue lake."
        },
        {
            "published_date": "2025-07-10T05:30:17",
            "title": "Rise in global warming may lead to accelerated increase in heatwave duration: Study",
            "author": "PTI",
            "url": "https://www.mid-day.com/lifestyle/nature-and-wildlife/article/rise-in-global-warming-may-lead-to-accelerated-increase-in-heatwave-duration-study-23584020",
            "url_media": "https://images.mid-day.com/images/images/2025/jul/high-Temperature_d-1752137974742_d.png",
            "country": "IN",
            "language": "en",
            "summary": "As the planet continues to warm, heatwaves will last longer at an accelerating rate. The longest and rarest heatwaves in each region are the ones that show the greatest increases in frequency. Tropical regions are expected to see larger changes compared to temperate regions and heatwaves during summer to prolong more than warm spells during winter."
        },
        {
            "published_date": "2025-07-10T05:20:36",
            "title": "UN report: Older people at particular risk from climate change",
            "author": "DPA",
            "url": "https://www.yahoo.com/news/un-report-older-people-particular-052036636.html",
            "url_media": "https://media.zenfs.com/en/dpa_international_526/6200187216b6cec4bb15fb9020018b9a",
            "country": "US",
            "language": "en",
            "summary": "Elderly people are at particular risk from the consequences of climate change. Annual heat-related deaths among older people have risen by around 85% since the 1990s. The combination of heat and high humidity is particularly dangerous for elderly people. Warming cities are also problematic, especially as the urban population is increasing worldwide."
        },
        {
            "published_date": "2025-07-10T05:17:50",
            "title": "The US Faces More Frequent Extreme Weather Events, But Attitudes And Actions Aren't Keeping Up (Video)",
            "author": "News",
            "url": "https://southfloridareporter.com/the-us-faces-more-frequent-extreme-weather-events-but-attitudes-and-actions-arent-keeping-up-video",
            "url_media": "https://southfloridareporter.com/wp-content/uploads/2025/07/NC.webp",
            "country": "US",
            "language": "en",
            "summary": "Climate change is making extreme weather events more frequent and intense, according to climate scientists and government data. People and governments are living in the past and haven't embraced that extreme weather is now the norm. People should prepare for the nastier future that's in store."
        },
        {
            "published_date": "2025-07-10T05:15:00",
            "title": "Japan Weather Bureau Says 40% Chance of La Nina Emerging in Autumn",
            "author": "Reuters",
            "url": "https://www.usnews.com/news/world/articles/2025-07-10/japan-weather-bureau-says-40-chance-of-la-nina-emerging-in-autumn",
            "url_media": "https://www.usnews.com/object/image/00000197-b27c-d052-a3ff-b27dd7c50000/june-27-pyss-w03.jpg?update-time=1751046429007&size=responsive640",
            "country": "US",
            "language": "en",
            "summary": "Japan's weather bureau says normal weather patterns are continuing. There is a greater, 60% chance of the La Nina phenomenon emerging in the Northern Hemisphere autumn. La Nina is characterised by unusually cold ocean temperatures in the equatorial Pacific Ocean region. It is also linked to floods and drought."
        },
        {
            "published_date": "2025-07-10T05:14:04",
            "title": "Herefordshire farmer says 'nightmare' summer worst since 1976",
            "author": "Tom Edwards",
            "url": "https://www.bbc.com/news/articles/c0l4xk7017zo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/bc7b/live/a7101b20-5cd7-11f0-8ad1-05b0327a56af.png",
            "country": "GB",
            "language": "en",
            "summary": "Martin Williams is a third generation arable farmer in Fownhope, Herefordshire. This summer has been the worst for agriculture since 1976. In 1976, a peak temperature of 35.9C (96.6F) was registered in Cheltenham. In 2025, it was 34.9 C (94.4F) registered in London."
        },
        {
            "published_date": "2025-07-10T05:07:12",
            "title": "China heatwaves boost ice factory sales",
            "author": "France 24",
            "url": "https://www.france24.com/en/live-news/20250710-china-heatwaves-boost-ice-factory-sales",
            "url_media": "https://s.france24.com/media/display/bc772b56-5d4b-11f0-8b4d-005056bfb2b6/w:1280/p:16x9/8dd46c7b3ca436c3d7d28fdd4c661745a03b19c0.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Feichao ice factory's sales have picked up in recent weeks due to the heatwaves sweeping the whole country. The owner, Sun Chao, sells around 100 tonnes of ice a day in May and June and 400 tonnes in July. China has endured a string of extreme summers in recent years due to climate change."
        },
        {
            "published_date": "2025-07-10T05:06:32",
            "title": "Somalia, China Discuss Climate Response",
            "author": "",
            "url": "https://allafrica.com/stories/202507100038.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Chairman of SoDMA, Mohamud Moalim, met Chinese Ambassador Wang Yu in Mogadishu. They discussed increasing Chinese technical and financial support to strengthen Somalia's emergency response systems and rebuild damaged public services across vulnerable regions. Ambassador Yu reaffirmed China's commitment to Somalia's recovery."
        },
        {
            "published_date": "2025-07-10T05:00:55",
            "title": "Conference told that climate action requires early and sustained community engagement",
            "author": "Our Reporter",
            "url": "https://connachttribune.ie/conference-told-that-climate-action-requires-early-and-sustained-community-engagement",
            "url_media": "https://connachttribune.ie/wp-content/uploads/2025/07/CEO-of-Pobal-Anna-Shakespeare.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Five Climate Action projects from partners in Galway were showcased at a National Climate Conference in Dublin recently. The projects were funded under the Community Climate Action Programme. They included Climate Connection, a project to connect and guide communities to decarbonise, Beach and Dunes for Climate Adaption, Feminist Communities for Climate Justice, Retrofit Ready and Green GAA Club Programme."
        },
        {
            "published_date": "2025-07-10T05:00:11",
            "title": "‘Mango madness': why does hot weather correlate with an upswing in violence?",
            "author": "David Hambling",
            "url": "https://www.theguardian.com/news/2025/jul/10/mango-madness-why-does-hot-weather-correlate-with-an-upswing-in-violence",
            "url_media": "https://i.guim.co.uk/img/media/55681c4218b7ff27d556128bafd75a1accbcbc67/202_0_4800_3840/master/4800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b7c37e74ef77425c9a7b8310ef8d05dd",
            "country": "GB",
            "language": "en",
            "summary": "In northern Australia there is a seasonal upswing in violence associated with hot weather. A 10C increase in temperature typically increases the risk of violence by 9%. There are several theories as to why this might be, including the temperature-aggression theory and the routine activity theory."
        },
        {
            "published_date": "2025-07-10T05:00:00",
            "title": "I can't sell my house in France due to climate change - we cut the price by £190k",
            "author": "Sophie Gallagher",
            "url": "https://inews.co.uk/inews-lifestyle/cant-sell-house-france-climate-change-cut-price-190k-3796133",
            "url_media": "https://inews.co.uk/wp-content/uploads/2025/07/comp-1752057072.png?crop=2px%2C0px%2C1196px%2C675px&resize=1200%2C675",
            "country": "GB",
            "language": "en",
            "summary": "Catherine Higginson, 55, has lived in the south-west Landes region of France for 18 years. Her house in Dax, near the Pyrenees mountains, has been on the market for more than nine months. She suspects climate change is the reason why her house hasn't sold. Catherine has had to slash the price of the house by £190,000 to try and sell it."
        },
        {
            "published_date": "2025-07-10T04:46:40",
            "title": "United Way cooling program improves public health and safety",
            "author": "The Galveston Daily News",
            "url": "https://article.wn.com/view/2025/07/10/United_Way_cooling_program_improves_public_health_and_safety",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "Everybody knows Texas summers are getting hotter, and sources say they're getting hotter. It's not debatable, but it might be debatable if it's proved to be the case that they are getting more frequent and hotter. In Texas, it's hot. "
        },
        {
            "published_date": "2025-07-10T04:25:31",
            "title": "Africa CDC launches framework to combat health impact of climate change",
            "author": "Premium Times",
            "url": "https://www.latestnigeriannews.com/p/4371517/africa-cdc-launches-framework-to-combat-health-impact-of-climate-change.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Mr Kaseya said climate change is already wreaking havoc across Africa, driving extreme weather events, shifting disease patterns, food insecurity, and waterborne illnesses. Africa CDC launches framework to combat health impact of climate change, to combat the negative effects of global warming."
        },
        {
            "published_date": "2025-07-10T04:24:42",
            "title": "Resilient but Exposed: Why Pacific Women Need Inclusive and Affordable Insurance",
            "author": "Co E-EDP",
            "url": "https://www.devdiscourse.com/article/other/3497891-resilient-but-exposed-why-pacific-women-need-inclusive-and-affordable-insurance",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_07_2025_10_24_42_4660793.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Women in Pacific Island Countries (PICs) are essential drivers of economic and community life. They work in the informal economy, markets, agriculture, and handicrafts, often without social protection or financial safety nets. Pacific region is prone to natural disasters like cyclones, floods, droughts, and earthquakes. Women represented 70% of adult deaths in the 2009 Samoa and Tonga tsunami. Disaster-linked insurance products for women are virtually nonexistent. Women occupy only 26% of board seats and 20% of CEO roles in Pacific insurance firms."
        },
        {
            "published_date": "2025-07-10T04:20:21",
            "title": "Six month 'in danger' warning for Great Barrier Reef repeated at UN meeting",
            "author": "Jake Evans",
            "url": "https://www.abc.net.au/news/2025-07-10/great-barrier-reef-in-danger-heritage-warning-six-months/105516802",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/0d6eb1b11ece7bfffc320318758d54f7?impolicy=wcms_watermark_news&cropH=1152&cropW=2048&xPos=0&yPos=313&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "UN's World Heritage Committee warns Australia it has six months to avoid a possible \"in-danger\" listing for the Great Barrier Reef from UNESCO. The long-term outlook for the world's largest reef remains \"very poor\". The committee wants Australia to submit an updated report by February 2026 on the state of the reef. Environment Minister Murray Watt is in Paris for the committee's session."
        },
        {
            "published_date": "2025-07-10T03:48:40",
            "title": "Interview: Europe facing earlier, stronger heatwaves -- climate scientist",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/07/10/Interview_Europe_facing_earlier_stronger_heatwaves_climate_s",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "Europe is experiencing earlier and more intense heatwaves due to climate change, according to the EU-funded Copernicus Climate Change Service. These events typically occur in mid-July or August, the agency reports monthly.      Â  "
        },
        {
            "published_date": "2025-07-10T03:20:19",
            "title": "Report critical test of Great Barrier Reef's health",
            "author": "Poppy Johnston",
            "url": "https://au.news.yahoo.com/report-critical-test-great-barrier-032019070.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/HR7ebb38rSP.Vq9BlYirig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aap.com.au/8b00a27a223ed8d7e798ef6b023944ea",
            "country": "US",
            "language": "en",
            "summary": "The Great Barrier Reef's world heritage status is under pressure as the United Nations committee orders a full report on efforts to protect the marine wonder. Climate change remains the biggest threat to the complex ecosystem and the driver of mass coral bleaching events. Land-based runoff from nearby towns, industry and agriculture can further damage the marine landscape. Coastal flooding following natural disasters in Queensland's north has been exacerbating water quality problems."
        },
        {
            "published_date": "2025-07-10T03:20:19",
            "title": "Report critical test of Great Barrier Reef's health",
            "author": "Poppy Johnston",
            "url": "https://www.illawarramercury.com.au/story/9013013/report-critical-test-of-great-barrier-reefs-health",
            "url_media": "https://www.illawarramercury.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4f23df4b-1d41-4a3d-8300-81c5f6eb6370.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "\"The number one thing Australia must do is adopt reef-safe climate policies,\" Dr Schindler says.    \"If Australia wants to protect the reef and keep it off the World Heritage in danger list, it must adopt reef safe climate policies.\" "
        },
        {
            "published_date": "2025-07-10T03:20:19",
            "title": "Report critical test of Great Barrier Reef's health",
            "author": "Poppy Johnston",
            "url": "https://www.newcastleherald.com.au/story/9013013/report-critical-test-of-great-barrier-reefs-health",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4f23df4b-1d41-4a3d-8300-81c5f6eb6370.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The United Nations committee orders a full report on efforts to protect the Great Barrier Reef. Federal Environment Minister Murray Watt is in Paris for the World Heritage Committee's 47th session. The committee adopted a draft decision from UNESCO released in May. It requests Australia to provide a state of conservation report by February. Climate change remains the biggest threat to the complex ecosystem and the driver of mass coral bleaching events. Land-based runoff from nearby towns, industry and agriculture can further damage the marine landscape. Coastal flooding following natural disasters in Queensland's north has been exacerbating water quality problems."
        },
        {
            "published_date": "2025-07-10T03:20:19",
            "title": "Report critical test of Great Barrier Reef's health",
            "author": "Poppy Johnston",
            "url": "https://www.bordermail.com.au/story/9013013/report-critical-test-of-great-barrier-reefs-health",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4f23df4b-1d41-4a3d-8300-81c5f6eb6370.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The Great Barrier Reef's world heritage status is under pressure. The United Nations committee orders a full report on efforts to protect the marine wonder. The report will be presented to the UN Security Council in a few weeks.       .  "
        },
        {
            "published_date": "2025-07-10T03:14:00",
            "title": "UNSW Launches ARC Fire Safety Research Hub",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/unsw-launches-arc-fire-safety-research-hub-1494040",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/def_rota/news2.jpeg",
            "country": "US",
            "language": "en",
            "summary": "ARC Research Hub for Fire Resilience Infrastructure, Assets and Safety Advancements (FRIASA) was opened yesterday at UNSW Sydney. It will focus on turning lab-based knowledge into commercially viable products like the fire-retardant paint developed by UNSW researchers. Australian bushfires have a devastating impact on life, property and infrastructure."
        },
        {
            "published_date": "2025-07-10T03:04:52",
            "title": "Number of New Zealanders leaving for Australia reaches highest level in more than a decade",
            "author": "",
            "url": "https://www.rnz.co.nz/news/national/566546/number-of-new-zealanders-leaving-for-australia-reaches-highest-level-in-more-than-a-decade",
            "url_media": "https://media.rnztools.nz/rnz/image/upload/s--ZqPMUpme--/t_tohu-badge-facebook/v1644475901/4M6JNNJ_copyright_image_270871?_a=BACCd2AD",
            "country": "NZ",
            "language": "en",
            "summary": "In 2024 New Zealand had the largest annual net loss to Australia since 2012. The number of New Zealanders who left for Australia last year was the highest in more than a decade. In May the number of migrants in New Zealand fell to a two-and-a-half year low."
        },
        {
            "published_date": "2025-07-10T02:57:15",
            "title": "Asia warming nearly twice as fast as global average: Report",
            "author": "董欣怡",
            "url": "https://global.chinadaily.com.cn/a/202507/10/WS686f2af2a31000e9a573b40a.html",
            "url_media": "http://img2.chinadaily.com.cn/images/202507/10/686f2af2a31000e98c7d8836.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "Warming trend between 1991 and 2024 was almost double that of the period between 1961 and 1990. 2024 is the warmest or second-warmest year for Asian countries. In 2024, most of the ocean area of Asia was affected by marine heat waves of strong, severe, or extreme intensity. In the High-mountain Asia region, 23 out of 24 glaciers suffered mass loss between 2023 and 2024."
        },
        {
            "published_date": "2025-07-10T02:38:51",
            "title": "June was hottest on record in western Europe",
            "author": "Manal Ahmed",
            "url": "https://www.dawn.com/news/1923162/june-was-hottest-on-record-in-western-europe",
            "url_media": "https://www.dawn.com/_img/social-default.jpg",
            "country": "PK",
            "language": "en",
            "summary": "This past June was the third warmest on record in the world. Europe is warming several times faster than the global average. The previous hottest June was in 2024 and the second hottest was in 2023. Europe experienced back-to-back heatwaves from June 17 to 22 and again from June 30 to July 2."
        },
        {
            "published_date": "2025-07-10T02:32:00",
            "title": "World Heritage Orders Review of Great Barrier Reef",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/world-heritage-orders-review-of-great-barrier-1493523",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=pbs.twimg.com%2Fprofile_images%2F828447353271037952%2FTB5ynuvL_400x400.jpg",
            "country": "US",
            "language": "en",
            "summary": "UNESCO's World Heritage Committee has ordered a full review of Australia's Great Barrier Reef management in 2026. It follows the sixth mass bleaching event in nine years and severe coastal flooding. Australia must submit a full State of Conservation report by February 2026, outlining its progress in implementing the recommendations of the 2022 UNESCO-IUCN Reactive Monitoring Mission. If progress is insufficient, the Reef could be recommended for inclusion on the World Heritage In Danger list."
        },
        {
            "published_date": "2025-07-10T02:30:00",
            "title": "Birding: Create an inviting habitat to attract wild birds to your yard",
            "author": "ERIC MOORE",
            "url": "https://www.dcourier.com/features/birding-create-an-inviting-habitat-to-attract-wild-birds-to-your-yard/article_2b992bb9-1dd9-49a7-827e-9438cc4d141e.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dcourier.com/content/tncms/assets/v3/editorial/2/b9/2b992bb9-1dd9-49a7-827e-9438cc4d141e/68537d8bda504.preview.jpg?crop=926%2C486%2C62%2C0",
            "country": "US",
            "language": "en",
            "summary": "This past Sunday, I had my first fall migrant in the yard — a male rufous hummingbird. It has only been three weeks since the first day of summer and hummingbirds are already moving south. From now until mid-August, hummingbird numbers will continue to climb at backyard feeders as more birds move south."
        },
        {
            "published_date": "2025-07-10T02:25:00",
            "title": "The Ironies of Fooling Ourselves with Catastrophic Climate Destabilization",
            "author": "Frosty Wooldridge",
            "url": "https://newswithviews.com/the-ironies-of-fooling-ourselves-with-catastrophic-climate-destabilization",
            "url_media": "https://newswithviews.com/wp-content/plugins/pdf-print/images/pdf.png.pagespeed.ce.xghmEBSH98.png",
            "country": "US",
            "language": "en",
            "summary": "There was a flash flood in Texas that killed over 110 people. Frosty Wooldridge has written three books on America's overpopulation crisis. He believes that human overpopulation is the main driver of climate change. He thinks that we are adding 83,000,000 (million) more of our species every year, year in and year out."
        },
        {
            "published_date": "2025-07-10T02:23:45",
            "title": "Europe's Scorcher: Heatwave Linked to 2,300 Fatalities",
            "author": "",
            "url": "https://www.archyde.com/europes-scorcher-heatwave-linked-to-2300-fatalities",
            "url_media": "https://s.france24.com/media/display/1ac68198-5d06-11f0-bde9-005056bfb2b6/w:1024/p:16x9/EN-20250709-223109-224212-CS.jpg",
            "country": "US",
            "language": "en",
            "summary": "There were over 2,300 heat-related deaths across 12 European cities due to the recent European heatwave. The increasing frequency and intensity of heatwaves are directly linked to global warming, driven by greenhouse gas emissions. The Polluters Pay Pact is advocating for fossil fuel companies to contribute to the damages caused by climate change."
        },
        {
            "published_date": "2025-07-10T02:17:35",
            "title": "Impact of NOAA Budget Cuts on Your Daily Life",
            "author": "Internewscast",
            "url": "https://internewscast.com/local-news/impact-of-noaa-budget-cuts-on-your-daily-life",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/07/How-NOAA-cuts-could-affect-you.jpg",
            "country": "NG",
            "language": "en",
            "summary": "The proposed bill would further reduce NOAA's budget by $200 million, making the total cuts amount to $2.2 billion. This could force NOAA to shut down all its weather and climate centers. The proposed cuts wouldn't go into effect until 2026."
        },
        {
            "published_date": "2025-07-10T02:14:00",
            "title": "‘Won't survive': Australia ‘falling short' of Great Barrier Reef management goals",
            "author": "Hannah Wilcox",
            "url": "https://www.news.com.au/technology/environment/natural-wonders/wont-survive-australia-falling-short-of-great-barrier-reef-management-goals/news-story/9419f38ac7bf30981e49af62140022e4",
            "url_media": "https://content.api.news/v3/images/bin/174de06793e8957b49e195bb61159227",
            "country": "AU",
            "language": "en",
            "summary": "UNESCO's World Heritage Committee requested a full review of the Great Barrier Reef's management by the Federal Government. Australia's 'lack of progress' in managing the reef could see it placed on the World Heritage in Danger list by early next year. Federal Government must submit a State of Conservation report in February 2026 to outline the progress it has made tackling some of the reef's key threats. The reef supports 64,000 jobs and drives $6.4 billion into the economy each year."
        },
        {
            "published_date": "2025-07-10T02:11:47",
            "title": "Extreme Weather and a Delayed Response: America's Growing Crisis",
            "author": "",
            "url": "https://www.archyde.com/extreme-weather-and-a-delayed-response-americas-growing-crisis",
            "url_media": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-07/250709-texas-floods-vl-137p-256907.jpg",
            "country": "US",
            "language": "en",
            "summary": "Trump-era cuts to disaster preparedness agencies could hamper the nation's ability to respond to climate-fueled disasters. The past year has seen record-breaking wildfires in Hawaii and Canada, devastating floods in Texas and elsewhere, and prolonged heat waves across the globe. Experts emphasize the need for a shift in disaster planning away from relying on historical data and focusing on preparing for worst-case scenarios."
        },
        {
            "published_date": "2025-07-10T02:07:00",
            "title": "David Seymour responds to migration statistics",
            "author": "",
            "url": "https://www.nzherald.co.nz/nz/david-seymour-responds-to-migration-statistics/E6A5AZ7QBGB36BRSKWDXGIIA4I",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/ZHGFPQUHA5E7NAFYQN4NRB5SKI.jpg?auth=bb7a2abb68b0363c1258162ed3e609d95639bb716789d05c5d2ea3c018f62656&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "The number of Kiwis who left for Australia last year was the highest in more than a decade, according to Stats NZ. It comes after Stats NZ said the number of New Zealanders leaving for Australia was highest in over a decade. It was up by 7,000."
        },
        {
            "published_date": "2025-07-10T02:00:10",
            "title": "Australia's massive migration driven demographic shift",
            "author": "Tarric Brooker",
            "url": "https://www.macrobusiness.com.au/2025/07/australias-massive-migration-driven-demographic-shift",
            "url_media": "https://api.macrobusiness.com.au/wp-content/uploads/2025/04/Albo-migration.png",
            "country": "AU",
            "language": "en",
            "summary": "The topic of the total proportion of the population made up by migrants has been making headlines in the United States, Britain and parts of Europe. The U.N. data undercounts the proportion of Australian population that is migrants compared with the ABS data. "
        },
        {
            "published_date": "2025-07-10T02:00:00",
            "title": "Scientists issue warning after observing concerning phenomenon in the Arctic: 'More vulnerable'",
            "author": "Zachary Ehrmann",
            "url": "https://www.msn.com/en-us/weather/topstories/scientists-issue-warning-after-observing-concerning-phenomenon-in-the-arctic-more-vulnerable/ar-AA1IiKly",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Arctic sea ice has plummeted to near-record lows. Melting ice in the Arctic threatens communities worldwide. Scientists are developing advanced monitoring systems to better understand and track the crisis. ESA is preparing to launch the CRISTAL mission in 2027, which will carry the first dual-frequency radar altimeter designed to measure and monitor sea ice thickness."
        },
        {
            "published_date": "2025-07-10T01:49:33",
            "title": "1,500 Europeans died during last week's heat wave due to human-caused climate change, says study",
            "author": "The Post-Standard",
            "url": "https://article.wn.com/view/2025/07/10/1500_Europeans_died_during_last_week_s_heat_wave_due_to_huma",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "About 1,500 people died in last week's European heat wave due to human-caused climate change. They would not have died if it weren't for our burning of oil, coal and gas in the last century.      Â"
        },
        {
            "published_date": "2025-07-10T01:49:32",
            "title": "July 10, 2025: Best photos from around the world",
            "author": "DH Web Desk",
            "url": "https://www.deccanherald.com/world/news-in-pics-july-10-2025-best-photos-from-around-the-world-3623536",
            "url_media": "https://media.assettype.com/deccanherald%2F2025-07-10%2Fcmc8kt1k%2Ffile81ft0pfd05f1mqbzc7rj.jpg?rect=0%2C45%2C1200%2C630&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "A drone view shows the Maipo River bed in the Chilean Andes, where glaciers are facing the risk of rising temperatures. Britain's Prime Minister Keir Starmer and his wife Victoria Starmer meet with France's President Emmanuel Macron at Downing Street in London, July 9, 2025. Japan's government issues a heatstroke alert in Tokyo and other prefectures."
        },
        {
            "published_date": "2025-07-10T01:20:02",
            "title": "Geese's Financial Woes and the Soundtrack to Now",
            "author": "",
            "url": "https://www.archyde.com/geeses-financial-woes-and-the-soundtrack-to-now",
            "url_media": "https://thefader-res.cloudinary.com/private_images/c_limit,w_1024/c_crop,h_512,w_983,x_38,y_0,f_auto,q_auto:eco/SONGS_YOU_NEED_TWITTER_14_u05pog/SONGS_YOU_NEED_TWITTER_14_u05pog.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is an unexpected economic downturn in the goose population. Geese are struggling with rising costs, dwindling resources, and changing economic landscape. The Anser (Grey and white) and Branta (black) genera are more susceptible to the economic downturn than the Greylag Goose (grey and white). Geese can't open a bank account, but there are practical ways that can improve their financial outlook."
        },
        {
            "published_date": "2025-07-10T01:15:00",
            "title": "Melting Glaciers Could Lead to More Frequent and Explosive Volcanic Eruptions: Study",
            "author": "Cristen Hemingway Jaynes",
            "url": "https://www.ecowatch.com/melting-glaciers-volcano-eruptions.html",
            "url_media": "https://www.ecowatch.com/wp-content/uploads/2025/07/iceland-volcanoes.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Ice loss from melting glaciers could cause pressure to be released from volcanic magma chambers located deep underground. This makes volcanic eruptions more frequent and powerful, according to new research conducted in the Chilean Andes. Since the 1970s, scientists have been aware of the link between increased volcanic activity and retreating glaciers in Iceland. This is among the first studies to examine this type of event in continental volcanic systems."
        },
        {
            "published_date": "2025-07-10T00:56:00",
            "title": "Last Chance For Real Climate Action To Save Great Barrier Reef From In Danger Listing",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/last-chance-for-real-climate-action-to-save-1493944",
            "url_media": "https://greens.org.au/sites/default/files/styles/alt_box/public/2021-03/web_20-10-31%20Election%20Party-32_1.jpg?itok=1c7u0LLt",
            "country": "US",
            "language": "en",
            "summary": "UNESCO gave Australia 6 months to take action to avoid an In Danger listing for the Great Barrier Reef. The World Heritage Committee called for strong climate targets that would limit global warming to 1.5°C. The Greens say this means a 2035 target of net zero, not approving any new coal or gas projects, and rescinding the North West Shelf gas plant extension."
        },
        {
            "published_date": "2025-07-10T00:45:52",
            "title": "WA weather: Parts of regional Western Australia experience below freezing temperatures as winter chill hits",
            "author": "Perth Now",
            "url": "https://thewest.com.au/news/weather/wa-weather-parts-of-regional-western-australia-experience-below-freezing-temperatures-as-winter-chill-hits-c-19308426",
            "url_media": "https://images.thewest.com.au/publication/C-19308426/eb0f28be1d3f06cd13e7141d8bda4c957975ff78-16x9-x0y209w4000h2250.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Temperatures dropped as low as -2.6C in the Wheatbelt this morning. Southern Cross Airport experienced the lowest temperatures in the State at 7.20am. In Cunderdin, early risers experienced the chill of -0.8C at 5.10am, in the Great Southern it was just 0.9C at 7:05am and in Kalgoorlie-Boulder it was 0.3C. In Gingin, the coldest part of the metropolitan area, it was 3.9 degrees. The Bureau's outlook for winter predicted above average maximum temperatures across most of the country and 'unusually high' temperatures in WA."
        },
        {
            "published_date": "2025-07-10T00:45:52",
            "title": "Parts of WA shiver through below freezing temperatures",
            "author": "",
            "url": "https://www.perthnow.com.au/wa/weather/wa-weather-parts-of-regional-western-australia-experience-below-freezing-temperatures-as-winter-chill-hits-c-19308426",
            "url_media": "https://images.perthnow.com.au/publication/C-19308426/eb0f28be1d3f06cd13e7141d8bda4c957975ff78-16x9-x0y209w4000h2250.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Temperatures dropped as low as -2.6C in the Wheatbelt this morning. Southern Cross Airport experienced the lowest temperatures in the State at 7.20am. In Cunderdin, early risers experienced the chill of -0.8C at 5.10am, in the Great Southern it was 0.9C and in Kalgoorlie-Boulder it was - 0.3C. Yesterday, Perth recorded its coldest start to the day in two years with 3.2C."
        },
        {
            "published_date": "2025-07-10T00:13:00",
            "title": "Scientists travel to Antarctica to track ocean temperatures",
            "author": "",
            "url": "https://www.skynews.com.au/australia-news/weather/scientists-travel-to-antarctica-to-track-ocean-temperatures/video/129adc006fb1ad107f37ec831618f00e",
            "url_media": "https://content.api.news/v3/images/bin/59866a3c8ff125458f4e913a0e67f563",
            "country": "AU",
            "language": "en",
            "summary": "There is a climate warning in the Southern Ocean. Australian scientists travelled to Antarctica to better understand the effects of climate change. They travelled to Denham Glacier earlier this year. The area where the glacier meets the water has retreated significantly in the past few decades. This could cause global sea levels to rise by 1.5 meters."
        },
        {
            "published_date": "2025-07-10T00:10:18",
            "title": "Melting ice will strengthen the monsoon in northern Australia – but cause drier conditions north of the Equator",
            "author": "Corey J. A. Bradshaw",
            "url": "https://au.news.yahoo.com/melting-ice-strengthen-monsoon-northern-001018190.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Kiquo13cvcGouz7KPwUVWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_conversation_au_articles_517/490e5ffb7c6ef815a51738740c37dd0a",
            "country": "US",
            "language": "en",
            "summary": "As the world gets hotter, the Indo-Australian monsoon will intensify and northern Australia will get wetter. This is consistent with research suggesting the East Asian monsoon could weaken, threatening agriculture and nature in heavily populated countries. Girraween Lagoon on the outskirts of Darwin in the Northern Territory kept a detailed environmental record over a long period."
        },
        {
            "published_date": "2025-07-10T00:01:27",
            "title": "Number of New Zealanders leaving for Australia in 2024 highest in more than a decade",
            "author": "Cameron Smith",
            "url": "https://www.nzherald.co.nz/business/number-of-new-zealanders-leaving-for-australia-in-2024-highest-in-more-than-a-decade/VPFOXI23SFDWLNIIHKYPID32BI",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/SPG6AFF5A5AQ3CPDOX536Q24YY.JPG?auth=b5224152a4dc5fa804e71d2e1092dfb2ac18f9e282ad80952ee4dd1505b583d0&width=1200&height=675&quality=70&focal=2446%2C2153&smart=false",
            "country": "NZ",
            "language": "en",
            "summary": "The number of New Zealanders who left for Australia last year was the highest in more than a decade. New Zealand recorded a net migration loss of 30,000 people departing to Australia in the year ended December 2024. This comprised 17,300 migrant arrivals from Australia to New Zealand."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Extreme heatwave triggers fires, casualties across Italy as temperatures begin to recede",
            "author": "刘小卓",
            "url": "https://www.chinadaily.com.cn/a/202507/10/WS686f15f6a31000e9a573b322.html",
            "url_media": "http://img2.chinadaily.com.cn/images/202507/10/686f15f6a31000e98c7d8430.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "The heatwave that swept across Europe in recent weeks has taken a heavy toll on Italy, triggering wildfires, injuring dozens, and contributing to a surge in heat-related deaths. The recent heatwave marked the first major climate-related emergency in the country this year. 21 out of Italy's 27 largest metropolitan areas were under red alert."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Interview: Europe facing earlier, stronger heatwaves -- climate scientist",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250710/e5228a88860a4fec8f388fa3a23e1f65/c.html",
            "url_media": "https://english.news.cn/20250710/e5228a88860a4fec8f388fa3a23e1f65/20250710e5228a88860a4fec8f388fa3a23e1f65_XxjidwE007014_20250710_CBMFN0A001.JPG",
            "country": "CN",
            "language": "en",
            "summary": "Europe is experiencing earlier and more intense heatwaves due to climate change, according to Julien Nicolas, a senior scientist at the EU-funded Copernicus Climate Change Service. June was a record-hot June in Western Europe, with average temperatures 2.81 degrees above the 1991-2020 norm. Mediterranean Sea remains a climate change hotspot, with a more rapid and persistent warming trend."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "New Zealand sees largest net migration loss to Australia since 2012",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250710/6320d0f7b23b4ad697118e2f9604b253/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "New Zealand saw a net migration loss of 30,000 people to Australia in the year ending December 2024. New Zealand citizens led trans-Tasman migration in 2024, making up 85 percent of departures to Australia and 67 percent of arrivals. Of those migrating to Australia, 35 percent were born overseas."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Net Migration Loss To Australia In 2024",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/07/10/Net_Migration_Loss_To_Australia_In_2024",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Net migration loss from New Zealand to Australia in 2024 was similar to the loss of 29,400 in 2023, according to the international migration statistics spokesperson Sarah Drake. The net migration loss in 2024 is expected to be about 1.5 million people, compared to 1.7 million people in 2024."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Earth's Reckoning: Geophysical and geopsychological crises shaping our legacy",
            "author": "International Business Times",
            "url": "https://article.wn.com/view/2025/07/10/Earths_Reckoning_Geophysical_and_geopsychological_crises_sha",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "The Earth is on a trajectory toward catastrophe unless we act decisively. Every fraction of a degree matters. The geophysical upheaval of a warming world and the environmental upheaval of climate change are the main factors in the future of the Earth.    .  "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Trump budget cuts threaten accuracy of hurricane forecasts, scientists warn",
            "author": "The Eagle-Tribune",
            "url": "https://article.wn.com/view/2025/07/10/Trump_budget_cuts_threaten_accuracy_of_hurricane_forecasts_s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration's proposed budget cuts to weather programs could damage the weather programs. The president wants to cut the budget for weather programs by about $1.5 billion. The proposal is not likely to be accepted by Congress, as many have warned.  "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "New Zealand sees largest net migration loss to Australia since 2012",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/07/10/New_Zealand_sees_largest_net_migration_loss_to_Australia_sin_v",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New Zealand saw a net migration loss of 30,000 people to Australia in the year ending December 2024. This figure was similar to the loss of 29,400 in 2023. It is the highest annual net loss since 2012, though it remains the highest since 2012."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "June was hottest on record in western Europe",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/07/10/June_was_hottest_on_record_in_western_Europe",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Western Europe experienced its hottest June on record last month. Globally, this past June was the third warmest on record. In a warming world, heatwaves are likely to become more frequent, more intense and impact more people across Europe, according to Copernicus."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Asia warming nearly twice as fast as global average: Report",
            "author": "China Daily",
            "url": "https://article.wn.com/view/2025/07/10/Asia_warming_nearly_twice_as_fast_as_global_average_Report",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The warming trend between 1991 and 2024 was almost double that of the period between 1961 and 1990. 2024 is the warmest or second-warmest year for Asian countries, with widespread and prolonged heat waves. The melting of glaciers affects sea level, regional water cycles and the occurrence of local hazards."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Number of Kiwis leaving for Oz in 2024 highest in more than a decade",
            "author": "Newstalk ZB",
            "url": "https://article.wn.com/view/2025/07/10/Number_of_Kiwis_leaving_for_Oz_in_2024_highest_in_more_than_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The number of New Zealanders who left for Australia last year was the highest in more than a decade. New Zealand recorded a net migration loss of 30,000 people departing to Australia in the year ended December 2024. This comprised 17,300 migrant arrivals from Australia to New Zealand and the loss is the largest for a calendar year since 2012."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "China heatwaves boost ice factory sales",
            "author": "Hector RETAMAL",
            "url": "https://www.dailygazette.com/news/national/china-heatwaves-boost-ice-factory-sales/article_1935493d-512d-5750-8424-e68e239535af.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/a/82/a82b1abe-7af5-5c8d-8753-8e3156547a1b/686f4cf8cd34e.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "In Feichao ice factory on the outskirts of Hangzhou, workers use tongs to slide large blocks of frosty white ice along a metal track into a refrigerated truck. Sales have picked up in recent weeks, boosted by heatwaves sweeping the whole country."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "China heatwaves boost ice factory sales",
            "author": "Hector RETAMAL",
            "url": "https://starlocalmedia.com/news/national/china-heatwaves-boost-ice-factory-sales/article_86a3bb78-94b0-5995-9ac4-0f08b2868eb7.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/starlocalmedia.com/content/tncms/assets/v3/editorial/a/12/a12bde19-12b3-530c-9e84-40b67e55ac6e/686f4cac5132b.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "In Feichao ice factory on the outskirts of Hangzhou, workers use tongs to slide large blocks of frosty white ice along a metal track into a refrigerated truck. Sales have picked up in recent weeks, boosted by heatwaves sweeping the whole country."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "UNEP warns of climate change risks to older persons, ecosystems",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/07/10/UNEP_warns_of_climate_change_risks_to_older_persons_ecosyste_d",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather events linked to global warming have exposed older persons and fragile ecosystems to significant risks, the UNEP warned in a new report released Thursday in Nairobi, the Kenyan capital. UNEP's Frontiers Report is in its seventh edition and calls on policymakers to take action to protect people, nature and economies."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "UN report sounds alarm on climate health risks for world's aging population",
            "author": "Anadolu Agency",
            "url": "https://article.wn.com/view/2025/07/10/UN_report_sounds_alarm_on_climate_health_risks_for_worlds_ag",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Older people face increasing health risks from extreme heat as climate change accelerates, UNEP warned Thursday in its Frontiers 2025 report. Rising temperatures, melting glaciers, and flooding are putting both people and ecosystems under growing strain, according to the new edition of the report."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Blockbuster Lennon Miller transfer 'announcement' teased as Motherwell boss reveals what star told him in ...",
            "author": "Daily Record",
            "url": "https://article.wn.com/view/2025/07/10/blockbuster_lennon_miller_transfer_aposannouncement_apos_tea",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "Miller is expected to leave this summer. Jens Berthel Askou admits interest is increasing in the player and he is a target for Askou's club.      Â   in Miller's contract is up this summer, but he is not expected to sign. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Measuring how—and where—Antarctic ice is cracking with new data tool",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/07/10/Measuring_how_and_where_Antarctic_ice_is_cracking_with_new_d",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A total collapse of the Thwaites Glacier could lead to 11 feet of sea-level rise, according to scientists. Thwaite Glacier is 80 miles wide and is the widest in the world.      Â   in terms of land area."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Reader's View: Fix global warming now",
            "author": "Duluth News Tribune",
            "url": "https://article.wn.com/view/2025/07/10/Readers_View_Fix_global_warming_now",
            "url_media": "https://article.wn.com/view/2025/07/10/[]",
            "country": "US",
            "language": "en",
            "summary": "I am concerned about people making global warming worse and killing many animals. I think humans are some of the worst species. I am not saying that about everyone, but some people are worse than others. I'm not saying everyone is better than others, just some people."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Scorched Earth Britain: Dramatic images show drought-hit England wilting in 33C heatwave as government extends ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/07/10/Scorched_Earth_Britain_Dramatic_images_show_droughthit_Engla",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Grass has become parched in Britain due to the lack of rain. 16million people could face a hosepipe ban amid the summer's third heatwave. Landscapes have turned from green to brown across the country following England's hottest spring on record and driest in over a century."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Global grill: What other countries throw on the fire when it's hot outside",
            "author": "The Courier Times",
            "url": "https://article.wn.com/view/2025/07/10/Global_grill_What_other_countries_throw_on_the_fire_when_it__v",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The United States is not the only country to throw on the grill when it's hot outside. From Argentina's to Argentina's, here's what other countries do when the weather gets hot.    the post Global grill: What other countries throw the grill on the fire when it gets hot outside appeared first on CNN.com."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Climate Change Poses Heat Risks for Elderly Populations",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/07/10/Climate_Change_Poses_Heat_Risks_for_Elderly_Populations",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Older adults are facing growing health dangers from intensifying heat waves, according to the Frontiers 2025 report released Thursday by the UN Environment Programme (UNEP).       .   \"Frontiers 2025\" is a report released by UNEP.  "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Jewish Australians feel 'very unsafe' after rise in attacks: envoy",
            "author": "News Graphic",
            "url": "https://article.wn.com/view/2025/07/10/Jewish_Australians_feel_very_unsafe_after_rise_in_attacks_en_y",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Jewish Australians feel unsafe after a surge in threats, vandalism and violence since the outbreak of hostilities in Gaza, Australia's antisemitism envoy Jillian Segal said Thursday.    Jillian Segal is Australia's envoy for the fight against anti-Semitism. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Jewish Australians feel unsafe after rise in attacks: antisemitism envoy",
            "author": "The Courier Times",
            "url": "https://article.wn.com/view/2025/07/10/Jewish_Australians_feel_unsafe_after_rise_in_attacks_antisem",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Jewish Australians feel unsafe after a surge in threats, vandalism and violence since the outbreak of hostilities in Gaza, Australia's antisemitism envoy Jillian Segal said Thursday.    Jillian Segal is Australia's envoy for the fight against anti-Semitism. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Last week's heatwave killed 2,300 people across Europe: Study",
            "author": "Press TV",
            "url": "https://article.wn.com/view/2025/07/10/last_week_x2019s_heatwave_killed_2300_people_across_europe_s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "According to European climate scientists, human-caused climate change was responsible for approximately 1,500 deaths during last week's deadly heatwave across Europe. The scientists used peer-reviewed methods to analyze mortality data and temperature records from 12 major cities. They found that the people who died because of climate change would not have died if it had not been for our burning of oil, coal, and gas in the last century."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Many City of Edmonton buildings highly vulnerable to climate risks, report finds",
            "author": "CBC",
            "url": "https://article.wn.com/view/2025/07/10/Many_City_of_Edmonton_buildings_highly_vulnerable_to_climate",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hundreds of municipal buildings in Edmonton are at risk to climate-related hazards, according to a report done by consultants. The report hasn't been shared with city council yet.       \"There are many municipal buildings that are highly vulnerable and at risk\" in Edmonton."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Extreme heat and drought are Switzerland's top climate change risks",
            "author": "Swissinfo",
            "url": "https://article.wn.com/view/2025/07/10/Extreme_heat_and_drought_are_Switzerlands_top_climate_change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Swiss authorities have identified dozens of climate-related risks in the coming decades. The top threats are heat and drought related, according to a recent report by the Federal Office of the Swiss authorities. The report is titled \"Climate-related Risks in the Swiss Alps\"."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Tennessee summers are getting hotter, and some towns are more vulnerable to adverse health effects",
            "author": "Victoria Advocate",
            "url": "https://article.wn.com/view/2025/07/10/Tennessee_summers_are_getting_hotter_and_some_towns_are_more_j",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tennesseans are feeling extra heated about the weather this year because summers are up to 3 degrees Fahrenheit warmer on average than they were in 1970, according to a temperature data analysis by a nonprofit group.       in 1970 summers in the state were 3 degrees warmer than in 1970."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Guilt Trip: pilots torn between flight and the fight for the planet",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/10/Guilt_Trip_pilots_torn_between_flight_and_the_fight_for_the_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "George Hibberd and Todd Smith are commercial pilots. They are torn between their childhood ambitions and the impact of their industry on the world beneath them. They decide to take drastic steps to address the climate crisis.   Â      in this video."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Climate Change Is Making Extreme Rain Events Like Texas' More Common — And More Intense",
            "author": "Huffington Post",
            "url": "https://article.wn.com/view/2025/07/10/Climate_Change_Is_Making_Extreme_Rain_Events_Like_Texas_More",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "\"These are roughly one-in-1,000-year events and would be extremely rare in the absence of human-caused warming,\" one climate scientist says. \"They would be roughly one in 1,000 years if there was no climate change.\""
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Images show drought-hit England amid heatwave",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/07/10/Images_show_droughthit_England_amid_heatwave_Daily_Mail_Onli",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Grass has become parched in Britain due to the lack of rain. 16million people could face a hosepipe ban amid the summer's third heatwave. Landscapes have turned from green to brown across the country following England's hottest spring from March to May on record and driest in over a century."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Himachal floods: How can Himalayan region safeguard its people, heritage, ecosystems from climate change?",
            "author": "Indian Express",
            "url": "https://article.wn.com/view/2025/07/10/Himachal_floods_How_can_Himalayan_region_safeguard_its_peopl",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Addressing the escalating threat of climate-induced floods in the U.N. conference on climate change is a must for the conference on global warming and climate change adaptation in the United Nations (UNICEF) to be held in Paris on November 25th. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Trump tariffs unsettle SA farmers as Africa eyes agricultural growth",
            "author": "Moneyweb",
            "url": "https://article.wn.com/view/2025/07/10/Trump_tariffs_unsettle_SA_farmers_as_Africa_eyes_agricultura",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Western Cape in particular could face serious disruption due to the impact of the drought on agricultural exports, according to the government.    The overall economic impact on agriculture is modest, but the Western Cape could be hit hard. It could have a serious impact on the economy. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Heat deaths could rise up to 50-fold by 2070s due to climate change",
            "author": "London Evening Standard",
            "url": "https://article.wn.com/view/2025/07/10/Heat_deaths_could_rise_up_to_50fold_by_2070s_due_to_climate__s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " temperature rises on ageing population in England and Wales, according to the analysis.    in the UK and in the rest of the world.  in North America and in Australia and in North Africa. in the South Africa and in parts of the UK. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Heatwaves could cause 34,000 deaths per YEAR in the UK by 2070, scientists predict - ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/07/10/Heatwaves_could_cause_34000_deaths_per_YEAR_in_the_UK_by_207",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The number of people dying from unbearable heat in England and Wales could increase fiftyfold because of climate change, experts warn. Scientists analysed the impacts of 15 different scenarios over the next 50 years and found different levels of global warming with varying levels of adaptation, an aging, and a changing climate."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Expert warns of rising heatwave, wildfire risks in Spain",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/07/10/Expert_warns_of_rising_heatwave_wildfire_risks_in_Spain_v",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "People in Spain must be aware of climate-related risks, says Javier Martin-Vide, professor of physical. He warns of intense heatwaves and especially fierce wildfires driven by rising temperatures, which are favorable for the development of large wildfires in the future. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Reform UK councillor calls man-made global warming a",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/07/10/Reform_UK_councillor_calls_manmade_global_warming_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bert Bingham is a cabinet member for transport and environment at Nottinghamshire County Council. He made the comments during a public meeting on Thursday. He claims data is manipulated and people have been affected by global warming. He has been criticised by Reform UK for his comments."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "China heatwaves boost ice factory sales",
            "author": "Knoxville Daily Sun",
            "url": "https://article.wn.com/view/2025/07/10/China_heatwaves_boost_ice_factory_sales_qb",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Feichao ice factory's sales have picked up in recent weeks, boosted by heatwaves sweeping the whole country as summer sets in. In the spring, autumn and winter, a higher temperature of two to three degrees doesn't have a big impact on the sales."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Faster Earth Rotation on Three Summer Days Could Shift How We Track Time",
            "author": "Greek Reporter",
            "url": "https://article.wn.com/view/2025/07/10/Faster_Earth_Rotation_on_Three_Summer_Days_Could_Shift_How_W",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world is spinning faster for 3 days straight this summer. Earth completed its rotation slightly quicker on July 9 and is expected to do so again on July 22 and August 5. The Earth rotates once per day, divided by 86,400, that's one second."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "‘Urgent action': Australian antisemitism report proposes university funding cuts, deportations",
            "author": "Virtual Jerusalem",
            "url": "https://article.wn.com/view/2025/07/10/8216urgent_action_8217_australian_antisemitism_report_propos",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The plan is led by Australia's special envoy on antisemitism, Jillian Segal. It responds to a sharp rise in anti-Semitic incidents in Australia and worldwide.       in the last few years, there has been a rise in incidents of anti-Semitism."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Climate change is a local issue – here's what's happening in every part of MD",
            "author": "Maryland Daily Record",
            "url": "https://article.wn.com/view/2025/07/10/Climate_change_is_a_local_issue_here_s_what_s_happening_in_e",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Maryland faces ghost forests, crop loss, flooding and heat waves as climate change reshapes regions from Baltimore to the Eastern Shore. The state's population is expected to grow by 2.5 million people by the year's end, according to the U.S. Census Bureau."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "PR No. 126 Flash Flood & GLOF Alert from GB & upper KP Islamabad: July 10, 2025 (Ministry of Information and Broadcasting of the Islamic Republic of Pakistan)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/07/10/PR_No_126_Flash_Flood_GLOF_Alert_from_GB_upper_KP_Islamabad_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There has been a significant increase in temperature in the northern regions of Pakistan, particularly in GB and upper KP. This has resulted in the melting of glaciers and snow cover, thereby increasing river flows. The areas that require vigilant attention are the GB and KP. "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Severe storms drench East Coast",
            "author": "Good Morning America",
            "url": "https://www.goodmorningamerica.com/video/123637716",
            "url_media": "https://s.abcnews.com/images/GMA/250710_gma_russom_storms2_0709_hpMain_16x9_1600.jpg",
            "country": "US",
            "language": "en",
            "summary": "More than 14 million people remain under flood threat from the Carolinas to the Mid-Atlantic. Heavy rain and wind occurred across the I-95 corridor, especially along the Carolines-to-Mid-Atlantic route.      Â "
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "MSNBC: Stop Blaming People for Texas Floods, Blame Climate Change",
            "author": "Lucas Escala Intern",
            "url": "https://newsbusters.org/blogs/nb/lucas-escala/2025/07/10/msnbc-stop-blaming-people-texas-floods-blame-climate-change",
            "url_media": "https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-07/Chris%20Jansing%20Reports-12_18_55%20pm-2025-07-09-0.jpg?itok=HT38W42H",
            "country": "US",
            "language": "en",
            "summary": "MSNBC's Chris Jansing talked about the Texas floods on her show Wednesday afternoon. She and her guests blamed climate change for the floods. Michael Mann, the director of the Penn Center for Science, Sustainability, and the Media, said climate change has made the events worse and made them more deadly."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Bull sharks linger in warming Sydney waters",
            "author": "SAEED KHAN",
            "url": "https://www.dailygazette.com/news/national/bull-sharks-linger-in-warming-sydney-waters/article_ef1cf1ec-bdad-514e-97b0-83b1bd2e86e7.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/b/84/b84b63dd-e044-51fe-aaaf-786372d8463c/687073dc146ac.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Bull sharks are lingering off Sydney's beaches longer each year as oceans warm. The predators are migratory, swimming north in winter when Sydney's long-term ocean temperatures dip below 19 degrees Celsius to bask in the balmier waters off Queensland. Researchers predict they may one day stay all year."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Vermont updates its Climate Action Plan",
            "author": "Keith Whitcomb",
            "url": "https://www.timesargus.com/news/local/vermont-updates-its-climate-action-plan/article_643fc976-95e3-5449-89fa-5dcf7014c9ee.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/timesargus.com/content/tncms/custom/image/b304aa08-5df8-11e8-b455-b382f4872e89.jpg?crop=435%2C435%2C0%2C53&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Climate Action Plan, adopted four years ago, was updated July 1. The plan was developed by the 23-member Vermont Climate Council, which includes many state administrative heads. There were several public information sessions and more than 1,000 comments were submitted. Flood resiliency in particular has been on the minds of Vermonters since the 2023 and 2024 floods that devastated the central part of the state."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "European heatwave caused 2,300 deaths in 10 days: study",
            "author": "New Age Desk",
            "url": "https://www.newagebd.net/post/europe/269693/european-heatwave-caused-2300-deaths-in-10-days-study",
            "url_media": "https://outspoken.newagebd.com/files/img/202507/cc66b8815cb1bbbaf16a5be8b9060162_og.jpg",
            "country": "BD",
            "language": "en",
            "summary": "2,300 people are likely to have died of heat-related causes across 12 European cities during a severe heatwave that ended last week. Two-thirds of the deaths are directly linked to climate change. The study focused on the 10-day period between June 23 and July 2. It covered 12 cities with a combined population of more than 30 million."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Heat is changing the Valley, and policy keeps pushing it higher",
            "author": "Ross D. Franklin",
            "url": "https://www.yourvalley.net/stories/heat-is-changing-the-valley-and-policy-keeps-pushing-it-higher,598548",
            "url_media": "https://gamma.creativecirclecdn.com/yourvalley/original/20240326-144806-Downtown%20Phoenix%20air%20quality.jpg",
            "country": "US",
            "language": "en",
            "summary": "Elaine Joyal is a botanist and an ethnoecologist living in Tempe, Arizona. She is concerned about climate change and the urban heat island effect. She will testify at the Extreme Weather People's Hearing at South Mountain Community College on June 26th."
        },
        {
            "published_date": "2025-07-10T00:00:00",
            "title": "Sullivan Schulte: Wind needed to address future energy needs",
            "author": "Linda Sullivan Schulte",
            "url": "https://baytobaynews.com/dover/stories/sullivan-schulte-wind-needed-to-address-future-energy-needs,238134",
            "url_media": "https://baytobaynews.com/images/favicons/favicon-v2.ico",
            "country": "US",
            "language": "en",
            "summary": "In April 2017, President Donald Trump implemented the 'America First' executive order, designed to encourage oil and gas drilling in the Atlantic Ocean. It poses significant threats to nearly every coastal community in the U.S. and to the health and economic resilience of millions of people, wild animals and watersheds."
        }
    ]
}