{
    "status": "ok",
    "total_articles": 162,
    "articles": [
        {
            "published_date": "2025-07-03T23:48:30",
            "title": "ECOWAS Partners with Nigerian Agency to Boost Climate Resilience",
            "author": "Business",
            "url": "https://www.newsghana.com.gh/ecowas-partners-with-nigerian-agency-to-boost-climate-resilience",
            "url_media": "https://newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana-1.png",
            "country": "GH",
            "language": "en",
            "summary": "The Economic Community of West African States (ECOWAS) has formalized a strategic partnership with Nigeria's Meteorological Agency (NiMet) to strengthen regional disaster preparedness and climate security. The collaboration, advanced during a July 1, 2025, meeting in Abuja, targets enhanced early-warning systems and humanitarian coordination across West Africa."
        },
        {
            "published_date": "2025-07-03T23:08:00",
            "title": "Wake-up call for France as climate experts push for new action on emissions",
            "author": "RFI",
            "url": "https://www.modernghana.com/news/1414081/wake-up-call-for-france-as-climate-experts-push.html",
            "url_media": "https://cdn.modernghana.com/images/content/732025103614-qvmxpcb543-000-64d46q2.jpg",
            "country": "GH",
            "language": "en",
            "summary": "France's top climate advisory body has called for renewed urgency in tackling climate change. Political instability and stop-start funding are holding back the changes needed to adapt to a fast-warming world. The country is not on track to reach carbon neutrality by 2050 and is heating up faster than the global average."
        },
        {
            "published_date": "2025-07-03T22:26:50",
            "title": "The crippling of forecasting: John Morales on severe cuts to NOAA's budget as hurricane season carries on",
            "author": "John Morales",
            "url": "https://www.nbcmiami.com/weather/hurricane-season/the-crippling-of-forecasting-john-morales/3651432",
            "url_media": "https://media.nbcmiami.com/2025/07/GettyImages-2217127747.jpg?quality=85&strip=all&resize=1200%2C675",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration wants to cut NOAA's budget by 75% as part of its 2026 budget proposal. NOAA's office of Oceanic and Atmospheric Research would disappear. The Atlantic Oceanographic & Meteorological Laboratory studies oceans and human health, how the ocean changes over time and its relation to climate, and hurricanes."
        },
        {
            "published_date": "2025-07-03T22:23:58",
            "title": "Looming National Security Threat",
            "author": "Sajid Salamat",
            "url": "https://dailytimes.com.pk/1328758/looming-national-security-threat",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/07/f0f326be-8d45-4019-99f5-b6f6e85d2a78.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan is one of the most vulnerable nations to the effects of climate change. Pakistan has suffered economic losses estimated at nearly $100 billion due to climate-related disasters and shifts. Climate change impacts 8% of Pakistan's GDP and could reach 30% by 2050. Pakistan must prioritise sustainable water and energy management and invest in resilient infrastructure."
        },
        {
            "published_date": "2025-07-03T21:39:19",
            "title": "Victoria can expect nothing but sun and heat in this week's forecast",
            "author": "Curtis Blandy",
            "url": "https://victoriabuzz.com/2025/07/victoria-can-expect-nothing-but-sun-and-heat-in-this-weeks-forecast",
            "url_media": "https://victoriabuzz.com/wp-content/uploads/2019/08/sun-summer-pexels.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Environment Canada's latest forecast says Victoria can expect nothing but sun over the weekend and through next week. On Friday, July 4th, there will be a high temperature of around 22°C. On Saturday, the temperature is expected to dip a bit to 20°C, but still not a cloud in the sky. On Sunday, as Phillips Backyard closes until August's events, the high is forecasted to jump back up to 23°C and will remain sunny. Monday's high is predicted to be 25°C with Tuesday peaking at a scorching 27 °C. From Friday, through to next Wednesday, overnight lows are expected to be between 12 °C and 14"
        },
        {
            "published_date": "2025-07-03T20:52:08",
            "title": "Citizens needed for the Citizen Climate Advisory Committee",
            "author": "Jennifer Cabrera",
            "url": "https://alachuachronicle.com/citizens-needed-for-the-citizen-climate-advisory-committee",
            "url_media": "https://alachuachronicle.com/wp-content/uploads/2025/07/unnamed-2025-07-03T164955.118.jpg",
            "country": "US",
            "language": "en",
            "summary": "There are five vacancies on the Citizen Climate Advisory Committee (CCAC) in Alachua County, Florida. The deadline to apply is July 14, 2025. The CCAC advises the Joint Water and Climate Policy Board on bold and innovative climate adaptation and mitigation strategies, policies and target goals."
        },
        {
            "published_date": "2025-07-03T20:29:45",
            "title": "These Cod Have Been Shrinking Dramatically for Decades. Now, Scientists Say They've Solved the Mystery",
            "author": "Amber X. Chen",
            "url": "https://www.smithsonianmag.com/smart-news/these-cod-have-been-shrinking-dramatically-for-decades-now-scientists-say-theyve-solved-the-mystery-180986920",
            "url_media": "https://th-thumbnailer.cdn-si-edu.com/PCE0rS-3NYcdsqNPsfLHLi-30eM=/fit-in/1200x0/filters:focal(512x346:513x347)/https%3A%2F%2Ftf-cmsv2-smithsonianmag-media.s3.amazonaws.com%2Ffiler_public%2Fe5%2F5f%2Fe55fb2ef-20d0-4090-ab31-532e5a04c554%2Fcod_image.jpg",
            "country": "US",
            "language": "en",
            "summary": "Eastern Baltic cod grow to much smaller sizes than they did just 30 years ago. Overfishing altered their genes, according to new research. Regulators banned fishing of eastern Baltic cod in 2019 due to a population collapse, but their size still shows no signs of bouncing back."
        },
        {
            "published_date": "2025-07-03T20:14:01",
            "title": "Farmers continue working outside despite heat wave, weather warnings",
            "author": "영화와 음악이 만났을 때",
            "url": "https://n.news.naver.com/mnews/article/640/0000072895",
            "url_media": "https://imgnews.pstatic.net/image/640/2025/07/03/0000072895_001_20250703201418714.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Extreme heat warnings remain in effect due to a heat wave. Temperatures could rise to 37 degrees Celsius (98 degrees Fahrenheit) from Thursday to Saturday on the east coast, Gangneung and Samcheok in Gangwon and in South Gyeongsang's Hapcheon, Miryang and Changnyeong."
        },
        {
            "published_date": "2025-07-03T20:00:55",
            "title": "Climate Change Fueling 'Most Widespread and Damaging' Droughts in History: UN Report",
            "author": "Stephen Prager",
            "url": "https://www.commondreams.org/news/climate-change-historic-droughts",
            "url_media": "https://www.commondreams.org/media-library/image.jpg?id=61144040&width=1200&height=600&coordinates=0%2C85%2C0%2C86",
            "country": "US",
            "language": "en",
            "summary": "Climate change is driving \"some of the most widespread and damaging drought events in recorded history,\" according to a report published Wednesday on global drought hotspots. The economic disruption caused by droughts today is twice as high as in 2000. The areas hit the hardest over the past two years were ones already suffering from the most severe temperature increases and exacerbated by a particularly severe El Niño weather cycle in 2023-24. In 2024, then the hottest year on record, 48 of the 50 U.S. states faced drought conditions."
        },
        {
            "published_date": "2025-07-03T19:35:50",
            "title": "Marin County Faces $1.2 Billion Challenge to Save Stinson Beach from Sea Level Rise",
            "author": "Source",
            "url": "https://hoodline.com/2025/07/marin-county-faces-1-2-billion-challenge-to-save-stinson-beach-from-sea-level-rise",
            "url_media": "https://img.hoodline.com/2025/7/marin-county-faces-dollar12-billion-challenge-to-save-stinson-beach-from-sea-level-rise-5.webp",
            "country": "US",
            "language": "en",
            "summary": "The future of Stinson Beach in Marin County hangs in the balance due to sea level rise. The damages from storms are estimated at $8 million. The adaptation strategy is projected to cost around $1.2 billion. It would fund road elevation, bridge improvements, and shoreline defenses. Only 15% of the beach's parcels are primary residences."
        },
        {
            "published_date": "2025-07-03T19:00:00",
            "title": "Earth Was Once a Scorched Wasteland—Scientists Are Finally Uncovering the Truth",
            "author": "Melissa Ait Lounis",
            "url": "https://www.msn.com/en-ie/money/other/earth-was-once-a-scorched-wasteland-scientists-are-finally-uncovering-the-truth/ar-AA1HVm52",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Permian–Triassic mass extinction, or the Great Dying, killed off up to 94% of marine species and 70% of terrestrial vertebrate families 252 million years ago. The extinction was triggered by a massive volcanic eruption in what is now Siberia. Tropical forests, which once played a crucial role in regulating the planet's carbon cycle, were destroyed by the volcanic eruptions. The loss of these forests was critical as they were vital in removing carbon dioxide from the atmosphere and storing it as organic matter."
        },
        {
            "published_date": "2025-07-03T18:14:24",
            "title": "Mauna Loa Observatory captured the reality of climate change. The US plans to shut it down",
            "author": "Alex Sen Gupta",
            "url": "https://theconversation.com/mauna-loa-observatory-captured-the-reality-of-climate-change-the-us-plans-to-shut-it-down-260403",
            "url_media": "https://images.theconversation.com/files/678060/original/file-20250703-62-j95yk9.jpg?ixlib=rb-4.1.0&rect=0%2C83%2C999%2C499&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Donald Trump wants to defund the Mauna Loa observatory recording the data on global CO₂ levels. The station has been collecting data for more than 65 years. If it is defunded, other observatories such as Australia's Kennaook/Cape Grim will become even more vital."
        },
        {
            "published_date": "2025-07-03T18:12:44",
            "title": "Himachal Pradesh Faces Devastating Floods as Rains Wreak Havoc",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3491728-himachal-pradesh-faces-devastating-floods-as-rains-wreak-havoc",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_07_2025_23_41_26_1791548.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Monsoon rains in Himachal Pradesh have killed 37 people and damaged property worth Rs 400 crore. 40 people are missing in Mandi district alone. 250 roads are blocked, over 500 electricity transformers are down and 700 water schemes are compromised. A multi-agency response involving local entities and national forces is underway."
        },
        {
            "published_date": "2025-07-03T18:00:55",
            "title": "Extreme heatwaves may cause global decline in dairy production, scientists warn",
            "author": "Elsie McDowell",
            "url": "https://www.theguardian.com/environment/2025/jul/03/heatwaves-global-dairy-decline-milk-production-farming-environment",
            "url_media": "https://i.guim.co.uk/img/media/001d03c9ebed7cebd4f196ee55510158591a2756/473_0_4171_3338/master/4171.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ddc3341f2d00812da5e3137cb474fcf7",
            "country": "GB",
            "language": "en",
            "summary": "Extreme heat reduces dairy cows' ability to produce milk by 10%. One hour of wet-bulb temperature above 26C can reduce a cow's daily milk production by 0.5%. South Asia is expected to account for more than half of global growth in milk production over the coming decade. Farmers are already implementing adaptation strategies."
        },
        {
            "published_date": "2025-07-03T17:49:00",
            "title": "Pollen levels so high that people with no allergies suffer from hay fever",
            "author": "Samuel Montgomery",
            "url": "https://www.telegraph.co.uk/news/2025/07/03/pollen-levels-high-no-allergies-suffer-hay-fever",
            "url_media": "https://www.telegraph.co.uk/content/dam/news/2025/07/03/TELEMMGLPICT000431033868_17515640582560_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=OG-Standard",
            "country": "GB",
            "language": "en",
            "summary": "Pollen levels have been so high this year that hay fever has been triggered in non-sufferers. Almost half of British adults suffer hay fever symptoms, 37% developed them for the first time in the past five years. The driest start to a spring in Britain since 1956 has led to an 'explosion' in hay fever."
        },
        {
            "published_date": "2025-07-03T17:47:46",
            "title": "New Study Indicates The North Atlantic Is Colder Now Than Any Other Time In The Last 9000 Years",
            "author": "Kenneth Richard",
            "url": "https://notrickszone.com/2025/07/03/new-study-indicates-the-north-atlantic-is-colder-now-than-any-other-time-in-the-last-9000-years",
            "url_media": "https://notrickszone.com/wp-content/uploads/2025/07/Holocene-cooling-in-the-North-Atlantic-over-the-last-9000-years-Liu-2025.jpg",
            "country": "DE",
            "language": "en",
            "summary": "According to a new study, abrupt shifts in North Atlantic sea surface temperature (SST) have occurred routinely over the last 9000 years. The modern period is the coldest of the Holocene. North Atlantic SSTs have not warmed in the last 120 years or since the late 1800s."
        },
        {
            "published_date": "2025-07-03T17:30:00",
            "title": "Fijian coastal communities are facing the impossible decision to stay or relocate from their homes that are being impacted by rising seas and erosion",
            "author": "Fred Hooper",
            "url": "https://www.abc.net.au/pacific/programs/pacific-prepared/pacific-prepared/105473298",
            "url_media": "https://www.abc.net.au/core-assets/pacific/abc-pacific.png?imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Pacific Prepared is produced by ABC International Development with funding from the Australian Department of Foreign Affairs and Trade. In this edition, Pacific Prepared talks about climate change and how it affects people's lives and how to be prepared for it in your daily life. "
        },
        {
            "published_date": "2025-07-03T17:05:26",
            "title": "Cyclones, Salinity, and the Fight to Save Farming in Bangladesh",
            "author": "",
            "url": "https://apnews.com/press-release/3bl-media/cyclones-salinity-and-the-fight-to-save-farming-in-bangladesh-95661261c11f2fb553a9b172646a5c6b",
            "url_media": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png",
            "country": "US",
            "language": "en",
            "summary": "Bangladesh has been hit by a series of climate-related disasters since May 2024. Action Against Hunger is working to build resilience in Satkhira, a district in the south-west region of Bangladesh where most families rely on agriculture to survive. It offers training on climate-smart farming as part of its extensive Food Security and Livelihoods work."
        },
        {
            "published_date": "2025-07-03T17:00:00",
            "title": "Letters: Avoiding politically unpopular decisions is not the way to tackle the climate crisis",
            "author": "NZ Herald",
            "url": "https://www.nzherald.co.nz/nz/letters-avoiding-politically-unpopular-decisions-is-not-the-way-to-tackle-the-climate-crisis/INXRLK2WS5DXLPYXOTXOEFYXYE",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/44OPQ4W7VZH2TCMIXEZROYHF4Q.jpg?auth=81d1bdcfe31c75687a696a314f04e4000d8eaaab99b8b891a8264ab553b9e25e&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "It is now accepted that climate change is a reality and that someone should do something about it urgently to protect the planet and all forms of life. However, there is one overriding condition that blocks any significant action and that is the lack of political will to tackle it."
        },
        {
            "published_date": "2025-07-03T16:40:16",
            "title": "Fossils reveal why earth was extremely hot for millions of years",
            "author": "Andrew Merdith",
            "url": "https://www.independent.co.uk/news/science/great-dying-heat-permian-triassic-extinction-fossils-b2782156.html",
            "url_media": "https://static.independent.co.uk/2020/10/20/15/newFile-6.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": " 252 million years ago, almost all life on Earth disappeared. Up to 94% of marine species and 70% of terrestrial vertebrate families were wiped out. Tropical forests experienced massive declines. Earth warmed too rapidly, leading to the dying out of low- to mid-latitude vegetation. The efficiency of the organic carbon cycle was greatly reduced."
        },
        {
            "published_date": "2025-07-03T16:38:25",
            "title": "Sindh's climate imperative",
            "author": "Fayyaz Salih Hussain",
            "url": "https://www.pakistantoday.com.pk/2025/07/03/sindhs-climate-imperative",
            "url_media": "https://www.pakistantoday.com.pk/wp-content/uploads/2025/07/Gamma-2.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The province of Sindh is at a critical juncture in its development trajectory as it faces the mounting challenges posed by climate change. Extreme weather events are already taking a heavy toll on the province's economy, infrastructure, and most importantly, its people. Sindh's dependence on the Indus River system, changing precipitation patterns and rising temperatures has created a situation where water scarcity and flooding occur in rapid succession. The 2022 floods provided a devastating demonstration of this vulnerability, submerging vast agricultural areas and causing losses estimated at billions of dollars. The climate impacts threaten to reverse decades of development progress and exacerbate existing socioeconomic inequalities unless urgent, coordinated action is taken. The framework provided by Pakistan's NDC"
        },
        {
            "published_date": "2025-07-03T16:30:00",
            "title": "Today Tuvalu; tomorrow the world",
            "author": "",
            "url": "https://www.odt.co.nz/opinion/today-tuvalu-tomorrow-world",
            "url_media": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2025/07/355101633-tuvalu-australia_climate.jpg?itok=fkoWZ6ZX",
            "country": "NZ",
            "language": "en",
            "summary": "Last week Australia created the world's first climate-change visas for potential climate refugees. In June all 10,000 residents of the South Pacific island state of Tuvalu were invited to enter a lottery. 280 lucky winners will get a special climate change visa that entitles them to work, study and live in Australia indefinitely. The tropical countries will be hit sooner and harder than those closer to the poles due to climate change."
        },
        {
            "published_date": "2025-07-03T16:17:00",
            "title": "Farmers affected by wildfire urge government to reduce bureaucracy",
            "author": "First Published",
            "url": "https://www.catalannews.com/society-science/item/farmers-wildfire-urge-government-reduce-bureaucracy-3-july-2025",
            "url_media": "https://cdn-acn.watchity.net/acn/images/0e0f7553-ca92-423d-a2a5-0253f5686056/0a4f54c0-420c-491c-ba70-d59d7652f3e8/0a4f54c0-420c-491c-ba70-d59d7652f3e8_medium.jpeg",
            "country": "ES",
            "language": "en",
            "summary": "Two people died in a wildfire in Torrefeta i Florejacs, in western Catalonia. Farmers and representatives of the agricultural sector want the government to reduce bureaucracy and improve territory management. Catalonia has experienced an average of 500 wildfires per year in the last decade."
        },
        {
            "published_date": "2025-07-03T16:15:00",
            "title": "Why is the Met Office adopting the language of climate alarmism?",
            "author": "Matt Ridley",
            "url": "https://www.telegraph.co.uk/news/2025/07/03/met-office-language-climate-alarmism",
            "url_media": "https://www.telegraph.co.uk/content/dam/news/2025/07/03/TELEMMGLPICT000431016741_17515573455840_trans_NvBQzQNjv4Bqek9vKm18v_rkIPH9w2GMNpPHkRvugymKLtqq96r_VP8.jpeg?impolicy=OG-Comment",
            "country": "GB",
            "language": "en",
            "summary": "June was the second hottest in England since 1884. St James's Park recorded 34.7C (94.5F) on Tuesday. The weather station is a low-reliability 'class 5' site with an error rating of 'up to 5C'. It's next to a busy tarmac path and in the middle of a city. Research reckons London's heat island is worth 4.5C extra warmth on average. As the world gets warmer, we will see more hot summer days, but mild winter nights."
        },
        {
            "published_date": "2025-07-03T16:14:00",
            "title": "Era of the ‘new normal' in extreme weather has arrived",
            "author": "The Editorial Board",
            "url": "https://www.manilatimes.net/2025/07/04/opinion/editorial/era-of-the-new-normal-in-extreme-weather-has-arrived/2143407",
            "url_media": "https://www.manilatimes.net/manilatimes/uploads/images/2025/07/03/670385.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Europe is in the grip of a heat wave that has caused roads to buckle and governments to issue warnings against the risk of wildfires. Global warming increased the likelihood of such heat waves by at least 150 times. The Philippines is at the onset of another season of severe storms and widespread flooding due to climate change."
        },
        {
            "published_date": "2025-07-03T16:11:00",
            "title": "PCG enforces ‘no sail' policy",
            "author": "Leander C. Domingo",
            "url": "https://www.manilatimes.net/2025/07/04/regions/pcg-enforces-no-sail-policy/2143274",
            "url_media": "https://www.manilatimes.net/manilatimes/uploads/images/2025/07/03/670154.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Philippine Coast Guard (PCG) District North Eastern Luzon is enforcing a 'No Sail Policy' that prohibits sailing of sea vessels to Calayan Island starting Thursday. This applies to all vessels that weigh 250 gross tonnage (GT) or more. This is due to the threat of inclement weather caused by a low-pressure area and the southwest monsoon affecting the entire country."
        },
        {
            "published_date": "2025-07-03T16:03:34",
            "title": "Ahead of storm, WC's Bredell urges residents to listen to rescue workers",
            "author": "Primedia",
            "url": "https://www.ewn.co.za/2025/07/03/ahead-of-storm-wcs-bredell-urges-residents-to-listen-to-rescue-workers",
            "url_media": "https://media-cache.primedia-service.com/media/zjsluqeb/whatsapp-image-2025-06-26-at-102928.jpeg?width=1200&height=630",
            "country": "ZA",
            "language": "en",
            "summary": "The South African Weather Service has issued a yellow level 4 warning for disruptive rain and a level 2 warning for rough seas along the southern coastline. Heavy rain is expected from later on Thursday and is expected to continue until Sunday. Western Cape MEC for Local Government, Environmental Affairs and Development Planning, Anton Bredell, advised the public to stay clear of low-lying bridges."
        },
        {
            "published_date": "2025-07-03T16:02:36",
            "title": "France faces 'significant delays' in meeting 2050 carbon neutrality target",
            "author": "Audrey Garric",
            "url": "https://www.lemonde.fr/en/environment/article/2025/07/03/france-faces-significant-delays-in-meeting-2050-carbon-neutrality-target_6742994_114.html",
            "url_media": "https://img.lemde.fr/2025/06/30/0/0/8001/5334/1440/960/60/0/5dd602f_ftp-import-images-1-wjn2yvyqpatm-5292567-01-06.jpg",
            "country": "FR",
            "language": "en",
            "summary": "In 2024, France's greenhouse gas emissions fell by 1.8%, compared to a 6.8% decrease in 2023. The slowdown affected all sectors except energy production. 70% of the reduction achieved in 2024 was due to circumstantial factors, such as a mild winter and a drop in cattle numbers. The share linked to structural reforms dropped substantially."
        },
        {
            "published_date": "2025-07-03T15:57:15",
            "title": "Heat warnings spread throughout southern Sask.",
            "author": "CTV",
            "url": "https://article.wn.com/view/2025/07/03/Heat_warnings_spread_throughout_southern_Sask",
            "url_media": "https://article.wn.com/view/2025/07/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Environment and Climate Change Canada has issued heat warnings for some areas. It is very hot in the area where the warnings are in effect. It's very warm in the rest of the country.    It's hot in most of Canada. It feels like it's very hot."
        },
        {
            "published_date": "2025-07-03T15:50:01",
            "title": "Europe Heatwave Sparks Global Drought Crisis Warnings",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/heatwaves-drought-grip-europe-fueling-calls-global-action-515",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "Extreme heat and drought conditions are gripping large parts of Europe, fueling wildfires and prompting urgent weather alerts across multiple countries. Germany is experiencing what may be its hottest day of the year on Wednesday, with temperatures forecast to reach 40 degrees Celsius. Czech Republic, Slovakia, Croatia and Romania are also on alert, with peak temperatures expected to reach 39 degrees Celsius and 37 degrees Celsius, respectively. Spain is experiencing a record-breaking heatwave, with June 2025 confirmed as the country's hottest month on record. Two farmers died in a wildfire that scorched 5,000 hectares in La Segarra, northeast Spain. June 2025 was the driest month since records began in Slovenia, with rainfall just 24"
        },
        {
            "published_date": "2025-07-03T15:20:05",
            "title": "Antarctic research is in decline, and the timing couldn't be worse",
            "author": "Elizabeth Leane",
            "url": "https://www.msn.com/en-us/news/world/antarctic-research-is-in-decline-and-the-timing-couldn-t-be-worse/ar-AA1HUyGK",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The annual Antarctic Treaty Consultative Meeting is taking place today in Milan, Italy. The region below 60 degrees south is governed by the 1959 Antarctic Treaty. The rate of research on the Antarctic and Southern Ocean is falling at the time when it should be increasing. Research leadership is changing, with China taking the lead for the first time."
        },
        {
            "published_date": "2025-07-03T14:59:25",
            "title": "Asia warming faster than the rest of the world: WMO report",
            "author": "Priyali Prakash",
            "url": "https://www.thehindu.com/videos/watch-asia-warming-faster-than-the-rest-of-the-world-wmo-report/article69769308.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/hdm76w/article69769299.ece/alternates/LANDSCAPE_1200/Andhra%20May%2023.png",
            "country": "IN",
            "language": "en",
            "summary": "The World Meteorological Organization released its 2024 State of Climate in Asia report last week. It found that Asia is warming at around twice the global average. 2024 was either the warmest, or second warmest on record for Asia. India saw extreme rainfall patterns in 2024. The landslide in Wayanad was one of the worst climate disasters in India."
        },
        {
            "published_date": "2025-07-03T14:27:07",
            "title": "British committed ‘genocide' against Aboriginal Australians",
            "author": "",
            "url": "https://syria.shafaqna.com/EN/AL/2074364",
            "url_media": "https://syria.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "The indigenous population in Victoria suffered 'near-complete physical destruction' at the hands of colonists, a report has said. British committed 'genocide' against Aboriginal Australians, according to the report.      Â   iReport.com "
        },
        {
            "published_date": "2025-07-03T14:00:51",
            "title": "Western Cape on high alert as disruptive rainfall looms",
            "author": "Sibuliso Duba",
            "url": "https://www.capetownetc.com/news/western-cape-on-high-alert-as-disruptive-rainfall-looms",
            "url_media": "https://www.capetownetc.com/wp-content/uploads/2025/07/image-1280x720-2025-07-03T150635.142.png",
            "country": "ZA",
            "language": "en",
            "summary": "The South African Weather Services and Department of Water and Sanitation have issued severe weather warnings concerning severe weather expected from Thursday to Sunday. A Yellow level 4 warning for disruptive rainfall is in effect across large parts of the Western Cape from 3 July until 6 July 2025. There is also a Yellow level 2 warning for waves for the southern coastline, which encompasses the Overberg and Garden Route districts. The combination of heavy rainfall and high waves poses a critical risk."
        },
        {
            "published_date": "2025-07-03T13:59:07",
            "title": "Somerset Co. Residents Protest Trump's 'Big Beautiful Bill' At Somerville Rally",
            "author": "Alexis Tarrazi",
            "url": "https://patch.com/new-jersey/bridgewater/somerset-co-residents-protest-trumps-big-beautiful-bill-somerville-rally",
            "url_media": "https://patch.com/img/cdn20/users/22871539/20250703/081246/styles/patch_image/public/image002-1___03080102353.jpg",
            "country": "US",
            "language": "en",
            "summary": "H.R. 1, President Trump's \"Big Beautiful Bill\" passed the Senate on Wednesday. It's now going to be voted on in the House for a final vote. In New Jersey's 7th District, more than 10,800 households rely on SNAP to afford groceries."
        },
        {
            "published_date": "2025-07-03T13:54:30",
            "title": "APTOPIX Australia Weather",
            "author": "플스포 메타인지의 방",
            "url": "https://n.news.naver.com/mnews/article/077/0006678263",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/07/03/PAP20250703192201009_P2_20250703135430168.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Large waves hit the headland at Sydney's Maroubra Beach in Australia on Thursday, July 3, 2025, as APTOPIX Australia Weather reports.    .      in the Pacific Ocean, Australia and New Zealand, on the Pacific Coast."
        },
        {
            "published_date": "2025-07-03T13:50:00",
            "title": "Extreme heat disrupts farming across southern Europe",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9747042/extreme-heat-disrupts-farming-across-southern-europe",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0258.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "In France fieldwork during peak heat hours is prohibited to shield workers and mitigate fire hazards. Spain and Portugal observe unprecedented June temperatures, with El Granado reaching 46 °C and Mora 46.6 °C. Italy has placed 21 cities, such as Rome and Milan, on red alert with heat exceeding 38 °C, and farmers in Spain, Italy, and southern France depend heavily on irrigation to avert crop failure."
        },
        {
            "published_date": "2025-07-03T13:49:00",
            "title": "Jurassic World makes a return to theatres: Take a Look Daily",
            "author": "",
            "url": "https://www.abc10.com/video/news/community/mark-s-allens-world/jurassic-world-makes-a-return-to-theatres-take-a-look-daily/103-618929ec-85c4-4b18-9f92-d66ca403024a",
            "url_media": "https://media.abc10.com/assets/KXTV/images/13831a71-7a6b-4f2c-bd61-bc92a30df2b2/20250703T135306/13831a71-7a6b-4f2c-bd61-bc92a30df2b2_1140x641.jpg",
            "country": "US",
            "language": "en",
            "summary": "Scientists estimate that dinosaurs last roamed the Earth around 66 million years ago. ABC10's Mark S. Allen has more on the 'Rebirth' of a Jurassic-sized franchise and the possibility of a new 'Jurassic Park' movie being made."
        },
        {
            "published_date": "2025-07-03T13:40:48",
            "title": "Argentina Border Closed: Chile Polar Wave Impact",
            "author": "",
            "url": "https://www.archyde.com/argentina-border-closed-chile-polar-wave-impact",
            "url_media": "https://watchers.news/wp-content/uploads/2025/07/iceberg-8618870_1280-e1751461886803.jpg",
            "country": "US",
            "language": "en",
            "summary": "On June 30, a Polar wave sent temperatures plummeting to historic lows across Chile. Temperatures in La Araucanía Region reached -7.9°C (17.8°F), the lowest since 1941. Chillán and Retiro registered -9.3°C, the coldest since 1947. Puerto Montt set a new record with -8.1°C. The Pino Hachado Border Crossing with Chile was closed on July 1st due to hazardous conditions on National Route 242."
        },
        {
            "published_date": "2025-07-03T13:35:00",
            "title": "Young cardinals are brown but will molt into red feathers",
            "author": "Val Cunningham",
            "url": "https://www.startribune.com/baby-cardinals-brown-not-red-enormous-canada-goose-flocks-late-spring-bluebird-nestlings-minnesota/601379071",
            "url_media": "https://arc.stimg.co/startribunemedia/BRMMCT5QUNGU5F6ZKLV2PMWRLQ.JPG?&w=1200&ar=1.91:1&fit=crop",
            "country": "US",
            "language": "en",
            "summary": "A male cardinal was feeding an all-brown bird on the roof of his garage. Blackbirds deposit their feces in the birdbath next to the house. A large flock of Canada geese was seen flying northward on May 26. It was late May and migration ended months ago."
        },
        {
            "published_date": "2025-07-03T13:34:01",
            "title": "Western Balkans face severe drought and water restrictions during heatwave",
            "author": "LLAZAR SEMINI",
            "url": "https://www.tdtnews.com/news/nation_world/article_89e371dd-46fb-5575-abe1-240a70f41aba.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/tdtnews.com/content/tncms/assets/v3/editorial/4/48/4488987e-e253-56c6-ab47-4412521e718c/686687fae5f0c.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Western Balkans faces a severe drought after a heatwave hit the region. The drought disrupts daily life and creates issues with agriculture and power.   Copyright 2025 The Associated Press. All rights reserved. No part of this article may be used without permission."
        },
        {
            "published_date": "2025-07-03T13:30:05",
            "title": "People cool off during heatwave in Vienna, Austria",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/07/03/People_cool_off_during_heatwave_in_Vienna_Austria",
            "url_media": "https://article.wn.com/view/2025/07/03/[]",
            "country": "US",
            "language": "en",
            "summary": "People cool off along the Danube river during a heatwave in Vienna, Austria, July 3, 2025. Children cool off at a splash pad during the heatwave there.       in Xinhua/He Canling and He Canling. "
        },
        {
            "published_date": "2025-07-03T13:21:48",
            "title": "SANBI to implement eco-disaster risk reduction project with Green Climate Fund support",
            "author": "Zainul Dawood",
            "url": "https://iol.co.za/news/south-africa/kwazulu-natal/2025-07-03-sanbi-to-implement-eco-disaster-risk-reduction-project-with-green-climate-fund-support",
            "url_media": "https://iol-prod.appspot.com/image/c403dcf406b2c3abfc914c03a3d0214ab062535a/1280/jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "The South African National Biodiversity Institute (SANBI) will receive a R700 million grant from the Green Climate Fund (GCF) to aid SANBI's Eco-Disaster Risk Reduction (Eco DRR) project. The project is expected to take place in the Eastern Cape Province: Alfred Nzo District, Umzimvubu and Ntabankulu Local Municipalities, Limpopo Province: Sekhukune District, Makhuduthamaga Local Municipality, Mepumalanga Province: Ehlanzeni District, Bushbuckridge Local municipality and North West Province: Ngaka Modiri Molema District."
        },
        {
            "published_date": "2025-07-03T13:02:57",
            "title": "Bihar CM Nitish Kumar inspects rising Ganga water levels, urges officials to stay alert",
            "author": "Class",
            "url": "https://theprint.in/india/bihar-cm-nitish-kumar-inspects-rising-ganga-water-levels-urges-officials-to-stay-alert/2678708",
            "url_media": "https://static.theprint.in/wp-content/uploads/2023/06/theprint_default_image_new.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bihar Chief Minister Nitish Kumar visited JP Setu, Digha Ghat, Krishna Ghat and Gandhi Ghat to assess the water levels of the Ganga at various ghats in Patna. He asked the district administration to remain on high alert and prepared for any potential emergency. The Patna Meteorological Centre predicted light to moderate rain in most parts of the state over the next two days."
        },
        {
            "published_date": "2025-07-03T13:00:08",
            "title": "Canada's wildfire emissions exceeded all other sources in 2023: Report",
            "author": "Tiffany Crawford",
            "url": "https://vancouversun.com/news/canadas-wildfire-emissions-exceeded-all-other-sources-in-2023-report",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/06/canada-wildfires_295888591.jpg",
            "country": "CA",
            "language": "en",
            "summary": "2023 Canada's worst wildfire season on record caused more greenhouse-gas emissions than all other sources combined. Wildfires released nearly one billion tonnes of carbon dioxide from Canada's forests. This year's wildfire season is on track to be the second worst on record in terms of area burned."
        },
        {
            "published_date": "2025-07-03T13:00:00",
            "title": "Vietnam could experience temperatures exceeding 40 C for 50 days annually by 2050",
            "author": "Vn Express",
            "url": "https://e.vnexpress.net/news/news/environment/vietnam-could-experience-temperatures-exceeding-40-c-for-50-days-annually-by-2050-4909721.html",
            "url_media": "https://vcdn1-english.vnecdn.net/2025/07/03/download14-1751532374-17515324-2353-9772-1751532411.jpg?w=680&h=0&q=100&dpr=1&fit=crop&s=NT7u7-AeGNwu-pJ-dc3qew",
            "country": "VN",
            "language": "en",
            "summary": "Vietnam's average yearly temperature rose by 0.028 degrees per year between 1984 and 2023, with the past decade seeing a sharper rise of 0.4 degrees. The highest temperature ever recorded in Vietnam was 44.2 degrees in Tuong Duong, Nghe An Province, on May 7, 2023."
        },
        {
            "published_date": "2025-07-03T12:58:43",
            "title": "Britain is already a hot country. It should act like it",
            "author": "The Economist",
            "url": "https://www.economist.com/britain/2025/07/03/britain-is-already-a-hot-country-it-should-act-like-it",
            "url_media": "https://www.economist.com/content-assets/images/20250705_BRD000.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Stepping off the 9.10 from London Victoria to Whitstable was akin to disembarking from a Ryanair flight in Alicante. The temperature was creeping towards 30°C. One pensioner despaired: 'It's unBritish'   "
        },
        {
            "published_date": "2025-07-03T12:57:14",
            "title": "Bihar CM Nitish Kumar inspects rising Ganga water levels, urges officials to stay alert",
            "author": "PTI",
            "url": "https://www.dailypioneer.com/2025/top-stories/bihar-cm-nitish-kumar-inspects-rising-ganga-water-levels--urges-officials-to-stay-alert.html",
            "url_media": "https://www.dailypioneer.com/uploads/2025/story/images/big/bihar-cm-nitish-kumar-inspects-rising-ganga-water-levels--urges-officials-to-stay-alert-2025-07-03.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bihar Chief Minister Nitish Kumar visited JP Setu, Digha Ghat, Krishna Ghat and Gandhi Ghat to assess the water levels of the Ganga at various ghats in Patna. He asked the district administration to remain prepared to tackle the situation if the water level further increases."
        },
        {
            "published_date": "2025-07-03T12:56:02",
            "title": "Parliament warns of rising climate threats, criticizes disaster response systems",
            "author": "Maleeha Zahid",
            "url": "https://dailytimes.com.pk/1328511/parliament-warns-of-rising-climate-threats-criticizes-disaster-response-systems",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/07/03/892623_98832153.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The National Assembly's Standing Committee on Climate Change voiced serious concern over Pakistan's climate challenges and the poor performance of its disaster response systems. They discussed glacier melting, flood risks, and ineffective early warning systems. Rain is forecasted later this month in Islamabad, KP, and Upper Punjab."
        },
        {
            "published_date": "2025-07-03T12:43:44",
            "title": "Bihar CM Nitish Kumar's Vigilance on Ganga Water Levels",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/law-order/3491227-bihar-cm-nitish-kumars-vigilance-on-ganga-water-levels",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/02_07_2025_20_07_17_7379702.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Bihar Chief Minister Nitish Kumar visited the Ganga's water levels at key ghats in Patna on Thursday. The recent rains have caused an increase at certain locations. The Patna Meteorological Centre forecasts further rain reinforcing the call for vigilance and high alert status."
        },
        {
            "published_date": "2025-07-03T12:16:17",
            "title": "Fossils unlock 250-million-year-old mystery of the ‘Great Dying'",
            "author": "Andrew Merdith",
            "url": "https://www.independent.co.uk/news/science/great-dying-permian-triassic-extinction-fossils-b2781071.html",
            "url_media": "https://static.independent.co.uk/2020/10/20/15/newFile-6.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": " 252 million years ago, almost all life on Earth disappeared. Up to 94% of marine species and 70% of terrestrial vertebrate families were wiped out. Tropical forests experienced massive declines. Earth warmed too rapidly, leading to the dying out of low- to mid-latitude vegetation. The efficiency of the organic carbon cycle was greatly reduced."
        },
        {
            "published_date": "2025-07-03T12:10:55",
            "title": "Safe water is a human right",
            "author": "Geoffrey P. Johnston",
            "url": "https://www.thewhig.com/opinion/safe-water-is-a-human-right",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2025/06/0703-pg-water.pg_.jpg",
            "country": "CA",
            "language": "en",
            "summary": "There is an extreme heat wave in southern Europe. The G7 Water Coalition was established at the G7 Summit hosted by Italy in 2024. The Global Commission on the Economics of Water calls for a sea change in how we understand and act on water. The UN adopted a series of sustainable human and ecological development goals to be achieved by 2030."
        },
        {
            "published_date": "2025-07-03T12:00:01",
            "title": "Opinion: Depopulation is coming. Don't expect it to solve our problems.",
            "author": "Michael Geruso",
            "url": "https://www.sltrib.com/opinion/commentary/2025/07/03/opinion-depopulation-is-coming",
            "url_media": "https://www.sltrib.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fsltrib%2FGUJIDV35ERFD7KEGQI6DNEIEFU.jpg?auth=7a049f498e4e4728178348a94b2cc4192d7ef45de63381494190228905d3d896&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Project Drawdown lists slower population growth as one of the top climate solutions. According to UN projections, by the 2080s, the global population will be declining. Paul R. Ehrlich's 1968 book, 'The Population Bomb', said that the only solution to pollution is to reduce humanity."
        },
        {
            "published_date": "2025-07-03T11:57:11",
            "title": "'There is a Warning Here': Permian-Triassic Extinction Reveals the Devastation of a Climate Tipping Point",
            "author": "Ryan Whalen",
            "url": "https://thedebrief.org/there-is-a-warning-here-permian-triassic-extinction-reveals-the-devastation-of-a-climate-tipping-point",
            "url_media": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/07/tipping-point-fossil.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The Permian-Triassic Extinction occurred 252 million years ago and wiped out all plant and animal life from both the sea and land. New research suggests that the deaths of tropical forests inhibited the planet's ability to absorb carbon, leaving greenhouse gases in the atmosphere for longer."
        },
        {
            "published_date": "2025-07-03T11:52:36",
            "title": "Wildfires in eastern Germany injure firefighters and force evacuations",
            "author": "The Associated Press",
            "url": "https://www.thestar.com/news/world/europe/wildfires-in-eastern-germany-injure-firefighters-and-force-evacuations/article_8888e1ec-1aef-5292-9f1a-f2c158409a08.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/2/89/28979434-0d55-565c-a558-f0d0633a1645/68666f95b03fd.image.jpg?crop=1622%2C852%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "The forest floor is on fire in a wooded area on the Saalfelder Höhe in Reichmannsdorf, Germany, on Wednesday, July 2, 2025. The fire is caused by a forest fire. It is controlled by a flag."
        },
        {
            "published_date": "2025-07-03T11:50:39",
            "title": "Europe's extreme pollen triggered symptoms in those not known to have allergies, data shows",
            "author": "Agence France-Presse in Paris",
            "url": "https://amp.theguardian.com/society/2025/jul/03/europes-extremely-high-pollen-levels-triggered-allergies-in-some-for-first-time-data-shows",
            "url_media": "https://i.guim.co.uk/img/media/08c90e3fe2cee39643abaa94ec1f2146932887e0/614_0_4333_3467/master/4333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1134c161e38bbafb7d41e13d63b3c7f1",
            "country": "GB",
            "language": "en",
            "summary": "Pollen levels were so high in parts of Europe during spring that even people without allergies felt the effects of hay fever. Scientists say the climate crisis is altering the production and distribution of pollen and spores. About a quarter of adults in Europe suffer from airborne allergies, including severe asthma."
        },
        {
            "published_date": "2025-07-03T11:50:39",
            "title": "Europe's extremely high pollen levels triggered allergies in some for first time, data shows",
            "author": "Agence France-Presse in Paris",
            "url": "https://www.theguardian.com/society/2025/jul/03/europes-extremely-high-pollen-levels-triggered-allergies-in-some-for-first-time-data-shows",
            "url_media": "https://i.guim.co.uk/img/media/08c90e3fe2cee39643abaa94ec1f2146932887e0/614_0_4333_3467/master/4333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1134c161e38bbafb7d41e13d63b3c7f1",
            "country": "GB",
            "language": "en",
            "summary": "Pollen levels were so high in parts of Europe during spring that even people without allergies felt the effects of hay fever. Climate change is altering the production and distribution of pollen and spores. About a quarter of adults in Europe suffer from airborne allergies. The proportion among children is 30% to 40%."
        },
        {
            "published_date": "2025-07-03T11:40:24",
            "title": "South Africa secures $40m grant to enhance nature-based climate resilience for vulnerable communities",
            "author": "Kristin Engel",
            "url": "https://www.dailymaverick.co.za/article/2025-07-03-south-africa-secures-40m-grant-to-enhance-nature-based-climate-resilience-for-vulnerable-communities",
            "url_media": "https://i0.wp.com/www.dailymaverick.co.za/wp-content/uploads/2025/06/ED_560381.jpg?fit=1280%2C806&quality=89&ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "The Green Climate Fund (GCF) has given South Africa $40.1m for an eight-year nature-based project to reduce disaster risks. The project will take place across four climate-vulnerable district municipalities in Eastern Cape, Limpopo, Mpumalanga and North West provinces. It will directly benefit 366,000 people and indirectly reach more than 5.1 million South Africans."
        },
        {
            "published_date": "2025-07-03T11:39:54",
            "title": "Cuba reaffirms its commitment to tacking climate change",
            "author": "Orfilio Peláez",
            "url": "https://en.granma.cu/cuba/2025-07-03/cuba-reaffirms-its-commitment-to-tacking-climate-change",
            "url_media": "http://en.granma.cu//file/img/2025/07/medium/f0039504.jpg",
            "country": "CU",
            "language": "en",
            "summary": "The Ministry of Science, Technology, and Environment presented a special award to Army General Raúl Castro Ruz for his leadership in the conception, development and implementation of the macro-project Scenarios of Danger and Vulnerability of the Coastal Zone and the State Plan for Addressing Climate Change, Tarea Vida (Life Task). Dr. Fernando González Bermúdez was recognized for his decisive contribution to the macro project. 59 young people were awarded the 2024 National Prize for Student Researchers, Young Researchers, and Young Technologists."
        },
        {
            "published_date": "2025-07-03T11:35:51",
            "title": "Ancient Earth kept boiling for five million years. We now know what happened",
            "author": "India Today Science Desk",
            "url": "https://www.msn.com/en-in/news/techandscience/ancient-earth-kept-boiling-for-five-million-years-we-now-know-what-happened/ar-AA1HTG62",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Permian Mass Extinction, 252 million years ago, wiped out 90% of life on Earth. The planet remained in extreme heat for 5 million years after the extinction, because the plants didn't grow back fast enough. The study shows how important plants are in balancing the Earth's climate. The lessons from the past are relevant to the modern world."
        },
        {
            "published_date": "2025-07-03T11:35:51",
            "title": "Ancient Earth kept boiling for five million years. We now know what happened",
            "author": "",
            "url": "https://www.indiatoday.in/amp/science/story/ancient-earth-kept-boiling-for-five-million-years-we-now-know-what-happened-2750195-2025-07-03",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202507/earth-origin-story-032928851-16x9_0.jpg?VersionId=YtPBEzVGYBxVTqXo1_ly8ElheumNc3aU",
            "country": "IN",
            "language": "en",
            "summary": "Permian–Triassic Mass Extinction occurred 252 million years ago and wiped out 90% of life on Earth. Scientists have long linked this catastrophe to massive volcanic eruptions in Siberia that released greenhouse gases, causing runaway global warming. Now, researchers believe they've found the missing piece of the puzzle and it's rooted in the soil. A massive collapse of land vegetation led to very low carbon absorption by plants."
        },
        {
            "published_date": "2025-07-03T11:32:04",
            "title": "How weather can affect your daily life in South Florida",
            "author": "With Ai Summarization",
            "url": "https://www.miamiherald.com/news/local/article309922700.html",
            "url_media": "https://www.miamiherald.com/latest-news/3idqhx/picture295445509/alternates/LANDSCAPE_1140/LeadPhotoClamFarmerOct2.jpg",
            "country": "US",
            "language": "en",
            "summary": "The articles below focus on how weather is affecting daily life in South Florida through the economy, flooding and allergies. All stories listed were reported, written and edited by McClatchy journalists. The summary above was drafted with the help of AI tools and edited. "
        },
        {
            "published_date": "2025-07-03T11:31:58",
            "title": "Delhi-NCR weather update: Delhi, Noida, Gurugram witness light rain, thunderstorms; check\\u0026Acirc;\\u0026nbsp;IMD\\u0026Acirc;\\u0026nbsp;forecast here",
            "author": "DNA India",
            "url": "https://article.wn.com/view/2025/07/03/DelhiNCR_weather_update_Delhi_Noida_Gurugram_witness_light_r",
            "url_media": "https://article.wn.com/view/2025/07/03/[]",
            "country": "US",
            "language": "en",
            "summary": "On Wednesday, Delhi recorded a maximum temperature of 36.6°C, which is higher than normal for the time of the month.    It was 36.8°C.  on Wednesday.  It was 32°C on Tuesday. "
        },
        {
            "published_date": "2025-07-03T11:30:00",
            "title": "Climate Crisis Threatens Pakistan's Tourism Future And National Wellbeing",
            "author": "Javeria Irshad",
            "url": "https://thefridaytimes.com/03-Jul-2025/climate-crisis-threatens-pakistan-s-tourism-future-and-national-wellbeing",
            "url_media": "https://thefridaytimes.com/digital_images/large/2025-07-03/climate-crisis-threatens-pakistan-s-tourism-future-and-national-wellbeing-1751538821-4416.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan is one of the most vulnerable countries to climate change, suffering annually from various disasters. According to Green Theory, major polluters are the industrialised nations of the Global North. Pakistan has been a member of the UNFCCC since 1994, has ratified the Kyoto Protocol, and is a signatory to the Paris Agreement. However, progress has been hindered by poor governance and political mismanagement."
        },
        {
            "published_date": "2025-07-03T11:12:01",
            "title": "Animals struggle as Europe bakes in scorching heatwave",
            "author": "Gulf News",
            "url": "https://article.wn.com/view/2025/07/03/Animals_struggle_as_Europe_bakes_in_scorching_heatwave",
            "url_media": "https://article.wn.com/view/2025/07/03/[]",
            "country": "US",
            "language": "en",
            "summary": "A man cools off his horse with water during a heatwave in Seville, Spain. A kea parrot drops an ice cube on its enclosure at the Zoo in Prague, Czech Republic. A dog enjoys the cooler in the dog park in Poland."
        },
        {
            "published_date": "2025-07-03T11:11:15",
            "title": "One of shortest days on record expected this month as scientists warn Earth's rotation is ‘unexpectedly' speeding up",
            "author": "Millie Turner",
            "url": "https://www.thescottishsun.co.uk/tech/15027312/shortest-days-on-record-earth-rotation-speed-up",
            "url_media": "https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/07/MR-SHORTER-DAYS-03_07_COMP.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "Earth is set to have three unexpectedly shorter than average days in the coming weeks. The first of the shorter days will take place next week. The shortest day recorded since 2020 was 5 July, 2024, which was a full 1.66 milliseconds shorter than the average."
        },
        {
            "published_date": "2025-07-03T11:00:00",
            "title": "How Has The Climate Changed Since the First 4th of July?",
            "author": "Jeffrey Kluger",
            "url": "https://time.com/7299601/climate-change-july-4-independence-day-history",
            "url_media": "https://api.time.com/wp-content/uploads/2025/07/july-4-independence-day-usa-climate-change-history.jpg?quality=85&w=1024&h=628&crop=1",
            "country": "US",
            "language": "en",
            "summary": "Today's Independence Day is different from the one 249 years ago. The first Independence Day occurred during the period known as the Little Ice Age, which saw temperatures in North America falling 1°C to 2°C (1.8° F to 3.6°F) below thousand-year averages. In 1760, the Industrial Revolution began in Europe and North America, pouring greenhouse gasses into the sky and countering the natural forces keeping the Earth relatively cool. In the past two and a half centuries, slash-and-burn farming, fossil fuel-burning and internal combustion have released an estimated 1.5 tons of CO2 into the air."
        },
        {
            "published_date": "2025-07-03T11:00:00",
            "title": "Business reports give the lie to climate alarmism",
            "author": "James Taylor",
            "url": "https://www.washingtonexaminer.com/restoring-america/faith-freedom-self-reliance/3461254/business-reports-give-the-lie-to-climate-change-alarmism",
            "url_media": "https://www.washingtonexaminer.com/wp-content/uploads/2024/12/california-wildfire-insurance.webp",
            "country": "US",
            "language": "en",
            "summary": "Wall Street Journal presented a conspiracy theory that businesses are hiding the truth about the effects of climate change against their own financial interests. However, the objective data show no increase in the frequency of hurricanes, droughts, floods, wildfires, and extreme heat. The amount of land burned by wildfires has been declining for more than a century."
        },
        {
            "published_date": "2025-07-03T10:52:00",
            "title": "FAO Meets Saint Kitts & Nevis Agri Secretary Flemming",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/fao-meets-saint-kitts-nevis-agri-secretary-1490321",
            "url_media": "https://www.fao.org/images/newsroomlibraries/breafing-notes/uf1a9fp-12402o_1298.jpg?sfvrsn=41a130f6_1",
            "country": "US",
            "language": "en",
            "summary": "FAO Director-General met with H.E. Miguel Flemming, the Permanent Secretary in the Ministry of Agriculture, Fisheries and Marine Resources of Saint Kitts and Nevis on the sidelines of the 44th Session of the FAO Ministerial Conference at FAO headquarters in Rome. The Permanent Secretary commended the close alliance with FAO for its scope and operational efficiency. FAO is committed to supporting agriculture and fisheries in the Caribbean."
        },
        {
            "published_date": "2025-07-03T10:48:00",
            "title": "Antarctic Research Decline Hits at Critical Time",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/antarctic-research-decline-hits-at-critical-time-1489920",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fuploads%2F1412533519888a485b488%2Fbb9f9777%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Annual Antarctic Treaty Consultative Meeting is taking place today in Milan, Italy. Delegates will discuss the future of the Antarctic and Southern Ocean. The region below 60 degrees south is governed by the 1959 Antarctic Treaty and subsequent agreements. Only countries that produce significant Antarctic research and are parties to the treaty get to have a final say in these decisions. China overtook the US as the leader in Antarctic research in 2022, while the US was the leader for decades."
        },
        {
            "published_date": "2025-07-03T10:30:00",
            "title": "Could Humanity Survive a New Snowball Earth?",
            "author": "Jan Otte",
            "url": "https://www.msn.com/en-us/weather/topstories/could-humanity-survive-a-new-snowball-earth/ss-AA1HTzMt",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Imagine waking up one morning to find the world plunged into an endless, icy winter. Glaciers stretch over cities, oceans are sealed beneath thick sheets of ice, and the air bites with a cold so fierce it takes your breath away. This is what scientists call a 'Snowball Earth'."
        },
        {
            "published_date": "2025-07-03T10:25:57",
            "title": "The Australia-Tuvalu climate migration treaty is a drop in the ocean",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/07/03/The_AustraliaTuvalu_climate_migration_treaty_is_a_drop_in_th",
            "url_media": "https://article.wn.com/view/2025/07/03/[]",
            "country": "US",
            "language": "en",
            "summary": "There will be millions more climate migrants in need of refuge by 2050. Australia has offered a lifeline to the people of Tuvalu, whose island is threatened by rising sea levels, but the deal comes with strings attached and comes with a warning that the situation will get worse."
        },
        {
            "published_date": "2025-07-03T10:25:00",
            "title": "Liverpool soccer player dies in car crash",
            "author": "Louis Leeson",
            "url": "https://www.cnn.com/2025/07/03/world/video/diogo-jota-liverpool-portugal-death-vrtc-digvid-ldn",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/112896-diogo-jota-car-crash-vrtc-clean-00-00-01-15-still001.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "Diogo Jota died in a car crash in Spain two weeks after he married his wife Rute. More than 40 people were killed in an Israeli airstrike on a cafe in Gaza. Ukraine struck a Russian missile factory inside Russia, killing 3 people and injuring at least 35 more. Colombia celebrates Pride in defiance of the country's anti-gay violence."
        },
        {
            "published_date": "2025-07-03T10:15:07",
            "title": "Officials uncover rising threat to US groundwater — here's what you need to know",
            "author": "Timothy McGill",
            "url": "https://www.yahoo.com/news/officials-uncover-rising-threat-us-101507312.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ZohV5O8aPx_Y.UDvze43gw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/16f8027868f21adbab4150a1d0b20250",
            "country": "US",
            "language": "en",
            "summary": "There is a rise in shallow fresh groundwater in California, putting water supplies at risk from exposure to pollution from sea level rise. By 2100, 500,000 people in California may live in areas where groundwater is likely to become contaminated. The new methods developed by Cal State Long Beach could be applied by communities around the world."
        },
        {
            "published_date": "2025-07-03T10:09:00",
            "title": "Research Ties Sea Ice Loss to Antarctic Ice Shelf Calving",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/research-ties-sea-ice-loss-to-antarctic-ice-1489877",
            "url_media": "https://www.adelaide.edu.au/newsroom/sites/default/files/styles/ua_image_portrait/public/media/images/2025-07/satellite-imagery-of-the-breakup-of-the-wilkins-ice-shelf-credit-nathan-teder_0.jpg?h=b4b2ecde&itok=sM5VkE8W",
            "country": "US",
            "language": "en",
            "summary": "New research tracked ice shelf, sea ice and ocean swell wave conditions over multiple years in the lead up to three large-scale iceberg 'calving' events in Antarctica. Long periods of sea ice loss surrounding the ice shelves occurred in the six to 18 months prior to the calving events. Sea ice is retreating at an unprecedented rate all around Antarctica. This will put further pressure on already thinned and weakened ice shelves."
        },
        {
            "published_date": "2025-07-03T10:08:29",
            "title": "Summer 2025 to Bring Record Dryness and Heat, Raising Fire Risks Across Bulgaria",
            "author": "Web",
            "url": "https://www.novinite.com/articles/233201/Summer+2025+to+Bring+Record+Dryness+and+Heat%2C+Raising+Fire+Risks+Across+Bulgaria",
            "url_media": "https://www.novinite.com/media/images/2025-07/photo_verybig_233201.jpg",
            "country": "BG",
            "language": "en",
            "summary": "June was one of the driest months in a century in Bulgaria. Rainfall was well below the long-term averages except near the mountainous regions of Rila and Pirin. Despite the dryness, temperatures in June were warmer than usual and surpassed those recorded in June 2023. July and August are expected to be hot and dry, raising the risk of wildfires. Sea temperatures along the Bulgarian Black Sea coast are warm."
        },
        {
            "published_date": "2025-07-03T10:04:47",
            "title": "Shortest day in history predicted to take place this summer",
            "author": "Bang Showbiz",
            "url": "https://www.perthnow.com.au/news/world/shortest-day-in-history-predicted-to-take-place-this-summer-c-19239671",
            "url_media": "https://images.perthnow.com.au/publication/C-19239671/f1a42eda41ebbf7a6120a3dd0dc152491495ce5d-16x9-x0y192w2048h1152.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "The planet's rotation will speed up on July 9, July 22 or August 5. Time will drop by 1.30, 1.38 or 1.51 milliseconds on these days. Earth has been spinning slightly faster than usual since 2020 but the cause is still a mystery."
        },
        {
            "published_date": "2025-07-03T10:04:00",
            "title": "Climate Wild Cards Still Missing From Our Models",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/climate-wild-cards-still-missing-from-our-models-1489865",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/def_rota/news2.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Today's climate change models are accurate at predicting global warming trends, but they don't fully capture some crucial processes that could dramatically accelerate climate change, according to experts at UNSW. Professor Katrin Meissner studies abrupt climate shifts and the thresholds and feedback loops that drive them. She warns they overlook key processes which could lead to more rapid warming in the future."
        },
        {
            "published_date": "2025-07-03T10:00:00",
            "title": "Sydney-centric government oblivious to SA climate catastrophe",
            "author": "Phillip Coorey",
            "url": "https://www.afr.com/politics/federal/sydney-centric-government-oblivious-to-sa-climate-catastrophe-20250702-p5mbzz",
            "url_media": "https://static.ffx.io/images/$zoom_0.5877%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_453/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/fe00aefcc0fe1ef4fe905da971a3e49bd034845a",
            "country": "AU",
            "language": "en",
            "summary": "In October last year, more than a dozen of the nation's leading marine scientists and associated experts wrote to then-environment minister Tanya Plibersek. A month earlier, a marine heatwave had started in the waters around South Australia with ocean temperatures about 2.5 degrees above average."
        },
        {
            "published_date": "2025-07-03T10:00:00",
            "title": "Labor refuses funding to fight marine catastrophe",
            "author": "Phillip Coorey",
            "url": "https://www.afr.com/politics/federal/labor-refuses-funding-to-fight-marine-catastrophe-20250702-p5mbu6",
            "url_media": "https://static.ffx.io/images/$zoom_0.5877%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_412/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/852d9c2d682c198be7e95bd7ab2d70a2889aec0b",
            "country": "AU",
            "language": "en",
            "summary": "The Albanese government has rejected scientists' request for extra funding to deal with an ecological catastrophe in the waters off South Australia. A toxic algal bloom fuelled by above-average sea temperatures has killed tens of thousands of marine creatures across the food chain since February."
        },
        {
            "published_date": "2025-07-03T09:40:40",
            "title": "What Kept Earth Boiling After The Great Dying? Scientists Reveal Mystery",
            "author": "NDTV News Desk",
            "url": "https://www.ndtv.com/world-news/great-dying-why-252-million-year-old-mass-extinction-left-earth-scorched-for-5-million-years-8818318",
            "url_media": "https://c.ndtvimg.com/2022-10/naoo5i6_earth-generic_625x300_08_October_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
            "country": "IN",
            "language": "en",
            "summary": "After the Great Dying, Earth remained in a state of extreme heat and harsh temperatures for 5 million years. Volcanoes in the Siberian Traps released huge amounts of carbon and other gases, causing intense global warming. The loss of vegetation, one of the best ways to absorb and store carbon dioxide, is the reason behind Earth's extreme heat."
        },
        {
            "published_date": "2025-07-03T09:37:46",
            "title": "Skills shortage threatens pledge to build 1.5 million homes: report",
            "author": "",
            "url": "https://www.upday.com/uk/uknews/skills-shortage-threatens-pledge-to-build-15-million-homes-report/0jf2l7g",
            "url_media": "https://ocdn.eu/pulscms-transforms/1/ujik9kuTURBXy9hYzVhYWJiNi0wMmQyLTRkN2ItYmU2ZS03NDQwOGUxMTRkMzkuanBlZ5GVAs0EsM0CdsPD3gABoTAC",
            "country": "PL",
            "language": "en",
            "summary": "Numbers of Arctic terns nesting at a key breeding site have dropped by nearly a third this year due to climate change and disease. Tommy Robinson is due to appear in court on Thursday accused of harassing two journalists through social media posts. Dundee University's new chief finance officer has quit after just over a week in the post, leaving the institution scrambling to find a replacement. Oliver Tarvet's Wimbledon fairy tale ended against reigning champion Carlos Alcaraz."
        },
        {
            "published_date": "2025-07-03T09:15:23",
            "title": "Southern Africa: SADC Unites to Tackle Forced Displacement, Fragility, and Climate Risks",
            "author": "",
            "url": "https://allafrica.com/stories/202507030158.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "The first-ever Joint Ministerial Meeting on Forced Displacement, Fragility Mitigation and Climate Resilience was held in the Southern African Development Community (SADC) to address the region's humanitarian and climate crises. Over 11.4 million people in the SADC region are currently forcibly displaced, a 34.5% increase since 2023. This includes more than 10.2 million internally displaced persons and 1 million refugees and asylum seekers."
        },
        {
            "published_date": "2025-07-03T09:00:44",
            "title": "…Nigeria Must Transit To Low-Carbon Economy Quickly –NCCC DG",
            "author": "New Telegraph-Admin",
            "url": "https://newtelegraphng.com/nigeria-must-transit-to-low-carbon-economy-quickly-nccc-dg",
            "url_media": "https://newtelegraphng.com/wp-content/uploads/2025/07/Nkiruka-Maduekwe.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria's contribution to global carbon emissions is minimal, but it is vulnerable to climate change impacts because of its location in the African continent and low adaptive capacity. Dr. Nkiruka Maduekwe, the Director General and CEO of the National Council on Climate Change (NCCC), said Nigeria must urgently transition to a low-carbon economy."
        },
        {
            "published_date": "2025-07-03T09:00:00",
            "title": "It's Aphelion Day, When Earth Is Farthest From The Sun. Here's Why",
            "author": "Jamie Carter",
            "url": "https://www.forbes.com/sites/jamiecartereurope/2025/07/03/its-aphelion-day-when-earth-is-farthest-from-the-sun---so-why-the-heatwave",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/685e9feb2a8ecb2fb84d0d6a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "Earth is today at aphelion, the point in its orbit at which it is farthest from the sun. At 3:54 p.m. EDT on Thursday, July 3, Earth will be 94.5 million miles (152 million kilometers) from the Sun. On Jan. 4, on Earth received its maximum radiation from sun, which was at its largest in the sky for 2025. The Earth rotates on a tilted axis and its 23.4-degree tilt determines the seasons."
        },
        {
            "published_date": "2025-07-03T08:34:30",
            "title": "Australian Island in Storm's Eye: Conditions Ease",
            "author": "James Carter",
            "url": "https://www.archyde.com/australian-island-in-storms-eye-conditions-ease",
            "url_media": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-roof-blown-off-a-premises-in-long-jetty-central-coast-CUTXSICG4NHUTGS6QOJUI2F53Q.jpg?auth=67f0179f831c2107bf715fac4646fce7609746b2fcf4dc9802a3de8d251497ef&quality=70&width=600&height=315&focal=572%2C282",
            "country": "US",
            "language": "en",
            "summary": "Australia's recent east coast storms have caused a lot of damage and disruption. The recent storms highlight the increasing intensity and unpredictability of extreme weather. The future of weather resilience lies in strategic investments. Government, businesses and individuals need to take a more proactive approach."
        },
        {
            "published_date": "2025-07-03T08:30:40",
            "title": "What Are Urban Heat Islands?",
            "author": "Deutsche Welle",
            "url": "https://www.latestly.com/agency-news/what-are-urban-heat-islands-6970162.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/07/73108963_403-784x441.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures are creating more extreme heat events in regions all over the world. Urban areas are hotter than their rural surroundings due to buildings, paved areas and human activities such as driving cars. The urban centers of London and Paris often record temperatures of 4 degrees Celsius higher than rural surroundings at night. Global warming is caused by burning planet-heating fossil fuels that release greenhouse gas emissions."
        },
        {
            "published_date": "2025-07-03T08:03:14",
            "title": "What are urban heat islands?  – DW – 07/03/2025",
            "author": "Sarah Steffen",
            "url": "https://www.dw.com/en/climate-lexicon-hotter-world-climate-change-greening-cities-solutions/a-73125012",
            "url_media": "https://static.dw.com/image/73087754_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Rising temperatures are creating more extreme heat events in regions all over the world. Urban heat islands are significantly hotter than their rural surroundings due to buildings, paved areas and human activities such as driving cars. The urban centers of London and Paris often record temperatures of around 4 degrees Celsius higher than rural surroundings at night. The heat island effect is compounded by the rise in overall global temperatures."
        },
        {
            "published_date": "2025-07-03T08:00:00",
            "title": "From Kenya to the world: This is how we made it big in Australia",
            "author": "Michael Ochieng’",
            "url": "https://nation.africa/kenya/life-and-style/mynetwork/from-kenya-to-the-world-this-is-how-we-made-it-big-in-australia--5103504",
            "url_media": "https://nation.africa/resource/image/5103528/landscape_ratio3x2/1200/800/a5418ea7323ede8d50c0b5165ee0f07a/ZQ/nt-cover.jpg",
            "country": "KE",
            "language": "en",
            "summary": "A growing number of Kenyans are carving out vibrant new lives in Australia. They are drawn by world-class education, career opportunities and a refreshing lifestyle shift, they're stepping boldly into uncharted territory and thriving there.      Â"
        },
        {
            "published_date": "2025-07-03T07:51:58",
            "title": "Drivers warned about having windows down over 'swarms' of bug",
            "author": "Richard Guttridge",
            "url": "https://www.birminghammail.co.uk/motoring/motoring-news/drivers-warned-having-windows-down-31981847",
            "url_media": "https://i2-prod.birminghammail.co.uk/article31863457.ece/ALTERNATES/s1200/0_cars1.jpg",
            "country": "GB",
            "language": "en",
            "summary": "It's been warm across much of England for weeks and drivers are warned about having their windows down during the current warm weather. It's the time of the year when flying ants thrive. They could be a distraction inside the car, or cause visibility problems if landing on the windscreen."
        },
        {
            "published_date": "2025-07-03T07:31:35",
            "title": "The 'rule' Aussies must follow if they see one of world's rarest creatures",
            "author": "Michael Dahlstrom",
            "url": "https://au.news.yahoo.com/the-rule-aussies-must-follow-if-they-see-one-of-worlds-rarest-creatures-073134532.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/9.tMIsoxM1FwRYrYh4mgBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://s.yimg.com/os/creatr-uploaded-images/2025-07/f808e0a0-57d4-11f0-b9fc-07620db217b8",
            "country": "US",
            "language": "en",
            "summary": "The endangered orange-bellied parrot has migrated from Tasmania to Victoria and South Australia, but only 18 have been seen. BirdLife Australia needs the public's help to find them. They are hard to spot as they are the size of a budgie and blend in perfectly with the shrubby landscape they like to inhabit. The species is threatened by habitat destruction, feral animals and wind farms."
        },
        {
            "published_date": "2025-07-03T07:30:14",
            "title": "Beyond carbon: big four banks urged to capture more gas",
            "author": "Jennifer Dudley-Nicholson",
            "url": "https://www.theleader.com.au/story/9007940/beyond-carbon-big-four-banks-urged-to-capture-more-gas",
            "url_media": "https://www.theleader.com.au/images/transform/v1/crop/frm/silverstone-feed-data/19f0228e-99e0-4bab-9488-f136783ea580.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Australia's big four banks are being urged to take greater action against climate change. A study found none of them were specifically identifying emissions of a major greenhouse gas and they need to do more to address it.      Â   y  "
        },
        {
            "published_date": "2025-07-03T07:00:49",
            "title": "Scientist warns shortest day in history is coming in weeks",
            "author": "OSHEEN YADAV",
            "url": "https://www.dailymail.co.uk/galleries/article-14869471/Scientist-warns-shortest-day-history-coming-weeks.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/07/01/21/99907283-0-image-a-10_1751400238547.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Since 2020, Earth's rotation has been slightly faster than usual. The fastest day recorded so far was on July 5, 2024, when Earth spun 1.66 milliseconds faster than the standard 24 hours. Scientists are studying what's happening inside the Earth to figure out what's going on."
        },
        {
            "published_date": "2025-07-03T06:45:00",
            "title": "Overshooting 1.5 degrees: What happens now?",
            "author": "Hannah Daly",
            "url": "https://www.irishtimes.com/environment/climate-crisis/2025/07/03/overshooting-15-degrees-what-now",
            "url_media": "https://www.irishtimes.com/resizer/v2/66XFDT6NUOER2AQWV5CVEDUDAE.jpg?smart=true&auth=91b98ae69259c74e5b4d64a330ec8fad125500be4cb291c9fb55e3421b61e236&width=1200&height=630",
            "country": "IE",
            "language": "en",
            "summary": "In 2024, the hottest year ever recorded, global temperatures averaged 1.6 degrees above pre-industrial levels. The Paris Agreement's 1.5 degrees of global warming threshold will be exceeded this decade, likely before the end of 2027. Stabilising global temperatures requires cutting greenhouse gases rapidly and removing carbon dioxide from the atmosphere at gigantic scales."
        },
        {
            "published_date": "2025-07-03T06:34:11",
            "title": "European heat wave triggers plans to reduce emissions",
            "author": "The Nation",
            "url": "https://www.latestnigeriannews.com/p/4363163/european-heat-wave-triggers-plans-to-reduce-emissions.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "The European Union presented plans to reduce greenhouse gas emissions under scorching temperatures yesterday. Europe's heat wave yesterday helped fuel a deadly wildfire in Spain. The blaze broke out because of the heat wave and the EU's present plans to cut down on emissions.  "
        },
        {
            "published_date": "2025-07-03T06:28:00",
            "title": "Antarctica's Research Race: A Global Crossroads",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3490697-antarcticas-research-race-a-global-crossroads",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/31_05_2024_13_09_00_860635.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Umea University reports on the critical issue of Antarctic ice loss affecting global sea levels, ocean currents, and ecosystems. Leadership in this field is shifting, with China surpassing the United States. The Antarctic Treaty System faces challenges in decision-making and environmental protections due to geopolitical tensions."
        },
        {
            "published_date": "2025-07-03T06:00:22",
            "title": "‘They are a species on the brink': can trees save the salmon in Scotland's River Dee?",
            "author": "Karen McVeigh",
            "url": "https://www.theguardian.com/environment/2025/jul/03/they-are-a-species-on-the-brink-can-trees-save-the-salmon-in-scotlands-river-dee",
            "url_media": "https://i.guim.co.uk/img/media/2e2899850034877c57def589737cef432ec0f0e9/803_0_4840_3872/master/4840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=72220b8b09ddbbc5b0489c19455a6803",
            "country": "GB",
            "language": "en",
            "summary": "Edwin Third works on the River Muick, a tributary of the UK's highest river, the Dee, in Aberdeenshire. He is concerned about the decline of spring salmon in the Dee's Special Area of Conservation due to climate change. A 20-year, £5m project called 'Save the Spring' aims to halt the decline."
        },
        {
            "published_date": "2025-07-03T06:00:00",
            "title": "Is that the buzzing sound of climate change worsening sleep apnea?",
            "author": "Devika Rao",
            "url": "https://theweek.com/health/climate-change-effect-sleep-apnea",
            "url_media": "https://cdn.mos.cms.futurecdn.net/mk6BueoQfChCZLQXqxsqaT.jpg",
            "country": "US",
            "language": "en",
            "summary": "Increasing global temperatures are ruining sleep quality across the world. Obstructive sleep apnea (OSA) is expected to have up to a three-fold increase by 2100 in countries with temperatures 1.8 °C (3.2 °F) or more above preindustrial levels. OSA can cause daytime sleepiness, gasping or choking at night, high blood pressure and headaches. Untreated OSA is associated with decreases in workplace productivity and absenteeism. It could cost the U.S. economy nearly $87 billion per year."
        },
        {
            "published_date": "2025-07-03T05:46:36",
            "title": "Gardeners told to sprinkle chilli powder in garden this July",
            "author": "Sam Dimmer",
            "url": "https://www.nottinghampost.com/news/uk-world-news/gardeners-told-sprinkle-chilli-powder-10314833",
            "url_media": "https://i2-prod.nottinghampost.com/news/uk-world-news/article10314832.ece/ALTERNATES/s1200/0_Long-tailed-tit-perching-on-a-bird-feeding-station-with-high-energy-food-Facing-right-Clean-background.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Gardeners are encouraged to sprinkle chilli powder in their gardens this July to scatter food for peckish birds. Bird populations are under threat in the UK as food availability continues to dwindle. The drastic decrease in insect numbers - down by as much as 60% in the last two decades due to habitat loss and climate change - is having ripple effects up the food chain, putting birds at risk of starvation."
        },
        {
            "published_date": "2025-07-03T05:42:20",
            "title": "Good COP, bid COP",
            "author": "",
            "url": "https://www.themonthly.com.au/karen-middleton/2025-07-03/good-cop-bid-cop",
            "url_media": "https://admin.themonthly.com.au/sites/default/files/styles/blank/public/2025-07/Middleton_030725_social.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Australia and Türkiye are in a stand-off over hosting the COP31 in 2026. The Albanese government is pitching its bid, in partnership with Pacific Island countries, for Adelaide to host the event. Australia has majority support within the Western Europe and Others Group (WEOG) within the UNFCC, one of five groupings that rotate hosting duties."
        },
        {
            "published_date": "2025-07-03T05:07:12",
            "title": "UNEP, GCF step up support for climate change adaptation",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/news/20250703/earth-today-unep-gcf-step-support-climate-change-adaptation",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/07/03/3173346/8331873.jpg?itok=YXEdZaP-",
            "country": "JM",
            "language": "en",
            "summary": "Green Climate Fund (GCF) will give Ghana, Maldives and Mauritania more than US$120 million to improve their climate resilience. UNEP developed the projects for the three countries at their request. In Ghana, 619,000 people are to benefit directly, while early warning alerts will reach up to 2.9 million people. In Maldives, more than half a million people will benefit and in Mauritania, 85,000 will benefit directly."
        },
        {
            "published_date": "2025-07-03T05:07:02",
            "title": "‘Pick up the pace!'",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/news/20250703/earth-today-pick-pace",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/07/03/3173319/8331848.jpg?itok=YKSwc1Ce",
            "country": "JM",
            "language": "en",
            "summary": "The Alliance of Small Island States (AOSIS) has called for a significant pick-up in the pace of the global response to climate change. AOSIS represents 39 small island and low-lying coastal developing states in international climate change and sustainable development negotiations. They have long championed the 1.5 degrees Celsius target as key to ensuring that they do not become victims to their vulnerabilities."
        },
        {
            "published_date": "2025-07-03T05:06:01",
            "title": "Long Nanny seabird colonies decreasing in Northumberland, National Trust warns",
            "author": "Luke Walton",
            "url": "https://www.bbc.com/news/articles/cp8m9jnqmm6o",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/83b8/live/f2a0c7b0-5787-11f0-a627-bd8dd9636891.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Long Nanny, near Beadnell, Northumberland, has the largest population of Artic terns in the UK. The number of breeding pairs at the site has dropped from 1,037 last year to 724 this year. The exact cause of the fall is still being explored."
        },
        {
            "published_date": "2025-07-03T04:56:00",
            "title": "Responding To Coastal Erosion In Grassy Head",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/responding-to-coastal-erosion-in-grassy-head-1490171",
            "url_media": "https://www.kempsey.nsw.gov.au/files/sharedassets/public/v/2/images/departments/community-partnerships/read-amp-recovery/20250626_115944.jpg?w=1200",
            "country": "US",
            "language": "en",
            "summary": "Severe weather and surf conditions have caused significant coastal erosion at Grassy Head. The beach access points are currently unusable. Council will begin repair works on the public access point on Friday 4 July and Monday 7 July. The works will extend the existing ramp and provide a temporary fix. A full assessment is expected next week."
        },
        {
            "published_date": "2025-07-03T04:34:59",
            "title": "Africa: Climate Change Has Doubled the World's Heatwaves - How Africa Is Affected",
            "author": "Joyce Kimutai",
            "url": "https://allafrica.com/stories/202507030003.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "A review of extreme heat has found that climate change has increased the number of heatwaves and made them worse and more harmful. The report also identified 67 extreme heat events that were influenced by climate change. In Africa, the most strongly climate-influenced heatwave took place between 14 and 30 December 2024 and affected 42 of Africa's 54 countries."
        },
        {
            "published_date": "2025-07-03T04:22:46",
            "title": "Droughts push millions to starvation, says UN-backed report",
            "author": "Latestnigeriannews",
            "url": "https://www.latestnigeriannews.com/p/4362851/droughts-push-millions-to-starvation-says-unbacked-report.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "New report raised concerns that droughts, fuelled by climate change and relentless pressure on land and water, have escalated, triggering cascading shocks to food, energy, ecosystems and human survival across the world. Droughts push millions to starvation, says UN-backed report."
        },
        {
            "published_date": "2025-07-03T04:14:00",
            "title": "Experts Call For Increased Climate Finance To Power Locally Led Adaptation Initiatives",
            "author": "Undp Pac...",
            "url": "https://www.scoop.co.nz/stories/WO2507/S00044/experts-call-for-increased-climate-finance-to-power-locally-led-adaptation-initiatives.htm",
            "url_media": "http://img.scoop.co.nz/stories/images/1908/scoop_image.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "African leaders, scientists, youth activists and faith-based organizations are calling for a significant increase in climate finance to support adaptation and resilience-building across the continent. The conference, titled Vatican African Conference on Climate Resilience, was convened under the auspices of the Pontifical Academy of Sciences. It follows on the momentum of the 2023 African Climate Summit and Africa Youth Climate Assembly Declaration."
        },
        {
            "published_date": "2025-07-03T04:06:26",
            "title": "Fastest Day Ever: Earth's Speeding Rotation Explained",
            "author": "",
            "url": "https://www.archyde.com/fastest-day-ever-earths-speeding-rotation-explained",
            "url_media": "https://image.hurimg.com/i/hurriyet/75/0x0/68653e9caf493530ec1b15df.jpg",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation is speeding up. This summer, Earth's rotations could be shorter by 1.30, 1.38, and 1.51 milliseconds. This phenomenon could affect numerous critical systems, including satellite communications, GPS accuracy, and even the precision of timekeeping itself."
        },
        {
            "published_date": "2025-07-03T04:01:00",
            "title": "1900 Scientists Say 'Climate Change Not Caused by CO2",
            "author": "Mark Keenan",
            "url": "https://www.lewrockwell.com/2025/07/no_author/1900-scientists-say-climate-change-not-caused-by-co2",
            "url_media": "https://www.lewrockwell.com/wp-content/uploads/2025/07/Picture2-255x300.jpg",
            "country": "US",
            "language": "en",
            "summary": "Millions of people are concerned about climate change and believe there is a climate emergency. Many scientists dispute the UN-promoted man-made climate change theory. Almost 2,000 of the world's leading climate scientists and professionals in over 30 countries have signed a declaration that there is no CO2-induced climate change. The ICSF provides a lecture series with scientific evidence that contradicts the UN assertions."
        },
        {
            "published_date": "2025-07-03T03:31:00",
            "title": "European settlers committed genocide in Australia, finds probe",
            "author": "AFP",
            "url": "https://timesofindia.indiatimes.com/world/rest-of-world/european-settlers-committed-genocide-in-australia-finds-probe/articleshow/122215234.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-122215234,width-1070,height-580,imgsize-null,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "A truth-telling inquiry in Victoria has found that European settlers committed genocide against Australia's Indigenous people. The report of the four-year royal commission said mass killings, disease, sexual violence, child removal and assimilation had led to the \"near-complete destruction\" of Indigenous people in the state."
        },
        {
            "published_date": "2025-07-03T03:30:46",
            "title": "Europe swelters through record heatwave",
            "author": "Sky News Australia",
            "url": "https://www.msn.com/en-au/news/other/europe-swelters-through-record-heatwave/ar-AA1HS9jV",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Europe is sweltering through a record-breaking heatwave. Wildfires are burning in Turkey and Greece. Parisian workers have been feeling the strain of extreme temperatures. People in Germany are travelling to Munich to cool down. A zoo in Rome is serving frozen treats to its animals."
        },
        {
            "published_date": "2025-07-03T03:24:19",
            "title": "Experiencing extreme weather and disasters is not enough to change views on climate action, study shows",
            "author": "Omid Ghasemi",
            "url": "https://theconversation.com/experiencing-extreme-weather-and-disasters-is-not-enough-to-change-views-on-climate-action-study-shows-260308",
            "url_media": "https://images.theconversation.com/files/678033/original/file-20250703-56-3zen0t.jpg?ixlib=rb-4.1.0&rect=0%2C882%2C5616%2C2808&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Extreme weather events such as bushfires and floods are more frequent and more likely due to climate change. The Trust in Science and Science-related Populism survey measures public support for climate policies and the extent that people think climate change is behind increases in extreme weather. People who more strongly believe climate change has worsened these events are more likely to support climate policies. People in countries with higher exposure to extreme weather events do not support climate action."
        },
        {
            "published_date": "2025-07-03T03:13:44",
            "title": "$457 million gone? BC farmers sound alarm after seven years of losses amid exploding land prices and climate disaster",
            "author": "",
            "url": "https://economictimes.indiatimes.com/news/international/canada/457-million-gone-bc-farmers-sound-alarm-after-seven-years-of-losses-amid-exploding-land-prices-and-climate-disaster/articleshow/122217401.cms",
            "url_media": "https://img.etimg.com/photo/42031747.cms",
            "country": "IN",
            "language": "en",
            "summary": "British Columbia farmers recorded a net loss of $456.9 million in 2024. It's the highest agricultural loss among all Canadian provinces. The BC Agriculture Council cites rising land costs and climate disasters as key factors. The council urges the government to update the Agricultural Land Reserve and seek increased compensation for climate-related losses."
        },
        {
            "published_date": "2025-07-03T03:02:04",
            "title": "Climate Change Office Launches Cost of Inaction Study and National Framework",
            "author": "",
            "url": "https://lovefm.com/climate-change-office-launches-cost-of-inaction-study-and-national-framework",
            "url_media": "https://lovefm.com/wp-content/uploads/2025/07/SARGASSUM-FORUM-min-300x169.jpg",
            "country": "BZ",
            "language": "en",
            "summary": "The National Climate Change Office has launched the Cost of Inaction Study and the National Loss & Damage Framework. Stakeholders and technical teams are convening at the Ministry of Sustainable Development Auditorium in Belmopan from July 1-3 to strengthen Belize's ability to assess and address climate-related loss and damage."
        },
        {
            "published_date": "2025-07-03T03:00:00",
            "title": "Climate change cannot be denied, unless you're of the 'flat Earth' variety",
            "author": "Letters to the Editor",
            "url": "https://www.bordermail.com.au/story/9007209/border-mail-letters-bm-readers-slam-writers-denials-on-climate",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/zTpV5j6X6iLmSh5SbcmSaP/36da948d-a04d-4da0-999d-8c6ce2c6c8ba.jpg/r0_407_3504_2247_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Denying the facts is an absurdity from the land of Flat Earthers. I try to force myself not to submit letters in response to nonsense on climate change, such as that by George Krooglik (The Border Mail, June 28), but I have little willpower."
        },
        {
            "published_date": "2025-07-03T02:55:51",
            "title": "Fastest Day Ever? Earth's Speed Increase",
            "author": "",
            "url": "https://www.archyde.com/fastest-day-ever-earths-speed-increase-hurriyet",
            "url_media": "https://www.archyde.com/wp-content/uploads/2025/05/archydegemini.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation is experiencing unexpected changes, leading to noticeably shorter days. Geological processes, movements within the Earth's core, climate change-related shifts in mass distribution across the planet are all potential factors. Shorter days can affect various technologies, including satellite communication, GPS systems, and high-frequency trading platforms. The introduction of 'leap seconds' to compensate for variations in Earth's rotation rate may require new approaches."
        },
        {
            "published_date": "2025-07-03T02:45:35",
            "title": "Earth Became a Hothouse 250 Million Years Ago, And We Finally Know Why",
            "author": "The Conversation",
            "url": "https://www.sciencealert.com/earth-became-a-hothouse-250-million-years-ago-and-we-finally-know-why",
            "url_media": "https://www.sciencealert.com/images/2025/07/HothouseEarth.jpg",
            "country": "AU",
            "language": "en",
            "summary": " 252 million years ago, almost all life on Earth disappeared. The decline of tropical forests locked Earth in a hothouse state. Earth warmed too rapidly, leading to the dying out of low- to mid-latitude vegetation, especially the rainforests. The efficiency of the organic carbon cycle was greatly reduced immediately after the volcanic eruptions."
        },
        {
            "published_date": "2025-07-03T02:40:16",
            "title": "Scorched Reality",
            "author": "Statesman News Service",
            "url": "https://www.thestatesman.com/opinion/scorched-reality-1503452789.html",
            "url_media": "https://www.thestatesman.com/wp-content/uploads/2025/07/IMG_6070.webp",
            "country": "IN",
            "language": "en",
            "summary": "A searing heat-wave has descended upon Europe with a vengeance. Wildfires in Turkey have forced over 50,000 people to flee their homes, while France, Spain, Italy, Germany, and even the typically temperate Netherlands are under weather warnings. This is not just a passing inconvenience, but a signal of profound planetary imbalance. The climate emergency is already reshaping the rhythms of daily life across continents. The Rhine River in Germany, a critical trade artery, is running too low for cargo traffic, highlighting how economic systems are being impaired by ecological changes."
        },
        {
            "published_date": "2025-07-03T02:34:09",
            "title": "Four years after horrific B.C. heat dome: improvements, enduring risks, and no plans for a memorial",
            "author": "Penny Daflos",
            "url": "https://www.ctvnews.ca/vancouver/article/four-years-after-horrific-bc-heat-dome-improvements-enduring-risks-and-no-plans-for-a-memorial",
            "url_media": "https://www.ctvnews.ca/resizer/v2/5IVBDFPTV56GHHEKSHECQLR5QA.jpg?smart=true&auth=e418c03d76d321ce85a314279fe7a683cf9abb1cda5297a802eb26f7780ae943&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": "Hundreds died in extreme heat four years ago. CTV News looks at how the province has adapted its response and if more changes still need to be made to prevent future deaths in the future. iReport.com: What are your thoughts on the provincial response to extreme heat?"
        },
        {
            "published_date": "2025-07-03T02:31:55",
            "title": "Can a moose burger win you over? My surprising taste test in Canada",
            "author": "Alex Mitcheson",
            "url": "https://www.bordermail.com.au/story/9002605/moose-burgers-a-taste-of-newfoundlands-culinary-culture",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/130854433/60483965-e6e8-4da5-8488-4e78b693dcd3.jpg/r316_233_2121_1181_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "It's warm and sunny in St John's, Newfoundland, Canada's east coast, but the weather is not what the author was expecting. He's wearing sunscreen.      Â   in the streets of St John’s, Newfoundland."
        },
        {
            "published_date": "2025-07-03T02:31:55",
            "title": "Not your typical burger - this Canadian version will surprise your taste buds",
            "author": "Alex Mitcheson",
            "url": "https://www.hawkesburygazette.com.au/story/9002605/moose-burgers-a-taste-of-newfoundlands-culinary-culture",
            "url_media": "https://www.hawkesburygazette.com.au/images/transform/v1/crop/frm/130854433/60483965-e6e8-4da5-8488-4e78b693dcd3.jpg/r316_233_2121_1181_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "It's warm and sunny in St John's, Newfoundland, Canada's east coast, but the weather is not what the author was expecting. He's wearing sunscreen.      Â   in the streets of St John’s, Newfoundland."
        },
        {
            "published_date": "2025-07-03T02:31:51",
            "title": "UN Climate Expert Urges Criminalization of Fossil Fuel Disinformation to Protect Basic Human Rights",
            "author": "Cristen Hemingway Jaynes",
            "url": "https://www.ecowatch.com/climate-crisis-disinformation-criminalization.html",
            "url_media": "https://www.ecowatch.com/wp-content/uploads/2025/07/scientists-politicians.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Elisa Morgera, UN Special Rapporteur on human rights and climate change, presented a report to the General Assembly on Monday. She called for the criminalization of spreading disinformation regarding the climate crisis and a complete ban on fossil fuel lobbying and advertising by the industry. She argues that rich fossil fuel countries are legally bound by international law to phase out gas, oil and coal by the end of the decade."
        },
        {
            "published_date": "2025-07-03T02:12:00",
            "title": "Historic Aerial Photos Aid Sea Level Rise Prediction",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/historic-aerial-photos-aid-sea-level-rise-1489572",
            "url_media": "https://news.ku.dk/all_news/2025/07/old-aerial-photos-give-scientists-a-new-tool-to-predict-sea-level-rise/billedinformationer/IshyldeTop.png",
            "country": "US",
            "language": "en",
            "summary": "On 28 November 1966, an American aeroplane flies over the Antarctic Peninsula. The photographer takes an aerial photo of the Wordie Ice Shelf. 30 years later, the ice shelf has almost vanished after a total collapse. Antarctica is far away, but areas like Denmark are affected by sea level rise caused by ice shelf collapses. A new research study provides insights that can help identify signs of collapse in ice shelves and assess the stage of collapse."
        },
        {
            "published_date": "2025-07-03T02:08:00",
            "title": "Fire reported south of Merritt off Highway 5",
            "author": "Bc Wildfire Service",
            "url": "https://www.vernonmorningstar.com/home/fire-reported-south-of-merritt-off-highway-5-8108635",
            "url_media": "https://www.bpmcdn.com/f/files/publishergroup/bc-wildfire-2025/screenshot-66.jpg;w=1200;h=800;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "The BC Wildfire Service is responding to a fire south of Merritt on Highway 5. Human activity is believed to have started the fire. The fire is estimated to be about 0.3 hectares in size. It is not currently impacting travel along the highway."
        },
        {
            "published_date": "2025-07-03T01:51:49",
            "title": "Aviation Climate Strategies Favor Non-CO2 Solutions",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/aviation-climate-strategies-favor-non-co2-solutions",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/07/Aviation-Climate-Strategies-Favor-Non-CO2-Solutions-1751507512.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The aviation industry is a significant contributor to global climate change. For decades, the bulk of aviation climate policies have focused on reducing CO₂ emissions. However, NOₓ emissions and persistent contrails exert positive radiative forcing analogous to CO⁂. A study by Prather, Gettelman, and Penner (2025) delves into the complex trade-offs involved in mitigating different components of aviation's climate footprint."
        },
        {
            "published_date": "2025-07-03T01:45:00",
            "title": "How people die from extreme heat",
            "author": "Stars Insider",
            "url": "https://www.msn.com/en-my/news/other/how-people-die-from-extreme-heat/ss-AA1HPF3u",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The world is being blasted by extreme temperatures. People are struggling to keep cool and wildfires are rampant. People keep dying as a consequence. Click through to find out what happens to a person's body under severe heat and how it can lead to death.   "
        },
        {
            "published_date": "2025-07-03T01:41:46",
            "title": "Map Shows Cities Climate Change Disaster Would Destroy",
            "author": "Knewz Staff",
            "url": "https://www.msn.com/en-ca/weather/climate-change/map-shows-cities-climate-change-disaster-would-destroy/ar-AA1HSlma",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The National Oceanic and Atmospheric Administration has created a map showing the impact of the Thwaites glacier melting on the U.S. coastlines. States at risk include New York, Texas, California, Virginia, South Carolina, Georgia, Florida, Miami, Atlantic City, New York City, Charleston, Savannah and Virginia Beach."
        },
        {
            "published_date": "2025-07-03T01:26:00",
            "title": "Extreme Weather Fails to Shift Climate Action Views",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/extreme-weather-fails-to-shift-climate-action-1490028",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1487956382158-bb926046304a%3Fixlib%3Drb-1.2.1%26amp%3Bixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1351%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather events such as bushfires and floods are more frequent and more likely due to climate change. The Trust in Science and Science-related Populism survey measures public support for climate policies and the extent that people think climate change is behind increases in extreme weather. People who more strongly believe climate change has worsened these events are more likely to support climate policies. People in countries with higher exposure to extreme weather events do not show greater support for such policies."
        },
        {
            "published_date": "2025-07-03T01:17:16",
            "title": "China's Plum Rains Unleash Havoc",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3490518-chinas-plum-rains-unleash-havoc",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/03_07_2025_01_17_16_0270956.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The annual 'Plum Rains' wreak havoc in China's northern and western regions. Thousands of rescue workers are deployed across the country, pulling people from floodwaters. In Henan province's town of Taiping, over 1,000 rescue workers were dispatched after torrential rains led to a river bursting its banks, resulting in five deaths and three missing persons. The severe weather disrupted transportation, with train services to Beijing suspended and flights delayed."
        },
        {
            "published_date": "2025-07-03T01:16:05",
            "title": "Why Did Major US Climate Report Websites Suddenly Go Dark?",
            "author": "Edited by:",
            "url": "https://www.timesnownews.com/world/us/us-news/why-did-major-us-climate-report-websites-suddenly-go-dark-article-152203798",
            "url_media": "https://images.timesnownews.com/thumb/msid-152203799,thumbsize-959735,width-1280,height-720,resizemode-75/152203799.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The websites for the National Climate Assessments and the US Global Change Research Program were offline on Monday and Tuesday. The sudden disappearance has raised concerns about transparency, public access to scientific data and the potential risks for communities confronting growing climate challenges. The information was being moved to NASA to meet legal requirements."
        },
        {
            "published_date": "2025-07-03T01:01:41",
            "title": "Coastal erosion inaction has home owners on brink",
            "author": "Tom Wark",
            "url": "https://www.theleader.com.au/story/9007335/coastal-erosion-inaction-has-home-owners-on-brink",
            "url_media": "https://www.theleader.com.au/images/transform/v1/crop/frm/silverstone-feed-data/2f71109e-6e65-4f1e-847c-ec261a0d04df.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Residents of a beachfront community slipping into the sea are crying out for help. There's relief the latest storm deposited sand rather than took it away, as it did in the previous storm.    in this case, the sand deposited sand and did not take away."
        },
        {
            "published_date": "2025-07-03T00:50:54",
            "title": "Priorities for consent-based and well-supported climate relocations",
            "author": "Bower",
            "url": "https://news.knowledia.com/all/all/articles/priorities-for-consent-based-and-well-supported-climate-relocations-f7b7f041fae2662b3dcff9caa3861ee6f4727aa7",
            "url_media": "http://eprints.lse.ac.uk/style/images/plus.png",
            "country": "FR",
            "language": "en",
            "summary": "Climate-related planned relocations are happening globally yet vary significantly. Durand-Delacre, Piggott-Mckellar, Gini, and Harrington-Abrams write about this topic. They draw on diverse sources to draw their conclusions.  "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Heatwaves, drought grip Europe, fueling calls for global action",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250703/40c03c8004c14344b33e3878e4f48bfa/c.html",
            "url_media": "https://english.news.cn/20250703/40c03c8004c14344b33e3878e4f48bfa/2025070340c03c8004c14344b33e3878e4f48bfa_CbsbeeE007008_20250703_CBMFN0A001.JPG",
            "country": "CN",
            "language": "en",
            "summary": "Extreme heat and drought conditions are sweeping across Europe, triggering wildfires and economic strain. Experts warn of a global \"new era of drought\" driven by climate change and urge global action and collaboration. Germany is experiencing what may be its hottest day of the year on Wednesday, with temperatures forecast to reach 40 degrees Celsius. In the Czech Republic, the national meteorological institute warned of \"very high temperatures\" and increased fire danger. Slovakia's meteorological authority issued its highest-level red alert for 10 districts on Thursday. Spain is experiencing a record-breaking heatwave, with June 2025 confirmed as the country's hottest month on record. Slovenia's Environment Agency noted that June 2025 was the driest month"
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Spain continues to endure record-breaking heatwave",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/07/03/Spain_continues_to_endure_recordbreaking_heatwave",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "More than 100 monitoring stations of the Spanish meteorological agency AEMET registered temperatures exceeding 40 degrees Celsius during the first major heatwave of the year. People walk with a parasol in Seville, Spain, July 2, 2025.   . "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Europe's heatwave: Temperature hits 40°C in Germany",
            "author": "The National",
            "url": "https://article.wn.com/view/2025/07/03/Europes_heatwave_Temperature_hits_40_C_in_Germany",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are set to reach 40°C in Germany on Wednesday. It will be the hottest day of the year in Germany so far this year, according to the weather forecasters. The average temperature in Germany is 32°C on Wednesday this year."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Africa: Climate Change Has Doubled the World's Heatwaves - How Africa Is Affected",
            "author": "All Africa",
            "url": "https://article.wn.com/view/2025/07/03/Africa_Climate_Change_Has_Doubled_the_Worlds_Heatwaves_How_A",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A global review of extreme heat has found that between May 2024 and May 2025, nearly half of the world's population will be affected by heatwaves.       .   \"Almost half\" of the population will suffer from heatwaves between 2024 and 2025. "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Antarctic research is in decline, and the timing couldn't be worse",
            "author": "Deccan Herald",
            "url": "https://article.wn.com/view/2025/07/03/Antarctic_research_is_in_decline_and_the_timing_couldn_t_be_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Elizabeth Leane and Keith Larson write for The Conversation that the UK needs to significantly expand its research efforts in Antarctica. They discuss ice loss in Antarctica and its impact on the planet, sea level rise, changes to ocean currents and disturbance of wildlife and food webs."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "How much does a heat wave cost? Insurers and CEOs want to know",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/03/How_much_does_a_heat_wave_cost_Insurers_and_CEOs_want_to_kno",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As extreme heat events intensify, financial risks are becoming more apparent, prompting the development, says the government.      “The development is necessary to prevent financial risks from financial risks.”   \"The development will help prevent the financial risks.\" "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Australia should invest in new environmental monitoring systems: ANU expert (The Australian National University)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/07/03/Australia_should_invest_in_new_environmental_monitoring_syst",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change has altered Australia's environment and biodiversity over the past 25 years. The number of threatened species has risen by more than 50 per cent. Average temperatures have increased by 0.81 degrees Celsius and there's been a rise in the number of species threatened."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Wind gust record set as more flights cancelled between Brisbane and Sydney",
            "author": "system",
            "url": "https://article.wn.com/view/2025/07/03/Wind_gust_record_set_as_more_flights_cancelled_between_Brisb",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A new wind gust record has been set at Brisbane Airport. Weather conditions in New South Wales continue to cause flight cancellations at the airport as a result of the weather conditions in the state continues to cause delays and cancellations for the flights.    "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Weatherwatch: Thirstier atmosphere brings more drought to northern England",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/07/03/Weatherwatch_Thirstier_atmosphere_brings_more_drought_to_nor",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Research shows 'atmospheric evaporative demand' is rising. This is increasing the amount of land vulnerable to drought, according to the research.       .   \"Atmospheric evapotranspiration demand\" is rising, which increases the risk of drought. "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "European settlers committed genocide in Australia, finds probe",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/03/European_settlers_committed_genocide_in_Australia_finds_prob",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A truth-telling inquiry in Victoria has found that European settlers committed genocide against Australia's Indigenous people. The inquiry is calling for an inquiry into the issue.   Â      in the state of Victoria has called for an investigation into the genocide."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "People cool off during heatwave in Vienna, Austria",
            "author": "新华网",
            "url": "https://english.news.cn/20250703/7d194ceb044e4c2da694dc565040b505/c.html",
            "url_media": "https://english.news.cn/20250703/7d194ceb044e4c2da694dc565040b505/202507037d194ceb044e4c2da694dc565040b505_202507037d351d4ccb404baab21aac72261c0fcf.jpg",
            "country": "CN",
            "language": "en",
            "summary": "People cool off along the Danube river during a heatwave in Vienna, Austria, July 3, 2025. Children cool off at a splash pad during the heatwave and ride on a ride during a ride in Vienna on July 3. 2025 in China and Austria."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Laos works to improve early warning for people with disabilities",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250703/e8fc40de20a14b879162d32eeae0338a/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Laos is facing growing risks from hydro-meteorological hazards, such as storms, floods, droughts, and heatwaves, intensified by climate change. Representatives from the Lao government and its partners convened a two-day workshop on strengthening early warning systems for persons with disabilities."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Somalia has relied on aid for decades – can it survive without it?",
            "author": "The Independent",
            "url": "https://article.wn.com/view/2025/07/03/Somalia_has_relied_on_aid_for_decades_can_it_survive_without",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Somalia is struggling with hunger, security and the impact of the climate crisis, despite the efforts of the UNFCCC to tackle the problem.       .   in Somalia is also struggling with the effects of climate change, despite efforts to tackle it."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Earth is farthest from the sun today. So why is it so hot?",
            "author": "Space",
            "url": "https://article.wn.com/view/2025/07/03/Earth_is_farthest_from_the_sun_today_So_why_is_it_so_hot",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Earth is at its farthest point from the sun on July 3. That's why there are high temperatures across the U.S. today. The heat is due to the fact that the Earth is at the farthest distance from the Sun at that time."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "The World's Biggest Carbon Emitters—And The Story Behind The Numbers",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/07/03/The_World_s_Biggest_Carbon_Emitters_And_The_Story_Behind_The",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "China, the U.S., and India top the CO₂ list, but per capita and economic efficiency stats show a deeper climate divide between them and the rest of the world. The numbers are not as clear-cut as they seem, however."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "IFLScience The Big Questions: Are We Living Through A Sixth Mass Extinction?",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/07/03/IFLScience_The_Big_Questions_Are_We_Living_Through_A_Sixth_M",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change, species extinctions and increasing carbon dioxide levels are real threats to biodiversity across the globe. Some have argued that these are warning signs for the future of the planet.    .   i   in the media buzzwords might feel like buzzwords at this point, but they are still real threats."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Deaths, fires, power outages as record heatwave grips Europe",
            "author": "Press TV",
            "url": "https://article.wn.com/view/2025/07/03/Deaths_fires_power_outages_as_record_heatwave_grips_Europe",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A record heatwave gripping Europe has led to multiple fatalities and widespread wildfires. Experts warn of a humanitarian and environmental crisis across the continent. The relentless heat is driven by a persistent 'heat dome' over the continent, which has pushed temperatures to dangerous highs. "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Europe continues to bake in summer heat wave",
            "author": "The Bryan Eagle",
            "url": "https://article.wn.com/view/2025/07/03/Europe_continues_to_bake_in_summer_heat_wave",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Europe's continuing heat wave has fueled a deadly wildfire in Spain. European Union presented plans to reduce greenhouse gas emissions under the scorching temperatures on Wednesday. The EU will present them to the European Parliament later this week.    in Madrid.  in Barcelona."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Wildfires rage on Greek island of Crete amid deadly European heat wave",
            "author": "The Washington Post",
            "url": "https://article.wn.com/view/2025/07/03/Wildfires_rage_on_Greek_island_of_Crete_amid_deadly_European_c",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Blazes are burning in Spain, Greece and Turkey in the wake of record-setting temperatures across much of the continent, including Greece and Spain, due to the recent heatwave. The fires are caused by human-caused wildfires.   Â "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Europe Boils Under Record Heatwaves: Climate Change No Longer a Theory, But a Deadly Reality",
            "author": "Watan",
            "url": "https://article.wn.com/view/2025/07/03/Europe_Boils_Under_Record_Heatwaves_Climate_Change_No_Longer",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is battering Europe from its typically warm southern regions to its colder northern nations. Cities like Paris, Rome, Madrid, and Athens have recorded temperatures exceeding 40°C, prompting the closure of landmarks such as the Eiffel Tower's upper deck and the Atomium."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Experiencing Extreme Weather And Disasters Is Not Enough To Change Views On Climate Action, Study Shows",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/07/03/Experiencing_Extreme_Weather_And_Disasters_Is_Not_Enough_To_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change has made extreme weather events such as bushfires and floods more frequent and more likely in recent years. The trend is expected to continue. These include bushfires, floods and droughts, which are caused by climate change, according to The Conversation."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Shorter days ahead? On THESE three days, Earth is predicted to rotate faster — Here's why",
            "author": "Live Mint",
            "url": "https://article.wn.com/view/2025/07/03/Shorter_days_ahead_On_THESE_three_days_Earth_is_predicted_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Earth's rotation is expected to speed up in July and August. Days will be slightly shorter on July 9, July 22 and August 5, because of this, especially on the July 9th and the July 22nd.    i.e. on July 8th and July 5th."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Last month was Ireland's fourth warmest June on record",
            "author": "Irish Central",
            "url": "https://article.wn.com/view/2025/07/03/Last_month_was_Irelands_fourth_warmest_June_on_record",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "June 2025 was notably warmer than average in Ireland, continuing the recent warmer-than-normal monthly trend, Metireann said in its climate statement. It is the warmest June on record in Ireland so far this year, according to the weather agency. "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Veteran detention deputy suspended six days after social media comments",
            "author": "TCPalm",
            "url": "https://article.wn.com/view/2025/07/03/Veteran_detention_deputy_suspended_six_days_after_social_med",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Deputy Ronald Parker was suspended six days after inappropriate Facebook comments. The Treasure Coast name refers to the Spanish Treasure Fleet that was lost in a 1715 hurricane. It is National Corrections Week May 4th - 10th, according to the St. Lucie County Sheriff."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Wildfires threaten homes in Crete as Europe swelters through heatwave",
            "author": "system",
            "url": "https://article.wn.com/view/2025/07/03/Wildfires_threaten_homes_in_Crete_as_Europe_swelters_through",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greece's fire season is starting earlier and becoming more severe due to climate change, scientists say, because of the warming climate. The fire season in Greece starts earlier and gets worse due to the climate change. The current fire season lasts longer than in the past."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Vanuatu Statement On Inter-American Court Advisory Opinion On The Climate Emergency And Human Rights",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/07/03/Vanuatu_Statement_On_InterAmerican_Court_Advisory_Opinion_On",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The scientific consensus is that human-induced climate change is accelerating and driving widespread and severe impacts. It disproportionately affects developing countries and vulnerable communities, especially in the developing world.    “Climate change is disproportionately affecting developing countries.”  "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "US Military is polluting world more than nations like Sweden and Portugal",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/07/03/US_Military_is_polluting_world_more_than_nations_like_Sweden",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The US military is the world's largest institutional greenhouse gas emitter, surpassing entire nations in pollution, according to a recent study. The US military emits more CO2 than entire nations.      Â   .   y  "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "When rainforests died, the planet caught fire: New clues from Earth's greatest extinction",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/07/03/When_rainforests_died_the_planet_caught_fire_New_clues_from_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "When Siberian volcanoes kicked off the Great Dying, the real climate villain turned out to be the rainforests themselves. Once they collapsed, Earth's climate got worse and so did the planet's atmosphere. The Earth's atmosphere got warmer and the planet got colder. "
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "New public health emergency",
            "author": "Md Mehedi Hasan",
            "url": "https://www.newagebd.net/post/opinion/268997/new-public-health-emergency",
            "url_media": "https://outspoken.newagebd.com/files/img/202507/17ac4403f010f1987eb3bcf12886bbaf_og.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Rising temperatures, erratic rainfall, recurrent floods, saltwater intrusion and worsening air pollution in Bangladesh are putting a strain on the healthcare system. Waterborne diseases like dengue and chikungunya are thriving in warmer temperatures and extended monsoon seasons. The health infrastructure across the country is ill-prepared to meet the demands of climate-linked illnesses. Pregnant women and children are especially vulnerable."
        },
        {
            "published_date": "2025-07-03T00:00:00",
            "title": "Deadly heat pushing Arizona into 'uncharted territory'",
            "author": "STAFF REPORT",
            "url": "https://www.eacourier.com/free-access/deadly-heat-pushing-arizona-into-uncharted-territory/article_8edd8a4d-b5f2-4dc8-9d7d-0a709bcbd8f6.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/eacourier.com/content/tncms/assets/v3/editorial/0/9c/09c1c556-e6e7-4344-a21c-2b84a9dfc016/6866efba13c62.image.jpg?crop=1688%2C886%2C0%2C170&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "In 2024, the max temperature in Phoenix will be at or above 100 degrees for approximately 30 percent of the year. Environmentalists and doctors are worried about the years to come as climate change continues to make the world and Arizona hotter. Last year Arizona saw Arizona last year saw Arizona."
        }
    ]
}