{
    "status": "ok",
    "total_articles": 144,
    "articles": [
        {
            "published_date": "2025-05-07T23:54:51",
            "title": "Drought conditions affect 46% of Mexico, marking improvement from 2024",
            "author": "Mnd Staff",
            "url": "https://mexiconewsdaily.com/news/half-of-mexico-drought",
            "url_media": "https://mexiconewsdaily.com/wp-content/uploads/2025/05/976448_Se-seca-Laguna-Parque-Sierra-Morelos_impreso.jpg",
            "country": "MX",
            "language": "en",
            "summary": "Almost half of Mexico is experiencing some level of drought. Chihuahua, on the U.S. border, was the only state in Mexico to experience extreme and exceptional drought. President Claudia Sheinbaum introduced Mexico's National Water Plan 2024–2030 in November. "
        },
        {
            "published_date": "2025-05-07T23:44:27",
            "title": "Satellites Detect Glacial ‘Ice Piracy'",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/satellites-detect-glacial-ice-piracy",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/05/Satellites-Detect-Glacial-Ice-Piracy.jpeg",
            "country": "TR",
            "language": "en",
            "summary": "Researchers from the University of Leeds have unveiled an unprecedented phenomenon in the Antarctic region: ice piracy. This term describes a glacier's ability to absorb ice from its neighboring glacier. The study highlights the dramatic changes occurring in one of Antarctica's prominent ice streams. It raises concerns about the implications of these changes for global sea level rise."
        },
        {
            "published_date": "2025-05-07T23:43:02",
            "title": "Recent La Niña ends, what this means for the 2025 hurricane season",
            "author": "",
            "url": "https://abc13.com/post/2025-hurricane-season-looming-ahead-now-is-time-get-flood-insurance/16351486",
            "url_media": "https://cdn.abcotvs.net/abcotv/assets/news/ktrk/images/logos/default_1280x720.jpg?w=1600",
            "country": "GB",
            "language": "en",
            "summary": "The hurricane season begins on June 1 and ends on November 30th. This spring will mark the end of the recent La Niña. This week is National Hurricane Preparedness Week. It's a good time to check home and flood insurance policies. If you're in the market for flood insurance, it takes 30 days for the policy to go into effect."
        },
        {
            "published_date": "2025-05-07T23:00:00",
            "title": "Younger Canadians to face far more extreme weather, finds study",
            "author": "Stefan Labbé Glacier Media",
            "url": "https://www.vancouverisawesome.com/environment/younger-canadians-to-face-far-more-extreme-weather-finds-study-10627954",
            "url_media": "https://www.vmcdn.ca/f/files/glaciermedia/images/climate-enviro-solutions/heat-wave/tree-canopy/diane-brisson.jpg;w=1000;h=664;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "The environmental burden on children born in 2020 could far outstrip that of their parents and grandparents if current policies to avoid global warming aren't strengthened. The number of people facing unprecedented lifetime exposure to heatwaves, crop failures, river floods, droughts, wildfires and tropical cyclones will at least double from 1960 to 2020, according to a new study."
        },
        {
            "published_date": "2025-05-07T22:59:02",
            "title": "Unpacking Pakistan's hunger crisis",
            "author": "Assadullah Channa",
            "url": "https://pakobserver.net/unpacking-pakistans-hunger-crisis",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/04/pakistans-gender-gap-in-political-participation-pakobserver-675384.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The World Bank's report warns Pakistan is in a financial crisis. Pakistan is one of the most vulnerable countries in South Asia. Pakistan's agricultural sector employs around 40% of the country's workforce and contributes significantly to the economy. The country's food production has decreased dramatically and the available supply of food is insufficient to meet domestic demand. The political landscape has been fraught with division and uncertainty. The government's inability to address these issues in a timely manner has led to a growing sense of despair among the population."
        },
        {
            "published_date": "2025-05-07T22:56:27",
            "title": "Four seasons in London: what to do in the city come rain, chill or shine",
            "author": "SPRING",
            "url": "https://www.bendigoadvertiser.com.au/story/8504615/experience-londons-charm-and-what-to-do-through-all-four-seasons",
            "url_media": "https://www.bendigoadvertiser.com.au/images/transform/v1/crop/frm/190394412/da8f109f-4bd7-4c52-bea9-95de7403a67b.jpg/r0_154_6000_3304_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "It's spring. The average temperature is 7 degrees. Australians need a visa to travel to the UK and Europe in 2025. Airlines are banning the use of the popular travel gadgets due to fire risk. It takes the average Aussies longer to recover from jet lag."
        },
        {
            "published_date": "2025-05-07T22:13:03",
            "title": "Arctic sea ice has been hitting record lows. Scientists just lost a critical tool for studying it.",
            "author": "Kuac",
            "url": "https://alaskapublic.org/news/alaska-desk/2025-05-07/arctic-sea-ice-has-been-hitting-record-lows-scientists-just-lost-a-critical-tool-for-studying-it",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/265b124/2147483647/strip/true/crop/1760x924+0+124/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F92%2F0b%2Fdf5a5ac647e0b9ca8cc3ff2df666%2Fsea-ice.jpeg",
            "country": "US",
            "language": "en",
            "summary": "NOAA will defund a program that catalogs decades sea ice data in Alaska. Scientists say the program's termination could create a gap in climate research at a time when polar ice is dwindling to historic lows. According to an internal budget document, the Trump administration is seeking to end nearly all of NOAA's climate research."
        },
        {
            "published_date": "2025-05-07T21:19:29",
            "title": "Part of Atlantic sees most cooling in 75 years ahead of hurricane season",
            "author": "Dave Downey",
            "url": "https://www.cbs17.com/weather/part-of-atlantic-sees-most-cooling-in-75-years-ahead-of-hurricane-season",
            "url_media": "https://www.cbs17.com/wp-content/uploads/sites/29/2024/10/AP24283596619383_0260db.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "The Atlantic Ocean was warm last year. The Main Development Region of the Tropical Atlantic cooled the most between January and March since at least 1950. Two other years since 1950 saw similar levels of cooling that followed busy seasons: 1996 and 2018. In 1996, both Bertha and Fran caused significant impacts across North Carolina."
        },
        {
            "published_date": "2025-05-07T21:15:41",
            "title": "County officials and landowners grapple with flood problems at 3 Crabs Road",
            "author": "PEPPER FISHER",
            "url": "https://www.myclallamcounty.com/2025/05/07/county-officials-and-landowners-grapple-with-flood-problems-at-3-crabs-road",
            "url_media": "https://dehayf5mhw1h7.cloudfront.net/wp-content/uploads/sites/958/2025/05/07135210/3-crabs-flooding-1024x651.jpg",
            "country": "US",
            "language": "en",
            "summary": "Homes built on the waterfront along Three Crabs Road in Sequim are in danger of being made unlivable because of rising sea levels and flooding due to increasingly frequent King tides. Many residents have built bulkheads to protect their homes, and many more have applied to Clallam County for permits to do so since a massive tidal surge flooded the area in December. Bruce Emery, Director of Community Development, says there are consequences to the ecosystem and to the properties next door when a property owner builds a bulkhead. In 2004, the county did a federally funded buyout of properties near the mouth of the Dungeness River for floodplain restoration."
        },
        {
            "published_date": "2025-05-07T21:14:24",
            "title": "City of Rockingham wants Penguin Island closed to visitors as concerns for bird population grows",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-05-08/penguin-island-city-of-rockingham-calls-for-closure/105264676",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/58276bbab019c67d1e2a6b937b02b7ab?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=694&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "The population of little penguins on Penguin Island has dropped by 94 per cent since 2007. The city of Rockingham wants to close the tourist attraction for at least two years to restore the population. The state government is working hard to reduce pressures on the little penguin population."
        },
        {
            "published_date": "2025-05-07T21:04:02",
            "title": "How Trump cuts could affect your weather reports",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/how-trump-cuts-could-affect-your-weather-reports-2fd94a3e9e92a2bc2d52754d4ebf7de517f211bd",
            "url_media": "https://images.csmonitor.com/csm/2025/05/0507%20NNOAA%20cockpit%20lede.jpg?alias=standard_1200x800",
            "country": "FR",
            "language": "en",
            "summary": "The proposed budget for the National Oceanic and Atmospheric Administration (NOAA) proposes a $1.5 billion reduction to the agency's funding. NOAA plays a key role in weather forecasts and hurricane warnings. All living former directors of the National Weather Service, which falls under NOAA, drafted an open letter warning of drastic impacts."
        },
        {
            "published_date": "2025-05-07T21:00:04",
            "title": "'Unprecedented' climate exposures for people born in 2020",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6751811",
            "url_media": "https://i.cbc.ca/ais/1d1b6807-e80e-403d-973a-34f3119bb78a,1746649486846/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C390%2C7489%2C4212%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "Extreme climate events like heat waves and floods will be a regular feature in the lives of younger generations, according to a new research. It modeled different climate scenarios by birth cohorts and found that younger generations will be more sensitive to such events.    . "
        },
        {
            "published_date": "2025-05-07T21:00:00",
            "title": "Rare and Massive Grasshopper Swarm in Australia Is Like a Scene Straight Out of 'Jumanji'",
            "author": "",
            "url": "https://www.yahoo.com/news/rare-massive-grasshopper-swarm-australia-210000299.html",
            "url_media": "https://media.zenfs.com/en/pethelpful_915/ab05335908553c1cd69254950e908e52",
            "country": "US",
            "language": "en",
            "summary": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. There was a huge swarm of grasshoppers on a rural road in Laglan, Queensland. The grasshopper population could increase to plague proportions in the next few months."
        },
        {
            "published_date": "2025-05-07T20:32:39",
            "title": "VIDEO: Tasmanian sea surface temperatures for December 2024",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-05-08/tasmanian-sea-surface-temperatures-for-december/105264770",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/22abd831646e476a3316a3518f076fd2?impolicy=wcms_watermark_news&cropH=576&cropW=1024&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "There was a drop in penguin numbers around the middle of the month. Scientists say the East Australia Current is extending further south and is impacting ecosystems.    (Data from Australia's Integrated Marine Observing System (IMOS) and the Eastern Australia Current (EAC)."
        },
        {
            "published_date": "2025-05-07T20:10:45",
            "title": "Wildfires are getting worse. Can an old technique help control them?",
            "author": "Great Lakes Now",
            "url": "https://www.greatlakesnow.org/2025/05/wildfires-are-getting-worse-can-an-old-technique-help-control-them",
            "url_media": "https://d2j02ha532z66v.cloudfront.net/wp-content/uploads/2025/05/gln-2504-fire-3-1024x577.png",
            "country": "US",
            "language": "en",
            "summary": "The Great Lakes region has seen its share of destructive blazes due to climate change. Vern Northrup is a former fireman and a member of the Fond du Lac Band of Ojibwe. He says that the OJibwe have long recognized the importance of fire in forest management."
        },
        {
            "published_date": "2025-05-07T20:02:45",
            "title": "Scientists launch Southern Ocean voyage to track human impact on cleanest air",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250507/0c3b7716bbf44edcb3fabe16ad0f1c25/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "A team of scientists has set out on a research voyage to the Southern Ocean to study how human activity is changing the atmosphere. The three-week mission departed Hobart on April 29 and will return on May 18. The team will track air quality up to 1,500 km off Tasmania's northwest coast and compare it with data from the Kennaook/Cape Grim Baseline Air Pollution Station."
        },
        {
            "published_date": "2025-05-07T20:00:59",
            "title": "Understanding Nigeria's increasing heat levels",
            "author": "Guest Contributor",
            "url": "https://globalvoices.org/2025/05/07/understanding-nigerias-increasing-heat-levels",
            "url_media": "https://globalvoices.org/wp-content/uploads/2025/04/pexels-photo-11390779-800x450.jpeg",
            "country": "US",
            "language": "en",
            "summary": "In mid-April, northern Nigeria experienced a historic heatwave. The Nigerian Meteorological Agency issued warning statements to safeguard people from heat-related risks. The high temperatures were beyond normal seasonal variations and could indicate a dangerous new normal if the phenomenon continues. Temperature levels in Nigeria have been increasing annually and the situation has been worsening over the past few decades. The increase can be attributed to human-induced climate change. Deforestation is also a factor. Nigeria is Africa's largest oil-producing country and the 14th largest globally. In 2018 alone, 7.4 billion cubic feet of gas was flared in Nigeria. Nigeria's CO2 emissions for 2022 was pegged at 122,750,410 tons."
        },
        {
            "published_date": "2025-05-07T19:49:51",
            "title": "Maharashtra News: Unseasonal Rains Devastate Mango, Fish, And Salt Sectors In Konkan; Citizens' Group Demands Compensation",
            "author": "Manoj Ramakrishnan",
            "url": "https://www.freepressjournal.in/mumbai/maharashtra-news-unseasonal-rains-devastate-mango-fish-and-salt-sectors-in-konkan-citizens-group-demands-compensation",
            "url_media": "https://media.assettype.com/freepressjournal/2025-05-07/73tg4qz8/fe1611b6-9ae6-4ae0-b698-e0e283df9071-1all53295-1.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Unseasonal rains caused extensive damage to mango orchards, disrupted dry fish production, and adversely affected salt manufacturing operations in Mumbai, Konkan and coastal regions. Watchdog Foundation has asked the government to conduct surveys (panchnamas) to assess the extent of damage and provide compensation to affected farmers and producers."
        },
        {
            "published_date": "2025-05-07T19:43:49",
            "title": "Multiple voices in Puerto Rico call for urgency from the Legislative Assembly to address climate change plan",
            "author": "Leysa Caro González",
            "url": "https://www.elnuevodia.com/english/news/story/multiple-voices-in-puerto-rico-call-for-urgency-from-the-legislative-assembly-to-address-climate-change-plan",
            "url_media": "https://www.elnuevodia.com/resizer/v2/NLUBQSLJZZESVLM52RBANIZMRU.jpg?auth=7f080b4b01380350da45b20b58fc37918186e70720497475c31f2714355c09c7&quality=75&width=1200&height=717&focal=3209%2C1823",
            "country": "PR",
            "language": "en",
            "summary": "The House of Representatives approved delaying the evaluation of the Climate Change Mitigation, Adaptation and Resilience Plan to December 2026. Puerto Rico needs to address the urgent issue 'now' or else 'we will suffer the consequences', according to ecologist and engineer Carl Soderberg."
        },
        {
            "published_date": "2025-05-07T19:37:22",
            "title": "Uneven Morphodynamics Shape Wadden Sea Evolution",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/uneven-morphodynamics-shape-wadden-sea-evolution",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/05/Uneven-Morphodynamics-Shape-Wadden-Sea-Evolution-1746646645.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The Wadden Sea is an intertidal zone stretching along the coasts of Denmark, Germany, and the Netherlands. New research has revealed the asymmetric nature of the morphodynamics governing this unique marine environment. This revelation has implications for coastal management under the influence of climate change and sea-level rise."
        },
        {
            "published_date": "2025-05-07T19:33:01",
            "title": "Heavy rains in Puerto Rico have exposed the vulnerability of some municipalities: is the island prepared for hurricane season?",
            "author": "Gloria Ruiz Kuilan",
            "url": "https://www.elnuevodia.com/english/news/story/heavy-rains-in-puerto-rico-have-exposed-the-vulnerability-of-some-municipalities-is-the-island-prepared-for-hurricane-season",
            "url_media": "https://www.elnuevodia.com/resizer/v2/DG6RQXWDOVG6NHG3GH4YTJM5WI.JPG?auth=3e272bc0db1a5f63b6012c5731bdc1efa290dca5c93be0ccbaf790d2fd33bebf&quality=75&width=1200&height=717&focal=2791%2C2045",
            "country": "PR",
            "language": "en",
            "summary": "Heavy rains since April 19 have severely affected 10 municipalities. The hurricane season begins on June 1. Mayors are worried about President Donald Trump's austerity policies, which include the Federal Emergency Management Agency (FEMA) ceasing to exist as it has operated until now."
        },
        {
            "published_date": "2025-05-07T19:11:30",
            "title": "Marin drops work on thorny hazards rules",
            "author": "Ben Stocking",
            "url": "https://www.ptreyeslight.com/news/marin-drops-work-on-thorny-hazards-rules",
            "url_media": "https://www.ptreyeslight.com/wp-content/uploads/2022/03/featured.png",
            "country": "US",
            "language": "en",
            "summary": "Marin has been trying to reach an agreement with the California Coastal Commission to ease restrictions on what homeowners can do to protect their homes from encroaching seas and other environmental hazards. On Monday, planners gave up and will address the issue when they respond to a new state law requiring municipalities to adopt plans for coping with climate change."
        },
        {
            "published_date": "2025-05-07T19:05:33",
            "title": "Climate change: 38m children can escape lifetime of heatwave if…",
            "author": "Sola Ogundipe",
            "url": "https://www.vanguardngr.com/2025/05/climate-change-38m-children-can-escape-lifetime-of-heatwave-if-sci",
            "url_media": "https://cdn.vanguardngr.com/wp-content/uploads/2020/01/Climate.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Paris Agreement target of limiting global warming to 1.5°C is attainable by the end of the century in 2100. Under current climate commitments, about 100 million of the estimated 120 million children born in 2020 will face 'unprecedented' lifetime exposure to extreme heat. In a more severe scenario where global temperatures rise to 3°C by 2100, around 111 million children would be at risk."
        },
        {
            "published_date": "2025-05-07T19:00:31",
            "title": "Wealthy 10% Drive Two-Thirds of Climate Change Since 1990, Study Finds",
            "author": "Park Keun-Tae",
            "url": "https://biz.chosun.com/en/en-science/2025/05/08/PJJ2ZYHZAFH33PKFXV57WKKO3Q",
            "url_media": "https://biz.chosun.com/resizer/v2/EG7G74TWT5KQJIPRNCZXBBV7OA.jpg?auth=36630f8da0286e0948ea0d29dca38612c494ba141861a98cd78e0e3c7f0d5781&width=1200&height=630&smart=true",
            "country": "KR",
            "language": "en",
            "summary": "Two-thirds of global warming since 1990 has been caused by the wealthiest 10% in the world, according to an analysis by researchers from the International Institute for Applied Systems Analysis (IIASA) in Austria, ETH Zurich in Switzerland, Humboldt University in Germany, and the University of Melbourne in Australia. The researchers tracked greenhouse gas emissions across various income tiers in each country from 1990 to 2020 and assessed their contributions to global average temperature. "
        },
        {
            "published_date": "2025-05-07T19:00:00",
            "title": "Australia on track for one of its warmest winters ever, Sky News predicts after record hot start to 2025",
            "author": "Rob Sharpe",
            "url": "https://www.skynews.com.au/australia-news/weather/australia-on-track-for-one-of-its-warmest-winters-ever-sky-news-predicts-after-record-hot-start-to-2025/news-story/c4b536021f3dbc9a30764dc4c16f57c1",
            "url_media": "https://content.api.news/v3/images/bin/e8402d2228e4ed19c117ca0ddf911ec9",
            "country": "AU",
            "language": "en",
            "summary": "The waters surrounding Australia have been their warmest or second warmest for the past 10 months in a row. The coming season looks similar due to the warm waters around Australia. The seasonal transition toward winter has been remarkably mild across Australia. Mild winters are here to stay."
        },
        {
            "published_date": "2025-05-07T18:53:28",
            "title": "Smoke from climate-fueled wildfires contributed to thousands of US deaths over 15 years, study says",
            "author": "Class",
            "url": "https://www.columbian.com/news/2025/may/07/smoke-from-climate-fueled-wildfires-contributed-to-thousands-of-us-deaths-over-15-years-study-says",
            "url_media": "https://www.columbian.com/wp-content/uploads/2025/05/Wildfire_New_Jersey_98097-f40ca.jpg",
            "country": "US",
            "language": "en",
            "summary": "Climate change contributed to about 15,000 deaths from exposure to small particulate matter from wildfires from 2006 to 2020 and cost about $160 billion. Annual range of deaths was 130 to 5,100, with the highest in states such as Oregon and California. Lisa Thompson, a professor at Emory University, said it is one of the first studies to isolate the effect of climate change on mortality."
        },
        {
            "published_date": "2025-05-07T18:35:49",
            "title": "Trump administration is ending NOAA data service used to monitor sea ice off Alaska",
            "author": "",
            "url": "https://www.adn.com/alaska-news/science/2025/05/07/trump-administration-is-ending-noaa-data-service-used-to-monitor-sea-ice-off-alaska",
            "url_media": "https://www.adn.com/resizer/v2/3NH2RBPUF5HPNJ6ZKLIINNUPS4.jpg?smart=true&auth=1d135a25cf8f2714028bdfd9ecdb5b7a519c035162628f6de7ced3f7ea4adc70&width=1200&height=630",
            "country": "US",
            "language": "en",
            "summary": "NOAA's National Centers for Environmental Information has decommissioned its snow and ice data products as of Monday. The data collected by that office is critical to the daily updates provided by the Colorado-based National Snow and Ice Data Center. The loss of NOAA data means that regular reports published by the center will be limited to 'basic' levels."
        },
        {
            "published_date": "2025-05-07T18:31:18",
            "title": "The Apocalypse Approaches According to the Climate Company Selling Line, But That's Anything But True",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/the-apocalypse-approaches-according",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F928f54aa-c92e-4701-8537-2fc8231dbfcd_1500x1000.heic",
            "country": "US",
            "language": "en",
            "summary": "Harry DeAngelo and Judith Curry have published a paper titled 'A Critique of the Apocalyptic Climate Narrative' They argue that the threat from human-caused climate change is not dire and that urgent suppression of fossil-fuel use would be unwise. They argue for developing a diversified portfolio of energy sources."
        },
        {
            "published_date": "2025-05-07T18:08:00",
            "title": "Ask a scientist: What's with the birds on Whitshed Road?",
            "author": "Cristina Reo",
            "url": "https://thecordovatimes.com/2025/05/07/ask-a-scientist-birds-on-whitshed-road",
            "url_media": "https://thecordovatimes.com/wp-content/uploads/2019/12/CT-12-27-whitshed-crash-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Milo Burcham, a retired U.S. Forest Service biologist and vice president of Prince William Sound Audubon, explains the springtime northerly migration of birds has begun. Many species are moving from their wintering grounds to their breeding grounds. They are heading to breeding grounds throughout Alaska, including right here on the Copper River Delta to as far as the Bering Sea and Arctic Coasts. Certain weather conditions can make the migration more difficult than usual, resulting in large numbers of birds 'dropping out' to rest and refuel. "
        },
        {
            "published_date": "2025-05-07T18:00:01",
            "title": "April one of Northland's wettest on record",
            "author": "Mike Dinsdale",
            "url": "https://www.nzherald.co.nz/northern-advocate/news/april-one-of-northlands-wettest-on-record/VAKYYUQ2JRASVEQRAMZESFHRAQ",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/LNAULOX2IVDY5BD5UARVPLKXOU.JPG?auth=4fce6c39dd68259c0a9fd0ccab727755005f954767abb8c517edc182eb8493e8&width=1200&height=675&quality=70&smart=true",
            "country": "NZ",
            "language": "en",
            "summary": "Kerikeri recorded its wettest April on record with 519mm. Whangārei recorded 403mm, Dargaville 218mm and Kaitāia 132mm. April 2025 was characterised by lower-than-normal mean sea level pressure (MSLP) to the northwest of New Zealand and higher-than the normal MSLP to the east of the country."
        },
        {
            "published_date": "2025-05-07T18:00:00",
            "title": "It's the end of the world as we know it. Thanks to the blackouts",
            "author": "Noel Yaxley",
            "url": "https://www.spectator.com.au/2025/05/its-the-end-of-the-world-as-we-know-it-thanks-to-the-blackouts",
            "url_media": "https://www.spectator.com.au/wp-content/uploads/2025/05/yaxley-10-may25_post.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The existence of Donald Trump helped Anthony Albanese win a second term and green activists' mass hysteria over hydrocarbons fed the absurd belief that billions are going to die.   Subscribers get unlimited access to spectator.com.au and app, podcasts and newsletters, and full access to the website and newsletters. "
        },
        {
            "published_date": "2025-05-07T18:00:00",
            "title": "As ‘ghost forests' multiply in Chesapeake Bay region, answers lag behind",
            "author": "Jeremy Cox",
            "url": "https://southernmarylandchronicle.com/2025/05/07/as-ghost-forests-multiply-in-chesapeake-bay-region-answers-lag-behind",
            "url_media": "https://i0.wp.com/southernmarylandchronicle.com/wp-content/uploads/2025/05/680bbc7e851de.image_.jpg?fit=1200%2C675&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "In the past decade, thousands of acres of forests along Maryland's coasts have been destroyed by saltwater intrusion. In the Eastern Shore of Virginia, formerly healthy forests are transforming into 'ghost forests' because of sea level rise. The region's shore-hugging trees are dying back at a significantly slower pace than on the other coastal areas."
        },
        {
            "published_date": "2025-05-07T17:58:00",
            "title": "This is when life will end on Earth, as per a supercomputer",
            "author": "TOI Trending Desk",
            "url": "https://timesofindia.indiatimes.com/etimes/trending/this-is-when-life-will-end-on-earth-as-per-a-supercomputer/articleshow/120972108.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120972172,width-1070,height-580,imgsize-25290,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "According to supercomputers, the Sun will be the ultimate cause of the collapse of life on Earth. Life on Earth will end around the year 1,000,002,021. Rising global temperatures and melting polar ice are acting as catalysts to the billion-year benchmark. Human-driven climate change is severing the blow."
        },
        {
            "published_date": "2025-05-07T17:51:02",
            "title": "Human health is already being affected by climate change",
            "author": "Ashraf Hassen Coovadia",
            "url": "https://www.dailymaverick.co.za/article/2025-05-07-human-health-affected-climate-change",
            "url_media": "https://i0.wp.com/www.dailymaverick.co.za/wp-content/uploads/2024/01/iStock-1549876042.jpg?fit=1280%2C648&quality=89&ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "The second G20 Health Working Group meeting is taking place in KwaZulu-Natal this week. South Africa's G20 health agenda looks at important issues such as stemming the tide of non-communicable diseases and Pandemic Prevention Preparedness and Response. There is a lack of focus on the impact of climate change on public health. Human health is already being affected by climate change. Children, the elderly, pregnant women, people with pre-existing heart or lung conditions, and the poor are especially at risk."
        },
        {
            "published_date": "2025-05-07T17:36:49",
            "title": "NASA scientists have worked when Earth's oxygen supply will run out",
            "author": "Bethan Finighan",
            "url": "https://www.manchestereveningnews.co.uk/news/world-news/nasa-scientists-worked-earths-oxygen-31593521",
            "url_media": "https://i2-prod.manchestereveningnews.co.uk/article31593539.ece/ALTERNATES/s1200/0_PIA11066large.jpg",
            "country": "GB",
            "language": "en",
            "summary": "NASA and Toho University used supercomputers to work out when Earth's oxygen supply will run out. The future lifespan of Earth's atmosphere is one billion years. Life on Earth will end around the year 1,000,002,021, according to Kazumi Ozaki."
        },
        {
            "published_date": "2025-05-07T17:34:35",
            "title": "Two-thirds of global warming caused by world's richest 10%, study finds",
            "author": "",
            "url": "https://www.aljazeera.com/news/2025/5/7/two-thirds-of-global-warming-caused-by-worlds-richest-10-study-finds",
            "url_media": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP24270595728778-1746637891.jpg?resize=1920%2C1440",
            "country": "QA",
            "language": "en",
            "summary": "The richest 10 percent of the world's people are responsible for two-thirds of the global warming since 1990. The richest 1 percent contributed 26 times more to once-a-century heatwaves than the global average and 17 times more than droughts in the Amazon. The authors argue that targeting the financial activities and investment portfolios of high-income individuals could lead to significant climate gains."
        },
        {
            "published_date": "2025-05-07T17:26:39",
            "title": "How Activists And Flawed Data Created The Illusion Of A Climate Apocalypse",
            "author": "Dr. Matthew Wielicki",
            "url": "https://climatechangedispatch.com/how-activists-and-flawed-data-created-the-illusion-of-a-climate-apocalypse",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/05/tree-rings.jpg",
            "country": "US",
            "language": "en",
            "summary": "A 2018 activist document titled 'Don't Mention the Emergency?' was published by the Climate Emergency Declaration group. On page 7 of the document, a graphic dramatically juxtaposes heavily smoothed temperature proxy reconstructions with modern instrumental temperature data, falsely presenting today's warming as unprecedented and alarming. This misleading graphic was inspired by a 2013 blog post, 'The two epochs of Marcott' from 'OurChangingClimate'. Marcott et al. (2013) explicitly warned about significant limitations in its data."
        },
        {
            "published_date": "2025-05-07T17:13:47",
            "title": "Shocking Antarctica discovery sends climate change deniers into mass celebration",
            "author": "CHRIS MELORE",
            "url": "https://www.dailymail.co.uk/sciencetech/article-14684443/Shocking-Antarctica-discovery-sends-climate-change-deniers-mass-celebration.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/05/07/14/98101493-0-image-a-9_1746624085096.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Scientists from Tongji University in Shanghai found the Antarctic Ice Sheet had been losing ice at an alarming rate for nearly two decades between 2002 and 2020, but from 2021 to 2023, the ice sheet gained 108 billion tons of ice each year. The change in weather patterns brought more moisture to the Eastern half of Antarctica, which helped build up layers of fresh ice. Sea level rise was reduced by 15 percent."
        },
        {
            "published_date": "2025-05-07T17:09:20",
            "title": "Antarctic Wilkes Land-Queen Mary Region Sees 100 Billion Tonne Ice Mass Increase",
            "author": "P Gosselin",
            "url": "https://notrickszone.com/2025/05/07/antarctic-wilkes-land-queen-mary-region-sees-100-billion-tonne-ice-mass-increase",
            "url_media": "https://i0.wp.com/tkp.at/wp-content/uploads/2025/05/Antarctic-Ice-Sheets-Mass-DramaFrom-Accelerated-Loss-to-Surprising-Gain-777x351-1.png?resize=777%2C351&ssl=1",
            "country": "DE",
            "language": "en",
            "summary": "Ice mass has gained in the Antarctic Wilkes Land-Queen Mary Land region. West Antarctic has cooled at a rate of 5°C per century since the early 1980s. The study was published in the journal Science China Earth Sciences and looked at the AIS mass change series from April 2002 to December 2023."
        },
        {
            "published_date": "2025-05-07T16:57:59",
            "title": "How Trump cuts could affect your weather reports",
            "author": "The Christian Science Monitor",
            "url": "https://www.csmonitor.com/USA/Politics/2025/0507/noaa-weather-forecasts-trump-budget",
            "url_media": "https://images.csmonitor.com/csm/2025/05/0507%20NNOAA%20cockpit%20lede.jpg?alias=standard_900x600",
            "country": "US",
            "language": "en",
            "summary": "The proposed budget for the new fiscal year proposes a 24% cut to NOAA's budget. The National Oceanic and Atmospheric Administration plays a key role in weather forecasts and hurricane warnings. Scientists and industry experts are concerned that NOAA won't be able to fulfill services to people who depend on them, such as fishers, farmers, and the general public."
        },
        {
            "published_date": "2025-05-07T16:50:44",
            "title": "UK scientists one step closer to 'dimming the Sun' thanks to £57 million funding",
            "author": "Bethan Finighan",
            "url": "https://www.manchestereveningnews.co.uk/news/uk-news/uk-scientists-one-step-closer-31593193",
            "url_media": "https://i2-prod.manchestereveningnews.co.uk/article31593204.ece/ALTERNATES/s1200/0_Sydney-Faces-Heatwave-Warning-As-Summer-Approaches.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Britain has approved funding for experiments to dim sunlight in an attempt to limit global warming. The Advanced Research and Innovation Agency (ARIA) is funding nearly £57 million for the project. The project aims to gather \"critical missing scientific data\" into whether climate cooling could ever be safely carried out as Earth nears catastrophic climate \"tipping points\"."
        },
        {
            "published_date": "2025-05-07T16:50:18",
            "title": "Wealthiest 10% responsible for two-thirds of global warming since 1990, study finds",
            "author": "Dimsumdaily Hong Kong",
            "url": "https://www.dimsumdaily.hk/wealthiest-10-responsible-for-two-thirds-of-global-warming-since-1990-study-finds",
            "url_media": "https://cdn.dimsumdaily.hk/wp-content/uploads/2025/05/08004803/Global-warming-34343.webp",
            "country": "HK",
            "language": "en",
            "summary": "The world's wealthiest 10% are responsible for two-thirds of the global warming since 1990. The top 1% have contributed 26 times more to once-a-century heatwaves and 17 times to droughts in the Amazon region. The rise in Earth's average surface temperature by 1.3 degrees Celsius has been attributed to activities such as burning fossil fuels and deforestation."
        },
        {
            "published_date": "2025-05-07T16:29:45",
            "title": "Hay Fever, Deforestation, & Border Walls – Archyde: Latest World News, Economy, Entertainment, Health, Technology & Sports Updates",
            "author": "archyde",
            "url": "https://www.archyde.com/hay-fever-deforestation-border-walls",
            "url_media": "https://i0.wp.com/thinklandscape.globallandscapesforum.org/wp-content/uploads/2025/05/Aspergillus-fumigatus_CDC_Full.jpg?resize=800%2C618&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Archyde interviewed Dr. Anya Sharma, a leading environmental scientist at the Global Sustainability Institute. Dr. Sharma gives a summary of the 'Planet' and 'Climate' sections based on the information from the information within the Planet and Climate sections."
        },
        {
            "published_date": "2025-05-07T16:16:33",
            "title": "Supercomputer Names Exact Year Life on Earth Will End",
            "author": "",
            "url": "https://www.yahoo.com/news/supercomputer-names-exact-life-earth-161633700.html",
            "url_media": "https://media.zenfs.com/en/men_s_journal_718/339ae8f9f75eecd930cde38767c7ebaf",
            "country": "US",
            "language": "en",
            "summary": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Scientists with NASA and Japan's Toho University used the computer to determine \"when all life will end\" on Earth. They determined that the sun will end life on Earth around the year 1,000,002,021."
        },
        {
            "published_date": "2025-05-07T15:44:04",
            "title": "Richest 10% Responsible for Most Global Warming Since 1990, Says Study",
            "author": "India New England News",
            "url": "https://indianewengland.com/richest-10-responsible-for-most-global-warming-since-1990-says-study",
            "url_media": "https://indianewengland.com/wp-content/uploads/2025/05/Global-Warming.png",
            "country": "US",
            "language": "en",
            "summary": "The world's wealthiest 10 percent are contributing more to global warming than the poorest half of the population. The top 1 percent of global earners contributed 26 times more than the average person to the increase in rare, high-temperature events and 17 times more to droughts in regions like the Amazon."
        },
        {
            "published_date": "2025-05-07T15:42:10",
            "title": "This Florida town is considered one of America's most endangered historic sites. See where",
            "author": "",
            "url": "https://www.yahoo.com/news/florida-town-considered-one-america-154210567.html",
            "url_media": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "country": "US",
            "language": "en",
            "summary": "The National Trust for Historic Preservation released its list of America's \"11 Most Endangered Historic Places\" on May 7. Cedar Key, a fishing village in Florida, was damaged by Hurricane Helene in 2024. Hotel Casa Blanca, Idlewild, Michigan, served as a premier lodging site for African American travelers, entertainers, and thought leaders during segregation. Oregon Caves Chateau, Caves Junction, Oregon, closed in 2018 because of extensive repairs. Pamunkey Indian Reservation, Virginia, has served an important economic role in its rural region for 91 years. May Hicks Curtis House, Flagstaff, Arizona, commemorates May Curtis, who sewed the first"
        },
        {
            "published_date": "2025-05-07T15:42:10",
            "title": "This Florida town is considered one of America's most endangered historic sites. See where",
            "author": "Samantha Neely",
            "url": "https://www.nwfdailynews.com/story/news/2025/05/07/cedar-key-most-endangered-historical-site-florida/83490384007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2024/09/28/USAT/75429828007-vpc-cedar-key-helene-destruction-usat.jpg?auto=webp&crop=1919,1079,x0,y0&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "The National Trust for Historic Preservation released its annual list of America's \"11 Most Endangered Historic Places\" on May 7. The listings began in 1988 and the latest was released May 7th. The recognition doesn't come with funding but garners attention and support for the sites. Cedar Key is an island city in Levy County, off the northwest coast of Florida in the Gulf of America. It is \"increasingly threatened by rising sea levels and severe storm events,\" including Hurricane Helene in 2024."
        },
        {
            "published_date": "2025-05-07T15:38:53",
            "title": "Ice Surprises – Arctic and Antarctic Ice Sheets Are Stabilizing and Growing",
            "author": "",
            "url": "https://www.todayville.com/ice-surprises-arctic-and-antarctic-ice-sheets-are-stabilizing-and-growing",
            "url_media": "https://i2.wp.com/www.todayville.com/wp-content/uploads/2025/05/tvrd-thb-icy-cooling-earth-polar-ice-image-2025-05-07.jpg?fit=400%2C400&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "New York Post asked me to explain the significance of the new research on ice dynamics at both poles. Wang et al. 2025 find a record accumulation of ice on the Antarctic ice sheet over the period 2021 to 2023. England et. al. find a 'surprising, but not unexpected, pause in Arctic sea ice loss at the North Pole."
        },
        {
            "published_date": "2025-05-07T15:35:00",
            "title": "Multilingual program looks at coastal flooding, resources",
            "author": "Amanda Armstrong",
            "url": "https://www.gloucestertimes.com/news/local_news/multilingual-program-looks-at-coastal-flooding-resources/article_43c44761-2fb0-4224-8d00-5535d68cc198.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/gloucestertimes.com/content/tncms/custom/image/09cba638-d48d-11ed-9329-d74ff747ab4f.jpg?crop=99%2C99%2C204%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Coastal Coastal R&R — Relocation and Resilience Event will take place from 5:30 to 7:30 p.m. May 8 at Maritime Gloucester, 23 Harbor Loop, Gloucester. Hosts are TownGreen, Urban Harbors Institute, Communities Responding to Extreme Weather (CREW) and The Nature Conservancy."
        },
        {
            "published_date": "2025-05-07T15:22:43",
            "title": "Exposing Climate Science's Biggest Lie",
            "author": "Dr. Matthew Wielicki",
            "url": "https://irrationalfear.substack.com/p/exposing-climate-sciences-biggest",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F31b7aeaf-5c2b-4475-aa06-1c563c84e750_1049x646.png",
            "country": "US",
            "language": "en",
            "summary": "A 2018 activist document titled \"Don't Mention the Emergency?\" was published by the Climate Emergency Declaration group. On page 7 of the document, a graphic dramatically juxtaposes heavily smoothed temperature proxy reconstructions with modern instrumental temperature data, falsely presenting today's warming as unprecedented and alarming. The graphic was inspired by a 2013 blog post, \"The two epochs of Marcott,\" from OurChangingClimate. This blog relied heavily on the Marcott et al. (2013) reconstruction, which explicitly warned about significant limitations in its data. Marcott's reconstruction relies on sediment cores and ice core isotopic data."
        },
        {
            "published_date": "2025-05-07T15:14:00",
            "title": "Antarctica sees ice gain after two decades of decline",
            "author": "Harsh Vardhan",
            "url": "https://watchers.news/2025/05/07/antarctica-ice-gain-after-two-decades-decline",
            "url_media": "https://watchers.news/wp-content/uploads/2025/05/Pine-Island-Glacier-and-iceberg-B-46.webp",
            "country": "US",
            "language": "en",
            "summary": "Antarctica gained ice mass between 2021 and 2023 after years of steady decline. Global sea levels rose by 0.20 mm per year between 2002 and 2010 due to moderate ice loss from Antarctica. The recent era saw a net mass gain of 107.79±74.90 gigatonnes per year, contrary to the long-term trend. The highest contribution to global sea level rise from Antarctica occurred in February 2020."
        },
        {
            "published_date": "2025-05-07T15:05:58",
            "title": "Will Antarctic Ice Rebound Chill Climate Meltdown Narrative?",
            "author": "Larry Bell",
            "url": "https://www.newsmax.com/larrybell/antarctic-ice-climate-change/2025/05/07/id/1209927",
            "url_media": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=f2539408-854e-43ff-a93b-2e6e84944f6c&SiteName=Newsmax",
            "country": "US",
            "language": "en",
            "summary": "The Antarctic Ice Sheet has recently shown signs of record-breaking growth of 108 gigatons per year between 2021 and 2023. Most of the previous loss was driven by the destabilization of glaciers in West Antarctica and the Wilkes Land–Queen Mary Land (WL-QML) region of East Antarctica. The unexpected mass gain only offsets global sea level rise by about 0.3 mm per year."
        },
        {
            "published_date": "2025-05-07T15:01:49",
            "title": "Scientists launch voyage to study human impact on cleanest air",
            "author": "Climate",
            "url": "https://news.cgtn.com/news/2025-05-07/Scientists-launch-voyage-to-study-human-impact-on-cleanest-air-1DbFt1hqFIk/p.html",
            "url_media": "https://news.cgtn.com/news/2025-05-07/Scientists-launch-voyage-to-study-human-impact-on-cleanest-air-1DbFt1hqFIk/img/aef2a4ea09cb44789cd8d3f6e35636fc/aef2a4ea09cb44789cd8d3f6e35636fc-750.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "A team of scientists has set out on a research voyage to the Southern Ocean to study how human activity is changing the atmosphere. The three-week mission departed Hobart, capital of the island state of Tasmania, on April 29 and will return on May 18. The team will track air quality up to 1,500 kilometers off Tasmania's northwest coast and compare it with data from the Kennaook/Cape Grim Baseline Air Pollution Station."
        },
        {
            "published_date": "2025-05-07T15:01:16",
            "title": "83 per cent of 5-year-olds will be exposed to ‘unprecedented' extreme heat in their lifetime",
            "author": "Euronews Green",
            "url": "https://www.euronews.com/green/2025/05/07/83-per-cent-of-5-year-olds-will-be-exposed-to-unprecedented-extreme-heat-in-their-lifetime",
            "url_media": "https://static.euronews.com/articles/stories/09/26/89/26/1200x675_cmsv2_07891a9a-722b-5e7f-9a76-737a3dab6834-9268926.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The world is on course for around 3.1°C of warming above pre-industrial levels. Meeting the 1.5°C target would reduce the number of five-year-olds impacted by extreme heat to 62 million. Children affected by inequality and those in lower- and middle-income countries are worst affected by climate extremes."
        },
        {
            "published_date": "2025-05-07T15:00:46",
            "title": "How much will climate change affect YOU? Scientists predict your lifetime exposure to heatwaves, floods, droughts, and wildfires - and it's bad news for Gen Alpha",
            "author": "JONATHAN CHADWICK",
            "url": "https://www.dailymail.co.uk/sciencetech/article-14686539/climate-change-affect-YOU-heatwaves-floods.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/05/07/11/98126681-0-image-m-47_1746613823225.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Researchers at Vrije Universiteit Brussel (VUB) in Belgium warn that climate change will have a 'disproportionate burden' on the youth. Today's children will endure more climate extremes than any previous generation. 1.5 billion children alive today face 'unprecedented lifetime exposure' to heatwaves, crop failures, wildfires, droughts, floods and tropical cyclones. 431 million of today's children face a lifetime of food shortages due to crop failures."
        },
        {
            "published_date": "2025-05-07T14:42:00",
            "title": "World's richest 10 per cent caused two-thirds of global warming: Study",
            "author": "Afp",
            "url": "https://timesofindia.indiatimes.com/home/environment/worlds-richest-10-per-cent-caused-two-thirds-of-global-warming-study/articleshow/120969147.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120969316,width-1070,height-580,imgsize-1611552,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The richest 10% of individuals are responsible for two-thirds of global carbon emissions since 1990. The richest one per cent contributed 26 times more to once-a-century heatwaves, and 17 times to droughts in the Amazon than the global average. Wealthy in China and the U.S. account for nearly half of global CO2 emissions."
        },
        {
            "published_date": "2025-05-07T14:33:39",
            "title": "Allergy sufferers buckle up: ‘Intense' pollen season expected in May",
            "author": "Dilshad Burman",
            "url": "https://toronto.citynews.ca/2025/05/07/intense-pollen-season-expected-in-may",
            "url_media": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/05/07/mohammad-hosein-safaei-3mmQIqJyH-E-unsplash-scaled.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Aerobiology Research Laboratories based in Ottawa gathers pollen and spore samples daily from 30 strategically placed monitoring stations across the country. They use the data to predict the levels of allergens in the air and provide forecasts to the public. They predict an intense spring tree pollen season for birch, alder, maple, poplar and oak. For grass and weed pollen later in the summer and towards the fall, they're expecting slightly more elevated levels than usual, but it won't be apocalyptic."
        },
        {
            "published_date": "2025-05-07T14:29:16",
            "title": "Two New Studies Reveal Shocking Polar Ice Gains, Upend Climate Narrative",
            "author": "Roger Pielke Jr.",
            "url": "https://climatechangedispatch.com/two-new-studies-reveal-shocking-polar-ice-gains-upend-climate-narrative",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/05/polar-bear-clapping.jpg",
            "country": "US",
            "language": "en",
            "summary": "Two new studies show that the Earth's climate is far more complex than often acknowledged. After years of ice sheet decline, Antarctica has seen a record-breaking accumulation of ice. In the opposite direction, the loss of Arctic sea ice cover has undergone a slowdown over the past two decades."
        },
        {
            "published_date": "2025-05-07T14:26:36",
            "title": "World's richest 10% responsible for two thirds of global warming, study finds",
            "author": "FRANCE 24",
            "url": "https://www.france24.com/en/environment/20250507-world-s-richest-10-responsible-for-two-thirds-of-global-warming-study-finds",
            "url_media": "https://s.france24.com/media/display/5cd3421c-2b4a-11f0-b280-005056bf30b7/w:1280/p:16x9/000_42YG8KD.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The richest 10 percent of individuals are responsible for two thirds of global warming since 1990. The richest one percent contributed 26 times more to once-a-century heatwaves and 17 times to droughts in the Amazon than the global average. The rich one percent have more wealth than the lowest 95 percent combined."
        },
        {
            "published_date": "2025-05-07T14:09:13",
            "title": "UC Merced Researchers Publish New Study: How Did the COVID-19 Pandemic Fuel Record-Breaking Wildfires in 2020?",
            "author": "",
            "url": "https://goldrushcam.com/sierrasuntimes/index.php/news/local-news/67031-uc-merced-researchers-publish-new-study-how-did-the-covid-19-pandemic-fuel-record-breaking-wildfires-in-2020",
            "url_media": "https://goldrushcam.com/sierrasuntimes/images/2020/september/creekfire2.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2020, the COVID-19 pandemic affected many facets of life, including health care, schools and the work environment. It also fueled an elevated number of wildfires in the Western United States that year. According to CalFire, nearly 10,000 fires burned over 4.2 million acres, more than 4% of California's roughly 100 million acres of land."
        },
        {
            "published_date": "2025-05-07T14:08:20",
            "title": "Thread by @freedom_rsrch on Thread Reader App",
            "author": "",
            "url": "https://threadreaderapp.com/thread/1920118504008622474.html",
            "url_media": "https://threadreaderapp.com/images/screenshots/thread/1920118504008622474.jpg",
            "country": "US",
            "language": "en",
            "summary": "Henrik Svensmark, astrophysicist at the Danish National Space Institute, has a theory that challenges the entire foundation of climate politics. The Sun's magnetic field modulates cosmic rays that seed clouds. Clouds are the real thermostat. Speaking out against CO₂ orthodoxy can end a scientist's career."
        },
        {
            "published_date": "2025-05-07T14:05:53",
            "title": "The deliberate destruction of Australian quality of life",
            "author": "Leith van Onselen",
            "url": "https://www.macrobusiness.com.au/2025/05/the-deliberate-destruction-of-australian-quality-of-life",
            "url_media": "https://api.macrobusiness.com.au/wp-content/uploads/2025/05/Politicians-Big-Australia.png",
            "country": "AU",
            "language": "en",
            "summary": "This century has seen a remarkable transformation of Australia. In the 60 years post-World War II, Australia's net overseas migration averaged 90,000 per year. Since 2005, the NOM has more than doubled to 233,000 a year. Australia's population has ballooned by 8.7 million people (46%) since the turn of the century. The 2024 Population Statement from Treasury's Centre for Population projects the population will balloon by 13.5 million people in 40 years."
        },
        {
            "published_date": "2025-05-07T13:52:40",
            "title": "Ice Surprises",
            "author": "Roger Pielke Jr",
            "url": "https://rogerpielkejr.substack.com/p/ice-surprises",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f0325f9-825c-4829-ab53-99098840832a_1024x1024.png",
            "country": "US",
            "language": "en",
            "summary": "New York Post asked me to explain the new research on polar ice dynamics at both poles. Wang et al. find a record accumulation of ice on the Antarctic ice sheet over the period 2021 to 2023, following a steady decrease from 2002 to 2021. At the other end of the planet, at the North Pole, a new preprint finds a 'surprising, but not unexpected, pause in Arctic sea ice loss."
        },
        {
            "published_date": "2025-05-07T13:32:32",
            "title": "Somalia's exports are threatened by climate change and conflict: what 30 years of data tell us",
            "author": "Abdikafi Hassan Abdi",
            "url": "https://theconversation.com/somalias-exports-are-threatened-by-climate-change-and-conflict-what-30-years-of-data-tell-us-254146",
            "url_media": "https://images.theconversation.com/files/665395/original/file-20250502-56-axskju.jpg?ixlib=rb-4.1.0&rect=0%2C236%2C2870%2C1435&q=45&auto=format&w=1356&h=668&fit=crop",
            "country": "AU",
            "language": "en",
            "summary": "Somalia's economy is based on agriculture and livestock. Livestock exports peaked in 2015–2016 at over US$530 million, but have since declined due to recurrent droughts, internal conflict and trade restrictions, including a partial import ban by Saudi Arabia in 2016. A 1% rise in average temperature reduces agricultural exports by 8.37%."
        },
        {
            "published_date": "2025-05-07T13:17:02",
            "title": "‘There's a risk to life, a risk to health', says Clontarf councillor demanding flood defence action",
            "author": "Amy Donohoe",
            "url": "https://www.independent.ie/regionals/dublin/dublin-news/theres-a-risk-to-life-a-risk-to-health-says-clontarf-councillor-demanding-flood-defence-action/a934059807.html",
            "url_media": "https://focus.independent.ie/thumbor/cBC1hhmtyM7lMWz2oRUy1_exn38=/140x0:3240x2067/629x0/prod-mh-ireland/39bf5125-0bf3-4d4c-a6f8-95fc194d6345/66dd16e4-1e77-49d8-b8af-d37b1a4c8ee4/39bf5125-0bf3-4d4c-a6f8-95fc194d6345.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Fine Gael councillor Clodagh Ní Mhuirí wrote to the Minister of State for Planning, John Cummins, to highlight the need for clear timelines around planning decisions and delivery of flood defence projects. She wrote to him about the mandatory statutory timeframes that will be introduced under the Planning and Development Act 2024."
        },
        {
            "published_date": "2025-05-07T13:03:13",
            "title": "World's richest 10% caused two thirds of global warming: study",
            "author": "",
            "url": "https://www.yahoo.com/news/worlds-richest-10-caused-two-130313503.html",
            "url_media": "https://media.zenfs.com/en/afp.com/a2dd89162b735b511c382bdbff7069a5",
            "country": "US",
            "language": "en",
            "summary": "The richest 10 percent of individuals are responsible for two thirds of global warming since 1990. The richest one percent contributed 26 times more to once-a-century heatwaves and 17 times to droughts in the Amazon than the global average. Almost a third of the world's billionaires are from the United States."
        },
        {
            "published_date": "2025-05-07T12:40:56",
            "title": "Europe Is the Fastest-Warming Continent",
            "author": "Human Wrongs Watch",
            "url": "https://www.pressenza.com/2025/05/europe-is-the-fastest-warming-continent",
            "url_media": "https://www.pressenza.com/wp-content/uploads/2025/05/Depositphotos_2239488_S.jpg",
            "country": "IT",
            "language": "en",
            "summary": "2024 was the warmest year on record for Europe, with record-high annual temperatures in almost half of the continent. There was a striking east-west contrast in climate conditions, with extremely dry and often record-warm conditions in the east and warm but wet conditions in western Europe. Europe experienced the most widespread flooding since 2013. The proportion of electricity generation by renewables in Europe reached a record high in 2024."
        },
        {
            "published_date": "2025-05-07T12:27:03",
            "title": "Couple who moved to Australia from UK warn Brits about scary everyday reality that may put people off",
            "author": "James Moorhouse",
            "url": "https://www.ladbible.com/lifestyle/travel/australia-brits-holiday-uk-scary-reality-reason-why-676684-20250507",
            "url_media": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blt9d0adcf4f913809b/681b4bc684abdb5b5a4e31b1/GettyImages-1160125161.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Teresa and Mike have been living in Queensland, Australia, for the past seven months. The content creator couple warn other Brits about the everyday realities of living Down Under. The noise of the wildlife is very loud, especially in the mornings and evenings. Red-bellied snakes scare Teresa. Ross Johnston, who moved to Australia in 2020 during the Covid-19 pandemic, shares his tips on YouTube."
        },
        {
            "published_date": "2025-05-07T12:19:03",
            "title": "Rewrite High-income groups disproportionately contribute to climate",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/rewrite-high-income-groups-disproportionately-contribute-to-climate-extremes-worldwide-as-a-headline-for-a-science-magazine-post-using-no-more-than-8-words",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/05/Rewrite-High-income-groups-disproportionately-contribute-to-climate-extremes-worldwide-as-a-headline-for-a-science-magazine-post-using-no-more-than-8-words-1746620346.jpg",
            "country": "TR",
            "language": "en",
            "summary": "We used the SPI-3 to identify meteorological droughts and SPEI-348 to measure potential drought risks. We used a time series of historic baseline emissions from 1850 to resolve by gas and removed emitter-specific contributions from the baseline emissions. We focused on decomposing emissions into CO 2 , N 2 O and CH 4."
        },
        {
            "published_date": "2025-05-07T12:18:34",
            "title": "Labor's ‘consequences' for looking to host climate conferences discussed",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/paul-murray/labors-consequences-for-looking-to-host-climate-conferences-discussed/video/57854b3f845f74943a12d555de03d805",
            "url_media": "https://content.api.news/v3/images/bin/31f1563975d127524143663f4a453689",
            "country": "AU",
            "language": "en",
            "summary": "Paul Murray discusses the 'consequences' of Labor's push to host climate conferences in Australia, which will put pressure on the government to increase the number of renewable energy projects from where it is now.       .  . "
        },
        {
            "published_date": "2025-05-07T12:01:42",
            "title": "Favorite weekend retreat of Florida residents among 'Most Endangered Historic Places'",
            "author": "Staff report",
            "url": "https://www.gainesville.com/story/news/2025/05/07/cedar-key-florida-among-most-endangered-historic-places-in-2025/83479731007",
            "url_media": "https://www.gainesville.com/gcdn/authoring/authoring-images/2025/05/06/NTGS/83480569007-11-most-2025-cedar-key-20-cr-timothy-macy.jpg?crop=4688,2637,x0,y468&width=3200&height=1801&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "Cedar Key, Florida, is listed as one of America's 11 Most Endangered Historic Places by the National Trust for Historic Preservation. Rising sea levels and severe storms, including Hurricane Helene in 2024, threaten the historic fishing village. The group worked with the University of Florida on a \"Resilient Cedar Key Adaptation Plan\""
        },
        {
            "published_date": "2025-05-07T12:00:09",
            "title": "Here's the 2025 list of Most Endangered Historic Places in the U.S.",
            "author": "",
            "url": "https://knpr.org/npr/2025-05-07/heres-the-2025-list-of-most-endangered-historic-places-in-the-u-s",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/95cdd37/2147483647/strip/true/crop/4524x2375+0+85/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fdims3%2Fdefault%2Fstrip%2Ffalse%2Fcrop%2F4524x2545%2017%200%2Fresize%2F4524x2545%21%2F%3Furl%3Dhttp%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2Fd7%2F8c64ea1345c78e43da4da7343aca%2Fwellington-jpg.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Mystery Castle in Phoenix, Arizona, is one of America's 11 most endangered historic places in 2025. The National Trust for Historic Preservation has been issuing an annual list of U.S. sites at risk since 1988. This year's list includes not only buildings, but entire communities, such as a smattering of islands off Florida's northwest coast and the French Broad and Swannanoa River Corridors in North Carolina."
        },
        {
            "published_date": "2025-05-07T11:47:00",
            "title": "Planet's climate has never been so variable",
            "author": "ANSA English Desk",
            "url": "https://www.ansa.it/english/news/science_tecnology/2025/05/07/planets-climate-has-never-been-so-variable-ingv_453b44b3-1b3e-4e0f-8d5f-f28f6857535a.html",
            "url_media": "https://www.ansa.it/webimages/img_1129x635/2025/5/7/3176f9673f225c27bcb95b56cfde623b.jpg",
            "country": "IT",
            "language": "en",
            "summary": "Planet Earth's climate has never been so variable, alternating between hot and cold periods. The current period is sensitive to small disturbances induced by human activity. It makes it difficult to accurately predict the evolution of our climate and requires special attention in the study of tipping points."
        },
        {
            "published_date": "2025-05-07T11:15:38",
            "title": "New report reveals why the future of one of the world's most extreme airports is at risk: 'A significant issue'",
            "author": "",
            "url": "https://www.yahoo.com/news/report-reveals-why-future-one-111538981.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Yy3j8.FQHadu8PnI6px6SA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/b8c333e54b9a14f051f432c989438a65",
            "country": "US",
            "language": "en",
            "summary": "The infrastructure of the world's northernmost commercial airport, located in Svalbard, Norway, is under threat as the permafrost beneath it starts to melt. Warming in the Arctic has been linked to carbon pollution. SValbard is an archipelago located well off the Norwegian mainland and relies on coal for energy."
        },
        {
            "published_date": "2025-05-07T11:00:10",
            "title": "Antarctica's Ice Sheet Expands for the First Time in Decades",
            "author": "Leslie Eastman",
            "url": "https://legalinsurrection.com/2025/05/antarcticas-ice-sheet-expands-for-the-first-time-in-decades",
            "url_media": "https://legalinsurrection.com/wp-content/uploads/2025/05/LI-037-Antarctic-Ice-Sheet.png",
            "country": "US",
            "language": "en",
            "summary": "Antarctica's ice sheet has been melting fast for decades, pushing sea levels higher with each passing year. Between 2021 and 2023, the Antarctic Ice Sheet gained mass for the first time in decades. This anomaly is driven by unusual precipitation patterns. The Hunga-Tonga underwater volcano in 2022 vaporized trillions of gallons of seawater into the atmosphere, which increased the global stratospheric water mass by 13%."
        },
        {
            "published_date": "2025-05-07T11:00:01",
            "title": "Minnesota scientists speak out after White House dismisses authors of climate report",
            "author": "Kristoffer Tigue",
            "url": "https://www.startribune.com/minnesota-scientists-speak-out-after-white-house-dismisses-authors-of-climate-report/601344171",
            "url_media": "https://arc.stimg.co/startribunemedia/WP5HMQW4NFAVJKIAOV5SOEX5FU.jpg?&w=1200&ar=1.91:1&fit=crop",
            "country": "US",
            "language": "en",
            "summary": "Melissa Kenney has spent decades researching how to best convey scientific information to the public. Kenney is director of research at the University of Minnesota's Institute on the Environment. Last year she was asked to contribute to the National Climate Assessment, the nation's foremost report on how climate change is affecting the United States. Last week she received an email from the Trump administration telling her the scope of the report was 'being reevaluated' and that her services were no longer required. She is one of nearly 400 scientists dismissed from the report."
        },
        {
            "published_date": "2025-05-07T10:35:00",
            "title": "Conversion Therapy Harms Heart Health",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/conversion-therapy-harms-heart-health/article_8ab67e19-438d-5fc8-8954-92a2946026dd.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/a/5c/a5cb63de-9ebe-5665-b64a-e6a4ebf3dd5c/681b39cc8dd3c.image.jpg?crop=1053%2C553%2C0%2C123",
            "country": "US",
            "language": "en",
            "summary": "It's going to be cloudy with rain for the afternoon. Rainfall near a quarter of an inch is expected in Griffin, GA. It'll be cloudy after midnight with a few showers. It will be 30% chance of rain at some point in the day."
        },
        {
            "published_date": "2025-05-07T10:25:00",
            "title": "Stress Quadruples Risk Of COPD Flares, Study Says",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/stress-quadruples-risk-of-copd-flares-study-says/article_c9d2e13c-dca5-5c54-9806-5f2088151a05.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/e/95/e9512cf9-4d21-5184-82ba-ba2afdff2a86/681b39ccda312.image.jpg?crop=1200%2C630%2C0%2C85",
            "country": "US",
            "language": "en",
            "summary": "It's going to be cloudy with rain for the afternoon. Rainfall near a quarter of an inch is expected in Griffin, GA. It'll be cloudy after midnight with a few showers. It will be 30% chance of rain at some point in the day."
        },
        {
            "published_date": "2025-05-07T10:17:02",
            "title": "World's wealthiest 1% responsible for one-fifth of global warming since 1990: Study",
            "author": "PTI",
            "url": "https://www.deccanherald.com/world/worlds-wealthiest-1-responsible-for-one-fifth-of-global-warming-since-1990-study-3528956",
            "url_media": "https://images.deccanherald.com/deccanherald%2F2024-10-14%2Fn1ik0ua1%2FiStock-157419001.jpg?rect=0%2C46%2C1208%2C634&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "The study directly links climate change to personal lifestyle and investment choices of high-income individuals, according to the researchers. It is published in the journal Nature Climate Change.      Â   .   \"Nature Climate Change\" is published by Nature."
        },
        {
            "published_date": "2025-05-07T10:15:00",
            "title": "Shingles Vaccine Could Protect Heart Health",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/shingles-vaccine-could-protect-heart-health/article_9e84cd8c-91bd-5fd9-9da3-8b7b5a32a947.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/4/dc/4dcc4e9a-970d-5413-89ae-db49de1e7ffa/681b39cd20c1f.image.jpg?crop=1200%2C630%2C0%2C85",
            "country": "US",
            "language": "en",
            "summary": "It's going to be cloudy with rain for the afternoon. Rainfall near a quarter of an inch is expected in Griffin, GA. It'll be cloudy after midnight with a few showers. It will be 30% chance of rain at some point in the day."
        },
        {
            "published_date": "2025-05-07T10:05:00",
            "title": "Childhood High Blood Sugar Can Cause Heart Problems In Young Adults",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/childhood-high-blood-sugar-can-cause-heart-problems-in-young-adults/article_b01d6f9d-6684-583c-8f5f-fbcadcc4e3ce.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/1/b9/1b9a2e89-47fb-5d8d-acf4-9131affa99da/681b39cd5bb80.image.jpg?crop=1200%2C630%2C0%2C85",
            "country": "US",
            "language": "en",
            "summary": "It's going to be cloudy with rain for the afternoon. Rainfall near a quarter of an inch is expected in Griffin, GA. It'll be cloudy after midnight with a few showers. It will be 30% chance of rain at some point in the day."
        },
        {
            "published_date": "2025-05-07T10:00:53",
            "title": "This nation is threatened by rising sea levels. It is raising awareness as it sets up its first soccer team",
            "author": "Ben Morse",
            "url": "https://edition.cnn.com/2025/05/07/sport/marshall-islands-football-team-climate-change-spt-intl",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/20250415-marshall-islands-football-gfx-test13.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "The Marshall Islands are seeking to become the last of 193 United Nations member states to have a recognized international 11-a-side soccer team with the aim of becoming a member of FIFA by 2030. The nation's soccer governing body has organized a four-team tournament taking place this summer in Springdale, Arkansas to raise awareness about climate change. Matt Webb, Lloyd Owers and Justin Walley have also created a new team kit."
        },
        {
            "published_date": "2025-05-07T10:00:00",
            "title": "Puncturing the Apocalypse: Curry and DeAngelo Expose the Myth of Climate Catastrophe",
            "author": "Charles Rotter",
            "url": "https://hotair.com/headlines/2025/05/07/puncturing-the-apocalypse-curry-and-deangelo-expose-the-myth-of-climate-catastrophe-n3802509",
            "url_media": "https://cdn.townhall.com/web/thm/hotair-twitter-default.jpg",
            "country": "US",
            "language": "en",
            "summary": "A new paper by Dr. Judith Curry and economist Harry DeAngelo details the flaws in the Apocalyptic climate narrative and articulates nine principles for sensible U.S. policies on energy and global warming. The paper questions the urgency of decarbonization and eviscerates it."
        },
        {
            "published_date": "2025-05-07T09:36:05",
            "title": "Amur Falcon \"Chiuluan 2\" Completes 3,800 Km Non-Stop Bird Migration From Somalia To India",
            "author": "OT Staff",
            "url": "https://www.outlookindia.com/traveller/amur-falcon-chiuluan-2-bird-migration-from-somalia-to-india",
            "url_media": "https://media.assettype.com/outlooktraveller/2025-05-06/tu45ek6p/snapins-ai3496671666976419059.jpg?w=1200&amp;ar=40%3A21&amp;auto=format%2Ccompress&amp;ogImage=true&amp;mode=crop&amp;enlarge=true&amp;overlay=false&amp;overlay_position=bottom&amp;overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "A satellite-tagged Amur Falcon named 'Chiuluan 2' has completed a distance of 3,800 km in a single non-stop flight from Somalia to India in 93 hours. Amur Falcons generally travel around 20,000 km a year, making it one of the longest migrations in the avian world."
        },
        {
            "published_date": "2025-05-07T09:16:34",
            "title": "Premier Roger Cook warns WA's emissions may rise before they fall in bid to help global net zero push",
            "author": "",
            "url": "https://thewest.com.au/politics/state-politics/premier-roger-cook-warns-was-emissions-may-rise-before-they-fall-in-bid-to-help-global-net-zero-push-c-18613880",
            "url_media": "https://images.thewest.com.au/publication/C-18613880/8106969516414a861a5cfa710bb2236489d9f071-16x9-x352y130w2548h1433.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "WA's emissions may rise before they fall in a bid to help global net zero push, warns Premier Roger Cook. WA's emissions are expected to rise, not fall, in order to help the global net-zero push. WA is not meeting its emissions targets. "
        },
        {
            "published_date": "2025-05-07T09:15:14",
            "title": "Unequal Carbon Footprints: Wealth's Impact on Climate Change",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3373467-unequal-carbon-footprints-wealths-impact-on-climate-change",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/07_04_2025_12_25_37_9258341.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The richest one per cent contribute to one-fifth of climate change effects since 1990, according to the study published in the journal Nature Climate Change. The findings expose the climate injustice and inequality inherent in emissions related to income and emphasize the need for climate policies targeting reductions in emissions from the affluent."
        },
        {
            "published_date": "2025-05-07T09:15:00",
            "title": "Resilient in the face of change: Alaska's waterfronts",
            "author": "",
            "url": "https://www.nationalfisherman.com/resilient-in-the-face-of-change-alaskas-waterfronts",
            "url_media": "https://s3.divcom.com/www.nationalfisherman.com/images/shutterstock_2320981355.jpg.medium.800x800.jpg",
            "country": "US",
            "language": "en",
            "summary": "Alaska's fishing communities are at a tipping point due to regulatory pressures, climate change, and economic consolidation. Speakers advocate for a stronger community participation in fisheries governance, including co-management with Tribal and Indigenous groups. They emphasize the need for coordinated planning and investment in infrastructure- cold storage, transportation, hatcheries."
        },
        {
            "published_date": "2025-05-07T09:00:10",
            "title": "Two-thirds of global heating caused by richest 10%, study suggests",
            "author": "Damien Gayle",
            "url": "https://www.theguardian.com/environment/2025/may/07/two-thirds-of-global-heating-caused-by-richest-study-suggests",
            "url_media": "https://i.guim.co.uk/img/media/de83a47049a1976fc72a0688838f465567c7f6a8/125_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c3aebc20530a93f4665d3991e0a09917",
            "country": "GB",
            "language": "en",
            "summary": "The richest 10% are responsible for two-thirds of global warming since 1990. The richest 1% responsible for 20% of global heating and the richest 0.1% for 8%. More than 50% of full-time employees in the UK earn more than £37,430 a year."
        },
        {
            "published_date": "2025-05-07T09:00:00",
            "title": "World's richest 10% responsible for two-thirds of global warming since 1990, study finds",
            "author": "Stuti Mishra",
            "url": "https://www.independent.co.uk/climate-change/news/global-warming-carbon-emission-rich-vs-poor-tax-b2745446.html",
            "url_media": "https://static.independent.co.uk/2023/11/17/22/GettyImages-1247106395.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "The world's wealthiest 10% have caused more than two-thirds of global warming since 1990. The top 1% of emitters contributed 26 times the global average to increases in deadly heat events and 17 times more to droughts in the Amazon. The last 10 years have been the hottest on record, according to the World Meteorological Organisation."
        },
        {
            "published_date": "2025-05-07T09:00:00",
            "title": "Could climate change trigger the next subprime mortgage crisis?",
            "author": "Kareem Saleh",
            "url": "https://www.fastcompany.com/91327980/could-climate-change-trigger-the-next-subprime-mortgage-crisis",
            "url_media": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/wp-cms-2/2025/05/p-1-91327980-climate-change-housing-crisis.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2008, the American dream of homeownership morphed into a nightmare that tanked the global economy. Today, another financial time bomb is ticking fueled by rising seas, wildfires, and a lethal dose of denial. Climate change is quietly corroding the foundations of the U.S. housing market."
        },
        {
            "published_date": "2025-05-07T08:45:45",
            "title": "Experts warn of high fire risk after dry winter",
            "author": "Yiannis Elafros",
            "url": "https://www.ekathimerini.com/news/environment/1268785/experts-warn-of-high-fire-risk-after-dry-winter",
            "url_media": "https://www.ekathimerini.com/wp-content/uploads/2021/08/fire-vilia-AP-960x600.jpg?v=1629402859",
            "country": "GR",
            "language": "en",
            "summary": "Last year was the warmest and among the driest ever recorded in Greece. This year has not reversed the drought trend. Scientists warn that urban sprawl is increasing the risk of fires in mixed forest-residential areas where fires often start and spread. There is also concern over possible extreme winds fueled by warm seas."
        },
        {
            "published_date": "2025-05-07T08:30:00",
            "title": "May 10 Migratory Bird Day in Sequim",
            "author": "",
            "url": "https://www.sequimgazette.com/news/may-10-migratory-bird-day-in-sequim",
            "url_media": "http://spiseq.wpengine.com/wp-content/themes/spiseq/assets/images/logo-1200x630.png",
            "country": "US",
            "language": "en",
            "summary": "An estimated 35 million birds will fly over Clallam County during the current spring migratory period. Sequim Mayor Brandon Janisse proclaimed May 10 World Migratory Bird Day. Since the 1970s, in the United States more than three billion birds have been lost, largely due to human-generated light pollution fragmenting the night skies."
        },
        {
            "published_date": "2025-05-07T08:30:00",
            "title": "San Juan County's Climate and Sustainability Advisory Committee seeks two new members",
            "author": "San Juan County.",
            "url": "https://www.islandssounder.com/news/san-juan-countys-climate-and-sustainability-advisory-committee-seeks-two-new-members",
            "url_media": "https://www.islandssounder.com/wp-content/uploads/2025/05/39279828_web1_CommitteeNewMembers-IWK-250506-flier_1.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Climate and Sustainability Advisory Committee was established by the San Juan County Council in early 2022 to help steer the County's climate action work. The Committee consists of 11 members who represent various sectors and perspectives on climate and sustainability issues. The new members will be expected to attend meetings and participate in the Committee's activities and projects. The application deadline has been extended to May 31, 2025."
        },
        {
            "published_date": "2025-05-07T07:53:00",
            "title": "Ever wondered when life on Earth will end? A supercomputer has the answer",
            "author": "TOI Science Desk",
            "url": "https://timesofindia.indiatimes.com/science/ever-wondered-when-life-on-earth-will-end-a-supercomputer-has-the-answer/articleshow/120957014.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120957348,width-1070,height-580,imgsize-82678,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "NASA and Japan's Toho University conducted a study on Earth's habitability over the next billion years. The study predicts that the Sun's increasing heat will make Earth uninhabitable. The Sun's radiation will cause Earth's temperatures to rise and its atmosphere to get more polluted. The most powerful solar storm in 20 years was recorded recently."
        },
        {
            "published_date": "2025-05-07T07:40:30",
            "title": "Flood: Bauchi, Gombe, Jigawa intensifies mitigation campaign",
            "author": "Omowumi Samuel",
            "url": "https://von.gov.ng/flood-bauchi-gombe-jigawa-intensifies-mitigation-campaign",
            "url_media": "https://von.gov.ng/wp-content/uploads/2023/12/sotuh-africa-floods-1-6705541-1703942742777.jpg",
            "country": "NG",
            "language": "en",
            "summary": "NiMet predicted flooding in 18 states including Bauchi, Gombe and Jigawa, in its 2025 Seasonal Climate Prediction (SCP). Perennial flooding is ravaging communities and the environment due to the abundance of water bodies and rivers traversing across the states. The disaster is negatively impacting food supply, environmental sustainability, loss of lives, farmlands, livestock, livelihoods and displaced millions of people."
        },
        {
            "published_date": "2025-05-07T06:45:00",
            "title": "Hunga Tonga Over? Global Temps Return To Early 2023 Levels",
            "author": "Tyler Durden",
            "url": "https://www.zerohedge.com/weather/hunga-tonga-over-global-temps-return-early-2023-levels",
            "url_media": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-05/GqH0_7iXsAAeEw5.jpg?h=7aafe19f&itok=XEfZZ44T",
            "country": "BG",
            "language": "en",
            "summary": "Climate alarmists will push for new climate taxes, toxic degrowth policies, and depopulation measures under the guise of saving the planet. The number of \"hottest day ever\" headlines in corporate media has surged to record levels over the past three years, coinciding with the massive 2022 eruption of the underwater volcano Hunga Tonga-Hunga Ha'apai."
        },
        {
            "published_date": "2025-05-07T06:18:00",
            "title": "Double-Glazed Windows: Affordable Abroad, Costly Here",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/double-glazed-windows-affordable-abroad-costly-1455485",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1526256262350-7da7584cf5eb%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "In Europe, double-glazed windows are standard. In Australia, these energy-saving windows are remarkably uncommon. The main reason for this is the high cost. In 2016, only 6% of windows installed in new houses in Australia had U-values below 4. In 2024, that figure will be 19%."
        },
        {
            "published_date": "2025-05-07T06:04:00",
            "title": "Global Stations Unite to Track World's Cleanest Air",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/global-stations-unite-to-track-worlds-cleanest-1455472",
            "url_media": "https://www.csiro.au/-/media/News-releases/2025/May/Global-monitoring-stations-team-up-to-track-human-influence-on-cleanest-air-in-the-world/CSIRO-research-vessel-RV-InvestigatorWEB030CSIRO.jpg?mw=1200&hash=1952947DF8714C87C8B7BC9BB1C5343E",
            "country": "US",
            "language": "en",
            "summary": "Scientists have embarked on a three-week voyage aboard CSIRO research vessel (RV Investigator) to measure some of the world's cleanest air. The aim is to deepen our understanding of the increasing influence of human activity on the global atmosphere and improve climate modelling. The COAST-K (Clean Ocean Air Sampling upwind of Tasmania – Kennaook/Cape Grim) RV Investigator voyage left Hobart on Tuesday 29 April and will return on 18 May 2025."
        },
        {
            "published_date": "2025-05-07T05:01:00",
            "title": "Emigration is a big, frightening way of learning you are capable of change",
            "author": "Laura Kennedy",
            "url": "https://www.irishtimes.com/abroad/2025/05/07/laura-kennedy-emigration-is-one-big-frightening-way-of-learning-you-are-resilient-and-capable-of-change",
            "url_media": "https://www.irishtimes.com/resizer/v2/J44NLTQFX5AK5PXLTCNRWCGXNA.jpg?smart=true&auth=900b300909f70b7392bc629331b43775af8c75ea2251310f9be4f0e154e0478a&width=1200&height=630",
            "country": "IE",
            "language": "en",
            "summary": "Emigrating to another country requires a leap of faith and imagination. Emma moved to Australia in August 2023. She had been living in London for six years. Emigrating forced her to re-evaluate the entire landscape of her life and change her job."
        },
        {
            "published_date": "2025-05-07T04:00:00",
            "title": "Climate Change and Rising Heat: A Growing Threat to Older Americans",
            "author": "Dr. Patrise Holden",
            "url": "https://www.washingtoninformer.com/tips-protect-seniors-heat-waves",
            "url_media": "https://www.washingtoninformer.com/wp-content/uploads/2025/05/image-20.jpg",
            "country": "US",
            "language": "en",
            "summary": "As climate change accelerates, extreme heat is emerging as a significant health threat in the United States, particularly for older adults. May is Older Americans Month. Many older adults live on fixed incomes and may not have air conditioning or be able to afford to use it. They may not recognize the warning signs of heat-related illness until it's too late. Research links extreme heat with increased anxiety, reduced productivity and higher suicide risk."
        },
        {
            "published_date": "2025-05-07T04:00:00",
            "title": "BEST IMPERSONATION OF WINTER",
            "author": "",
            "url": "https://fortmyers.floridaweekly.com/articles/best-impersonation-of-winter",
            "url_media": "https://fortmyers.floridaweekly.com/wp-content/uploads/images/2025-05-07/3p1.jpg",
            "country": "US",
            "language": "en",
            "summary": "On Jan. 23, Fort Myers had a high of 50 after a low of 46. On Feb. 1, the high reached 70. On Dec. 29, 1894, the coldest day in Fort Myers was 24 degrees. The normal January temperature is 54 degrees."
        },
        {
            "published_date": "2025-05-07T01:48:00",
            "title": "2024 Sea Level Report Cards Chart US Coastal Futures",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/2024-sea-level-report-cards-chart-us-coastal-1455364",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1517245386807-bb43f82c33c4%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "William & Mary's Batten School & VIMS have released their 2024 U.S. sea level report cards. They provide updated analyses of sea level trends and projections for 36 coastal communities based on 55 years of historical data. Most locations continue a trend of accelerating sea level rise. However, projections have remained mostly uniform since 2018."
        },
        {
            "published_date": "2025-05-07T01:41:50",
            "title": "How will life end on Earth? Study rules out meteorites and climate change",
            "author": "Shrey Banerjee",
            "url": "https://www.hindustantimes.com/world-news/how-will-life-end-on-earth-nasa-study-says-lack-of-oxygen-101746580014732.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/05/07/1600x900/SPACE-SCIENCE-ASTRONOMY-PLANET-LIFE-0_1744856703282_1746580179777.jpg",
            "country": "IN",
            "language": "en",
            "summary": "NASA-led study confirms that the end of life on planet Earth will be through the lack of oxygen. The study done by Toho University in Japan is powered by NASA modelling. They found that in a billion years, the Sun will grow even more luminous, causing a change in the Earth's balance of gases. This would lead to a disruption of oxygen levels on Planet Earth."
        },
        {
            "published_date": "2025-05-07T01:32:37",
            "title": "Scientists Warn of Fatal Fungus Similar to 'The Last of Us' Disease",
            "author": "",
            "url": "https://www.yahoo.com/news/scientists-warn-fatal-fungus-similar-013237916.html",
            "url_media": "https://media.zenfs.com/en/men_s_journal_718/79e80587ecfd828da24949d2e0cfefba",
            "country": "US",
            "language": "en",
            "summary": "Aspergillus fumigatus is a deadly mold that thrives in warm, humid environments. Rising temperatures due to climate change could expand the fungus's habitat by 77% by 2100. Crops are also at risk as another deadly strain could expand by 16%."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "UAE high temperature alert: Public urged to guard against heat illnesses",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/UAE_high_temperature_alert_Public_urged_to_guard_against_hea",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Summer temperatures are climbing rapidly across the UAE. Health professionals are warning about the dangers of extreme heat for outdoor workers, the elderly, children, and those with chronic medical conditions. Heat-related problems are common among blue-collar workers, especially those at construction sites."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Emissions of methane, a potent greenhouse gas, remain high worldwide despite available solutions",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Emissions_of_methane_a_potent_greenhouse_gas_remain_high_wor",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Methane emissions remain high around the world, according to an annual update from the International Energy Agency. Methane emissions are a key driver of climate change and are a problem for the environment.      Â   ...   ."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Fail safe",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Fail_safe",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The increasing frequency of extreme weather events worldwide signals the urgency for climate action and the green and low-carbon transition. The international landscape has grown increasingly volatile, with overlapping geopolitical conflicts and a prolonged escalation of tensions. Simultaneously, the global economic situation is getting worse."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Surprise! Ice is rebounding at BOTH poles — climate is more complex than we know",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Surprise_Ice_is_rebounding_at_BOTH_poles_climate_is_more_com",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Two new studies show that the Earth's climate is far more complex than often acknowledged. The loss of Arctic sea ice cover has undergone a slowdown over the past two decades, across all months of the year. The study reminds us of the importance of pragmatic energy and of adaptation to climate change."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Virus cases explode in Australia as country braces for 'severe' winter",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Virus_cases_explode_in_Australia_as_country_braces_for_sever",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There have been more than 63,000 flu cases in Australia already this year. The number is higher than the average number of cases over the past five years. Experts warn of a high number of flu cases this winter due to the high level of flu vaccine production."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Climate in the classroom",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Climate_in_the_classroom",
            "url_media": "https://i.ytimg.com/vi/WZkbaG16wV0/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "As climate change accelerates, its impacts on education systems are becoming impossible to ignore. From submerged schools in Bangladesh to heatwave-related closures in Pakistan, extreme weather events disrupt learning for students. Students wear protective masks to keep a safe distance from each other."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Greenpeace Slams PM's Science Pick: \"Polluters Are Running The Show\"",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/greenpeace_slams_pm_x2019s_science_pick_polluters_are_runnin",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "DairyNZ is working with Federated Farmers and Beef + Lamb to push for a system called no additional warming to measure methane emissions. Greenpeace says this approach isn't grounded in science and is designed to justify doing less, as they say it's not based in science."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Shea industry on brink of collapse, as harsh conditions ravage trees",
            "author": "Kingsley Webora",
            "url": "https://article.wn.com/view/2025/05/07/Shea_industry_on_brink_of_collapse_as_harsh_conditions_ravag",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Shea trees in the northern part of the country are seeing a decline in production due to climate change. The situation is negatively affecting pickers, processors and local businesses, many of which are women-led. The resulting market distortion is collapsing the local shea economy."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Pakistan's healthcare, disaster systems failing children, elderly: Amnesty",
            "author": "Syed Minhaj ur Rab",
            "url": "https://www.thenews.com.pk/print/1309133-pakistan-s-healthcare-disaster-systems-failing-children-elderly-amnesty",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-05-07/l_1309133_061854_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Amnesty International has released a report on climate change-related deaths in Pakistan. Children and older people are most at risk of death and disease due to extreme weather events related to climate change. Pakistan contributes about 1 per cent of global greenhouse gas emissions annually and is the world's fifth-most vulnerable country to climate disasters."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "War pollution",
            "author": "Aiman Imtiaz",
            "url": "https://www.thenews.com.pk/print/1309012-war-pollution",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-05-07/l_1309012_013804_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The outbreak of war can undo years of progress on climate change. War machines and bombs cause a lot of pollution and damage the environment. Peaceful countries have to deal with the pollution caused by those starting wars, so it's unfair to hold them responsible for the environmental problems they cause."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Wealthiest 10% responsible for two-thirds of global warming since 1990: study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Wealthiest_10_responsible_for_twothirds_of_global_warming_si",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "A new study published in Nature Climate Change has revealed a stark divide in climate responsibility. The richest 10% of the global population contribute disproportionately to the planet's rising temperatures. According to the research, they are responsible for two-thirds of global warming observed since the 1990s."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Scientists launch Southern Ocean voyage to track human impact on cleanest air",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Scientists_launch_Southern_Ocean_voyage_to_track_human_impac_k",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "A team of scientists has set out on a research voyage to the Southern Ocean to study how human activity is changing the atmosphere. The Southern Ocean absorbs a lot of the world's carbon dioxide and heat, so any changes can influence our weather and climate. The three-week mission aboard the research vessel Investigator of the Commonwealth Scientific and"
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's wealthiest one per cent responsible for one-fifth of global warming since 1990: Study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Worlds_wealthiest_one_per_cent_responsible_for_onefifth_of_g",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "The wealthiest 1% are responsible for a fifth of global warming since 1990, while the top 10% contribute only 10%.    The study was published in the journal \"The Global Warming Policy Foundation\". It was published by Oxford University Press.  "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Sunlight Reveals New Insights into Earth's Complex Systems",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Sunlight_Reveals_New_Insights_into_Earths_Complex_Systems",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sydney, Australia (SPX) May 07, 2025. When sunlight interacts with Earth, it creates a spectrum of phenomena ranging from the stunning beauty of the sun to the stunning phenomenon of light pollution.   Read full story at: http://www.sphx.com/news/features/special-reports/sophie-spix-may-07-25th-2025."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's richest 10% responsible for two thirds of global warming, study finds",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Worlds_richest_10_responsible_for_two_thirds_of_global_warmi",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "The richest ten percent of the global population has caused two thirds of global warming since 1990, according to a new study. The authors of the study suggest progressive taxes on wealth and carbon-intensive investments could provide a solution to the global warming problem.    "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Killer fungus forecast to spread as climate heats up, experts warn",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Killer_fungus_forecast_to_spread_as_climate_heats_up_experts",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Aspergillus could reach more northerly countries in Europe, Asia and America, according to a study funded by the Wellcome Trust. Researchers forecast that there will be more people infected with the killer fungus because of rising temperatures.      "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's richest 10% caused two thirds of global warming — study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Worlds_richest_10_caused_two_thirds_of_global_warming_study",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world's wealthiest 10% are responsible for two thirds of global warming since 1990, according to French researchers. How the rich consume and invest has increased the risk of deadly heatwaves and drought. It's the first study to quantify the impact of concentrated concentrated carbon emissions."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's Wealthiest 10Pc Contributing Most To Global Warming Than Poorest 50Pc: Study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Worlds_Wealthiest_10Pc_Contributing_Most_To_Global_Warming_T",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Ten per cent of the world's richest people have a higher carbon footprint than the poorest 50 per cent. This can lead to climate extremes such as heat waves, according to the World Resources Institute (WRI). WRI is a research institute based in New Delhi."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Solutions needed as climate change & land use fuel global crop pest menace",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Solutions_needed_as_climate_change_land_use_fuel_global_crop",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change, land use change and biodiversity loss are driving an increase in agricultural pests and expansion of their ranges. This has concerning implications for future global food security, according to a recent paper published in the journal Nature Reviews Earth & Environment. The international team led by researchers at the University of Cambridge found that crop pests are increasing in abundance and range due to climate warming, land conversion and agricultural intensification."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Why The Ice Sheet\\u2019s Mass Gain Is Shocking Experts",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Antarctic_Rebound_Why_The_Ice_Sheet_u2019s_Mass_Gain_Is_Shoc",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Mass changes across the Antarctic ice sheet have been detected using satellite gravimetry. There are significant instabilities in major glacier basins of East Antarctica and across the entire ice sheet, according to the study.    ... read full story here.  "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Shocking Antarctica discovery sends climate change deniers into mass celebration",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Shocking_Antarctica_discovery_sends_climate_change_deniers_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists have made a discovery in Antarctica that has climate change deniers claiming there's now proof global warming is just a hoax. Researchers from Tongji University in Shanghai found the frozen continent suddenly reversed its decades-long trend of catastrophic melting and gained record amounts of ice."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's richest 10% responsible for two-thirds of global warming since 1990, study finds",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/World_s_richest_10_responsible_for_twothirds_of_global_warmi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world has already seen a rise in billion-dollar disasters, with stronger hurricanes in the US, floods in Europe and heatwaves in Asia. Studies estimate that if global heating reaches 4C by the end of the century, the world economy could be affected."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Drought risk warning issued after England's driest start to spring since 1956",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Drought_risk_warning_issued_after_England_s_driest_start_to__b",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Environment Agency warns of possibility of drought due to climate change. More frequent dry summers to come as a result of climate change, according to the agency's forecast. The agency also warns of more frequent droughts in the future, because of the increase in global warming."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "10% Of World's Richest Have Higher Carbon Footprint Than Poorest 50%: Study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/10_Of_Worlds_Richest_Have_Higher_Carbon_Footprint_Than_Poore",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Ten per cent of the world's richest people have a higher carbon footprint than the poorest 50 per cent. This could lead to climate extremes such as heat waves and droughts, according to a study on the study on climate change.    ... "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "IEA: Upstream operations account for 85% of methane emissions",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/IEA_Upstream_operations_account_for_85_of_methane_emissions",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "According to the IEA's Global Tracker report, the fossil fuel sector accounts for nearly one-third of global methane emissions from human activity today. The Tracker shows that record global production of oil, gas and coal, along with limited mitigation efforts to date, have kept the emissions from the energy sector low."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Two-thirds of global warming caused by world's richest 10%, study finds",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Twothirds_of_global_warming_caused_by_world_s_richest_10_stu",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "The wealthiest 10 percent of the world's people are responsible for two-thirds of the global warming since 1990, according to researchers. The way rich consume and invest has increased the risk of heatwaves and droughts, the researchers wrote in a study published on Wednesday."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Climate change: Future of today's young people",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Climate_change_Future_of_todays_young_people",
            "url_media": "https://i.ytimg.com/vi/VzgkY78sh0I/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Millions of young people will live through unprecedented lifetime exposure to heatwaves, crop failures, river floods, droughts, wildfires and tropical storms under current climate policies. If global temperatures rise by 3.5 C by the end of the century, they will be more vulnerable."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Scientists say Antarctic ice has made 'surprising' rebound in mass",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Scientists_say_Antarctic_ice_has_made_surprising_rebound_in_",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "The Antarctic Ice Sheet (AIS) has shown signs of record-breaking growth after decades of contributing to global sea-level rise. A study published in Science China Earth Sciences revealed that between 2021 and 2023, the AIS gained mass at a rate of 108 gigatons."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Could Sweating Spacecraft Make Re-Entry Easier?",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Could_Sweating_Spacecraft_Make_ReEntry_Easier",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "When ISS astronauts return home, they have a hot ride back to Earth's surface. It's been that way since the beginning of human spaceflight to orbital space and beyond. The incoming incoming space shuttle is going to be very hot on its return to Earth."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Two-thirds of global heating caused by richest 10%, study suggests",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Twothirds_of_global_heating_caused_by_richest_10_study_sugge",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world's wealthiest 10% are responsible for two-thirds of global heating since 1990, according to a study. This is driving droughts and heatwaves in the poorest parts of the world. The study links extreme climate impacts to lifestyle and investment choices, which are linked to wealth."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "CNHI SPECIAL REPORT: Earth's warming affecting Americans from coast to coast",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/CNHI_SPECIAL_REPORT_Earths_warming_affecting_Americans_from_",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Continued use of fossil fuels has warmed oceans, melted ice caps and led to some of the hottest years in recorded history, according to the UNFCCC. The world's population is growing faster than at any other time in the history of the planet. "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Pamunkey Indian Reservation named among America's most endangered historic places",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Pamunkey_Indian_Reservation_named_among_America_s_most_endan",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is threatening the Pamunkey Indian Reservation. The National Trust for Historic Preservation has named the area as one of the most endangered historic sites in the country. The reservation is situated on a 1,600-acre peninsula in King William County. It is surrounded by the Pamuunkey River."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "How much will climate change affect YOU? Scientists predict your lifetime exposure to heatwaves, floods, ...",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/How_much_will_climate_change_affect_YOU_Scientists_predict_y",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is already having a catastrophic effect around the world, evident from European heatwaves to violent typhoons in the Pacific. Researchers at Vrije Universiteit Brussel (VUB) in Belgium warn that climate change will get worse as people get older."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Dangerous clear-air turbulence is worsening due to global warming",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Dangerous_clearair_turbulence_is_worsening_due_to_global_war",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists at the European Geosciences Union conference last week said there is growing evidence that global warming is driving an increase in dangerous clear-air turbulence. Along some busy flight routes, turbulence is expected to double or treble or quadruple over the next few decades."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Heat and drought are quietly hurting crop yields",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Heat_and_drought_are_quietly_hurting_crop_yields",
            "url_media": "https://article.wn.com/view/2025/05/07/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change has altered growing conditions for the world's five major crops, according to a new study.    - The New York Times reports that the study is based on data from a study by the University of California, Los Angeles and the International Food Policy Institute. "
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "World's richest 10 per cent caused two-thirds of global warming: Study",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Worlds_richest_10_per_cent_caused_twothirds_of_global_warmin",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world's wealthiest 10% are responsible for two-thirds of global warming since 1990, according to a new study. How the rich consume and invest has increased the risk of deadly heatwaves and drought, the study found. It is the first study to quantify the impact of concentrated private wealth."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Puncturing the Apocalypse: Curry and DeAngelo Expose the Myth of Climate Catastrophe",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/07/Puncturing_the_Apocalypse_Curry_and_DeAngelo_Expose_the_Myth",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The apocalyptic climate narrative is a misleading propaganda tool and a socially destructive guide for public policy. The narrative overstates the risks to humanity of continued global warming. It prescribes large-scale near-term suppression of global warming, which is manageable, not existential."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Climate change a danger to general public health, APHRC",
            "author": "ELISHA SINGIRA",
            "url": "https://www.the-star.co.ke/news/2025-05-07-climate-change-a-danger-to-general-public-health-aphrc-1",
            "url_media": "https://cdn.radioafrica.digital/image/2025/05/5c686400-310a-4fba-9239-573519eb7462.jpeg?1746626529414",
            "country": "KE",
            "language": "en",
            "summary": "Climate change is a present-day public health crisis. It is amplifying health inequalities, particularly in Africa. It increases food insecurity, worsens water scarcity, and fuels migration. The effects are already visible across the continent. Climate-induced displacement is placing further strain on already overstretched health services."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "An Inconvenient Antarctic Ice Increase",
            "author": "",
            "url": "https://patriotpost.us/articles/117030-an-inconvenient-antarctic-ice-increase-2025-05-07",
            "url_media": "https://img.patriotpost.us/01JTNJ2HZNAPGN3925TTWABC3N.jpeg?w=1200&h=630",
            "country": "US",
            "language": "en",
            "summary": "The ice cap at the South Pole has been growing for three years. Al Gore predicted in 2009 that the north polar ice cap could be completely ice-free within the next five to seven years. In 2025, the Antarctic ice sheet gained mass at a rate of 108 gigatons per year."
        },
        {
            "published_date": "2025-05-07T00:00:00",
            "title": "Surprise! Two new studies find ice is rebounding at BOTH poles! 'Surprising pause' in Arctic",
            "author": "Freedomsphoenix Readerfour",
            "url": "https://www.FreedomsPhoenix.com/News/378728-2025-05-07-surprise-two-new-studies-find-ice-is-rebounding-at-both.htm",
            "url_media": "https://www.freedomsphoenix.com/Uploads/Graphics/533-0507183305-images-7.jpg",
            "country": "US",
            "language": "en",
            "summary": "After years of ice sheet decline, Antarctica has seen a record-breaking accumulation of ice. Melting Antarctic ice contributes to global sea-level rise, so understanding the dynamics of ice mass on Antarctica is essential. At the other end of the planet, at the North Pole, a new preprint by England et al. notes a \"pause\" in Arctic sea ice decline."
        }
    ]
}