{
    "status": "ok",
    "total_articles": 63,
    "articles": [
        {
            "published_date": "2025-05-18T22:24:00",
            "title": "IMD says it's going to be a rainy, humid day",
            "author": "",
            "url": "https://timesofindia.indiatimes.com/city/chennai/imd-says-its-going-to-be-a-rainy-humid-day/articleshow/121254218.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-121254217,width-1070,height-580,imgsize-103644,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Chennai and several northern Tamil Nadu districts are set to experience cooler temperatures and high humidity, with increased chances of rain due to a change in wind patterns. An upper air circulation (UAC) over the Bay of Bengal has moved closer to the Tamil Nadu coast, shifting prevailing winds to easterlies."
        },
        {
            "published_date": "2025-05-18T22:00:35",
            "title": "Send this to someone who is worried about the Climate Change Scam Hoax & the end of Earth.",
            "author": "SGT",
            "url": "https://www.sgtreport.com/2025/05/send-this-to-someone-who-is-worried-about-the-climate-change-scam-hoax-the-end-of-earth",
            "url_media": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "Send this to someone worried about the Climate Change Scam Hoax and the end of Earth. Reassure them that billions of tonnes of ice were added to the Ice Caps and that they're not shrinking. Let them know that the whole thing is a scam used for societal good."
        },
        {
            "published_date": "2025-05-18T22:00:00",
            "title": "In India, Women's 'Dream Maps' Push Back on Climate Change",
            "author": "Newser Editors",
            "url": "https://www.newser.com/story/368769/in-india-womens-dream-maps-push-back-on-climate-change.html",
            "url_media": "https://img2-azrcdn.newser.com/image/1610875-12-20250518120002.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Indigenous Adivasis in India's eastern state of Odisha are making their most significant effort yet to speak up for their community's needs due to climate change. Women from 10 villages are surveying and mapping out resources that are dwindling and pointing out what needs restoring. They estimate $2 million might be needed to restore common areas in their villages."
        },
        {
            "published_date": "2025-05-18T21:25:57",
            "title": "The world is getting darker, absorbing more sunlight, which is accelerating the Climate Crisis",
            "author": "Ben Aris in Berlin",
            "url": "https://www.intellinews.com/the-world-is-getting-darker-absorbing-more-sunlight-which-is-accelerating-the-climate-crisis-381563",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/Screen_Shot_2025-05-17_at_18.22.19_Cropped.png",
            "country": "US",
            "language": "en",
            "summary": "As the earth warms, the ice melts and we lose reflectivity, more heat from the sun is absorbed, creating a positive feedback loop that accelerates global warming. The Earth's albedo has decreased 0.5% in the last 25 years. The total human-caused climate forcing from all greenhouse gases was estimated at 3.2 W/m² as of 2023."
        },
        {
            "published_date": "2025-05-18T19:04:41",
            "title": "Climate Change Threatens Sleep Health Worldwide",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/climate-change-increases-severity-obstructive-sleep-apnea-study-798",
            "url_media": "https://one.newkerala.com/images/r/sleep-apnea-fp-2515.webp",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures increase the severity of obstructive sleep apnea (OSA). The societal burden of OSA is expected to double in most countries over the next 75 years due to climate change. People in Europe have higher OSA rates when temperatures rise than in the United States."
        },
        {
            "published_date": "2025-05-18T17:51:32",
            "title": "Melting water towers!",
            "author": "Arif Shafi Wani",
            "url": "https://www.greaterkashmir.com/opinion/melting-water-towers",
            "url_media": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2025/05/Screenshot-2025-05-18-at-11.17.37-PM.png",
            "country": "IN",
            "language": "en",
            "summary": "António Guterres is concerned about the rapid retreating of Himalayan glaciers in the Himalayas due to climate change. According to the UN report, the glacier melt risks unleashing cascading impacts on economies, ecosystems and communities. The report states that five of the past six years have witnessed the most rapid glacier retreat on record. 2025 was declared as the International Year of Glaciers' Preservation. India, along with 35 other countries, are part of this global initiative."
        },
        {
            "published_date": "2025-05-18T17:36:00",
            "title": "Ouch! What just bit me?",
            "author": "Emily Cabrera",
            "url": "https://www.news-daily.com/news/ouch-what-just-bit-me/article_416c41ce-fcc1-5ca2-b802-e22f6e7a4e68.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/assets/v3/editorial/3/e5/3e5b4720-8bb9-5f6e-9bda-63f8d44bf7e1/6824c80c19466.image.jpg?crop=1722%2C904%2C0%2C149&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "As summer approaches, there is a surge in stinging and biting insects. Elmer Gray is a research entomologist with the University of Georgia College of Agricultural and Environmental Sciences and a specialist for UGA Cooperative Extension. He explains the most common insect pests of the season and how to protect yourself and your family."
        },
        {
            "published_date": "2025-05-18T17:08:07",
            "title": "'At risk' areas revealed in Colchester's climate adaptation report",
            "author": "Séamus O'Hanlon",
            "url": "https://news.knowledia.com/all/all/articles/at-risk-areas-revealed-in-colchester-s-climate-adaptation-report-ed015afa0290569b37442816df1bef4a0a8ea5e5",
            "url_media": "http://www.gazette-news.co.uk/resources/images/19332880.jpg/",
            "country": "FR",
            "language": "en",
            "summary": "City leaders declared a climate emergency back in 2019 and committed to becoming carbon neutral by 2030. The potential for heatwaves is likely to increase. Essex is the second-most at risk county for wildfires in the UK. The average water use in the county is 155 to 160 litres per person per day."
        },
        {
            "published_date": "2025-05-18T17:00:17",
            "title": "There is no climate change crisis; there's a crisis of corrupted politicians and institutions",
            "author": "Rhoda",
            "url": "https://www.sgtreport.com/2025/05/there-is-no-climate-change-crisis-theres-a-crisis-of-corrupted-politicians-and-institutions",
            "url_media": "https://i0.wp.com/expose-news.com/wp-content/uploads/2025/05/FtMay17a.png?resize=1024%2C576&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Record harvests and growing ice sheets are empirical evidence that challenge climate alarmists' orthodoxy. The crisis is not in the atmosphere but in corrupted institutions and politicians, writes Vijay Jayaraj. Antarctica's ice sheet is growing instead of shrinking, which contradicts the IPCC's predictions."
        },
        {
            "published_date": "2025-05-18T16:00:00",
            "title": "Despite intense the heat, Yucatán is one of the few states with no drought in Mexico",
            "author": "Yucatan Times",
            "url": "https://www.theyucatantimes.com/2025/05/despite-intense-the-heat-yucatan-is-one-of-the-few-states-with-no-drought-in-mexico",
            "url_media": "https://www.theyucatantimes.com/wp-content/uploads/2025/05/sequia.jpeg",
            "country": "MX",
            "language": "en",
            "summary": "Yucatán, Tlaxcala, Mexico City, and Quintana Roo are the only states without drought impacts across 100% of their territory. Most of the states experiencing water shortages are concentrated in the north and center of the country, mainly in Sonora, Chihuahua, Coahuila, and Durango."
        },
        {
            "published_date": "2025-05-18T14:10:52",
            "title": "Over 11 million Pakistanis face acute food insecurity amid erratic weather changes — FAO",
            "author": "KASHIF IMRAN",
            "url": "https://www.arabnews.com/node/2601207/pakistan",
            "url_media": "https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/05/18/4603091-933491609.jpg?itok=AnnhK91M",
            "country": "SA",
            "language": "en",
            "summary": "11 million Pakistanis faced acute food insecurity between November 2024 and March 2025. Food and Agriculture Organization (FAO) says food insecurity and child malnutrition rose for the sixth consecutive year in 2024. The population coverage in Pakistan increased by 38 percent between 2024 and 2025, from 36.7 million people to 50.8 million."
        },
        {
            "published_date": "2025-05-18T13:24:10",
            "title": "Trump cuts weather service as hurricane season approaches",
            "author": "Trvln West",
            "url": "https://www.dailykos.com/stories/2025/5/18/2322977/-Trump-cuts-weather-service-as-hurricane-season-approaches",
            "url_media": "https://cdn.prod.dailykos.com/images/1429479/story_image/TrumpRFlag1200.jpg?1746438176",
            "country": "US",
            "language": "en",
            "summary": "There were 28 weather and climate disasters in 2023, surpassing the previous record of 22 in 2020, tallying a price tag of at least $92.9 billion. NOAA's primary science division has seen 74% cuts. The National Marine Fisheries Service is being cut by 30%. Farmers will face difficult decisions about what crops to grow."
        },
        {
            "published_date": "2025-05-18T13:16:56",
            "title": "Southern Africa faces climate threat to food security, experts warn",
            "author": "Lindi Botha",
            "url": "https://citizen.co.za/network-news/lnn/article/southern-africa-faces-climate-threat-to-food-security-experts-warn",
            "url_media": "https://images.caxton.co.za/wp-content/uploads/sites/110/2025/05/joburg-market-conference.jpg",
            "country": "ZA",
            "language": "en",
            "summary": "Southern Africa is warming at twice the global rate. This will have a significant impact on food production. The most recent drought in Southern Africa caused three countries to declare a state of emergency. Farmers need to implement climate smart agriculture technologies, climate neutral practices, and investment in solutions for water reuse."
        },
        {
            "published_date": "2025-05-18T13:00:01",
            "title": "Florida Map Shows Cities Where Sea Level Rise Is Accelerating",
            "author": "Theo Burman",
            "url": "https://www.newsweek.com/florida-map-cities-sea-level-rise-2072598",
            "url_media": "https://d.newsweek.com/en/full/2645117/florida-map-sea-level.jpg",
            "country": "US",
            "language": "en",
            "summary": "Some of the largest cities in Florida are facing rising sea levels due to land subsidence and ocean currents. Rising sea levels over the next two decades could profoundly impact life in some of the country's largest urban areas and lead to displaced communities. Cedar Key saw the greatest acceleration in rise rate out of the cities the report monitored."
        },
        {
            "published_date": "2025-05-18T12:29:40",
            "title": "Trump administration cuts endanger many critical science programs in Alaska, researchers say",
            "author": "Class",
            "url": "https://www.columbian.com/news/2025/may/18/trump-administration-cuts-endanger-many-critical-science-programs-in-alaska-researchers-say",
            "url_media": "https://www.columbian.com/wp-content/uploads/2025/05/0518_met_US-NEWS-SCI-ALASKA-FEDERAL-FUNDING-PT.jpg",
            "country": "US",
            "language": "en",
            "summary": "Trump administration wants to cut funding for climate and environmental studies in Alaskan research institutes and shrink the federal workforce. Long-running studies of fish, wildlife and Alaska ecosystems are being compromised. It's expensive to do this work in Alaska, so scientists can't hire Princess Cruises to do fishery surveys."
        },
        {
            "published_date": "2025-05-18T12:15:17",
            "title": "The World's Most Popular Fruit May Be Endangered",
            "author": "Tim Karan",
            "url": "https://news.knowledia.com/all/all/articles/the-world-s-most-popular-fruit-may-be-endangered-f6468a51f330ed920672bf35efe8c2fedf0a6c2a",
            "url_media": "https://img2-azrcdn.newser.com/image/1610509-17-20250517211202-worlds-popular-fruit-may-endangered.jpeg",
            "country": "FR",
            "language": "en",
            "summary": "Two-thirds of banana-growing areas in Latin America and the Caribbean could become unsuitable for cultivation by 2080 due to climate change. Extreme weather, rising temperatures and climate-fueled pests are already reducing yields in countries like Guatemala, Costa Rica, and Colombia."
        },
        {
            "published_date": "2025-05-18T11:57:21",
            "title": "How Cyprus' climate has changed down the centuries",
            "author": "Johanna Pauls",
            "url": "https://cyprus-mail.com/2025/05/18/how-cyprus-climate-has-changed-down-the-centuries",
            "url_media": "https://cyprus-mail.com/wp-content/uploads/2025/05/feature-johanna-main-Calcite-sampling-in-Varathro-cave.jpeg",
            "country": "CY",
            "language": "en",
            "summary": "There is a discussion about the nature of the current climate in Cyprus. It is not clear how to explain the current state of the climate. There are a lot of people in the discussion, but it's not clear what is going to be the result of the discussion."
        },
        {
            "published_date": "2025-05-18T11:57:21",
            "title": "Climate patterns on the island to be viewed across history",
            "author": "Iole Damaskinos",
            "url": "https://cyprus-mail.com/2023/05/11/climate-patterns-on-the-island-to-be-viewed-across-history",
            "url_media": "https://cyprus-mail.com/wp-content/uploads/2022/04/A-goat-walks-on-the-dried-up-bed-of-Kouris-reservoir-during-the-drought-of-2008.jpg",
            "country": "CY",
            "language": "en",
            "summary": "European and Lebanese scientists are working with the University of Nicosia to study Cypriot climate fluctuations and their effects on society. The research is part of a larger project examining how climate affects land use and disease outbreaks in the Eastern Mediterranean region. The scientists are collecting historical data on famines, agricultural shortages, disease outbreaks and the climate data."
        },
        {
            "published_date": "2025-05-18T11:36:00",
            "title": "Italy's Ambassador to Pakistan signs agreement with FAO",
            "author": "ANSA English Desk",
            "url": "https://www.ansa.it/english/news/news_from_embassies/2025/05/18/italys-ambassador-to-pakistan-signs-agreement-with-fao_36f7bc0d-3f91-4821-ac9b-6eb564c6771e.html",
            "url_media": "https://www.ansa.it/webimages/img_1129x635/2025/5/18/fa4391f0c73970d6912f5ccf273a6711.jpg",
            "country": "IT",
            "language": "en",
            "summary": "The Ambassador of Italy to Pakistan signed the agreement with FAO to launch the Resilience and Adaptation Promoting Advance Actions (RAFAA) initiative. The intervention aims to strengthen the resilience of communities most exposed to the impacts of climate change in Pakistan. The 36-month initiative will focus on Sindh province and involve 25,000 households and more than 1 million people."
        },
        {
            "published_date": "2025-05-18T11:32:42",
            "title": "World's favourite fruit at risk: Banana could disappear by 2080",
            "author": "Web Desk",
            "url": "https://jang.com.pk/en/38468-worlds-favourite-fruit-at-risk-banana-could-disappear-by-2080-news",
            "url_media": "https://jang.com.pk/assets/uploads/english_news/2025-05-18/38468_043334_eng.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Climate change could wipe out 60% of banana crops by 2080. Latin America and the Caribbean account for 80% of global banana exports. Over 400 million people rely on bananas for 27% of their daily calories. Most exported bananas come from a single cloned variety, the Cavendish."
        },
        {
            "published_date": "2025-05-18T11:20:28",
            "title": "Why Are Environmental Protesters Being Criminalized?",
            "author": "Deutsche Welle",
            "url": "https://www.latestly.com/agency-news/why-are-environmental-protesters-being-criminalized-6863515.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/05/61342823_403-784x441.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In late 2024, a flotilla of kayaks paddled into the harbor shipping lane to block a coal ship from docking in Newcastle on Australia's east coast. Some 170 activists were arrested for alleged crimes, including the disruption of a major facility. One in five climate and environment protesters are arrested in Australia, the highest rate in the democratic world. Similar punitive anti-protest laws have been enacted across Europe and US."
        },
        {
            "published_date": "2025-05-18T10:59:43",
            "title": "Why are environmental protesters being criminalized? – DW – 05/18/2025",
            "author": "Stuart Braun",
            "url": "https://www.dw.com/en/why-are-environmental-protesters-being-criminalized/a-72447290",
            "url_media": "https://static.dw.com/image/61342823_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Climate and environmental protest is rising in line with increasing global temperatures, but new draconian penalties are putting people who rally against climate pollution in jail. One in five climate and environment protesters are arrested in Australia, which is the highest rate in the democratic world. In Germany, members of the nonviolent climate action group Letzte Generation were charged in May 2024 with \"forming a criminal organization\""
        },
        {
            "published_date": "2025-05-18T10:54:29",
            "title": "Climate change increases severity of obstructive sleep apnea: Study",
            "author": "The Hans India",
            "url": "https://www.thehansindia.com/life-style/climate-change-increases-severity-of-obstructive-sleep-apnea-study-972162",
            "url_media": "https://assets.thehansindia.com/h-upload/2025/05/18/1551983-sleep.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures increase the severity of obstructive sleep apnea (OSA) according to a new study. The societal burden of OSA is expected to double in most countries over the next 75 years. People in Europe have higher OSA rates when temperatures rise than in Australia and the US."
        },
        {
            "published_date": "2025-05-18T10:41:40",
            "title": "Doomster Snake Oil Revelations from Inspector Robson",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/doomster-snake-oil-revelations-from",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F485e9194-7a04-471b-8ad6-e43d5e430185_1500x1000.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Dr. John Robson explains generational flooding, climate whiplash, and glacier melting rates now and then in this video. Enjoy.    Dr. Robson's video is titled \"Generational flooding, Climate Whiplash and Glacier Melting\". "
        },
        {
            "published_date": "2025-05-18T10:30:51",
            "title": "Experts sound alarm over creeping coastal collapse that could displace millions by 2050: 'Pushing many ... into poverty and hunger'",
            "author": "Catherine Wilkins",
            "url": "https://www.yahoo.com/news/experts-sound-alarm-over-creeping-103051400.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ItfZeUMIKacgbPJX2l6MSw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/de981fc957f093d87499cb77194e6c05",
            "country": "US",
            "language": "en",
            "summary": "Advocates warn that coastal communities in Nigeria could cease to exist by 2050 if environmental protections aren't made a priority. The global average sea level has increased by 8 to 9 inches in the last century and a half. The workshop participants from at least five Nigerian states \"pleaded for immediate government intervention\""
        },
        {
            "published_date": "2025-05-18T10:20:00",
            "title": "Women farmers bounce back",
            "author": "",
            "url": "https://www.jamaicaobserver.com/2025/05/18/women-farmers-bounce-back",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/05/68b60538127900b8bea457c662d62ae3-1024x720.jpg",
            "country": "JM",
            "language": "en",
            "summary": "Trishawna Brown's flower farm in Potsdam, St Elizabeth, Jamaica was destroyed by Hurricane Beryl. She lost a lot of plants and her house, the top and back of her house. She is now farming strawberries. One third of all farmers in Jamaica are women. UNDP and Jamaica Network of Rural Women Producers (JNRWP) shortlisted 54 women business owners for its livelihoods recovery support."
        },
        {
            "published_date": "2025-05-18T09:52:32",
            "title": "Significant eruption at Lewotobi Laki-laki volcano, Indonesia",
            "author": "Teo Blašković",
            "url": "https://watchers.news/2025/05/18/eruption-lewotobi-lakilaki-indonesia",
            "url_media": "https://watchers.news/wp-content/uploads/2025/05/lewotobi-laki-laki-eruption-may-18-2025-f.webp",
            "country": "US",
            "language": "en",
            "summary": "The Center for Volcanology and Geological Hazard Mitigation (PVMBG) maintains the Alert Level at III (Siaga). Residents and visitors are advised to avoid activities within a 6 km (3.7 miles) radius of the volcano's summit."
        },
        {
            "published_date": "2025-05-18T09:35:48",
            "title": "Flood peak in Mekong Delta can coincide with high tide peaks at end of 2025",
            "author": "Vinh Tuong",
            "url": "https://en.sggp.org.vn/flood-peak-in-mekong-delta-can-coincide-with-high-tide-peaks-at-end-of-2025-post117654.html",
            "url_media": "https://image.sggp.org.vn/1200x630/Uploaded/2025/bhtgkqztgazs/2025_05_18/05-2111-6405-6560.jpg",
            "country": "VN",
            "language": "en",
            "summary": "The Southern Institute of Water Resources Research has issued a warning that the flood peak in the Mekong Delta could coincide with high tide peaks in October and November 2025. This overlap may cause widespread and severe waterlogging across various areas in multiple regions. In Ca Mau Peninsula, the Cai Lon – Cai Be irrigation system is expected to be affected by upstream water flows, high tides and local rainfall."
        },
        {
            "published_date": "2025-05-18T09:00:00",
            "title": "Leiston school to present project at climate summit in Italy",
            "author": "Sophie Skyring",
            "url": "https://www.eadt.co.uk/news/25169481.leiston-school-present-project-climate-summit-italy",
            "url_media": "https://www.eadt.co.uk/resources/images/19446056.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Summerhill School pupils will attend the Climate Detectives Summit in Italy. The project focuses on the increasing erosion of cliffs in Happisburgh, north Norfolk. It highlights the demolition of homes and the threat to others as the cliffs recede. The children will be the youngest participants."
        },
        {
            "published_date": "2025-05-18T08:30:00",
            "title": "Comment: Ignoring the climate choice to adapt or die",
            "author": "",
            "url": "https://www.heraldnet.com/breakingnews/comment-ignoring-the-climate-choice-to-adapt-or-die",
            "url_media": "https://www.heraldnet.com/wp-content/uploads/2025/05/39403868_web1_TSR-Leque-Island-2-EDH-210817.jpg",
            "country": "US",
            "language": "en",
            "summary": "The White House is proposing to eliminate funding for climate adaptation science in the next federal budget. Bethany Bradley, Jia Hu and Meade Krosby are researchers and directors of regional Climate Adaptation Science Centers funded by the U.S. Geological Survey since 2011. They have seen firsthand the work these programs do to protect the nation's natural resources."
        },
        {
            "published_date": "2025-05-18T08:15:00",
            "title": "Why Poor Countries Suffer More From Climate Change Than Rich Countries",
            "author": "R. J. Manuel",
            "url": "https://www.msn.com/en-us/money/markets/why-poor-countries-suffer-more-from-climate-change-than-rich-countries/ar-AA1EZnS9",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Climate change impacts all parts of the globe, but poorer countries are hit harder than richer ones. Developing economies suffer more as a result of their geographical positions. Rich countries can spend money on flood barriers, early warning systems, and green infrastructure. Poor countries can't afford to invest money in climate adaptation. Developed countries have limited access to technological developments."
        },
        {
            "published_date": "2025-05-18T08:11:45",
            "title": "Is climate change men's fault?",
            "author": "Aoife Daly",
            "url": "https://www.newstalk.com/news/is-climate-change-mens-fault-2163371",
            "url_media": "https://media.radiocms.net/uploads/2024/11/10143804/RightSize3.png",
            "country": "IE",
            "language": "en",
            "summary": "New research from France has shown that men contribute 25% more to climate change than women due to their love of red meat and fast cars. Columnist Ian O'Doherty believes the days of 'climate catastrophism' are over as people are fed up with constantly being told the planet is dying. Dr Ní Lamhna is an environmentalist and PRO of the Tree Council of Ireland."
        },
        {
            "published_date": "2025-05-18T08:11:00",
            "title": "Big tension for cash-strapped Pakistan, 11 million people projected to face..., reason is...",
            "author": "Shivam Verma",
            "url": "https://www.dnaindia.com/world/report-big-tension-for-cash-strapped-pakistan-11-million-people-projected-to-face-reason-is-3152651",
            "url_media": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2025/05/18/2695435-image-2025-05-18t134340.205.jpg",
            "country": "IN",
            "language": "en",
            "summary": "11 million people in 68 flood-affected rural districts across Balochistan, Sindh and Khyber Pakhtunkhwa are projected to face food insecurity from November 2024 to March 2025. Extreme weather conditions would affect livelihoods of people. Pakistan experienced persistently high levels of acute malnutrition between 2018 and early 2024."
        },
        {
            "published_date": "2025-05-18T07:37:14",
            "title": "Climate Change and South Asia: Understanding the challenges and Pakistan's strategic response",
            "author": "Dr. Syeda Rehana",
            "url": "https://businessday.ng/opinion/article/climate-change-and-south-asia-understanding-the-challenges-and-pakistans-strategic-response",
            "url_media": "https://cdn.businessday.ng/2021/11/climate-change.jpeg",
            "country": "NG",
            "language": "en",
            "summary": "Climate change is one of the most pressing global challenges of the 21st century. South Asia is particularly susceptible to climate-induced disasters due to its geographic and socio-economic characteristics. Pakistan is especially vulnerable to the effects of climate change, despite contributing less than one percent of global greenhouse gas emissions. Pakistan has taken significant steps in policy and practice to address the climate crisis."
        },
        {
            "published_date": "2025-05-18T07:06:52",
            "title": "Low Gravity, High Longevity: Southern Sri Lanka's Tourism Potential",
            "author": "Thushan Jayasuriya",
            "url": "https://www.dailynews.lk/2025/05/18/admin-catagories/breaking-news/779985/low-gravity-high-longevity-southern-sri-lankas-tourism-potential",
            "url_media": "https://www.dailynews.lk/wp-content/uploads/2025/05/1-9-1.jpg",
            "country": "LK",
            "language": "en",
            "summary": "The Southern Province of Sri Lanka is home to the lowest gravity zone in the world and has the highest life expectancy in the country. This presents a significant opportunity to boost the province's tourism industry and attract foreign investment, according to Professor Indralal de Silva from the University of Colombo. "
        },
        {
            "published_date": "2025-05-18T07:00:00",
            "title": "Barcelona temperature will ‘rise 3.7 degrees by 2100' unless carbon emissions ‘substantially reduced', study warns - Olive Press News Spain",
            "author": "Ben Pawlowski",
            "url": "https://www.theolivepress.es/spain-news/2025/05/18/barcelona-temperature-will-rise-3-7-degrees-by-2100-unless-carbon-emissions-substantially-reduced-study-warns",
            "url_media": "https://www.theolivepress.es/wp-content/uploads/2025/04/barcelona.png",
            "country": "ES",
            "language": "en",
            "summary": "The average temperature in Barcelona could rise by up to 3.7 degrees Celsius by the end of the century unless greenhouse gas emissions are 'substantially reduced', according to the ICARIA project. Last summer, Barcelona recorded its highest-ever temperature of 40.2C as the city baked in a sweltering heatwave."
        },
        {
            "published_date": "2025-05-18T05:55:00",
            "title": "Hundreds of homes up for sale as residents flee coastal town: 'All the destruction'",
            "author": "Mike Taylor",
            "url": "https://www.yahoo.com/news/hundreds-homes-sale-residents-flee-055500733.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Ob3hnkqKM_E.KuMTEQYeHQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/772b729a9ce83be2d97c5e18f666a7ba",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Ian destroyed Sanibel, Florida, three years ago. Some residents are moving out, others are looking for new opportunities. The city has instituted over 40 ordinance changes to expedite the recovery process. On May 1, beaches will open with 800 free parking spaces and a pair of resorts reopened."
        },
        {
            "published_date": "2025-05-18T05:43:00",
            "title": "Germany voices concern over Israeli ground offensive in Gaza",
            "author": "Al Arabiya English",
            "url": "https://english.alarabiya.net/News/world/2025/05/18/germany-voices-concern-over-israeli-ground-offensive-in-gaza",
            "url_media": "https://vid.alarabiya.net/images/2025/05/17/3fb147c0-dd37-4184-9699-7a574358dacc/3fb147c0-dd37-4184-9699-7a574358dacc_16x9_600x338.JPG",
            "country": "SA",
            "language": "en",
            "summary": "The launch of Israel's new ground offensive in Gaza is a cause for deep concern, a German Foreign Office spokesperson said on Saturday. Germany's Foreign Office is concerned about the situation in Gaza and its humanitarian situation there.    in a statement on Saturday, the spokesperson said."
        },
        {
            "published_date": "2025-05-18T05:01:01",
            "title": "Number of Dangerous Heat Days Increases: Risk for Pregnant Women",
            "author": "Akt.",
            "url": "https://www.vol.at/number-of-dangerous-heat-days-increases-risk-for-pregnant-women/9410339",
            "url_media": "https://www.vol.at/wp-content/themes/vodl/assets/navigation/logo.png",
            "country": "AT",
            "language": "en",
            "summary": "The climate crisis increases the number of dangerous hot days for pregnant women worldwide. In Austria, there have been an average of 27 such hot days annually since 2020. The number of hot days has increased by 17 days per year due to climate change in 90% of the 247 countries and regions studied."
        },
        {
            "published_date": "2025-05-18T04:13:32",
            "title": "Wildfires slash global forest recovery capacity, study warns",
            "author": "CGTN",
            "url": "https://news.cgtn.com/news/2025-05-18/Wildfires-slash-global-forest-recovery-capacity-study-warns-1DtbzX3COU8/p.html",
            "url_media": "https://news.cgtn.com/news/2025-05-18/Wildfires-slash-global-forest-recovery-capacity-study-warns-1DtbzX3COU8/img/ddc73732535441cc916931ec55d71e12/ddc73732535441cc916931ec55d71e12-750.png",
            "country": "CN",
            "language": "en",
            "summary": "Fewer than one-third of affected forests can regenerate within seven years after a large-scale wildfire in the 21st century. After 2010, the median severity of large wildfires surged by 42.9 percent in arid regions and 54.3 percent in boreal zones, with North America's western regions, northern-central Siberia and southeastern Australia hardest hit."
        },
        {
            "published_date": "2025-05-18T03:37:15",
            "title": "Mitigating climate change impact in Sabah",
            "author": "Juiceapac Web Development Team",
            "url": "https://www.dailyexpress.com.my/read/6099/mitigating-climate-change-impact-in-sabah",
            "url_media": "https://www.dailyexpress.com.my/uploads/features2/2025/05/Govt_Padi_1805.jpg",
            "country": "MY",
            "language": "en",
            "summary": "Sabah is taking steps to address climate change and global warming challenges. The Sabah Climate Action Council (SCAC) was established in 2022. The Council is tasked with setting the direction and coordinating mitigation and adaptation projects across Sabah. A Climate Change Unit has been set up within the Sabah Forestry Department as the Interim Secretariat for the SCAC. The unit is responsible for developing the GHG inventory and a study on Climate Change Impacts, Vulnerability and Adaptation in Sabah in 2024. Sabah successfully completed consultancy services for the development of the Climate Change Policy in July 2024."
        },
        {
            "published_date": "2025-05-18T03:15:00",
            "title": "The World's Most Popular Fruit May Be Endangered",
            "author": "Tim Karan",
            "url": "https://www.newser.com/story/368646/the-worlds-most-popular-fruit-may-be-endangered.html",
            "url_media": "https://img2-azrcdn.newser.com/image/1610509-12-20250517171502.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Two-thirds of banana-growing areas in Latin America and the Caribbean could become unsuitable for cultivation by 2080 due to climate change. The region provides 80% of the banana exports that fill supermarket shelves around the world. Extreme weather, rising temperatures, and climate-fueled pests are already reducing yields in countries like Guatemala, Costa Rica, and Colombia."
        },
        {
            "published_date": "2025-05-18T02:53:20",
            "title": "Eye-Opening Global Ranking Highlights Challenges of Home Buying in Australia",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/eye-opening-global-ranking-highlights-challenges-of-home-buying-in-australia",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/05/Insane-global-ranking-that-says-it-all-about-buying-a.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Sydney, Melbourne, Brisbane, Adelaide, and Perth are some of the most unaffordable places to buy a home in the world. Sydney is the second least affordable city overall, behind only Hong Kong. Urban containment policies have driven up land prices on the edges of major Australian cities."
        },
        {
            "published_date": "2025-05-18T02:24:41",
            "title": "Superfood diet and the right shampoo essentials for budgies going on show",
            "author": "system",
            "url": "https://article.wn.com/view/2025/05/18/Superfood_diet_and_the_right_shampoo_essentials_for_budgies_",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Devoted budgie fanciers live and breathe for the native Australian parrots, but they joke theirs is a \"dying hobby\" and it's time to give up.       .   for the budgie hobby is a dying hobby."
        },
        {
            "published_date": "2025-05-18T01:43:39",
            "title": "Insane global ranking that says it all about buying a home in Australia",
            "author": "Max Aldred",
            "url": "https://www.msn.com/en-us/money/realestate/insane-global-ranking-that-says-it-all-about-buying-a-home-in-australia/ar-AA1EYN6c",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Sydney, Melbourne, Brisbane, Adelaide, and Perth are among the most unaffordable places in the world to buy a home according to the 2025 Demographia International Housing Affordability report. The report compares median house prices with median household incomes across 95 major housing markets in Australia, New Zealand, UK, the US, Canada, China, Ireland and Singapore."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Scientists reveal accelerating decline in global forest recovery after major wildfires",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250518/70198f6afc2e4ab9bf771d21993d41c0/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Less than one-third of affected forests can regenerate within seven years after a large-scale wildfire in the 21st century. After 2010, the median severity of large wildfires surged by 42.9 percent in arid regions and 54.3 percent in boreal zones. North America's western regions, northern-central Siberia and southeastern Australia are hardest hit."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "UT climate change action plan gets Centre's nod",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/05/18/UT_climate_change_action_plan_gets_Centre_s_nod",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The ministry of environment and climate change has given an in-principle nod to the Chandigarh State Action Plan for Climate Change 2.0 (SAPCC2.0). SAPCC 2. 0 outlines two major strategies — adaptation and mitigation."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Australia Set To Miss Energy Transition Targets",
            "author": "Oil Price",
            "url": "https://article.wn.com/view/2025/05/18/Australia_Set_To_Miss_Energy_Transition_Targets",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Australia has ambitious targets of shifting from hydrocarbons to wind and solar energy. It is set to miss those targets due to challenges that are difficult to overcome, according to the report. The report was published by the World Resources Institute (WRI) on Monday."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "UN Chief rejects forced displacement of Gaza residents",
            "author": "Times",
            "url": "https://article.wn.com/view/2025/05/18/UN_Chief_rejects_forced_displacement_of_Gaza_residents",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres expresses concern over reports of Israel's intention to expand its ground at the United Nations.       in New York, Secretary-General of the U.N. is concerned about Israel's plans to expand the ground."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Norfolk records highest sea-level rise on East Coast",
            "author": "Calhoun Times",
            "url": "https://article.wn.com/view/2025/05/18/Norfolk_records_highest_sealevel_rise_on_East_Coast",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Norfolk is near the top of the list for sea-level rise report cards from William & Mary's Batten School and the Virginia Institute of Marine Science.       .   \"Report cards\" for sea level rise are released every year."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Poor resource management to blame for drought in Nigeria, not 'climate change'",
            "author": "Natural News",
            "url": "https://article.wn.com/view/2025/05/18/Poor_resource_management_to_blame_for_drought_in_Nigeria_not",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "AfricaNews and the Associated Press deny that climate change is the primary cause of Nigeria's water shortages. They argue instead that it's a result of natural disasters.    Africa News and Associated Press are wrong in their claims.  \"Climate change is not the cause of water shortages in Nigeria.\""
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Insane global ranking that says it all about buying a home in Australia",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/05/18/Insane_global_ranking_that_says_it_all_about_buying_a_home_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sydney, Melbourne, Brisbane, Adelaide, and Perth are in the top 15 most unaffordable places to buy a home in the world according to the 2025 Demographia International Housing Affordability report. Sydney is among the most expensive locations in Australia."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Hello, pollen. Allergy season is in full swing -- and it's getting stronger",
            "author": "Times Reporter",
            "url": "https://article.wn.com/view/2025/05/18/Hello_pollen_Allergy_season_is_in_full_swing_and_its_getting_2",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Allergies are getting worse each year because of climate change. The pollen season is getting longer and more intense because of the warming temperatures.       .   \"Allergists are not crazy\"   and \"climate change is not to blame\". "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "The Hottest Year Ever? Not Even Close",
            "author": "Principia Scientific",
            "url": "https://article.wn.com/view/2025/05/18/The_Hottest_Year_Ever_Not_Even_Close",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "2024 was the hottest year ever, according to the National Geographic magazine and all the major media outlets. It was warmer than usual, according the magazine, and it was the warmest year on record, too. It's been happening for a long time. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "11m people facing acute food insecurity in Pakistan: FAO",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/05/18/11m_people_facing_acute_food_insecurity_in_Pakistan_FAO",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Malnutrition affected 2.1 million children in 10 months in Pakistan. 11 million people are at risk of food insecurity between November 2024 and March 2025, according to the '2025' report. Climate shocks may further aggravate already high malnutrition levels this year."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Climate change is already affecting Ohioans. Here's what comes next and what can be done",
            "author": "The Columbus Dispatch",
            "url": "https://article.wn.com/view/2025/05/18/Climate_change_is_already_affecting_Ohioans_Heres_what_comes",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Kate Hodges, a central Ohio farmer, is optimistic about the future of her industry. Experts predict increased temperatures and more precipitation in the future as a result of climate change in the state. Kate Hodges stays hopeful.       . "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "My advice to the new Green party leader? It's time to expose the climate deniers ...",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/05/18/My_advice_to_the_new_Green_party_leader_Its_time_to_expose_t",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Carla Denyer is co-leader of the Green party of England and Wales and MP for Bristol Central. She asks herself how can I make the biggest positive impact on the environment?    She believes that real solutions to climate change can be found within the Green Party."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Florida Map Shows Cities Where Sea Level Rise Is Accelerating",
            "author": "Newsweek",
            "url": "https://article.wn.com/view/2025/05/18/Florida_Map_Shows_Cities_Where_Sea_Level_Rise_Is_Acceleratin",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Florida's largest cities are facing rising sea levels along the Gulf and the East Coast, according to new data from the U.S. Geological Survey. The data is based on sea level rise along Florida's Gulf Coast and East Coast.   . "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "How Cyprus' climate has changed down the centuries",
            "author": "Cyprus Mail",
            "url": "https://article.wn.com/view/2025/05/18/How_Cyprus_climate_has_changed_down_the_centuries",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The fifth month of 2025 is nearing its end. Cyprus has already faced its first wildfire, several heatwaves and water levels have dropped to just 26%. Cyprus' president is deeply concerned about the health risks climate change poses to the country. Historical climate patterns could offer a way to combat climate change."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "A federal program insures farmers during hurricanes. Climate change is driving up its cost",
            "author": "Sun Sentinel",
            "url": "https://article.wn.com/view/2025/05/18/A_federal_program_insures_farmers_during_hurricanes_Climate_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ernest Fulford is hoping for a hurricane to save his 1,600 acres of peanuts and cotton bolls from flooding last fall. He wants a crop insurance payout, because the crop insurance program is not helping farmers adapt to extreme weather from climate change."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "When even Piers Morgan condemns Netanyahu's 'shameful' war, Israel has a problem",
            "author": "Haaretz",
            "url": "https://article.wn.com/view/2025/05/18/when_even_piers_morgan_condemns_netanyahu_x27s_x27shameful_x",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The British commentator's reversal from fierce defender to vocal critic signals a deeper crisis for Israel. Netanyahu's 'forever war' in Gaza is alienating his supporters around the world.    .   in Gaza.  in Israel. in the Gaza. in this context."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Commentary: The unconscionable assault on climate research must stop",
            "author": "Richard Wildermann",
            "url": "https://www.postandcourier.com/opinion/commentary/trump-administration-cuts-climate-research-noaa/article_848bce15-ae48-4af7-9395-99689e9e82de.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/5/9c/59c253a7-2f00-42f1-be39-f505e527d3e5/610d8a872dc40.image.jpg?crop=1241%2C652%2C0%2C426&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Richard Wildermannis is a Seabro Island resident and a climate activist. He says the Trump administration's attack on science has taken particular aim at climate research by federal agencies. NOAA's regional climate centers provide scientists, state officials and farmers with climate data and services. The S.C. Sea Grant Consortium relies on federal funding that is currently threatened."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bhopal climate plan begins with voices from its hottest homes",
            "author": "Bhopal",
            "url": "http://www.dailypioneer.com/2025/state-editions/bhopal-climate-plan-begins-with-voices-from-its-hottest-homes.html",
            "url_media": "https://www.dailypioneer.com/images/logo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The first phase of a 10-day Extreme Climate Workshop at the Maulana Azad National Institute of Technology in Bhopal concluded on Saturday. The workshop aims to prepare a location-specific Climate Action Plan for the city this winter. The second phase will assess flood risks. The third phase will consolidate findings into a comprehensive city plan focused on resilience and equity."
        }
    ]
}