{
    "status": "ok",
    "total_articles": 131,
    "articles": [
        {
            "published_date": "2025-10-03T22:43:38",
            "title": "Study shows world is more ablaze now with damaging fires than in 1980s",
            "author": "",
            "url": "https://borneobulletin.com.bn/study-shows-world-is-more-ablaze-now-with-damaging-fires-than-in-1980s",
            "url_media": "https://borneobulletin.com.bn/wp-content/uploads/2025/10/PAGE-14-A_04102025.jpg",
            "country": "BN",
            "language": "en",
            "summary": "Earth's nastiest and costliest wildfires are blazing four times more often now than in the 1980s because of human-caused climate change and people moving closer to wildlands. Europe and North America lead in the number of these economically damaging fires, especially in the Mediterranean around Greece, Italy, Spain and Portugal and the Western United States around California."
        },
        {
            "published_date": "2025-10-03T22:03:00",
            "title": "Trump isn't just retreating from the world — here's how he's helping to end it",
            "author": "Raw Story",
            "url": "https://article.wn.com/view/2025/10/03/Trump_isnt_just_retreating_from_the_world_heres_how_hes_help",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The world is falling apart. The planet is emitting 200 billion more tons of carbon dioxide-equivalent greenhouse gases every year. This is the slow-motion equivalent of atomic weapons going. The world's imperial powers are rising and falling, but nothing is truly normal about it anymore."
        },
        {
            "published_date": "2025-10-03T22:00:20",
            "title": "Pakistan's poly-crisis: A nation at crossroads of survival & renewal",
            "author": "News Desk",
            "url": "https://pakobserver.net/pakistans-poly-crisis-a-nation-at-crossroads-of-survival-renewal",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/10/Lt-Gen-Omar-Mahmood-Hayat.jpg",
            "country": "PK",
            "language": "en",
            "summary": "In the last five years, Pakistan has been hit by economic, environmental, political and epidemiological crises. Food inflation reached 47.15% in March 2023, while the cost of living more than doubled. The 2022 floods displaced 8 million people and affected 30 million, submerging entire districts in Sindh and Balochistan. Militant violence resurged in Khyber-Pakhtunkhwa and Baluchistan. Border tensions with Afghanistan led to mass deportations of refugees. Political polarization deepened mistrust in institutions. Journalists faced harassment, enforced disappearances and even death. Religious minorities were scapegoated under blasphemy laws."
        },
        {
            "published_date": "2025-10-03T21:54:00",
            "title": "Fall bird migration is in full swing",
            "author": "Justin Bradford",
            "url": "https://www.wilx.com:443/2025/10/03/fall-bird-migration-is-full-swing",
            "url_media": "https://gray-wilx-prod.gtv-cdn.com/resizer/v2/6UNIPZWPONAK7KKTA3UMLX23EQ.jpg?auth=1cd5a6488b9cabb51808e484106f9a21c5f5d98f8646e8e899e1513f60f2c5ec&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Early October is the peak of annual bird migrations in Michigan. The main factor for the birds is the day length. The migration is a key spreader of disease, including the avian or bird flu. Turning off the lights at night can help the birds navigate more safely."
        },
        {
            "published_date": "2025-10-03T21:30:06",
            "title": "A grief that never ends for Middle Eastern Australians",
            "author": "Grace Crivellaro",
            "url": "https://www.canberratimes.com.au/story/9081162/a-grief-that-never-ends-for-middle-eastern-australians",
            "url_media": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/82b2f7ca-efa5-455b-9d5e-2b4185c3b578.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "\"The demolitions and expansions of the illegal settlements that have been carried on, especially over the last two years, is beyond our imagination,\" says the executive member of the Australian Palestine Advocacy Network. \"It's beyond our imaginations. It's beyond us imagination.\""
        },
        {
            "published_date": "2025-10-03T21:12:48",
            "title": "Cyclone Shakti, season's 1st over Arabian Sea",
            "author": "India Times",
            "url": "https://www.onenewspage.com/n/India/1zs7vmguft/Cyclone-Shakti-season-1st-over-Arabian-Sea.htm",
            "url_media": "https://cdn.newsserve.net/en/knowledge/Arabian-Sea_20190305.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Cyclone Shakti has intensified in the Arabian Sea, currently west-southwest of Gujarat. It will strengthen into a severe cyclonic storm, but it is not expected to significantly impact the Indian landmass. Fishermen are advised to avoid venturing into the sea."
        },
        {
            "published_date": "2025-10-03T21:00:00",
            "title": "Net-Zero Banking Alliance to Stop Operations After Member Exodus",
            "author": "Eric Worrall",
            "url": "https://wattsupwiththat.com/2025/10/03/net-zero-banking-alliance-to-stop-operations-after-member-exodus",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/10/Net-Zero-Banking-Alliance.webp?fit=1200%2C600&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Global banking climate group to stop operations after member exodus. Several major banks, including HSBC and Barclays left the group within the last year. NZBA will cease operations immediately. The climate resources created during the organisation's short life will still be available for banks which want to use them."
        },
        {
            "published_date": "2025-10-03T20:52:40",
            "title": "This week in science: Fly migration, a surprise in the Amazon and fish noises",
            "author": "",
            "url": "https://www.aspenpublicradio.org/2025-10-03/this-week-in-science-fly-migration-a-surprise-in-the-amazon-and-fish-noises",
            "url_media": "https://www.aspenpublicradio.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "Hosts of NPR's science podcast discuss new findings about long-distance fly migration, the unexpected impact of emissions in the Amazon and fish noises on Aspen Public Radio's science show. On air now playing is \"On Air Now Playing\" by 2025 NPR."
        },
        {
            "published_date": "2025-10-03T20:33:28",
            "title": "North Carolina Homeowners Pay Some of the Lowest Insurance Costs In The Country, But Hike Is In The Works",
            "author": "The Realtor.com Team",
            "url": "https://www.sfgate.com/realestate/article/north-carolina-homeowners-pay-some-of-the-lowest-21076186.php",
            "url_media": "https://s.hdnux.com/photos/01/54/54/50/28494384/3/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "North Carolina homeowners pay some of the lowest average insurance premiums in the Southeast. The state has significant coastal exposure to hurricanes and flooding. North Carolina homeowners will see a 15% increase in insurance rates spread over two years due to a settlement between Insurance Commissioner Mike Causey and insurance companies."
        },
        {
            "published_date": "2025-10-03T19:55:35",
            "title": "Our Sea Levels Are Rising Fast, And A New Paper Confirms We've Been Aware For Three Decades",
            "author": "Kyra Piperides",
            "url": "https://twistedsifter.com/2025/10/our-sea-levels-are-rising-fast-and-a-new-paper-confirms-weve-been-aware-for-three-decades",
            "url_media": "https://twistedsifter.com/wp-content/uploads/2025/02/Seabed.jpg",
            "country": "US",
            "language": "en",
            "summary": "In the last 30 years, global sea levels have risen by 9 cm and the rate of sea level rise has doubled. Back in the 1990s, the Intergovernmental Panel on Climate Change predicted that sea levels would rise by around 8 cm in the coming 30 years. New research confirms the accuracy of the predictions."
        },
        {
            "published_date": "2025-10-03T19:37:06",
            "title": "They moved to escape climate disaster. It might happen again.",
            "author": "Terry L. Jones",
            "url": "https://soilerosion.einnews.com/article_detail/855034069/NOG3nZLLHZGHpola",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/times-georgian.com/content/tncms/assets/v3/editorial/2/4a/24a6be87-921e-54d9-893c-83f30b880cc9/68e0246e47a47.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "UA",
            "language": "en",
            "summary": "Isle de Jean Charles in Terrebonne Parish, Louisiana received $48.3 million in federal Community Development Block Grant money to relocate 37 people. Chris Brunet and his family had lived on the island for five generations. The island used to be 22,000 acres but has shrunk to about 320 acres due to erosion, land loss caused by severe storms, manmade canals and sea level rise spurred by climate change. Brunet's family moved to a new community in Gray, 9 miles north of Houma, 40 miles away."
        },
        {
            "published_date": "2025-10-03T19:06:10",
            "title": "In the Arctic, the U.S. Shifts Focus From Climate Research to Security",
            "author": "",
            "url": "https://dnyuz.com/2025/10/03/in-the-arctic-the-u-s-shifts-focus-from-climate-research-to-security",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/10/In-the-Arctic-the-US-Shifts-Focus-From-Climate-Research.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration is focusing Arctic research efforts on military and defense interests. The Arctic Research Commission released a report that emphasized military, community, economic and energy security. The consortium that coordinated Arctic research among an international network of scientists was closed down on Sept. 30 because of budget cuts."
        },
        {
            "published_date": "2025-10-03T18:52:42",
            "title": "In the Arctic, the U.S. Shifts Focus From Climate Research to Security",
            "author": "Sachi Kitajima Mulkey",
            "url": "https://www.nytimes.com/2025/10/03/climate/arctic-research-security.html",
            "url_media": "https://static01.nyt.com/images/2025/10/02/science/00cli-ARCTIC-PRIORITIES/00cli-ARCTIC-PRIORITIES-facebookJumbo.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Arctic is warming nearly four times faster than the rest of the planet. President Trump has shown interest in the Arctic region since his first months in office. He has said the U.S. would go 'as far as we have to go' to control Greenland and has announced intentions to order new icebreaker ships."
        },
        {
            "published_date": "2025-10-03T18:40:00",
            "title": "Deep depression intensifies into Cyclone 'Shakhti': PMD",
            "author": "Web Desk",
            "url": "https://www.thenews.com.pk/latest/1348354-deep-depression-intensifies-into-cyclone-shakhti-pmd",
            "url_media": "https://www.thenews.com.pk/assets/uploads/updates/2025-10-03/1348354_092117_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "A weather system over the northeast Arabian Sea has strengthened into cyclonic storm Shakhti. The cyclone is intensifying and will move west-northwest over the next 12 hours. It will change direction to the west and southwest after 24 hours and fishermen are advised not to venture into the deep sea for the next 24 hours. A westerly wavy is affecting the upper parts of the country and is likely to intensify on Saturday evening."
        },
        {
            "published_date": "2025-10-03T18:30:25",
            "title": "Antarctica Experiences Climate Change Impact Comparable to Greenland, New Study Finds",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/antarctica-experiences-climate-change-impact-comparable-to-greenland-new-study-finds",
            "url_media": "https://www.archyde.com/wp-content/uploads/2025/05/archydegemini.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Antarctica and Greenland are experiencing climate change impacts similar to each other. The University of Bristol study used 25 years of satellite data to assess ice sheet mass balance in both regions. The study highlights the vulnerability of both polar ice sheets and the urgent need for revised climate models. The combined ice loss from Antarctica and Greenland is a major contributor to global sea level rise."
        },
        {
            "published_date": "2025-10-03T18:30:00",
            "title": "September the hottest on record for Red Deer",
            "author": "PAUL COWLEY ADVOCATE STAFF",
            "url": "https://reddeeradvocate.com/2025/10/03/september-the-hottest-on-record-for-red-deer",
            "url_media": "https://reddeeradvocate.com/wp-content/uploads/sites/3/2025/10/40523423_web1_20251003-rda-sept-weather-weather_1.jpg",
            "country": "CA",
            "language": "en",
            "summary": "It was the warmest September on record in Red Deer, the driest in 113 years and the third driest since 1885 in Calgary. An upper ridge of high pressure that built across western Canada allowed warm air to flow from the U.S. plains into Western Canada and it held steady for weeks."
        },
        {
            "published_date": "2025-10-03T18:25:18",
            "title": "Eastern coast sinking faster as sea level rises",
            "author": "Wasim Bin Habib",
            "url": "https://www.thedailystar.net/news/bangladesh/news/eastern-coast-sinking-faster-sea-level-rises-4001051",
            "url_media": "https://tds-images.thedailystar.net/sites/default/files/styles/social_share/public/media/api_images/2025/10/04/Sea%20level%20rise.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Bangladesh's eastern coast is sinking faster than the central and western coasts due to rising sea levels. The study found that the gap between high and low tides is increasing in the east, raising the risk of flooding and erosion. The country's coastal zone sits just 1-1.5 metres above the sea level."
        },
        {
            "published_date": "2025-10-03T18:00:00",
            "title": "The race for small island states to stay afloat",
            "author": "",
            "url": "https://www.starsinsider.com/Lifestyle/795497/the-race-for-small-island-states-to-stay-afloat",
            "url_media": "https://media-manager.starsinsider.com/960/na_67d464851d15d.webp",
            "country": "US",
            "language": "en",
            "summary": "Islands are at greater risk of damage as a result of extreme weather due to climate change. The governments of the island states most at risk have adopted a number of different measures to protect their countries' land and population. Check out the gallery to find out more."
        },
        {
            "published_date": "2025-10-03T17:30:33",
            "title": "Why you'll find Andrew atop a clock tower on Sunday",
            "author": "Rachel Jackson",
            "url": "https://www.newcastleherald.com.au/story/9081142/why-youll-find-andrew-atop-a-clock-tower-on-sunday",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/01e6fc93-b09d-467b-a7dd-de2412f3f509.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Daylight savings begins on Sunday at 2am in NSW, Victoria, South Australia, ACT, the ACT and Tasmania. Horologist Andrew Markerink will be at the top of Sydney's Town Hall at 2 am on Sunday, manually turning the clock's hands forward by an hour. He is part of a team that works across Sydney, manually shifting major clocks forward until midafternoon. His favourite clock to shift for daylight saving is at Sydney's Hyde Barracks."
        },
        {
            "published_date": "2025-10-03T17:21:59",
            "title": "Flood Risk Looms Over 125 Villages In Srikakulam",
            "author": "Dc Correspondent",
            "url": "https://www.deccanchronicle.com/southern-states/andhra-pradesh/flood-risk-looms-over-125-villages-in-srikakulam-1907793",
            "url_media": "https://www.deccanchronicle.com/h-upload/2025/10/03/1964167-3kmk11.jpg",
            "country": "IN",
            "language": "en",
            "summary": "There are 125 villages in Visakhapatnam district at risk from rising floodwaters. Flood discharge reports from Srikakulam district have flagged 53 villages at the highest alert level. District collector Swapnil Dinkar Pundkar urged officials to prioritise flood mitigation infrastructure and early warning systems in the most vulnerable mandals."
        },
        {
            "published_date": "2025-10-03T17:21:11",
            "title": "Antarctica sees similar climate change effects as Greenland: Study",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/10/03/Antarctica_sees_similar_climate_change_effects_as_Greenland_",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": " the planet's warming climate is having effects in Antarctica that are getting worse.   increasingly.  warming climate is getting worse in Antarctica. It's getting colder there. The world is getting warmer. It is getting colder in Antarctica, too."
        },
        {
            "published_date": "2025-10-03T17:21:00",
            "title": "Millions of buildings at risk from sea level rise, analysis finds",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/10/03/Millions_of_buildings_at_risk_from_sea_level_rise_analysis_f",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sea level rise could put more than 100 million buildings at risk across the Global South due to sea level rise, according to the UN.   Â. Â   in the global south, especially in the coastal areas. In the past, sea levels have risen by less than 1mm per century."
        },
        {
            "published_date": "2025-10-03T17:15:19",
            "title": "America's First Attempt to Tackle Climate Relocation Sparks Regret",
            "author": "Terry Jones",
            "url": "https://www.motherjones.com/politics/2025/10/americas-first-attempt-to-tackle-climate-relocation-sparks-regret",
            "url_media": "https://www.motherjones.com/wp-content/uploads/2025/10/062525_Basinger_Louisiana_123.jpeg?w=1200&h=630&crop=1",
            "country": "US",
            "language": "en",
            "summary": "Isle de Jean Charles, Louisiana received $48.3 million in federal Community Development Block Grant money to relocate 37 people to a new community in Gray, 40 miles north of Houma. Island used to be home to Biloxi-Chitimacha-Choctaw Indians since the 1830s, but it's now a shell of its former self due to erosion, land loss, severe storms, manmade canals and sea level rise caused by climate change. Chris Brunet's family had lived on the island for five generations, but they had to leave because the Gulf of Mexico's swelling waters were consuming it. The new community is substandard, with rainwater se"
        },
        {
            "published_date": "2025-10-03T16:52:40",
            "title": "This week in science: Fly migration, a surprise in the Amazon and fish noises",
            "author": "",
            "url": "https://www.hppr.org/2025-10-03/this-week-in-science-fly-migration-a-surprise-in-the-amazon-and-fish-noises",
            "url_media": "https://www.hppr.org/apple-touch-icon.png",
            "country": "US",
            "language": "en",
            "summary": "The hosts of NPR's science podcast discuss new findings about long-distance fly migration, an unexpected impact of emissions in the Amazon, and fish noises. On Air Now Playing HPPR Mix and HPPR Connect are playing now.  Copyright 2025 NPR Facebook, Twitter and LinkedIn."
        },
        {
            "published_date": "2025-10-03T16:30:00",
            "title": "Over a Billion Birds Migrate to Yucatán in Fall 2025",
            "author": "Yucatan Times",
            "url": "https://theyucatantimes.com/2025/10/over-a-billion-birds-migrate-to-yucatan-in-fall-2025",
            "url_media": "https://theyucatantimes.com/wp-content/uploads/2021/03/4-Raised-epaulet-of-male-Red-winged-Blackbird.jpg",
            "country": "MX",
            "language": "en",
            "summary": "The peak of the migration occurred on September 25, 2025. Painted Bunting, Indigo Bunting and Blue Grosbeak are among the species arriving in Yucatán. Conservationists urge U.S. residents to turn off non-essential lights and apply window decals to prevent fatal collisions."
        },
        {
            "published_date": "2025-10-03T16:27:09",
            "title": "WFP:Millions of people in Somalia face worsening hunger",
            "author": "nasibeh yazdani",
            "url": "https://en.shafaqna.com/425435/wfpmillions-of-people-in-somalia-face-worsening-hunger",
            "url_media": "https://en.shafaqna.com/wp-content/uploads/2022/02/cropped-new-logo-s-en-fine-1-32x32.png",
            "country": "AU",
            "language": "en",
            "summary": "Millions of people in Somalia face worsening hunger, the World Food Programme warned on Friday. In November, 750,000 people will be cut off from the WFP emergency food program. Somalia is among the most vulnerable to climate change and has experienced both the worst drought in four decades and once-in-a-century flooding over the last five years."
        },
        {
            "published_date": "2025-10-03T16:20:08",
            "title": "B.C. launching deer hunt near Cranbrook to control spread of wasting disease",
            "author": "The Canadian Press",
            "url": "https://www.thestar.com/news/canada/british-columbia/b-c-launching-deer-hunt-near-cranbrook-to-control-spread-of-wasting-disease/article_6849f33e-783f-5cac-8240-77f6fa11903f.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/e/91/e912858e-a160-5a07-8a2a-6cf3c83fa6b4/67dc868f3fbb0.image.jpg?crop=1622%2C852%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Deer walk near the Granby River in Grand Forks, B.C., on May 16, 2018. GAC flag wire is true, flag sponsored is false, and first author's avatar is false first authoravatar is not the author. "
        },
        {
            "published_date": "2025-10-03T16:15:00",
            "title": "Audio Clips of Sounds of Climate Changes",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/10/03/Audio_Clips_of_Sounds_of_Climate_Changes",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "For the Climate Forward live event, we gathered recordings of a melting glacier, the Amazon jungle and the underwater Arctic. The soundscapes are rapidly changing and are recorded for the live event. The event will take place at 7.30 pm on Saturday at the Climate Center."
        },
        {
            "published_date": "2025-10-03T16:04:22",
            "title": "October hurricane risk intensifies for Jalisco and Nayarit",
            "author": "Ian Hayden Parker",
            "url": "https://www.vallartadaily.com/puerto-vallarta-news/october-hurricanes-puerto-vallarta",
            "url_media": "https://www.vallartadaily.com/wp-content/uploads/2025/10/october-hurricanes-puerto-vallarta.jpg",
            "country": "MX",
            "language": "en",
            "summary": "October hurricane risk climbs along Mexico's central Pacific coast. Steering winds shift and cold fronts arrive, raising the chance that late-season storms track closer to the coast this month. The risk of tropical cyclones is higher in the central Pacific Ocean.  "
        },
        {
            "published_date": "2025-10-03T16:03:00",
            "title": "International Conference in Baku addresses future of Caspian Sea amid climate challenges",
            "author": "Nazrin Abdul",
            "url": "https://today.az/news/society/262469.html",
            "url_media": "http://www.today.az/pictures/pic262469.jpg",
            "country": "AZ",
            "language": "en",
            "summary": "On October 2-3, an international conference titled 'A Turning Point for the Caspian Sea: From COP29 and UNOC 2025 Outcomes to COP30 Action' was held at the Baku Congress Center. It was organized by the IDEA Public Union and Caspisnet scientific network. It brought together experts from more than 10 countries, specializing in marine ecology, sustainable aquaculture, hydrology, geographic information systems, and other relevant fields. The aim was to exchange knowledge on sea level fluctuations and marine biodiversity conservation."
        },
        {
            "published_date": "2025-10-03T15:36:09",
            "title": "Flood alerts issued in Cumbria as Storm Amy arrives",
            "author": "Matthew Graham",
            "url": "https://www.newsandstar.co.uk/news/25516255.flood-alerts-issued-cumbria-storm-amy-arrives",
            "url_media": "https://www.newsandstar.co.uk/resources/images/20035038.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Two flood alerts are in place for the county due to persistent overnight rainfall. Rivers Duddon, Crake and Mill Beck are most at risk of flooding. Rivers Ehen, Calder, Irt and Esk are also at risk. Environment Agency has warned that further heavy rainfall and strong winds are forecast over the weekend."
        },
        {
            "published_date": "2025-10-03T15:29:04",
            "title": "LETTER: Jane Goodall's Message of Reverence for Life",
            "author": "Pagosa Daily Post",
            "url": "https://article.wn.com/view/2025/10/03/letter_jane_goodall_8217s_message_of_reverence_for_life",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Jane Goodall has passed away at age 91. She was a United Nations Messenger of Peace. She urged people to share the planet, because species are disappearing and ecosystems are collapsing, which is going to affect us. She said: 'Ecosystems are collapsing. "
        },
        {
            "published_date": "2025-10-03T15:17:07",
            "title": "Listen to the Sounds of Climate Change",
            "author": "",
            "url": "https://dnyuz.com/2025/10/03/listen-to-the-sounds-of-climate-change",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/10/Listen-to-the-Sounds-of-Climate-Change.jpg",
            "country": "US",
            "language": "en",
            "summary": "Sounds of Climate Change is an audio installation that offers a sonic tour of the underwater Arctic, a melting glacier and the Amazon rainforest. As the planet warms, the natural soundscape is shifting in surprising ways. The locations of many of the sounds you'll hear in the soundscape are now gone."
        },
        {
            "published_date": "2025-10-03T15:14:01",
            "title": "Balkans hit by heavy early snow sparking fears of floods and mudslides",
            "author": "Ap Correspondent",
            "url": "https://www.independent.co.uk/bulletin/news/balkans-snow-serbia-bosnia-weather-b2838900.html",
            "url_media": "https://static.independent.co.uk/2025/10/03/15/19/Bosnia-Weather-5tha20x4.jpeg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Heavy snowfall has caused widespread disruption across the Western Balkans, particularly in Serbia and Bosnia. Thousands of residents have been left without electricity due to fallen power lines and trees, and some areas have lost drinking water and phone connections. Meteorologists say the snowfall could reach record levels for October."
        },
        {
            "published_date": "2025-10-03T15:02:24",
            "title": "8 homes collapse in North Carolina's Outer Banks. How much shoreline has vanished?",
            "author": "Brandi D. Addison",
            "url": "https://www.starnewsonline.com/story/weather/2025/10/03/outer-banks-coastal-erosion-hurricane-tropical-storm/86433936007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/09/30/USAT/86447633007-outer-banks-collapse.jpg?auto=webp&crop=1918,1078,x0,y0&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Eight homes collapsed in North Carolina's Outer Banks this week due to Hurricane Imelda. The Outer Banks have lost 675 feet of shoreline since 1987. Rodanthe is losing more than 15 feet of coast per year. Outer Banks are narrow barrier islands made almost entirely of sand, which shifts easily under waves, storm surge and strong rip currents."
        },
        {
            "published_date": "2025-10-03T14:48:00",
            "title": "How climate affects population health outcomes",
            "author": "WILLIAM WANYOIKE",
            "url": "https://www.the-star.co.ke/news/infographics/2025-10-03-how-climate-affects-population-health-outcomes",
            "url_media": "https://cdn.radioafrica.digital/image/2025/10/625f0b2a-3a92-44dd-83c9-ea63fdea746f.jpg?1759504026192",
            "country": "KE",
            "language": "en",
            "summary": "According to the World Economic Forum, the intersection of climate risk factors and social vulnerabilities is expected to worsen ten major health outcomes. Extreme weather events, rising temperatures, air pollution, water scarcity, ecosystem decline, and sea level rise are among the leading climate stressors. Without urgent adaptation and mitigation, climate change will erode health gains and strain healthcare systems."
        },
        {
            "published_date": "2025-10-03T14:19:28",
            "title": "New Study Shows Arctic Sea Ice Decline Slowing, Driven More by Natural Variability Than Emissions",
            "author": "Kenneth Richard",
            "url": "https://climatechangedispatch.com/arctic-sea-ice-decline-study",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/10/arctic-sunset.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a sharply declining trend in Arctic sea ice from the mid-1990s to the 2010s (-11.3% per decade), as well as a flat trend since 2012 (-0.4%. The authors of Nature Communications suggest the trend or 'slowdown' in sea ice decline will likely persist for the next 10 to 15 years. Alarmist predictions of an ice-free Arctic will have to be put on hold until after the 2030s."
        },
        {
            "published_date": "2025-10-03T14:12:43",
            "title": "Dhauladhar Snowfall Brings Relief After Kangra Flood Damage",
            "author": "Naveen",
            "url": "https://www.newkerala.com/news/o/himachal-pradesh-dhauladhar-mountain-range-receives-snowfall-temperature-dips-622",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "After the change in the climatic conditions, the temperature took a dip near Dharamshala. The Kangra district was recently impacted by severe rainfall between June 20 and September 15, 2025, claiming 55 lives. The total estimated loss recorded during this period stands at Rs. 60,310.225 lakh (Rs. 603 crore). 215 livestock deaths were reported. The Public Works Department (PWD) reported the highest damage at Rs 29,808 lakh."
        },
        {
            "published_date": "2025-10-03T14:07:59",
            "title": "7 of the world's most endangered species on the verge of extinction",
            "author": "Indian Express",
            "url": "https://article.wn.com/view/2025/10/03/7_of_the_world_8217s_most_endangered_species_on_the_verge_of",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Rising global temperatures and deforestation are pushing for a change in global warming.    Rise in global temperature and deforestation is the main cause of climate change, according to the UNFCCC's report. It's a result of deforestation and rising global temperatures."
        },
        {
            "published_date": "2025-10-03T14:07:10",
            "title": "When Does Daylight Saving Time Start in Australia and How to Adjust Your Clocks",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/when-does-daylight-saving-time-start-in-australia-and-how-to-adjust-your-clocks",
            "url_media": "https://images.sbs.com.au/17/f1/69c54962438baaab41e1273427b7/daylight-savings-gfx-2-1.png?imwidth=1280",
            "country": "NG",
            "language": "en",
            "summary": "On Sunday 5 October at 2 am, clocks will roll forward one hour to 3 am and Australians will lose an hour of sleep. Queensland, Western Australia and the Northern Territory do not observe daylight saving time. The Sleep Health Foundation recommends adjusting your bedtime for three to four nights before the transition."
        },
        {
            "published_date": "2025-10-03T14:07:05",
            "title": "WFP forced to slash food rations in Haiti amid funding shortfalls",
            "author": "Cnw Reporter",
            "url": "https://www.caribbeannationalweekly.com/news/wfp-forced-to-slash-food-rations-in-haiti-amid-funding-shortfalls",
            "url_media": "https://www.caribbeannationalweekly.com/wp-content/uploads/2025/08/image1170x530cropped-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Gang violence in Haiti's capital is crippling humanitarian access and worsening hunger. The World Food Programme has had to cut rations in half and suspend hot meal services for newly displaced families. It has also been unable to preposition food supplies ahead of the Atlantic hurricane season. Overall, 5.7 million Haitians are suffering acute food insecurity."
        },
        {
            "published_date": "2025-10-03T14:03:01",
            "title": "#HaveItBothWays: Saltiness of the North Atlantic",
            "author": "John Robson",
            "url": "https://johnrobson.substack.com/p/haveitbothways-saltiness-of-the-north",
            "url_media": "https://substackcdn.com/image/fetch/$s_!oml0!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4dc873c-ac4a-43c9-9b21-75699e29b634_6000x4000.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The AMOC, or Atlantic Multidecadal Overturning Circulation, is on the verge of shutting down due to global warming. The AMOC will throw the global climate into chaos, including plunging Europe into a deep freeze, according to some reports."
        },
        {
            "published_date": "2025-10-03T13:48:05",
            "title": "Group Of 500+ Scientists Issue An Urgent Warning About The Melting Ice In Antarctica",
            "author": "Michael Levanduski",
            "url": "https://twistedsifter.com/2025/10/group-of-500-scientists-issue-an-urgent-warning-about-the-melting-ice-in-antarctica",
            "url_media": "https://twistedsifter.com/wp-content/uploads/2025/09/Antarctica-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2024, a group of scientists held a summit in Australia to talk about the impact of climate change on Antarctica. The East Antarctic Ice Sheet alone holds enough water to raise global sea levels by approximately 50 meters (164 feet) if completely melted. The sea-level rise by this much would impact every coastal region of the world, displacing billions of people."
        },
        {
            "published_date": "2025-10-03T13:42:00",
            "title": "Pakistani floods damage onions, dates, and chilies",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9771438/pakistani-floods-damage-onions-dates-and-chilies",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0093.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "Nearly 2.5 million acres of crops were destroyed in Sindh, Punjab and Khyber Pakhtunkhwa due to floods. The worst-hit crops were vegetables, seasonal fruits and orchards. The average water depth in fields ranged between 1.5 and 3 meters, and agricultural damage was estimated at nearly US$2.1 billion. Provincial administrations are deploying machinery to drain fields and providing financial support, seeds, fertilizers, and tools to farmers."
        },
        {
            "published_date": "2025-10-03T13:42:00",
            "title": "Australia research links heat to higher labour on fruit farms",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9771457/australia-research-links-heat-to-higher-labour-on-fruit-farms",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0263.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "Rising temperatures will affect labour supply in horticulture, with a focus on productivity losses and adaptation strategies. In Victoria's Yarra Valley, strawberry pickers may need to work an extra 26 minutes per day, pushing labour costs up by nearly 5%. In Queensland's banana plantations, labour requirements could rise by 9%."
        },
        {
            "published_date": "2025-10-03T13:37:51",
            "title": "Hong Kong's green goals in jeopardy amid exposure to extreme weather",
            "author": "CNA",
            "url": "https://www.channelnewsasia.com/watch/hong-kongs-green-goals-in-jeopardy-amid-exposure-extreme-weather-5384026",
            "url_media": "https://dam.mediacorp.sg/image/upload/s--2f28aH_i--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2025/10/03/1759497732-image.jpg?itok=7T0bflsN",
            "country": "SG",
            "language": "en",
            "summary": "More intense weather could cause problems for Hong Kong's green goals. There are worries that the targets for its 2050 action plan may not be met. CNA's Senior Correspondent May Wong explains.      Â   in the video below."
        },
        {
            "published_date": "2025-10-03T13:33:34",
            "title": "Out There: Migratory Patterns",
            "author": "Brian Pj Cronin",
            "url": "https://highlandscurrent.org/2025/10/03/out-there-migratory-patterns",
            "url_media": "https://highlandscurrent.org/wp-content/uploads/2025/10/IMG_8129-copy.webp",
            "country": "US",
            "language": "en",
            "summary": "The fall migration of birds is exploding overhead every night, with thousands of birds passing through the Highlands in the safety of darkness. Last month was the 20th anniversary of Hurricane Katrina, which displaced 1.5 million people, about 40 percent of whom never returned. People are fleeing the U.S., driven by the housing and affordability crises since 2020."
        },
        {
            "published_date": "2025-10-03T13:28:59",
            "title": "News4 First Alert Weather Extra: Why are Outer Banks beach houses falling into the sea?",
            "author": "",
            "url": "https://www.wtvy.com:443/video/2025/10/03/news4-first-alert-weather-extra-why-are-outer-banks-beach-houses-falling-into-sea",
            "url_media": "https://gray-wtvy-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F10-03-2025%2Ft_c1d26a689f324bcaad5fe64895a83e66_name_file_1280x720_2000_v3_1_.jpg?auth=8536ce4cc2d5e76454b9c7bc9399c22039931998e7ffa73afa81544874364ed6&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "David and Ryan look into why high-rise beach houses in Buxton, NC, have been crumbling when the waters of the Atlantic turn rough.    \"The cause of the problem is water erosion in the high-rises.\"   'The solution is to build new ones' "
        },
        {
            "published_date": "2025-10-03T13:15:10",
            "title": "The rich must eat less meat",
            "author": "",
            "url": "https://dnyuz.com/2025/10/03/the-rich-must-eat-less-meat",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/10/The-rich-must-eat-less-meat.jpg",
            "country": "US",
            "language": "en",
            "summary": "The way we farm and eat will cause global temperatures to rise 1.5 degrees Celsius above preindustrial levels. People in wealthy countries should eat more plant-based foods and less red meat, poultry, and dairy. In poor regions, like Sub-Saharan Africa and South Asia, the commission recommends an increase in most animal products."
        },
        {
            "published_date": "2025-10-03T13:09:00",
            "title": "Wrinkles, Dullness, And Rashes: How Climate Change Shows Up Early On Your Skin",
            "author": "Snigdha Oreya",
            "url": "https://www.news18.com/lifestyle/wrinkles-dullness-and-rashes-how-climate-change-shows-up-early-on-your-skin-ws-el-9611927.html",
            "url_media": "https://images.news18.com/ibnlive/uploads/2025/10/image-2025-10-6feddb8917f4a441231f3bc9a1f49f36-16x9.jpg",
            "country": "IN",
            "language": "en",
            "summary": "People in their 20s are reporting conditions that were once common in their late 30s or 40s due to climate change. Dermatologists are noticing that the human face has become an early canvas where environmental stress manifests. The Anthropocene Glow is caused by overactive oil glands, barrier dysfunction, and heat-induced sweating."
        },
        {
            "published_date": "2025-10-03T13:05:53",
            "title": "U.N. food agency to suspend food aid for 750,000 people in Somalia",
            "author": "Rédaction Africanews",
            "url": "https://www.africanews.com/2025/10/03/un-food-agency-to-suspend-food-aid-for-750000-people-in-somalia",
            "url_media": "https://static.euronews.com/articles/stories/09/49/54/45/1024x538_cmsv2_3d823981-8425-5b1b-bf82-6230767a4442-9495445.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The U.N. food agency is cutting food assistance for hundreds of thousands of people in Somalia. The number of people receiving emergency food assistance in the country will decrease from 1.1 million in August to 350,000 in November due to 'critical funding shortfalls'. 4.6 million people are facing crisis levels of hunger and 1.8 million children are projected to suffer from acute malnutrition this year. The World Food Program needs $98 million to sustain a minimum of life-saving operations for 800,000 people through the lean season until March 2026."
        },
        {
            "published_date": "2025-10-03T12:54:00",
            "title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month",
            "author": "",
            "url": "https://ground.news/article/un-food-agency-to-suspend-food-aid-for-750-000-people-in-somalia-next-month",
            "url_media": "https://web-api-cdn.ground.news/api/v04/images/story/rss_20561_1759493791389_4/webMetaImg?v=1",
            "country": "US",
            "language": "en",
            "summary": "Millions of people in Somalia face worsening hunger as major cuts to donor aid leave the World Food Programme with a funding shortfall. The Horn of Africa nation is among the most vulnerable to climate change. In the last five years it has experienced both the worst drought in four decades and the worst floods in decades."
        },
        {
            "published_date": "2025-10-03T12:49:28",
            "title": "Pakistan Engineering Council begins work on flood action plans",
            "author": "Web Desk",
            "url": "https://tribune.com.pk/story/2570400/pakistan-engineering-council-begins-work-on-flood-action-plans",
            "url_media": "https://i.tribune.com.pk/media/images/untitled-design-81759490889-0/untitled-design-81759490889-0-640x480.webp",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan Engineering Council (PEC) organized a roundtable conference of experts. PEC has begun the process of preparing a 12-month short-term action plan and a medium-term strategy covering one to three years. The framework is expected to reduce flood impacts on communities, livelihoods, and basic facilities."
        },
        {
            "published_date": "2025-10-03T12:49:00",
            "title": "This one's for the birds. More than one 'flew over the state's nest'",
            "author": "ERIKA ZAMBELLO Audubon Florida",
            "url": "https://www.chronicleonline.com/weeklies/wakulla_news/this-ones-for-the-birds-more-than-one-flew-over-the-states-nest/article_59475a39-3cc8-5c12-826f-e1389e1f1e65.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/chronicleonline.com/content/tncms/assets/v3/editorial/3/36/336b46dd-4cdb-5e1d-97ef-3f96daf5a71e/68deb9024b811.image.jpg?crop=1566%2C823%2C0%2C61&resize=1200%2C631&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Millions of birds are making their bi-annual journeys from northern breeding grounds to their winter homes farther south. More than 30 million birds crossed the Sunshine State last night as they made their way south to spend the winter in warmer climates in warmer climes."
        },
        {
            "published_date": "2025-10-03T12:47:12",
            "title": "Watch: Is climate change driving people out of the Sunderbans?",
            "author": "Priyali Prakash",
            "url": "https://www.thehindu.com/videos/watch-is-climate-change-driving-people-out-of-the-sunderbans/article70121369.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/ty3i6h/article70121393.ece/alternates/LANDSCAPE_1200/Tipping%20point%20new%20.png",
            "country": "IN",
            "language": "en",
            "summary": "The Sundarbans is one of the worst-climate change hit regions of India. Many people have depended on the rivers and forests for generations. Now the same rivers are threatening the existence of the people of Sunderbans, forcing many to migrate. The rivers here are the lifeline of these islands."
        },
        {
            "published_date": "2025-10-03T12:36:03",
            "title": "Tips for a smooth transition to daylight saving, and losing a sleep",
            "author": "",
            "url": "https://www.thenewdaily.com.au/life/health/2025/10/03/daylight-saving-tips",
            "url_media": "https://wp.thenewdaily.com.au/wp-content/uploads/2019/04/1695880041-Daylight-Savings_Forward.gif?resize=1200%2C630",
            "country": "AU",
            "language": "en",
            "summary": "Daylight saving time begins this weekend. Clocks will move forward an hour on Sunday, October 5th at 2am AEST for people in New South Wales, Victoria, South Australia, Tasmania, the ACT and Norfolk Island. Flinders University research shows people struggle even when one hour is lost following the transition to daylight saving time."
        },
        {
            "published_date": "2025-10-03T12:34:55",
            "title": "Africa ready to lead on climate action, but calls for homegrown solutions: B Lab Africa",
            "author": "Independent online",
            "url": "https://article.wn.com/view/2025/10/03/Africa_ready_to_lead_on_climate_action_but_calls_for_homegro",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "The 4th Annual B Lab Africa Summit has heard that the continent is increasingly ready to take action to mitigate against climate change, provided solutions are African-led and tailored to local realities. Africa remains the continent hardest, but it's getting better. The solutions for Africa are with Africans."
        },
        {
            "published_date": "2025-10-03T12:30:00",
            "title": "AVA to celebrate World Migratory Bird Day with events",
            "author": "",
            "url": "https://www.iosconews.com/oscoda_press/outdoors/article_7f7b3c75-6d56-421a-b269-ee63fd33a3dc.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/iosconews.com/content/tncms/custom/image/6bf9ebe4-a1be-11ea-89dc-6f19ef485c5c.png?resize=600%2C279",
            "country": "US",
            "language": "en",
            "summary": "Ausable Valley Audubon is celebrating World Migratory Bird Day in Iosco County with three separate events on Saturday, Oct. 11. The first event will be at Tawas Point State Park at 8:30 a.m. for a guided bird walk to see migrating birds. There will be two presentations at the Tawos Point Senior Center at 11 and at Riverbank Park at 2:30 p.m., for an invasive species clean up."
        },
        {
            "published_date": "2025-10-03T12:18:31",
            "title": "Holistic global action needed to address climate-linked health threats",
            "author": "CO-EDP",
            "url": "https://www.devdiscourse.com/article/science-environment/3645834-holistic-global-action-needed-to-address-climate-linked-health-threats",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/29_09_2025_17_24_03_66023.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Researchers warn that climate change is increasing risks for both infectious and non-communicable diseases. Their systematic review, published in Climate, finds that climate-related hazards threaten human, animal, and environmental health in interconnected ways and calls for coordinated One Health responses. They highlight the urgent need for cross-sectoral policies, surveillance, and capacity building to prepare health systems for future climate pressures."
        },
        {
            "published_date": "2025-10-03T12:09:52",
            "title": "8 homes lost in the Outer Banks from churning waters caused by Hurricane Imelda",
            "author": "",
            "url": "https://abc7.com/post/hurricane-imelda-8-waterfront-homes-outer-banks-collapse/17924127",
            "url_media": "https://cdn.abcotvs.com/dip/images/17929093_house-obx-collapse-img.jpg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Hurricanes Imelda and humberto are still churning up waters and could threaten more structures over the next few days. Eight waterfront homes collapsed on the Outer Banks, but they were unoccupied. Beach nourishment and jetty repairs are scheduled for the area in 2026."
        },
        {
            "published_date": "2025-10-03T12:03:00",
            "title": "International Conference in Baku addresses future of Caspian Sea amid climate challenges [PHOTOS]",
            "author": "Azernews",
            "url": "https://www.azernews.az/nation/248331.html",
            "url_media": "https://www.azernews.az/media/2025/10/03/18.jpg",
            "country": "AZ",
            "language": "en",
            "summary": "On October 2-3, an international conference titled 'A Turning Point for the Caspian Sea: From COP29 and UNOC 2025 Outcomes to COP30 Action' was held at the Baku Congress Center. It was organized by the IDEA Public Union and Caspisnet scientific network. The conference brought together experts from more than 10 countries. The aim was to exchange knowledge on sea level fluctuations, marine biodiversity conservation, and ecological balance."
        },
        {
            "published_date": "2025-10-03T12:00:52",
            "title": "This sea route has been dismissed as too treacherous. China's taking the risk",
            "author": "Laura Paddison",
            "url": "https://www.newsbreak.com/cnn-510076/4271153570320-this-sea-route-has-been-dismissed-as-too-treacherous-china-s-taking-the-risk",
            "url_media": "https://img.particlenews.com/img/id/1UHK4W_15JiNzan00",
            "country": "PH",
            "language": "en",
            "summary": "The Arctic journey is billed as the first step in China's quest to open a 'Polar Silk Road,' a commercial shipping route across the top of the world. It's only made possible by climate change, according to Laura Paddison, partner publisher with 3.0 million followers."
        },
        {
            "published_date": "2025-10-03T11:54:36",
            "title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month",
            "author": "Carolyn Hax",
            "url": "https://www.washingtonpost.com/world/2025/10/03/somalia-hunger-wfp/bbe37806-a04f-11f0-af12-ae28224a8694_story.html",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XA5EODFAJ4I7BLYSVYUCESUGSQ.jpg&w=1440",
            "country": "US",
            "language": "en",
            "summary": "U.N. food agency is cutting food assistance for hundreds of thousands of people in Somalia. The number of people receiving emergency food assistance in the country will decrease from 1.1 million in August to 350,000 in November due to 'critical funding shortfalls'"
        },
        {
            "published_date": "2025-10-03T11:54:05",
            "title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month",
            "author": "Associated Press",
            "url": "https://www.yahoo.com/news/articles/u-n-food-agency-suspend-115405183.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/1wf.L22yjHtQetnQVoy9Sg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03ODg7Y2Y9d2VicA--/https://media.zenfs.com/en/ap.org/87107ee33ce716078361253d8b193d8f",
            "country": "US",
            "language": "en",
            "summary": "U.N. food agency is cutting food assistance for hundreds of thousands of people in Somalia. The number of people receiving emergency food assistance in the country will decrease from 1.1 million in August to 350,000 in November due to 'critical funding shortfalls' 4.6 million people are facing crisis levels of hunger and 1.8 million children are projected to suffer from acute malnutrition this year."
        },
        {
            "published_date": "2025-10-03T11:52:45",
            "title": "Wildfire smoke will kill thousands more by 2050, study finds",
            "author": "Cdata",
            "url": "https://indianexpress.com/article/technology/science/wildfire-smoke-will-kill-thousands-more-by-2050-study-finds-10285748",
            "url_media": "https://images.indianexpress.com/2025/10/Wildfire.png",
            "country": "IN",
            "language": "en",
            "summary": "If the planet continues to warm at its current rate, wildfire smoke will kill 70,000 Americans each year by 2050. It is the most robust estimate yet of how deadly wildfire smoke could become as the planet warms. The Trump administration proposed repealing the endangerment finding at the end of July."
        },
        {
            "published_date": "2025-10-03T11:48:45",
            "title": "Coastal flood warning issued for St. Mary's County",
            "author": "",
            "url": "https://news.az/news/coastal-flood-warning-issued-for-st-marys-county",
            "url_media": "https://news.az/photos/2025/10/1759490271.jpg",
            "country": "AZ",
            "language": "en",
            "summary": "St. Mary's County, in the US State of Maryland, has been placed under a coastal flood warning by the National Weather Service. The alert remains in effect until 4 a.m. on Friday, October 3, 2025. Current water levels are 2 to 2.5 feet above normal, risking severe flooding in the county's lowest-lying waterfront communities. Residents are advised to remain alert to updates and take necessary precautions."
        },
        {
            "published_date": "2025-10-03T11:32:00",
            "title": "Climate Seminar Targets 'carbon Bootprint'",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/climate-seminar-targets-carbon-bootprint-1545875",
            "url_media": "https://www.defence.gov.au/sites/default/files/styles/landscape_large/public/media-gallery/2025-10/20250922adf8547344_0179.jpg?h=e885edd0&itok=1qM6fRcT",
            "country": "US",
            "language": "en",
            "summary": "Bangladesh Air Force hosted a Climate Security and Resilience Seminar in Dhaka, Bangladesh. The seminar was hosted by the BAF as part of the Australian Defence Force's Indo-Pacific Endeavour 2025 activities. It covered the challenges of climate change and opportunities for militaries to invest in sustainable aviation fuel. Bangladesh contributes just 0.04 per cent of historical global carbon emissions."
        },
        {
            "published_date": "2025-10-03T11:30:44",
            "title": "Heatwave Havoc: Climate Change Disrupts Global Migratory Species",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3651258-heatwave-havoc-climate-change-disrupts-global-migratory-species",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/13_09_2025_09_58_54_5050924.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Report from UN Convention on the Conservation of Migratory Species of Wild Animals details the adverse effects of climate change on global wildlife. Himalayan species such as musk deer and snow trout are increasingly pressured to migrate to fragmented habitats due to rising temperatures. Asian elephants face 'habitat gridlock' due to climate-induced habitat shifts and escalating human-animal conflicts. Arctic shorebirds' survival rates are falling due to timing mismatches with insect hatching."
        },
        {
            "published_date": "2025-10-03T11:22:34",
            "title": "La Niña poses heightened flood risks for Vietnam",
            "author": "MSc Luu Le Huong",
            "url": "https://vir.com.vn/la-ni-a-poses-heightened-flood-risks-for-vietnam-137739.html",
            "url_media": "https://vir.com.vn/stores/news_dataimages/2025/102025/01/16/in_social/ftd-166436842133694127724520251001160741.jpg?randTime=1759491841",
            "country": "VN",
            "language": "en",
            "summary": "Forecasts for the 2025–2026 La Niña show a high probability of occurrence between October and December. This coincides with the peak flood season in the Central region of Vietnam. There is a risk of an increase in rainfall of 9-19% compared with the multi-year average. This demands enhanced hydrometeorological forecasting, coordinated reservoir operations, and prepositioning of emergency resources to reduce losses."
        },
        {
            "published_date": "2025-10-03T10:55:41",
            "title": "National Hurricane Center Watching 2 Areas In Atlantic",
            "author": "The Weather Channel",
            "url": "https://www.yahoo.com/news/videos/national-hurricane-center-watching-2-105541220.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/i38sV.jLtv3PD141mBLVBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_weather_channel_videos_110/844790854acfb450797055f09d063be6",
            "country": "US",
            "language": "en",
            "summary": "The National Hurricane Center is monitoring two areas in the Atlantic for possible tropical development. The first area is located near Florida and has a low chance of development, but flooding will be a concern across parts of the Sunshine State and northern Gulf Coast. The second area is in the Main Development Region off the coast of Africa."
        },
        {
            "published_date": "2025-10-03T10:31:00",
            "title": "Bangkok summit spotlights need for regional climate solutions",
            "author": "South China Morning Post",
            "url": "https://article.wn.com/view/2025/10/03/Bangkok_summit_spotlights_need_for_regional_climate_solution",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As the milestones to limit global heating crumble and America abandons climate goals, policymakers from Asia have taken up the cause. America is the world's second-largest consumer of fossil fuels and a major player in the fossil fuel industry, followed by Asia. "
        },
        {
            "published_date": "2025-10-03T10:29:50",
            "title": "Want to change the world? Two Cape Cod festivals set out to protect environment and people",
            "author": "Cape Cod Times",
            "url": "https://article.wn.com/view/2025/10/03/Want_to_change_the_world_Two_Cape_Cod_festivals_set_out_to_p",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "The third annual Arts & Justice Festival takes place on October 3-5 in Cape Cod. The festival focuses on climate justice, social equity, and community storytelling. There are severe weather warnings and climate change concerns this week on Cape Cod, but there are also activities for people concerned about climate change."
        },
        {
            "published_date": "2025-10-03T10:05:00",
            "title": "Letter: Climate change is real, cut back on fossil fuels",
            "author": "",
            "url": "https://www.staradvertiser.com/2025/10/03/editorial/letters/letter-climate-change-is-real-cut-back-on-fossil-fuels",
            "url_media": "https://www.staradvertiser.com/wp-content/uploads/2025/10/web1_20191107-4344-WDA-MANOA-RAINBOW.jpg",
            "country": "US",
            "language": "en",
            "summary": "It finally rained in Manoa for the first time in over a month. The PGA golf tournament on Maui was cancelled due to drought. The drought is caused by climate change. The political decisionmakers must start to plan to deal with the new realities."
        },
        {
            "published_date": "2025-10-03T10:00:00",
            "title": "What Wine Can Teach Us About Climate Change",
            "author": "Miguel A. Torres",
            "url": "https://time.com/7320687/wine-can-teach-climate-change",
            "url_media": "https://api.time.com/wp-content/uploads/2025/09/Penedes-region.jpg?quality=85&w=1200&h=628&crop=1",
            "country": "US",
            "language": "en",
            "summary": "Wine can become a symbol of resilience against climate change. Penedès is one of the oldest wine regions in Spain, originating in the 7th century BC with the Phoenicians. Up to 70% of current wine-producing regions could become unsuitable for growing grapes if global temperatures rise by more than 2°C above pre-industrial levels. 90% of traditional wine regions could be at risk of disappearing by the end of the century due to drought and heatwaves."
        },
        {
            "published_date": "2025-10-03T10:00:00",
            "title": "Forum: Trump's FEMA actions could lead to catastrophe",
            "author": "Peter Barlow",
            "url": "https://www.dnronline.com/opinion/open_forum/forum-trumps-fema-actions-could-lead-to-catastrophe/article_d5d7438f-bf7f-5945-aab6-14105ca14374.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/dnronline.com/content/tncms/assets/v3/editorial/e/eb/eebea061-9943-52d1-965b-f9b267521837/68de8912395f9.image.jpg?crop=1246%2C654%2C0%2C503&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Peter Barlow lives in Weyers Cave, West Virginia. He left his job at FEMA in August. He is running for Congress in the 70% forested Congressional District of Western North Carolina. The district is similar terrain to the one devastated by Hurricane Helene last year."
        },
        {
            "published_date": "2025-10-03T09:37:23",
            "title": "Donegal remains dangerously exposed to extreme weather events",
            "author": "highlandnews",
            "url": "https://highlandradio.com/2025/10/03/donegal-remains-dangerously-exposed-to-extreme-weather-events-mep-mullooly",
            "url_media": "https://highlandradio.com/wp-content/uploads/2025/10/Obit-Template-2025-10-03T103709.576.jpg",
            "country": "IE",
            "language": "en",
            "summary": "There is no all-of-government emergency plan in place in Donegal despite Storm Éowyn. Ciaran Mullooly has praised ESB crews, local volunteers and emergency staff for their work during the storm but says the lack of preparedness left Ireland dependent on outside help."
        },
        {
            "published_date": "2025-10-03T09:25:22",
            "title": "La Nina is coming this fall, winter. Here's how it will impact Delaware",
            "author": "Greg Giesen",
            "url": "https://www.delawareonline.com/story/weather/2025/10/03/how-will-la-nina-impact-delaware-winter-weather/86440426007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/08/29/USAT/85886905007-la-nina-winter-flat-1400-x-933.jpg?auto=webp&crop=1398,787,x2,y0&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "There is a 71% chance of a La Nina period between October and December. There's a 54% chance it will continue through February. La Nina events cause drought in the southern U.S. and heavy rains and flooding in the Pacific Northwest and Canada. The outlook from the Climate Prediction Center is calling for a 40 to 50% chance for above normal tempratues this fall and winter."
        },
        {
            "published_date": "2025-10-03T09:10:51",
            "title": "ClimAfrica Forum 2025 Rallies Continent Around Early Warning Systems for All",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3650961-climafrica-forum-2025-rallies-continent-around-early-warning-systems-for-all",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_05_2025_14_01_02_4936052.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "ClimAfrica Forum 2025 was held from 30 September to 1 October in Skhirat, Morocco. The outcomes statement commits African nations to accelerate the rollout of Early Warning Systems (EWS) across the continent as a frontline defence against escalating climate threats. "
        },
        {
            "published_date": "2025-10-03T09:08:00",
            "title": "CoastCraft To Inspire Next Generation Of Environmental Champions To Fight Virtual Coastal Erosion",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/coastcraft-to-inspire-next-generation-of-1545757",
            "url_media": "https://assets.publishing.service.gov.uk/media/68de85f4c487360cc70ca077/s960_beachHuts.png",
            "country": "US",
            "language": "en",
            "summary": "CoastCraft is an educational game developed for Minecraft Education, aligned with the curriculum in England and designed for students aged between 9 and 14. It is based on the landscape of Bude in Cornwall and challenges players to respond to rising sea levels and the impacts of climate change. Environment Agency is working to deliver the government's record £7.9 billion capital investment over 10 years to protect 840,000 properties from flooding."
        },
        {
            "published_date": "2025-10-03T09:06:44",
            "title": "Transforming Food Systems Could Help Tackle Global Warming, Study Finds",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/10/03/Transforming_Food_Systems_Could_Help_Tackle_Global_Warming_S",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "EAT-Lancet Commission warns food systems account for nearly a third (30%) of total global greenhouse gas emissions, according to the study by the EAT-lancet commission. The study was based on a report by the UN Food and Agriculture Organization."
        },
        {
            "published_date": "2025-10-03T09:04:53",
            "title": "Want to change the world? Two Cape Cod festivals set out to protect environment and people",
            "author": "Gwenn Friss",
            "url": "https://www.capecodtimes.com/story/lifestyle/things-to-do/2025/10/03/climate-change-environment-justice-social-global-cape-cod/86420881007",
            "url_media": "https://www.capecodtimes.com/gcdn/presto/2022/03/29/NCCT/5ff4a4ea-a4cf-4294-9121-149a91e59dfb-032922mc03.jpg?crop=5399,3037,x0,y242&width=3200&height=1801&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "The third annual Arts & Justice Festival takes place on Oct. 3-5 in Hyannis. The festival is organized by Amplify POC Cape Cod, Belonging Books and The Cordial Eye. On Oct. 8-10, Cape Cod Community College and the Cape Cod Art Barn will host a 'Waves of Change' community arts festival focusing on 'climate justice, social equity, and community storytelling.' A Kalmus Beach cleanup, at 7 a.m. Saturday, Oct. 11, is billed as a bonus event for the festival."
        },
        {
            "published_date": "2025-10-03T08:50:01",
            "title": "Karachi Rain Forecast: Cyclone Intensifies in Arabian Sea, Fishermen Alerted",
            "author": "Web Desk",
            "url": "https://enews.hamariweb.com/pakistan/karachi-rain-forecast-cyclone-intensifies-in-arabian-sea-fishermen-alerted",
            "url_media": "https://enews.hamariweb.com/wp-content/uploads/2025/10/Untitled-Project-2025-10-03T134927.308.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The northeast Arabian Sea weather system has intensified and developed into a deep depression. Karachi and several districts in Sindh may experience light to moderate rain with drizzle at isolated locations. The most significant development in terms of weather in Karachi and coastal Sindh is the cyclone in Arabian Sea in October 2025. The Sindh Fisheries Department has instructed fishermen not to venture into the deep sea until October 3."
        },
        {
            "published_date": "2025-10-03T08:39:09",
            "title": "Asia confronts new climate reality at Bangkok summit amid global setbacks",
            "author": "Aidan Jones",
            "url": "https://www.scmp.com/week-asia/health-environment/article/3327781/asia-confronts-new-climate-reality-bangkok-summit-amid-global-setbacks",
            "url_media": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/10/03/901414b7-5ee7-4dde-9d52-f030742f704d_330ed34c.jpg?itok=vjHBK-rH&v=1759480748",
            "country": "HK",
            "language": "en",
            "summary": "Delegates from Asia gathered in Bangkok this week to discuss climate change. Global temperatures are likely to exceed the 1.5 degree Celsius rise above pre-industrial levels at some point over the coming five years. More than 100,000 people in Japan were sent to hospital this summer with heat stroke, a record number."
        },
        {
            "published_date": "2025-10-03T08:36:18",
            "title": "Swiss glaciers have shrunk by 3% this year",
            "author": "",
            "url": "https://www.ahmedabadmirror.com/swiss-glaciers-have-shrunk-by-3-this-year/81900078.html",
            "url_media": "https://media.ahmedabadmirror.com/am/uploads/mediaGallery/image/1759428563021.jpg-org",
            "country": "IN",
            "language": "en",
            "summary": "Glaciers in Switzerland have lost 3% of their volume this year due to global warming. Switzerland is home to nearly 1,400 glaciers, the most of any country in Europe. More than 1,000 small glaciers have already disappeared in Switzerland due to climate change."
        },
        {
            "published_date": "2025-10-03T08:30:00",
            "title": "Helping my teen understand global warming",
            "author": "",
            "url": "https://www.messagemedia.co/townnews/hydrography/helping-my-teen-understand-global-warming/article_5e60da6a-b25e-40c7-bc0c-bceb58afc557.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/messagemedia.co/content/tncms/custom/image/1f4ff670-2885-11e9-aab0-b387e94f5ee8.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "Climate change is the rapid increase of Earth's temperature resulting from the excessive emission of greenhouse gases into the atmosphere. It is actively threatening the livelihood of the planet humanity calls home. It will affect future generations to come, if we don't regulate the growth of this phenomenon."
        },
        {
            "published_date": "2025-10-03T08:08:46",
            "title": "Spring burn program begins with 70 hectares at MacGillivray-Locketts Track",
            "author": "Hui Jin",
            "url": "https://theislanderonline.com.au/news/2025/10/03/spring-burn-program-begins-with-70-hectares-at-macgillivray-locketts-track",
            "url_media": "https://theislanderonline.com.au/wp-content/uploads/2025/10/burns_508209_01.jpg",
            "country": "AU",
            "language": "en",
            "summary": "There are three burns planned for Kangaroo Island starting with 70 hectares on the MacGillivray-Locketts Track on Saturday, October 4th. The burns will burn 70 hectares of land on Kangaroo island on that day and then another 70 hectares the next day."
        },
        {
            "published_date": "2025-10-03T07:40:39",
            "title": "Catastrophic wildfires surge, nearly half of worst disasters strike in past decade: study",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/10/03/Catastrophic_wildfires_surge_nearly_half_of_worst_disasters__j",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change drives hotter, drier and longer fire seasons. 43 percent of the worst disasters recorded in the past decade have been caused by wildfires, according to Xinhua. These are fires occurring under increasingly extreme weather conditions that make them unstoppable, the report says."
        },
        {
            "published_date": "2025-10-03T07:00:00",
            "title": "Women in coastal regions need better social security",
            "author": "Md Al-Mamun",
            "url": "https://www.thedailystar.net/opinion/views/news/women-coastal-regions-need-better-social-security-4000246",
            "url_media": "https://tds-images.thedailystar.net/sites/default/files/styles/social_share/public/images/2025/10/02/women_in_climate_change_photo_tamanna_khan.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Bangladesh is one of the countries vulnerable to climate change. The southwest coastal districts are often at the epicentre of this crisis. Studies show that salinity intrusion and decline in crop production in several upazilas of Satkhira disproportionately affect women. Women are among the most vulnerable groups during and after natural disasters. Adaptive social protection (ASP) is a framework that integrates social safety nets with disaster preparedness and climate resilience."
        },
        {
            "published_date": "2025-10-03T06:58:16",
            "title": "El Niño's Climate Effects Across Africa Explored",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/el-ninos-climate-effects-across-africa-explored",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/10/El-Nino8217s-Climate-Effects-Across-Africa-Explored-1759474699.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The El Niño–Southern Oscillation (ENSO) is one of the most significant drivers of climate variability across the globe. ENSO's influence is profoundly significant in Africa, especially during the rainy season. Research into the regional circulations is vital for formulating effective adaptation strategies in African countries."
        },
        {
            "published_date": "2025-10-03T06:30:58",
            "title": "Daylight Saving Time (DST), when and where to change your clocks, NSW, Victoria, Tasmania, ACT, South Australia, October 5, AEST",
            "author": "Max Aldred",
            "url": "https://www.skynews.com.au/australia-news/daylight-saving-time-starts-sunday-in-australia-when-to-wind-your-clock/news-story/d6b11b8a6b32d6735ef1b11d20b4de33",
            "url_media": "https://content.api.news/v3/images/bin/2e99e5dd1baea0520f33f7a4ab285cbe",
            "country": "AU",
            "language": "en",
            "summary": "Clocks will change at 2am on Sunday and skip forward to 3am AEST. New South Wales, Victoria, South Australia, the Australian Capital Territory and Tasmania observe daylight saving time. Queensland, Western Australia and the Northern Territory do not. Daylight saving time is due to start on October 5, 2025."
        },
        {
            "published_date": "2025-10-03T06:00:00",
            "title": "Mercury Theatre Wales to perform The Woman on the Hill",
            "author": "Michael Ribbeck",
            "url": "https://www.southwalesguardian.co.uk/news/25512904.mercury-theatre-wales-perform-woman-hill",
            "url_media": "https://www.southwalesguardian.co.uk/resources/images/20030348.jpg?type=og-image&xType=0&yType=261",
            "country": "GB",
            "language": "en",
            "summary": "Mercury Theatre Wales is behind the play, 'The Woman on the Hill', which aims to explore the impact of environmental changes on Welsh coastal communities. The production will be performed through \"story, song and community voices\". It will take place at Theatr Gwaun on October 30 and 31 at 7.30 pm. Span Arts is offering a free ticket for companions, carers, or personal assistants of audience members who require access support."
        },
        {
            "published_date": "2025-10-03T05:36:38",
            "title": "Power cuts and travel disruption likely in parts of Ireland as Storm Amy to hit west coast today",
            "author": "Irish Independent",
            "url": "https://article.wn.com/view/2025/10/03/Power_cuts_and_travel_disruption_likely_in_parts_of_Ireland_",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Storm Amy may force some schools in vulnerable coastal areas to close because of the storm. Some schools may be forced to close due to the storm's impact.   Â   for some schools, including vulnerable coastal schools.  For confidential support call the National Suicide Prevention Lifeline on 1-800-273-8255. "
        },
        {
            "published_date": "2025-10-03T05:14:13",
            "title": "🌱 Patch AM: Grants boost composting efforts, including in Takoma Park",
            "author": "Patch AM Team",
            "url": "https://patch.com/maryland/takomapark/patch-am-grants-boost-composting-efforts-including-takoma-park-nodx-20251003",
            "url_media": "https://patch.com/img/cdn20/assets/layout/am_friday_2.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Composting Consortium has awarded grants to enhance composting infrastructure in Takoma Park. 2025 Mid-Atlantic Regional Watercolor Exhibition (presented by the Baltimore Watercolor Society) is on the calendar. Review of 'The Lost Trees of Willow Avenue' and an Interview with Its Author Mike Tidwell of the Chesapeake Climate Action are also in today's newsletter."
        },
        {
            "published_date": "2025-10-03T05:10:17",
            "title": "Why some Aussies think Daylight Saving Time should be shortened",
            "author": "Caitie Browne",
            "url": "https://au.news.yahoo.com/why-aussies-think-daylight-saving-050952452.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/O9M788jkgEc4WB5ZDRHy7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-10/ad072790-a015-11f0-bcdb-d9ebc93c37b2",
            "country": "US",
            "language": "en",
            "summary": "Only 5 of Australia's 8 states and territories participate in daylight saving time. Some argue that it disrupts sleep patterns and poses challenges for those living in rural or border regions. Some studies suggest that longer daylight hours encourage greater physical activity and improve mood and social well-being."
        },
        {
            "published_date": "2025-10-03T05:00:00",
            "title": "Bloomberg: 'Climate Deniers are Increasingly Hiding in Plain Sight'",
            "author": "Eric Worrall",
            "url": "https://wattsupwiththat.com/2025/10/02/bloomberg-climate-deniers-are-increasingly-hiding-in-plain-sight",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2017/05/spy_silhouette.png?fit=700%2C400&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "After Trump's UN speech, more than 100 countries have announced new goals to reduce greenhouse gas emissions or promised to submit updated climate plans. Ursula von der Leyen, president of the European Commission, spoke at the UN the day after Trump. EU members are still fighting over their 2035 and 2040 emission-reductions targets weeks away from COP30. EU bloc has delayed implementation of new anti-deforestation rules for another year. A forest monitoring law rejected by a right-wing coalition on Wednesday. Report found governments plan to produce 120% more fossil fuels in 2030 than what's required to limit warming to 1.5C."
        },
        {
            "published_date": "2025-10-03T04:57:14",
            "title": "Record Meltdown: Swiss Glaciers Facing Dramatic Ice Loss",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3650733-record-meltdown-swiss-glaciers-facing-dramatic-ice-loss",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_08_2024_06_53_14_5643084.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Switzerland's glaciers are shrinking due to scant snowfall and June heatwaves. There was a 3% loss in total ice mass in the past year. There are concerns about climate change impacts on alpine environments.      Â  "
        },
        {
            "published_date": "2025-10-03T04:51:36",
            "title": "Fueled By Water: Climate Change Isn't Slowing Down South Florida's Waterfront Real Estate Boom Anytime Soon",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/10/03/Fueled_By_Water_Climate_Change_Isn_t_Slowing_Down_South_Flor",
            "url_media": "https://article.wn.com/view/2025/10/03/[]",
            "country": "US",
            "language": "en",
            "summary": "Impact glass, fortified utilities, storm-proof infrastructure, and climate-resistant building design are helping waterfront cities like Fort Lauderdale thrive despite the potential risks from global warming and sea level rise, as well as sea level rises. The research was conducted by the University of Florida."
        },
        {
            "published_date": "2025-10-03T04:50:16",
            "title": "When exactly daylight savings starts as clocks set to change this weekend",
            "author": "Brianne Tolj",
            "url": "https://au.news.yahoo.com/when-exactly-daylight-savings-starts-for-millions-of-aussies-as-clocks-set-to-change-this-weekend-025221648.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/6LwwXgdQppNMzToh2YKm9A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-09/fdc8f210-9cd4-11f0-bcf4-f38e040d59c0",
            "country": "US",
            "language": "en",
            "summary": "Sunday marks the start of daylight savings time. In NSW, Victoria, South Australia, Tasmania, and the ACT, clocks will roll forward at 2am on Sunday, October 5, jumping to 3am. People in Queensland, WA and the Northern Territory do not get daylight saving. 50% of Aussies are not fans of daylight saving time."
        },
        {
            "published_date": "2025-10-03T03:56:39",
            "title": "Aberystwyth weather forecast: Moderate rain, heavy winds",
            "author": "",
            "url": "https://www.cambrian-news.co.uk/weather-forecasts/moderate-rain-and-strong-winds-likely-through-tomorrow-838064",
            "url_media": "https://www.cambrian-news.co.uk/tindle-static/image/2025/03/09/17/49/Light-Rain-2.jpeg?trim=44,0,177,0&width=1200&crop=16:9,smart&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "Temperatures are expected to reach near 15°C in Aberystwyth on Tuesday. The weather should remain mostly grey, with occasional breaks in the clouds, but rain is less intense than earlier in the week in the area. In the rest of the week, the weather is expected to remain damp."
        },
        {
            "published_date": "2025-10-03T03:28:39",
            "title": "Daylight Saving Begins: Time Difference with Greece Changes",
            "author": "Bill Giannopoulos",
            "url": "https://greekcitytimes.com/2025/10/03/daylight-saving-begins-time-difference-with-greece-changes",
            "url_media": "https://greekcitytimes.com/wp-content/uploads/2018/10/Clock-change-winter-2018-1600x1067.jpg",
            "country": "GR",
            "language": "en",
            "summary": "Daylight saving time officially begins on Sunday, 5 October. Clocks will move forward by one hour at 2:00 a.m., ushering in longer days and lighter evenings across participating states and territories. For the next three weeks, the time difference between Australia and Greece will be 8 hours. On Sunday, 26 October, the difference will increase to 9 hours."
        },
        {
            "published_date": "2025-10-03T02:04:11",
            "title": "Exactly When Daylight Savings Starts (And Whether To Turn Your Watch Forward Or Back)",
            "author": "Senior Writer",
            "url": "https://lifestyle.einnews.com/article_detail/854825765/mE5HGifrVE3Mb0BH",
            "url_media": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/6/2025/10/daylight-savings-68df2a3c2bf19.jpg?resize=1200%2C630",
            "country": "UA",
            "language": "en",
            "summary": "Daylight saving in Australia officially begins at 2:00 a.m. on Sunday, October 5th. Queensland, the Northern Territory and Western Australia are opting out of daylight saving. Southern states, with cooler winters and more dramatic seasonal shifts, embrace daylight saving for longer evenings, slower sunsets, and more time to do nothing. Northern states closer to the equator, where daylight hours are more consistent year-round, do not."
        },
        {
            "published_date": "2025-10-03T01:56:25",
            "title": "Hurricane Swell: Surfers vs. Monster Waves & Rocks 🌊",
            "author": "Luis Mendoza",
            "url": "https://www.archyde.com/hurricane-swell-surfers-vs-monster-waves-rocks-%f0%9f%8c%8a",
            "url_media": "https://www.surfer.com/.image/c_fit%2Ch_800%2Cw_1200/MjowMDAwMDAwMDAwMTM5NTc4/hurricane-narda-rocks.png",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Narda swelled surf conditions in Southern California. Climate change will lead to more frequent and intense tropical cyclones. Longer period swells pack more energy, creating more powerful and dangerous waves. Shifting storm patterns mean swells can arrive from unexpected directions. Technology is emerging as a crucial tool for mitigating risk."
        },
        {
            "published_date": "2025-10-03T01:35:59",
            "title": "When does daylight saving time start in Australia? Here's your pocket guide",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-10-03/daylight-saving-time-2025-pocket-guide/105801688",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/10accfa349ab59e2760bd649b1773d8c?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=11&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Daylight saving starts at 2am on October 5. Clocks will move forward by one hour in Australia. Northern Territory, Queensland, and Western Australia do not observe daylight saving time. Daylight saving will end on April 5 2026 when clocks are turned back to 2am AEST (Australian Eastern Standard Time)."
        },
        {
            "published_date": "2025-10-03T01:30:00",
            "title": "Warmer weather on the way for Victoria, but farmers face another challenging season",
            "author": "Sydney Morning Herald",
            "url": "https://ground.news/article/warmer-weather-on-the-way-for-victoria-but-farmers-face-another-challenging-season",
            "url_media": "data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 width=%22280%22 height=%22280%22 viewBox=%220 0 280 280%22><path transform=%22translate(97.3,0)%22 d=%22M44,140.1h42.8V272H54.9c0-0.1,0-103.8,0-103.8H44V140.1z M44,1c28.4,0,42.6,16.2,42.6,42.2v66.1H54.9V43.8 c0-7.2-3.1-11.7-10.6-11.7c-7,0-10.6,4.2-10.6,11.7c0,0,0,228.1,0,228.2H0.2c0-0.5,0-228.8,0-228.8C0.1,16.8,14.8,1,44,1L44,1z%22/><style>path { fill: %23262626 } @media (prefers-color-scheme: dark) { path { fill: %23EEEFE9 } }</style></svg>",
            "country": "US",
            "language": "en",
            "summary": "The start of daylight savings on Sunday means longer, warmer days for Victorians. Farmers are hoping for much-needed rainfall after a dry August and September, as Victorians embrace longer and warmer days with the start of the daylight savings.   . "
        },
        {
            "published_date": "2025-10-03T01:00:36",
            "title": "Millions of Aussies in firing line for hot weekend weather, rain, wind",
            "author": "Alexandra Feiam",
            "url": "https://www.nzherald.co.nz/world/millions-of-aussies-in-firing-line-for-hot-weekend-weather-rain-wind/L5SH7FPOZ5CMTK6AKHLJ3MGRRQ",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/MVYVIFIYHBHU7MBNBW6Y5K6YKE.jpg?auth=715ebfd84185109173806212f7d3a3f28cbf9d6c13879ef3fab311fbdd1304c0&width=1200&height=675&quality=70&focal=537%2C324&smart=false",
            "country": "NZ",
            "language": "en",
            "summary": "A high-pressure system is sweeping over the nation bringing a band of hot weather with it. Some regions are tipped to exceed 40C this weekend, before a cool change will cause temperatures to plummet.       .   and the Bureau of Meteorology."
        },
        {
            "published_date": "2025-10-03T01:00:00",
            "title": "What insurance data reveals about how bad wildfires are getting",
            "author": "CBC",
            "url": "https://article.wn.com/view/2025/10/03/What_insurance_data_reveals_about_how_bad_wildfires_are_gett",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists tapped into 44 years of data to show how societally destructive wildfires are growing all across the world. They are becoming more common because of climate change.    .   i   in this context,  in the context of the data,  "
        },
        {
            "published_date": "2025-10-03T00:20:00",
            "title": "Experts raise concerns over frightening phenomenon in US rivers: 'The trend … is actually increasing faster'",
            "author": "Kim La Capria",
            "url": "https://www.yahoo.com/news/articles/experts-raise-concerns-over-frightening-002000460.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/wE38ksAYjQzQ_mSkkfj1Jg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/0109e5d5def2d37c2e0baa6255bccc9a",
            "country": "US",
            "language": "en",
            "summary": "Experts raise concerns over rising water temperatures in US rivers. Riverine heat waves occur more frequently than air heat waves in 65 to 76% of the sites examined. The authors identified the culprit behind warmer rivers: an overheating planet. The research could facilitate changes to water management."
        },
        {
            "published_date": "2025-10-03T00:15:17",
            "title": "UNLOCKING CLIMATE FINANCE",
            "author": "Life",
            "url": "https://www.thisdaylive.com/2025/10/03/unlocking-climate-finance",
            "url_media": "https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Climate-Change.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria's response to climate change is underfunded. The Guide to Accessing Climate Finance will be officially launched on Monday, 6 October at the Transcorp Hilton in Abuja. It is designed to break down barriers and open new pathways for financing climate action."
        },
        {
            "published_date": "2025-10-03T00:15:13",
            "title": "Swiss Glaciers Shrank 3% This Year. That's Big",
            "author": "Newser Editors",
            "url": "https://www.newser.com/story/376253/swiss-glaciers-shrank-3-this-year-thats-big.html",
            "url_media": "https://img1-azrcdn.newser.com/image/1637770-12-20251002141514.jpeg",
            "country": "US",
            "language": "en",
            "summary": "This year's shrinkage of Switzerland's glaciers is the fourth-largest annual drop on record due to global warming. Switzerland is home to nearly 1,400 glaciers, the most of any country in Europe. More than 1,000 small glaciers in Switzerland have already disappeared."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Catastrophic wildfires surge, nearly half of worst disasters strike in past decade: study",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20251003/2e0bd4b11b9f4cf399eb7cd1bf3936bc/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Half of all catastrophic fire events costing over 43 billion U.S. dollars since 1980 occurred in the last decade. Mediterranean-type forests in southern Europe, California, southern Australia, and Chile experience wildfire disasters far exceeding their land area. Half of all disasters occurred in most extreme weather conditions on record."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "50�C Paris is no longer sci-fi",
            "author": "The Star",
            "url": "https://article.wn.com/view/2025/10/03/50_C_Paris_is_no_longer_scifi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "At 50 degrees Celsius, the asphalt on the streets of Paris would melt in spots, making it virtually impossible for ambulances and buses to pass. Read full story at iReporter.co.uk. iReport: Share your photos and videos of Paris at 50 degrees C."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Power cuts, school closures and travel disruption likely in parts of Ireland as Storm Amy to hit today",
            "author": "Irish Independent",
            "url": "https://article.wn.com/view/2025/10/03/Power_cuts_school_closures_and_travel_disruption_likely_in_p",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Storm Amy may force some schools in vulnerable coastal areas to close because of the storm. Some schools may be forced to close due to the storm's impact.   Â   for some schools, including vulnerable coastal schools.  For confidential support call the National Suicide Prevention Lifeline on 1-800-273-8255. "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Have familiar flaws put Ange Postecoglou's future at Nottingham Forest in jeopardy already?",
            "author": "The Athletic",
            "url": "https://article.wn.com/view/2025/10/03/Have_familiar_flaws_put_Ange_Postecoglous_future_at_Nottingh",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The start to the Australian's tenure is the worst of any permanent Forest manager in a hundred years, according to the Forest's official statistics. The start to his tenure is also the worst for any Forest manager for a century. The Forest are not satisfied with his performance."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "PR firms are spreading climate misinformation on behalf of fossil fuel companies. Could Australia stop them?",
            "author": "Renew Economy",
            "url": "https://article.wn.com/view/2025/10/03/PR_firms_are_spreading_climate_misinformation_on_behalf_of_f",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate misinformation is common and influential. It is based on outdated and incorrect information. It can be misleading and harmful for people and for the environment. It's not just a matter of opinion. It could be dangerous and harmful to people and the environment too. "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Alberta seeing more avian flu cases in wild birds heading into migratory season",
            "author": "CTV",
            "url": "https://article.wn.com/view/2025/10/03/Alberta_seeing_more_avian_flu_cases_in_wild_birds_heading_in",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As the seasons change and birds fly south, they are looking for food.    for the winter months. For more information, go to: http://www.bbc.com/news/buzzfeed/bbc-news/stories/browsing/bathers/"
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Israeli forces detain dozens after boarding flotilla boats headed for Gaza",
            "author": "The Mirror",
            "url": "https://article.wn.com/view/2025/10/03/Israeli_forces_detain_dozens_after_boarding_flotilla_boats_h",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Global Sumud Flotilla was boarded by Israeli forces as it was bound for the Palestinian territory of Gaza. It included climate activist Greta Tunberg as one of its passengers, who was protesting against climate change in the Middle East and was taken by surprise by the Israeli forces."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Temperature in Vladivostok breaks century-old record",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/10/03/Temperature_in_Vladivostok_breaks_centuryold_record_r",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in Vladivostok reached 23.5 degrees Celsius on Thursday, breaking a record that had stood for more than a century, local media reports.      Â   in the Russian Far Eastern city of VladivOSTOK."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Climate change made damage from Super Typhoon Ragasa significantly worse: study",
            "author": "South China Morning Post",
            "url": "https://article.wn.com/view/2025/10/03/Climate_change_made_damage_from_Super_Typhoon_Ragasa_signifi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change may have been responsible for more than a third of the direct damage to homes and property caused by the super typhoon that struck southern China last month, according to some experts.    - CNN.com. China. China's weather is changing due to climate change. "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Antarctica may have crossed a tipping point that leads to rising seas",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/10/03/Antarctica_may_have_crossed_a_tipping_point_that_leads_to_ri",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists are beginning to understand the sudden loss of sea ice in Antarctica. There is growing evidence that it represents a permanent shift with potentially catastrophic consequences. The loss of the sea ice could be catastrophic, according to some scientists.   .    "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Met Office report : Climate change in action as Sept 2025 among hottest, wettest months in decades",
            "author": "The News International",
            "url": "https://article.wn.com/view/2025/10/03/Met_Office_report_Climate_change_in_action_as_Sept_2025_amon",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "September 2025 experienced above-average rainfall and increase in both average maximum and minimum temperatures nationwide. Environmentalists attributed the changing weather patterns to climate change. They urged the government to act on the issue.       in response to the warning from environmentalists. "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Developing Nations Warn Of Climate Risks Amid Funding Gaps",
            "author": "BW Online Bureau",
            "url": "https://www.businessworld.in/article/developing-nations-warn-of-climate-risks-amid-funding-gaps-573984",
            "url_media": "https://static.businessworld.in/1698936380_fhUcI1_climate_change.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Leaders from developing countries have sharply criticised wealthy nations for failing to meet long-standing commitments to finance climate adaptation and mitigation. They warned that rising sea levels, worsening droughts, and deforestation threaten vulnerable populations and economies. A 2009 pledge to provide USD 100 billion annually was only met in 2022, two years later than promised. Last year's UN climate summit aimed to deliver USD 300 billion per year to developing nations by 2035."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "UNFPA sounds warning on growing climate change, GBV, and SRHR crises in South Sudan",
            "author": "Moses Magadza in Johannesburg",
            "url": "https://www.nation.sc/articles/27739/unfpa-sounds-warning-on-growing-climate-change-gbv-and-srhr-crises-in-south-sudan",
            "url_media": "https://www.nation.sc/",
            "country": "SC",
            "language": "en",
            "summary": "UNFPA warns of growing climate change, GBV, and SRHR crises in South Sudan. Dr Hussein Hassan presented the assessment to a workshop in Johannesburg on Monday. He is the Emergency Coordinator, Head, Humanitarian Response Unit, UNFPA in S.A."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Planetary health diet: This is the diet to adopt if you want to save the planet",
            "author": "The Independent",
            "url": "https://article.wn.com/view/2025/10/03/Planetary_health_diet_This_is_the_diet_to_adopt_if_you_want_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is threatening Kenya's tea trade, according to the Independent. The situation is getting worse due to climate change, says a report by the International Institute for Climate Change (ICC), which is worried about the impact of climate change on the tea trade."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Why coral reefs damaged by blast fishing struggle to recover—even after decades",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/10/03/Why_coral_reefs_damaged_by_blast_fishing_struggle_to_recover",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There is a rapid decline in coral reefs in parts of Indonesia. Climate change is often the first culprit. However, it is not the only one. It is also the cause of heat waves, bleaching events, and intensified cyclones in some parts of the country."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Climate change is messing with global wind speeds, impacting planetary health",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/10/03/Climate_change_is_messing_with_global_wind_speeds_impacting_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is disturbing wind patterns across the globe. Land-use change and desertification are spawning immense sand and dust storms that pose an ever-increasing risk to human health. These mega wind storms now affect an estimated 330 million people annually, exposing a growing global health threat."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "This sea route has been dismissed as too treacherous. China's taking the risk",
            "author": "Laura Paddison",
            "url": "https://article.wn.com/view/2025/10/03/This_sea_route_has_been_dismissed_as_too_treacherous_China_s_q",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Istanbul Bridge set sail from China bound for Europe laden with cargo. Climate change is altering the map, according to Laura Paddison, a CNN producer.       .   \"This is really the first time that climate change is altered the map\" "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Accelerated Gulf of Maine warming may pose a serious threat to American lobsters",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/10/03/Accelerated_Gulf_of_Maine_warming_may_pose_a_serious_threat_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Gulf of Maine is warming faster than 99% of the world's oceans. There are concerns for the $2 billion-a-year American lobster fishery in the Gulf. The Gulf is home to the largest lobster population in the world, which is worth billions of dollars."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month",
            "author": "ABC News",
            "url": "https://article.wn.com/view/2025/10/03/UN_food_agency_to_suspend_food_aid_for_750000_people_in_Soma_3",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The U.N. food agency has announced cuts to food assistance for hundreds of thousands in Somalia. Millions face the devastating effects of climate change and severe hunger in the country due to drought and other weather-related issues. The agency has also announced a reduction in food aid for children."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Watch: Is climate change driving people out of the Sunderbans?",
            "author": "The Hindu",
            "url": "https://article.wn.com/view/2025/10/03/Watch_Is_climate_change_driving_people_out_of_the_Sunderbans",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Sundarbans is one of the worst-hit regions of India due to climate change. It is home to millions of people who have depended on these resources. It's also home to people who depend on them for their livelihoods and livelihoods. "
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Engineering the world's largest carbon removal plant",
            "author": "Interesting Engineering",
            "url": "https://article.wn.com/view/2025/10/03/engineering_the_world_8217s_largest_carbon_removal_plant",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Humanity pumps 40 billion tonnes of carbon dioxide into the atmosphere each year. Even if emissions stopped tomorrow, we'd still need to remove billions of tonnes already in the atmosphere to hit climate targets. The problem is that atmospheric CO2 sits at around 422 parts per million—0.04% of the air around us."
        },
        {
            "published_date": "2025-10-03T00:00:00",
            "title": "Thailand Country Climate and Development Report (World Bank Group)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/10/03/Thailand_Country_Climate_and_Development_Report_World_Bank_G",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Thailand has achieved remarkable development progress, but the recent experience has been less rosy. Growth has slowed to an average of 2.6 percent, compared to 2.7 percent in the past decade. The report includes the overview and chapters on climate change and development."
        }
    ]
}