{
    "status": "ok",
    "total_articles": 89,
    "articles": [
        {
            "published_date": "2025-10-26T23:54:45",
            "title": "Neanderthals & Humans: Rewilding Europe Before Farming",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/neanderthals-humans-rewilding-europe-before-farming",
            "url_media": "https://www.archyde.com/wp-content/uploads/2025/05/archydegemini.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Neanderthals and early Homo sapiens managed European landscapes with fire for over 100,000 years. This intentional use of fire had profound consequences, for example, the expansion of grasslands and the decline of forest-dwelling megafauna. Prehistoric people were active agents in shaping the world around them. Many of Europe's current landscapes are legacies of these prehistoric interventions."
        },
        {
            "published_date": "2025-10-26T23:38:31",
            "title": "False 'heat only rises' claim defies climate science",
            "author": "",
            "url": "https://www.aap.com.au/factcheck/false-heat-only-rises-claim-defies-climate-science",
            "url_media": "https://storage.googleapis.com/pss-prod-aap-ss-web-bkt-fw/public/Uploads/Article/142dd006-d0eb-49ea-b840-f1f88647dd79__FillWzEyMDAsNjMwXQ.jpg",
            "country": "AU",
            "language": "en",
            "summary": "A Facebook post claims CO2 can't warm the earth's surface because \"heat only goes up\". Experts say CO2 transfers heat in all directions, including downwards, via radiation. The mechanisms by which CO2 increases global temperature are explained in the most recent IPCC report on the science of climate change."
        },
        {
            "published_date": "2025-10-26T23:35:46",
            "title": "The first swells of Hurricane Melissa are being felt on the southern coast of eastern Cuba",
            "author": "Ciber Cuba Editorial Team",
            "url": "https://en.cibercuba.com/noticias/2025-10-27-u1-e208933-s27061-nid313658-primeras-marejadas-huracan-melissa-comienzan",
            "url_media": "https://cdn0.celebritax.com/sites/default/files/styles/watermark_100/public/1761521270-primeras-marejadas-huracan-melissa-comienzan-sentirse-costa-sur-oriente-cubano.jpg",
            "country": "ES",
            "language": "en",
            "summary": "The first swells associated with the hurricane Melissa have already reached the southern coast of Granma province, raising the water level. The combination of strengthening winds and relentless waves puts Eastern Cuba in a critical situation. The eastern provinces of the island have been put on alert, due to the possibility of extreme rainfall and storm surges."
        },
        {
            "published_date": "2025-10-26T23:00:00",
            "title": "Coastal US residents alarmed as worsening crisis damages property: 'It's getting worse and worse each year'",
            "author": "Daysia Tolentino",
            "url": "https://news.yahoo.com/articles/coastal-us-residents-alarmed-worsening-230000199.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/PGMb2TazuzCuzoUYoWzDpw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/5bd8edf4c99d8154db5723b7cabc18da",
            "country": "US",
            "language": "en",
            "summary": "As sea levels rise due to warming global temperatures, coastal communities in South Florida are seeing a spike in \"king tides\". King tides are the highest high tides of the year and cause minor flooding. The sea level near the homes has risen by 8 inches in the past 30 years. Some residents had to leave their coastal homes because of the rising sea levels."
        },
        {
            "published_date": "2025-10-26T22:50:07",
            "title": "#EyeOnMelissa: Met Service warns Jamaicans to beware of storm surges",
            "author": "",
            "url": "https://www.jamaicaobserver.com/2025/10/26/eyeonmelissa-met-service-warns-jamaicans-beware-storm-surges",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/10/VERVWR.png",
            "country": "JM",
            "language": "en",
            "summary": "Hurricane Melissa is moving closer to Jamaica. The weather system is causing rough seas and rising tides. Storm surges could reach heights of up to 15 feet. Residents in low-lying and coastal areas are being urged to take precautions and evacuate if necessary. The Jamaica Observer visited Rae Town on Sunday and observed that the tides were becoming increasingly rough."
        },
        {
            "published_date": "2025-10-26T22:25:44",
            "title": "#EyeOnMelissa: Farmers told to reap early where possible to minimise losses",
            "author": "Lynford Simpson",
            "url": "https://www.jamaicaobserver.com/2025/10/26/eyeonmelissa-farmers-told-reap-early-possible-minimise-losses-green",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/02/YHP_2981-1024x683.jpg",
            "country": "JM",
            "language": "en",
            "summary": "Farmers were urged to harvest whatever crops they could ahead of Hurricane Melissa in order to minimise their losses. The agriculture ministry has sent out advisories and teams from the Rural Agricultural Development Authority have been on the ground visiting with farmers. Farmers have been told to clear drains so they can get rid of the excess water and prop up their plants."
        },
        {
            "published_date": "2025-10-26T22:15:00",
            "title": "Researchers raise red flags after observing concerning shift in crocodile behavior — here's what's happening",
            "author": "Alyssa Ochs",
            "url": "https://www.yahoo.com/news/articles/researchers-raise-red-flags-observing-221500911.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/gioviWNqA0pxaRF8lZLiCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/e974ee435973fd4677276e41b3337eba",
            "country": "US",
            "language": "en",
            "summary": "Researchers in Far North Queensland, Australia, noticed a change in crocodile behavior in response to increasing temperatures. They found that crocodiles engaged in more cool behaviors because of the warming temperatures. Conservationists are working to create safer environments for wildlife and support biodiversity as temperatures continue to rise."
        },
        {
            "published_date": "2025-10-26T22:05:40",
            "title": "Have moth populations increased this year?",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-10-27/have-moth-populations-increased-this-year-/105937164",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/63d4c681dd3516b0721063c47c8b67c9?impolicy=wcms_watermark_news&cropH=2280&cropW=4054&xPos=0&yPos=211&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Sydneysiders are reporting increased numbers of moths as the weather warms up. Entomologist Andrew Mitchell is an expert in moths at the Australian Museum explains to ABC NewsRadio's Sarah Morice how the moth population might be getting bigger. "
        },
        {
            "published_date": "2025-10-26T21:50:00",
            "title": "Co2 Emissions From Us Meat Production – Greater than Italy's Total Emissions",
            "author": "",
            "url": "https://ground.news/article/co2-emissions-from-us-meat-production-greater-than-italys-total-emissions",
            "url_media": "https://ground.news/_next/static/media/warningCircle.09b1bcdd.svg",
            "country": "US",
            "language": "en",
            "summary": "US-Americans love meat, but it travels halfway through the country. A huge CO2 imprint is added up from the feed field to the city, and from the city to the farm, which is not good for the environment. It's also bad for the atmosphere."
        },
        {
            "published_date": "2025-10-26T21:28:55",
            "title": "Hurricane Melissa: Category 4 Threat to Caribbean Islands",
            "author": "",
            "url": "https://www.archyde.com/hurricane-melissa-category-4-threat-to-caribbean-islands",
            "url_media": "https://s.france24.com/media/display/1b6dc4b0-b2a8-11f0-bf16-005056a97e36/w:1024/p:16x9/2025-10-26T131851Z-2025841603-RC2HJHAB7HCL-RTRMADP-3-STORM-MELISSA.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa's path across the Caribbean is directly linked to climate change. The financial toll of these storms is outpacing traditional disaster relief models, demanding a radical shift in preparedness and long-term resilience strategies. The increasing frequency and severity of hurricanes is creating a crisis in the insurance industry. Investing in resilient infrastructure is paramount. Tourism is a vital economic driver for Caribbean nations, but the increasing threat of hurricanes poses a significant risk."
        },
        {
            "published_date": "2025-10-26T21:17:46",
            "title": "Global change starts at home: Global Zero Waste Forum 2025",
            "author": "Daily Sabah",
            "url": "https://article.wn.com/view/2025/10/26/Global_change_starts_at_home_Global_Zero_Waste_Forum_2025",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "The world is at an irreversible turning point driven by humanity's consumption-based habits, climate change and artificially created needs, which is why environmental issue is an environmental problem. The world is on the verge of a turning point due to climate change, pollution and artificial created needs."
        },
        {
            "published_date": "2025-10-26T20:57:14",
            "title": "New animation shows First Nations leadership on climate change",
            "author": "The National Tribune",
            "url": "https://nativeamericans.einnews.com/article_detail/861766146/1gik6Ma8utEcEV9s",
            "url_media": "https://images.unsplash.com/photo-1614288231884-48eb03fcdf45?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1124&q=80",
            "country": "UA",
            "language": "en",
            "summary": "Aboriginal and Torres Strait Islander people have cared for Country for over 65,000 years. Their deep knowledge, passed down through generations, teaches when seasons change, when rivers rise, and how to protect land, water and communities. Today, climate change is creating new challenges. Seasons are shifting. Country is under stress. First Nations people are using Traditional Knowledge and new technologies to keep Country and communities strong. Community-led management of Country can help us live well."
        },
        {
            "published_date": "2025-10-26T20:30:45",
            "title": "Hurricane Melissa: Jamaica Braces for Strengthening Storm",
            "author": "",
            "url": "https://www.archyde.com/hurricane-melissa-jamaica-braces-for-strengthening-storm",
            "url_media": "https://i0.wp.com/www.archyde.com/wp-content/uploads/2025/05/jamescarternews-40x40.png?resize=40%2C40&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The Atlantic hurricane season is starting earlier and ending later, with storms rapidly intensifying at an alarming rate. Warmer ocean temperatures, fueled by climate change, provide more energy for these storms, allowing them to strengthen at an unprecedented pace. Traditional understanding of hurricane season – June 1st to November 30th – is becoming blurred, with activity extending beyond these dates. Jamaica's current situation with Hurricane Melissa highlights the vulnerability of island nations to extreme weather events. Investments in early warning systems, improved building codes, and coastal protection measures can significantly reduce the impact of future storms."
        },
        {
            "published_date": "2025-10-26T20:06:55",
            "title": "Hurricane Melissa claims three lives, with 6 injured in Haiti",
            "author": "Cnw Reporter",
            "url": "https://www.caribbeannationalweekly.com/news/hurricane-melissa-claims-three-lives-with-6-injured-in-haiti",
            "url_media": "https://www.caribbeannationalweekly.com/wp-content/uploads/2025/10/3d1d056a-84fd-4087-a633-b1e9c47e6b3e_c8421fee.webp",
            "country": "US",
            "language": "en",
            "summary": "Three people have died and six others were injured in Haiti as a result of Hurricane Melissa. The United Nations Central Emergency Response Fund (UNCERF) announced Thursday it is releasing $4 million to assist more than 100,000 Haitians at risk from Tropical Storm Melissa."
        },
        {
            "published_date": "2025-10-26T19:55:12",
            "title": "Melissa strengthens into a Category 4 hurricane, threatening catastrophic flooding in Jamaica, Haiti",
            "author": "",
            "url": "https://www.shorelinemedia.net/ludington_daily_news/videos/melissa-strengthens-into-a-category-4-hurricane-threatening-catastrophic-flooding-in-jamaica-haiti/video_e5a08b1a-ebbf-519f-8838-ead1ddba0e84.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/shorelinemedia.net/content/tncms/assets/v3/editorial/e/5a/e5a08b1a-ebbf-519f-8838-ead1ddba0e84/68fe7f91cda89.preview.jpg?crop=1280%2C672%2C0%2C23&resize=438%2C230&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "People in Jamaica are preparing as Hurricane Melissa strengthens into a major Category 4 hurricane. The storm is threatening catastrophic flooding in the northern Caribbean. The video may be available for archive licensing via https://newsroom.ap.org/home.    . "
        },
        {
            "published_date": "2025-10-26T19:20:06",
            "title": "Chinese premier urges Albanese to deepen co-operation with Beijing",
            "author": "Emma McGrath-Cohen",
            "url": "https://www.afr.com/politics/federal/trump-touts-peace-deal-on-asean-fly-by-20251024-p5n52y",
            "url_media": "https://static.ffx.io/images/$zoom_0.4731%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_453%2C$y_448/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_live_no_age_social_wm/f16fc970c7229f3acfaf464822faa3ccef9a5440",
            "country": "AU",
            "language": "en",
            "summary": "Li Qiang and Albanese met on the sidelines of the ASEAN forum in Kuala Lumpur on Monday. Albanese's visit to Beijing in July had received 'a lot of attention and acclaim' for the Australia-China relationship. Albaniaese said the two countries had shared interests across trade, climate change, tourism and people-to-people links."
        },
        {
            "published_date": "2025-10-26T19:19:16",
            "title": "'Succession' Star Fisher Stevens Explains Why He Moved to U.K.",
            "author": "Stephanie Kaloi",
            "url": "https://www.usmagazine.com/celebrity-news/news/succession-star-fisher-stevens-explains-why-he-moved-to-u-k",
            "url_media": "https://www.usmagazine.com/wp-content/uploads/2025/10/fisher-stevens-2219398728.jpg?crop=0px%2C405px%2C3334px%2C1753px&resize=1200%2C630&quality=86&strip=all",
            "country": "US",
            "language": "en",
            "summary": "Fisher Stevens moved his family to London about eight weeks ago. The actor played Hugo Baker on the HBO series \"Waystar Royco comms head Hugo Baker\" He and his wife Alexis Bloom are working on a documentary about deforestation and logging in the Amazon. Many celebrities have moved out of the United States in recent years in response to the current political climate. Ellen Degeneres, Rosie O'Donnell and Eva Longoria are staying in England."
        },
        {
            "published_date": "2025-10-26T19:00:00",
            "title": "CLAIM: Deep emission cuts will pushback sea level rise",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/10/26/10348904",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/10/king-canute-commands-the-sea.jpg?fit=1024%2C512&quality=83&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "IIASA, the UK, Belgium, The Netherlands, Germany, and the Netherlands Institute of Sea Research published a study in Nature Climate Change. It shows that near-term mitigation could spare future generations around 0.6 meters of sea-level rise between 2020 and 2090. Extending emissions on this trajectory until 2090 would lock in a global rise of about 0.8 meters, of which roughly 0.3 meters could still be avoided if the world started emissions reductions consistent with the Paris Agreement now."
        },
        {
            "published_date": "2025-10-26T18:55:00",
            "title": "UN agency says CO2 levels hit record high last year, causing more extreme weather",
            "author": "JAMEY KEATEN",
            "url": "https://www.yoursun.com/ap/international/un-agency-says-co2-levels-hit-record-high-last-year-causing-more-extreme-weather/article_40c965c6-cc63-50e8-9cc4-10c04f0dde02.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/yoursun.com/content/tncms/assets/v3/editorial/8/89/889bb7d4-6293-5247-866c-f8ccd4f4353d/68f111dd7cd8a.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere jumped by the highest amount on record last year. CO2 growth rates have tripled since the 1960s and reached levels more than 800,000 years ago, according to the World Meteorological Organization. The study was released ahead of the UN's annual climate conference."
        },
        {
            "published_date": "2025-10-26T18:53:43",
            "title": "Melissa will impact eastern Cuba as a major hurricane: Get the latest update",
            "author": "Ciber Cuba Editorial Team",
            "url": "https://en.cibercuba.com/noticias/2025-10-26-u1-e208512-s27061-nid313641-melissa-impactara-oriente-cuba-huracan-mayor-conoce",
            "url_media": "https://cdn0.celebritax.com/sites/default/files/styles/watermark_100/public/1761503861-melissa-impactara-oriente-cuba-huracan-mayor-conoce-ultimo-parte.jpg",
            "country": "ES",
            "language": "en",
            "summary": "Hurricane Melissa is intensifying and is expected to make landfall in Jamaica on Monday night or Tuesday morning and in southeastern Cuba late on Tuesday evening. It has maximum sustained winds near 140 mph (220 km/h) and hurricane-force winds that extend outward up to 25 miles (35 km) from the center. The hurricane will impact the eastern part of Cuba, with total rainfall accumulations of 10 to 15 inches and local amounts of up to 20 inches."
        },
        {
            "published_date": "2025-10-26T18:30:00",
            "title": "In a California farming region, researchers are mapping rural heat to protect farmworkers",
            "author": "DORANY PINEDA",
            "url": "https://omaha.com/news/nation-world/science/article_45074024-164b-569c-ac28-576780066a7e.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/omaha.com/content/tncms/assets/v3/editorial/4/50/45074024-164b-569c-ac28-576780066a7e/68fbc72013539.preview.jpg?crop=1678%2C881%2C52%2C96&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Raul Cruz starts his day at 4 a.m. in the Imperial Valley sugarcane field in Niland, California. He chops, cleans and bundles the crop, taking heed as the sun rises. It's hard work, but it's the safest thing when temperatures soar into the triple digits."
        },
        {
            "published_date": "2025-10-26T18:26:08",
            "title": "Guantánamo is preparing to evacuate more than 100,000 people, mostly to the homes of family and friends",
            "author": "Ciber Cuba Editorial Team",
            "url": "https://en.cibercuba.com/noticias/2025-10-26-u1-e208512-s27061-nid313640-guantanamo-prepara-evacuar-100-mil-personas-mayoria",
            "url_media": "https://cdn0.celebritax.com/sites/default/files/styles/watermark_100/public/1761502892-guantanamo-prepara-evacuar-100-mil-personas-mayoria-casas-familiares-amigos.jpg",
            "country": "ES",
            "language": "en",
            "summary": "Guantánamo will evacuate 139,000 people, 108,000 of them seeking shelter in the homes of relatives and friends. The Boca de Jauco bridge collapsed in Maisí, limiting the municipality's access by land. Hurricane Melissa has reached category 4 on the Saffir-Simpson scale and is moving slowly towards the west at 7 km/h. It is expected to turn north and northeast between Monday and Tuesday, coming dangerously close to eastern Cuba."
        },
        {
            "published_date": "2025-10-26T18:19:00",
            "title": "Greenfinches will thrive in your garden if you scatter 1 seed",
            "author": "Kris Boratyn",
            "url": "https://www.express.co.uk/life-style/garden/2125125/how-to-attract-greenfinches-to-gardens-favourite-seed",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/13/1200x630/6508419.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Greenfinches are the largest yellow-green finches in Europe. Their numbers fell by 67% between 2008 and 2018 due to a disease called trichomonosis. Greenfinches love sunflower seeds and peanuts. They are on the UK's red list for conservation, so it's important to keep their feeding areas clean."
        },
        {
            "published_date": "2025-10-26T18:00:32",
            "title": "‘The Blob' over Pacific Ocean could lead to snowy, frigid winter in Chicago area",
            "author": "Kevin Jeanes",
            "url": "https://www.nbcchicago.com/weather/stories/the-blob-over-pacific-ocean-could-lead-to-snowy-frigid-winter-in-chicago-area/3843690",
            "url_media": "https://media.nbcchicago.com/2022/02/GettyImages-1368259357.jpg?quality=85&strip=all&resize=1200%2C675",
            "country": "US",
            "language": "en",
            "summary": "'The Blob' is a marine heat wave over the Pacific Ocean, driving temperatures way above their average for a roughly 5,000-mile stretch of water spanning from Japan to Alaska. The ocean is absorbing heat created by human-caused climate change. The large mass of warm water creates higher air pressure, which pushes the Pacific jet stream further north over the ocean and along the Pacific coast of the United States. The jet stream then dips southward toward the Midwest, and storm systems are funneled down the jet stream and into the Chicago area."
        },
        {
            "published_date": "2025-10-26T18:00:00",
            "title": "Thriving reefs, plummeting climate deaths: Data tells different story as Canberra, The Guardian frighten citizens with global warming ‘sermon of doom'",
            "author": "John Mac Ghlionn",
            "url": "https://www.skynews.com.au/insights-and-analysis/thriving-reefs-plummeting-climate-deaths-data-tells-different-story-as-canberra-the-guardian-frighten-citizens-with-global-warming-sermon-of-doom/news-story/489e2f6650c6f55dd795df6c5bf967ad",
            "url_media": "https://content.api.news/v3/images/bin/3119fcae64ccc91f9391bd7000a323e7",
            "country": "AU",
            "language": "en",
            "summary": "The Guardian's latest climate warning reads like scripture for the secular and the simple-minded. It's less science than stagecraft — fear masquerading as fact. Recent studies suggest the situation is not nearly as dire as we have been led to believe. The Guardian and other left-leaning outlets know frightened citizens are easier to steer and convert."
        },
        {
            "published_date": "2025-10-26T18:00:00",
            "title": "Farmers, Nats bristle at Labor's climate czar call to end diesel rebates",
            "author": "Jason Gregory",
            "url": "https://www.farmonline.com.au/story/9096052/climate-czar-labels-diesel-fuel-rebate-scheme-insane",
            "url_media": "https://www.farmonline.com.au/images/transform/v1/crop/frm/230597393/695a3fdf-d5ce-48af-b6a8-f64647287521.jpeg/r0_297_4256_2531_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Farmers are at risk of being caught in the crossfire with Australia's diesel fuel tax credit scheme. Climate Change Authority chairman Matt Kean has labelled it an \"insane\" policy setting this week and has criticised it as a fuel subsidy scheme for farmers."
        },
        {
            "published_date": "2025-10-26T17:10:11",
            "title": "If you can't be a good role model...",
            "author": "Rich Snowdon",
            "url": "https://www.dailykos.com/story/2025/10/26/2350547/-If-you-can-t-be-a-good-role-model",
            "url_media": "https://cdn.prod.dailykos.com/images/1492791/story_image/KOSterriblewarning10-25-25.png?1761496177",
            "country": "US",
            "language": "en",
            "summary": "Canada is transforming its economy and coming into its own on the world stage. The EU is getting its act together and taking charge of its future. Australia was headed down the dead-end street of racist Trumpism, but they pulled back in the nick of time. Other nations are bolstering themselves against their right-wing parties. New trade agreements are springing up all around the world."
        },
        {
            "published_date": "2025-10-26T16:30:00",
            "title": "Antarctic Amundsen-Scott Station Sees Coldest October in 44 Years…Mainstream Media Silent!",
            "author": "Eric",
            "url": "https://www.sgtreport.com/2025/10/antarctic-amundsen-scott-station-sees-coldest-october-in-44-yearsmainstream-media-silent",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/07/Antarctica-NASA-image.png?w=827&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The Amundsen-Scott South Pole Station registered a temperature of minus 61.3 degrees Celsius on October 15. It's springtime and temperatures should be on the rise. CNN reported in 2021 that the continent had experienced its coldest winter since records began. Natural factors like stratospheric waves, polar vortex stability and cloud cover are the actual drivers of weather events."
        },
        {
            "published_date": "2025-10-26T15:40:50",
            "title": "AP News Summary at 11:40 a.m. EDT",
            "author": "",
            "url": "https://thefacts.com/ap_news/nation/ap-news-summary-at-11-40-a-m-edt/article_72513c90-8bb1-5bd5-ad1d-f3840176b418.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thefacts.com/content/tncms/custom/image/9c84975c-ae33-11e9-ad17-4b15a651296c.png?resize=200%2C57",
            "country": "US",
            "language": "en",
            "summary": "Melissa has strengthened into a major Category 4 hurricane. It is expected to reach Jamaica's southern coast late Monday or Tuesday morning. The storm has already caused fatalities in Haiti and the Dominican Republic. Authorities in Jamaica have activated shelters and closed Kingston's Norman Manley International Airport."
        },
        {
            "published_date": "2025-10-26T15:37:00",
            "title": "Hurricane Melissa: Category 4 storm rapidly intensifies, Jamaica and Haiti brace for major impact",
            "author": "Hindustan Times",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_Category_4_storm_rapidly_intensifies_Jamai",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa is rapidly intensifying in the Caribbean Sea. The storm is now a Category 4 hurricane. It is expected to cause extensive damage and long-duration power and communication outages, and potentially prolonged isolation of communities.   Â   "
        },
        {
            "published_date": "2025-10-26T15:31:15",
            "title": "Cyclone Montha threatens paddy harvest in Anakapalli district",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/news/cities/Visakhapatnam/cyclone-montha-threatens-paddy-harvest-in-anakapalli-district/article70205267.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/nusr8p/article70205741.ece/alternates/LANDSCAPE_1200/DSC_5370.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Cyclone Montha is expected to make landfall between the Kakinada and Visakhapatnam coasts on the night of October 28. The current kharif season is in its final stage, with paddy nearing harvest. Cultivation is concentrated in mandals such as Ravikamatham, Madugula, Yelamanchili, Cheedikada, Buchayyapeta, and K. Kotapadu. Anakapalli District Collector held emergency meetings with officials over the weekend."
        },
        {
            "published_date": "2025-10-26T15:29:23",
            "title": "Decline in Extinction Rates: Understanding the Change and What It Means for Conservation Efforts",
            "author": "Dr. Priya Deshmukh",
            "url": "https://www.archyde.com/decline-in-extinction-rates-understanding-the-change-and-what-it-means-for-conservation-efforts",
            "url_media": "https://www.futurity.org/wp/wp-content/uploads/2025/10/extinction-rates-1600.jpg",
            "country": "US",
            "language": "en",
            "summary": "New research shows that global extinction rates are declining across many animal and plant groups. Extinctions are more common on islands and less common on mainland continents. Mollusks and vertebrates have experienced the highest extinction rates, while arthropods and plants have experienced relatively low rates."
        },
        {
            "published_date": "2025-10-26T15:25:56",
            "title": "Hurricane Melissa intensifying off coast. Will Myrtle Beach area be affected?",
            "author": "Alexa Lewis",
            "url": "https://www.myrtlebeachonline.com/news/weather/hurricane/article312651171.html",
            "url_media": "https://www.myrtlebeachonline.com/akam/13/pixel_3ee9a8a9?a=dD1lM2Y3ZTA2NjI5NGNkOWZhYTFiYjQ3NWMyNDU2OThhZjJmMjhmYTFhJmpzPW9mZg==",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa is intensifying into a Category 4 storm in the Atlantic. It will stay far away from Grand Strand shores, but it will bring higher rip current risks to Myrtle Beach area next weekend. The area will see some rain from other systems this week, including showers late Sunday through Monday."
        },
        {
            "published_date": "2025-10-26T15:05:26",
            "title": "Odisha Prepared to Tackle Cyclone Montha Fury, 128 Teams Mobilised in 8 Red Zone Dists",
            "author": "Yajati Rout",
            "url": "https://pragativadi.com/odisha-prepared-to-tackle-cyclone-montha-fury-128-teams-mobilised-in-8-red-zone-dists",
            "url_media": "https://pragativadi.com/wp-content/uploads/2025/10/WhatsApp-Image-2025-10-26-at-20.01.44.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Odisha government has held a preparatory meeting to address the potential cyclone. The meeting involved all 30 districts to cover pre-cyclone preparations and response strategies. The cyclone is expected to severely impact eight southern Odisha districts: Malkangiri, Koraput, Rayagada, Ganjam, Gajapati, Kandhamal, Kalahandi, and Nabarangpur. 128 teams from ODRAF, NDRF, and fire services have been deployed across these eight districts. Elderly people and children are being shifted to safe locations in advance, while expectant mothers are being accommodated at local primary health centres. Residents in high-altitude areas"
        },
        {
            "published_date": "2025-10-26T15:00:58",
            "title": "In Ocoa: Coffee growers describe the situation in coffee-growing areas as 'disastrous' due to rain.",
            "author": "Merit Designs Consulting Group",
            "url": "https://dominicantoday.com/dr/economy/2025/10/26/in-ocoa-coffee-growers-describe-the-situation-in-coffee-growing-areas-as-disastrous-due-to-rain",
            "url_media": "https://dominicantoday.com/wp-content/uploads/2025/10/68fd48cb9b7a3.jpeg",
            "country": "DO",
            "language": "en",
            "summary": "Hurricane Melissa caused heavy rains in the coffee-growing area of the Quita Sueño section of the Rancho Arriba municipality in the province of San José de Ocoa. Hundreds of quintals of coffee have fallen due to the rainfall. Many farmers are stranded on their farms because of the lack of drying tunnels and the destruction of local roads. The overflowing of the Nizao River near Montenegro has blocked access to several communities."
        },
        {
            "published_date": "2025-10-26T14:30:51",
            "title": "Cyclone Montha: 110 fisherfolk evacuated from Hope Island in Kakinada Bay",
            "author": "Appala Naidu Tippana 10237",
            "url": "https://www.thehindu.com/news/national/andhra-pradesh/cyclone-montha-110-fisherfolk-evacuated-from-hope-island-in-kakinada-bay/article70205020.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/x4cu3k/article70205308.ece/alternates/LANDSCAPE_1200/10237_26_10_2025_18_29_34_1_HOPEISLAND.JPG",
            "country": "IN",
            "language": "en",
            "summary": "At least 110 fisherfolk from Hope Island in the Kakinada Bay were evacuated and relocated to Toorangi village. The fishermen make a living through traditional fishing in the Bay of Bengal and the Godavari estuary. The relocated families will remain in the rehabilitation centre until further orders."
        },
        {
            "published_date": "2025-10-26T13:46:50",
            "title": "Asia's Carbon Emissions: Effects on Climate and Sea Levels",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/asias-carbon-emissions-effects-on-climate-and-sea-levels",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/10/Asia8217s-Carbon-Emissions-Effects-on-Climate-and-Sea-Levels-1761486414.jpg",
            "country": "TR",
            "language": "en",
            "summary": "A new study has been published in Environmental Science and Pollution Research. It explains the relationship between carbon dioxide and methane emissions and their regional and global effects on the climate. The authors argue that both gases contribute to the greenhouse effect, leading to global warming, but there are regional variances in their impacts. They suggest that reducing reliance on fossil fuels, investing in renewable energy sources and sustainable agricultural practices can substantially lower emissions."
        },
        {
            "published_date": "2025-10-26T13:30:24",
            "title": "Marine Institute Pinpoints Cause of Recent Ocean Warming",
            "author": "Beth Fagan",
            "url": "https://vocm.com/2025/10/26/283192",
            "url_media": "https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2025/10/signal-hill-ocean.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Marine Institute study looked at data from July to October of 2023. It found that there were a series of marine heat waves on the Newfoundland and Labrador shelf. The study's co-author Dr. Frédéric Cyr describes the ocean as being like a cake, with the top layer absorbing heat from the sun."
        },
        {
            "published_date": "2025-10-26T13:00:00",
            "title": "CLAIM: Increasing heat is super-charging Arctic climate and weather extremes",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/10/26/claim-increasing-heat-is-super-charging-arctic-climate-and-weather-extremes",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/10/algore-flamethrower.webp?fit=1024%2C512&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The annual mean warming rate of the Arctic is more than three times the global average. Since the year 2000 the probability of atmospheric heatwaves has increased by 20%, Atlantic Ocean layer warm events have increased by 76%, sea ice loss events increased by 83%, and Greenland Ice Sheet melt extent increased by 68%."
        },
        {
            "published_date": "2025-10-26T13:00:00",
            "title": "Highland gulls row divides opinion - people must adapt or call in pest control?",
            "author": "Gregor White",
            "url": "https://www.inverness-courier.co.uk/news/humans-need-to-learn-to-live-with-wild-animals-hitting-ba-417347",
            "url_media": "https://www.inverness-courier.co.uk/_media/img/7LR2BCIZBZJQTY1RJE1T.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Douglas Ross is angry over a drop in the number of licences granted to control urban seagull numbers. Dr Becky Baird is concerned about the possibility of further North Sea oil and gas operations. Jeff Card's wife tripped and fell on the road in Inverness."
        },
        {
            "published_date": "2025-10-26T12:39:46",
            "title": "Coastal low expected to impact the Outer Banks",
            "author": "Submitted Story",
            "url": "https://www.outerbanksvoice.com/2025/10/26/coastal-low-expected-to-impact-the-outer-banks",
            "url_media": "https://www.outerbanksvoice.com/wp-content/uploads/2025/10/10-26-nws-max-wind-gusts.jpg",
            "country": "US",
            "language": "en",
            "summary": "Coastal low expected to impact the Outer Banks this week. Gale Watch is in effect for all coastal waters and inland Sounds/Rivers in ENC. Strong winds out of the northeast are expected Monday to Wednesday, peaking Tuesday. Highest rainfall totals are expected along the coast, decreasing inland."
        },
        {
            "published_date": "2025-10-26T12:09:00",
            "title": "Cork's coastal roads 'under increasing pressure' from climate change",
            "author": "Sean O Riordan",
            "url": "https://www.irishexaminer.com/news/arid-41731002.html",
            "url_media": "https://www.irishexaminer.com/cms_media/module_img/9671/4835565_8_seoimageog_LC_20pilmore_20cottages_2008.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Cork County Council is taking steps to protect its coastal roads as global warming intensifies. A report into the impact of coastal erosion in the region is almost complete. A second report will be published in 2027 and will look at the likely impacts of higher sea levels, warmer seas, and increasingly violent storms."
        },
        {
            "published_date": "2025-10-26T11:31:28",
            "title": "Cyclone Montha to bring heavy rain, red warning for 5 Odisha districts",
            "author": "Rajendra Mohapatra",
            "url": "https://odishatv.in/odisha/cyclone-montha-to-bring-heavy-rain-red-warning-for-5-odisha-districts-10595138",
            "url_media": "https://img-cdn.publive.online/fit-in/1280x960/filters:format(webp)/odishatv/media/post_attachments/uploadimage/library/16_9/16_9_0/recent_photo_1751203720.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Cyclone Montha is moving towards Odisha. IMD has issued a Red Warning for Malkangiri, Koraput, Rayagada, Gajapati, and Ganjam districts on October 28. Orange Alert has been sounded for Nabarangpur, Kalahandi, Kandhamal, Nayagarh, Khordha, and Puri on October 29. The sea will remain very rough under the cyclone's influence. Fishermen advised not to venture into the sea from October 26 onwards."
        },
        {
            "published_date": "2025-10-26T10:41:00",
            "title": "The gorgeous European island that's the hottest in winter",
            "author": "Lauran O'Toole",
            "url": "https://www.express.co.uk/travel/articles/2126069/gorgeous-european-island-thats-hottest-in-winter",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/25/1200x630/6513166.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The Canary Islands are the ultimate sunshine spot during the winter. Tenerife, Gran Canaria and Lanzarote are three of the most popular islands among visitors. Airlines like Ryanair and Easyjet offer flights to and from the islands for under £100. Madrid averages 10C in November, while London sits at around 14C in October."
        },
        {
            "published_date": "2025-10-26T10:19:59",
            "title": "Recent Global Warming Mostly Due To Natural Factors, New Study Finds",
            "author": "P Gosselin",
            "url": "https://notrickszone.com/2025/10/26/recent-global-warming-mostly-due-to-natural-factors-new-study-finds",
            "url_media": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png",
            "country": "DE",
            "language": "en",
            "summary": "Ad Huijser's recent paper challenges the widely held assumption that rising greenhouse gas (GHG) concentrations are the sole, or even the primary, drivers of recent global warming. Two-thirds of the observed global warming must be attributed to natural factors that increase incoming solar radiation, and one-third to the rising GHG concentrations."
        },
        {
            "published_date": "2025-10-26T10:18:20",
            "title": "Melissa strengthens to major hurricane",
            "author": "Perry Groten",
            "url": "https://www.keloland.com/news/national-world-news/melissa-strengthens-to-major-hurricane",
            "url_media": "https://www.keloland.com/wp-content/uploads/sites/103/2023/06/hurricane-_1530463789233_47339741_ver1.0.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "Melissa has strengthened into a major Category 4 hurricane. It's expected to reach the southern coast of Jamaica on Tuesday morning. The erratic and slow-moving storm has killed at least three people in Haiti and a fourth person in the Dominican Republic. Another person remains missing."
        },
        {
            "published_date": "2025-10-26T10:10:56",
            "title": "Gore's 'Inconvenient Truth' has come to pass",
            "author": "",
            "url": "https://qconline.com/article_48c31fbe-8c1b-50e0-978e-8e4a917b85e6.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/qconline.com/content/tncms/custom/image/d865ccfe-9f51-11e5-b21d-1fcfe817a822.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "\"An Inconvenient Truth\" by Al Gore described the science behind climate change. Everything he warned us about has come true. Warmer oceans, heavier rainfalls and flooding, areas of drought with forest fires, growing hunger around the world, stronger and more destructive hurricanes and tornadoes, melting glaciers and rising sea levels encroaching on coasts."
        },
        {
            "published_date": "2025-10-26T09:45:33",
            "title": "Climate summit: Lagos to unlock funding for ocean sustainability",
            "author": "Obinna Emelike",
            "url": "https://businessday.ng/life/article/climate-summit-lagos-to-unlock-funding-for-ocean-sustainability",
            "url_media": "https://cdn.businessday.ng/wp-content/uploads/2025/10/International-Climate-Change-Summit.png",
            "country": "NG",
            "language": "en",
            "summary": "Lagos State will host the 2025 International Climate Change Summit. The theme of the event is 'Blue Economy, Green Money: Financing Africa's Coastal Resilience and Ocean Innovation'. It will focus on the blue economy, green finance, innovation and youth empowerment, and partnerships. It is expected to attract over 1,200 delegates from across Africa and beyond."
        },
        {
            "published_date": "2025-10-26T09:43:18",
            "title": "Glaciers' secret cooling power won't last much longer",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/10/26/Glaciers_secret_cooling_power_won_t_last_much_longer",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Scientists have discovered that glaciers can temporarily cool the air around them. This self-cooling may delay some of the effects of global warming, according to the scientists.    .      in this way, glaciers can delay some effects of climate change."
        },
        {
            "published_date": "2025-10-26T09:08:20",
            "title": "How Hurricane Helene in Appalachia showed us a way to heal our nation",
            "author": "Knox News",
            "url": "https://article.wn.com/view/2025/10/26/How_Hurricane_Helene_in_Appalachia_showed_us_a_way_to_heal_o",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Kron Hicks lost her Carter County home to Hurricane Helene flooding in September 2024. She is now living in Hampton, in a time when headlines and social media shout, \"Who is my neighbor?    .   in this time of crisis. "
        },
        {
            "published_date": "2025-10-26T09:05:06",
            "title": "Cyclone Montha looms: NDRF teams rushed to coastal Andhra, IMD warns of heavy rain in Bengal",
            "author": "Ibt News Desk",
            "url": "https://www.ibtimes.co.in/cyclone-montha-looms-ndrf-teams-rushed-coastal-andhra-imd-warns-heavy-rain-bengal-891273",
            "url_media": "https://data1.ibtimes.co.in/en/full/823441/cyclone-montha-looms-ndrf-teams-rushed-coastal-andhra-imd-warns-heavy-rain-bengal.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Andhra Pradesh is on high alert for Cyclone Montha. The cyclone is expected to make landfall near Kakinada on the Andhra Pradesh coast on Monday. The state has suspended fishing and boating activities along the seashores and prohibited tourist access to beaches. NDRF and SDRF teams have been deployed to vulnerable districts, and mobile hospitals have been readied. The Uppada Beach Road has been closed and the district administration has canceled officials' leaves until October 30."
        },
        {
            "published_date": "2025-10-26T09:00:00",
            "title": "How humans almost vanished from Earth in 70,000 BCE due to volcanic winter and population collapse",
            "author": "TOI Science Desk",
            "url": "https://timesofindia.indiatimes.com/science/how-humans-almost-vanished-from-earth-in-70000-bce-due-to-volcanic-winter-and-population-collapse/articleshow/124822054.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-124822169,width-1070,height-580,imgsize-36034,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "70,000 years ago, early humans faced a near-extinction event due to the eruption of the Toba supervolcano in Sumatra, Indonesia. Global populations may have dropped to as few as 5,000 to 10,000 individuals, with some estimates suggesting only 1,000 reproductive adults, approximately 40 breeding pairs. This population bottleneck greatly reduced genetic diversity, leaving early humans vulnerable to environmental stresses. It took tens of thousands of years for populations to increase."
        },
        {
            "published_date": "2025-10-26T08:38:09",
            "title": "Cyclone Montha: Srikakulam, Vizianagaram district officials gear up",
            "author": "K Srinivasa Rao",
            "url": "https://www.thehindu.com/news/national/andhra-pradesh/cyclone-montha-srikakulam-vizianagaram-district-officials-gear-up/article70204197.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/n59nz5/article70204448.ece/alternates/LANDSCAPE_1200/Untitled%20design.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The officials of Srikakulam and Vizianagaram districts are prepared to minimise the possible damage due to the impact of cyclone 'Montha'. The cyclone is expected to hit Kakinada coast by the night of October 28, 2025. A control room has been set up to monitor vulnerable areas. The district has been hit by Hud-Hud, Titli and other cyclones."
        },
        {
            "published_date": "2025-10-26T07:06:24",
            "title": "🌱 Patch AM: Virginians urge action to safeguard FEMA funding",
            "author": "Patch AM Team",
            "url": "https://patch.com/virginia/annandale/patch-am-virginians-urge-action-safeguard-fema-funding-nodx-20251026",
            "url_media": "https://patch.com/img/cdn20/assets/layout/am_sunday_1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Richmond leaders and advocates call for Governor Youngkin to protect FEMA amid concerns over potential cuts and restructuring by the federal government. Trunk or Treat is on today's calendar. Today's riddle is \"What did the football coach say to the vending machine?\""
        },
        {
            "published_date": "2025-10-26T07:06:09",
            "title": "Salt-tolerant farming, educational aid key to tackling coastal, urban poverty",
            "author": "",
            "url": "https://www.bssnews.net/others/325075",
            "url_media": "https://www.bssnews.net/assets/news_photos/2025/10/26/image-325075-1761462187.jpg",
            "country": "BD",
            "language": "en",
            "summary": "People in Bangladesh's south-western coastal belt are facing acute livelihood and health crises as the impacts of climate change intensify. Lack of jobs, safe drinking water, and sanitation has forced many families to leave their ancestral homes for urban slums. Children in these slums are especially vulnerable, dropping out of school and joining the labor force."
        },
        {
            "published_date": "2025-10-26T07:03:16",
            "title": "Will solar sun flowers lead to greener energy?",
            "author": "The Malta Independent",
            "url": "https://article.wn.com/view/2025/10/26/Will_solar_sun_flowers_lead_to_greener_energy",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Malta's energy supply mix is made of burning Natural Gas. Fossil fuels are one of the main drivers of the current global warming, according to the Business Today article. The article quotes an article in Business Today about Malta's energy supplies mix.  "
        },
        {
            "published_date": "2025-10-26T06:51:15",
            "title": "Hurricane Melissa intensifies, threatens catastrophic flooding in Jamaica, Haiti",
            "author": "India Today",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_intensifies_threatens_catastrophic_floodin",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa is intensifying and threatens to cause catastrophic flooding in Jamaica and Haiti. It's expected to make landfall in either Jamaica or Haiti soon.    - Maria is a Category 4 hurricane.  - Hurricane Melissa is a powerful Category 5 hurricane with heavy rains."
        },
        {
            "published_date": "2025-10-26T06:45:11",
            "title": "A ‘burning' topic",
            "author": "Shehr",
            "url": "https://www.thenews.com.pk/tns/detail/1353568-a-burning-topic",
            "url_media": "https://www.thenews.com.pk/assets/uploads/tns/2025-10-26/1353568_070735_tns.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The practice of burning garbage heaps in open public spaces is becoming alarmingly rampant in the world's most polluted places. It's not a good idea to fight pollution with more pollution, but it's the only solution to the problem at the present time. "
        },
        {
            "published_date": "2025-10-26T05:51:09",
            "title": "Hurricane Melissa, now Category 3, threatens heavy floods in Jamaica, Haiti",
            "author": "",
            "url": "https://saudi.shafaqna.com/EN/AL/1833929",
            "url_media": "https://saudi.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Melissa is now a Category 3 hurricane. It is expected to become a major hurricane when it makes landfall in Jamaica. It could cause heavy floods in Jamaica and in Haiti.    .   i   in the Caribbean and in the Gulf of Mexico."
        },
        {
            "published_date": "2025-10-26T05:12:37",
            "title": "Storm-weary St Bess faces Melissa still reeling from Beryl",
            "author": "Albert Ferguson",
            "url": "https://jamaica-gleaner.com/article/lead-stories/20251026/storm-weary-st-bess-faces-melissa-still-reeling-beryl",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/logo2x.png",
            "country": "JM",
            "language": "en",
            "summary": "Tropical Storm Melissa is threatening Jamaica. Hurricane Beryl devastated St. Elizabeth a year ago. Castell Wright, 57, lost his home and fishing gear in the storm. He received only $150,000 in government assistance. Rebuild Jamaica initiative distributed cheques to more than 100,000 hurricane victims."
        },
        {
            "published_date": "2025-10-26T05:12:20",
            "title": "Researchers mapping rural heat to protect farmworkers",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/world-news/20251026/researchers-mapping-rural-heat-protect-farmworkers",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/jg_article_image/public/media/article_images/2025/10/26/3265230/8390520.jpg?itok=QrdqI_jq",
            "country": "JM",
            "language": "en",
            "summary": "Since the start of the 20th century, California temperatures have increased almost 3°F (about 1.7°C) and seven of the last eight years through 2024 were the warmest on record. Southern California is heating up about twice as fast as Northern California. Researchers from San Diego State University are working to understand the health consequences of heat stress on farmworkers in the Imperial and Coachella valleys."
        },
        {
            "published_date": "2025-10-26T05:00:00",
            "title": "Sunday 26 October: We chill on Sunday",
            "author": "Rtl Today",
            "url": "https://today.rtl.lu/news/luxembourg/a/2349253.html",
            "url_media": "https://www.rtl.lu/sassets/rtl2008.lu/nt/p/2025/10/25/17/14fea1005c5081443054f911af4c4ea4.jpeg",
            "country": "LU",
            "language": "en",
            "summary": "After seven days of gray weather, it's getting colder outside. I'm not a fan of it, because it's not too far from zero degrees yet.    for the time being, the weather is getting colder.  For more information, visit the National Weather Service website. "
        },
        {
            "published_date": "2025-10-26T04:53:26",
            "title": "Colder winter",
            "author": "Sentinel Digital Desk",
            "url": "https://www.sentinelassam.com/amp/story/more-news/editorial/colder-winter",
            "url_media": "https://media.assettype.com/sentinelassam-english%2F2025-10-26%2F59kc044i%2FColder-winter.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "The onset of winter in India this year may be slightly delayed because of the effects of global warming and climate change. Forecasts from the India Meteorological Department (IMD) and other weather agencies have predicted a colder and more severe-than-normal winter for 2025–2026. The shift is driven by the anticipated return of La Niña."
        },
        {
            "published_date": "2025-10-26T04:38:29",
            "title": "Deep Depression Intensifies Over Bay Of Bengal; Cyclonic Storm In Next 24 Hrs",
            "author": "Ommcom News",
            "url": "https://ommcomnews.com/odisha-news/deep-depression-intensifies-over-bay-of-bengal-cyclonic-storm-in-next-24-hrs",
            "url_media": "https://ommcomnews.com/wp-content/uploads/2025/10/Cyclone-2-1.jpg",
            "country": "IN",
            "language": "en",
            "summary": "A low-pressure system over the southeast Bay of Bengal has intensified into a Deep Depression. It is moving west-northwestwards at a speed of 10 kmph. The system is currently located 610 km west of Port Blair (Andaman & Nicobar Islands), 790 km east-southeast of Chennai (Tamil Nadu), 850 km south of Visakhapatnam, 840 km southeast of Kakinada (Andhra Pradesh), and 950 km south-southwest of Gopalpur (Odisha). It is expected to move northwestwards and intensify into a severe cyclonic storm by the morning of October 28. The forecast has prompted authorities to issue alerts and advisories"
        },
        {
            "published_date": "2025-10-26T04:36:10",
            "title": "European Space Agency's Swarm Satellites Detect Rapid Expansion in Earth's Magnetic Field Anomaly",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/european-space-agencys-swarm-satellites-detect-rapid-expansion-in-earths-magnetic-field-anomaly",
            "url_media": "https://www.notebookcheck.org/fileadmin/Notebooks/News/_nc5/South-Atlantic-Anomaly-2025.jpg",
            "country": "US",
            "language": "en",
            "summary": "New data from the Swarm satellite mission shows that Earth's magnetic fields are undergoing significant and accelerating alterations. South Atlantic Anomaly is expanding significantly. Southwest Africa has experienced a faster rate of weakening than any other part of the globe. Northern Canada's magnetic field strength has weakened, whereas Siberia's has increased. Magnetic shifts are caused by changes in the flow of molten iron within Earth's outer core."
        },
        {
            "published_date": "2025-10-26T04:23:54",
            "title": "Melissa strengthens into a Category 3 hurricane, threating catastrophic flooding in Jamaica, Haiti",
            "author": "Aaron Steckelberg",
            "url": "https://www.washingtonpost.com/world/2025/10/26/hurricane-melissa-haiti-jamaica-cuba/94f734fe-b223-11f0-ab72-a5fffa9bf3eb_story.html",
            "url_media": "https://images.outbrainimg.com/transform/v3/eyJpdSI6IjRkMWJlNWYxODg2YTQwOTQzZmFmN2NlODI3YzBmNjk1Y2QzNDc0NWNjNTY4NGM5ODJmYjM5YTQyNjk3YTAxMmQiLCJ3IjozMDAsImgiOjIwMCwiZCI6MS4wLCJjcyI6MCwiZiI6NH0.webp",
            "country": "US",
            "language": "en",
            "summary": "Melissa rapidly strengthened into a major Category 3 hurricane. It is expected to strengthen further and be a major hurricane when it makes landfall in Jamaica early next week. It should be near or over Cuba by the middle of the week. The storm is causing flooding and landslides in Jamaica and Haiti."
        },
        {
            "published_date": "2025-10-26T03:48:09",
            "title": "State fully prepared to tackle cyclone: Minister",
            "author": "Post News Network",
            "url": "https://www.orissapost.com/state-fully-prepared-to-tackle-cyclone-minister",
            "url_media": "https://www.orissapost.com/wp-content/uploads/2025/10/cyclone-Pujariii.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The cyclone brewing in the Bay of Bengal is likely to impact Odisha between October 27 and 29. NDRF, ODRAF, and Fire Services teams have been kept on alert. Vulnerable low-lying areas have been identified and cyclone shelters have been equipped with food, drinking water, cattle feed and essential medicines."
        },
        {
            "published_date": "2025-10-26T03:40:05",
            "title": "LIVE: Hurricane Melissa tracker",
            "author": "",
            "url": "https://www.mississippivalleypublishing.com/live-hurricane-melissa-tracker/video_47cc1318-6d5b-5c32-adab-e3f1add6961e.html",
            "url_media": "https://www.youtube.com/embed/zIvtlAAewAo?enablejsapi=1&origin=https://www.mississippivalleypublishing.com",
            "country": "US",
            "language": "en",
            "summary": "Melissa grew into a major Category 3 hurricane and is unleashing torrential rain in the north Caribbean Sea. Watch live tracker view as Hurricane Melissa lumbers through the Caribbean Sea on CNN iReport.com.    iReport: Hurricane Melissa tracker view."
        },
        {
            "published_date": "2025-10-26T03:29:17",
            "title": "Social protection: Investing in reform and resilience",
            "author": "Gary Gerald Mtombeni",
            "url": "https://www.thestandard.co.zw/standard-people/article/200047677/social-protection-investing-in-reform-and-resilience",
            "url_media": "https://cdn.thestandard.co.zw/images/thestandard/uploads/2025/10/91tAtUgYHmfMucnB93wslsblqw4pgK5a9bYT5P3q.jpg",
            "country": "ZW",
            "language": "en",
            "summary": "Zimbabwe's rural and urban poor are finding it difficult to adapt to climate change. Social protection is one of the most powerful tools for resilience. Zimbabwe needs a deliberate reform agenda focused on integration, innovation, and inclusivity. The Ministry of Labour and Social Welfare should collaborate closely with the ministries of Environment and Agriculture to ensure that climate adaptation projects are funded."
        },
        {
            "published_date": "2025-10-26T02:32:09",
            "title": "Catastrophic floods feared as hurricane bears down on Jamaica",
            "author": "Otago Daily Times",
            "url": "https://article.wn.com/view/2025/10/26/Catastrophic_floods_feared_as_hurricane_bears_down_on_Jamaic",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Fishing boats have been pulled ashore near the coast in Port Royal, in preparation for Hurricane Melissa. The storm is expected to make landfall on Friday.      Â   in the Port Royal area and then move on to the east coast."
        },
        {
            "published_date": "2025-10-26T01:59:07",
            "title": "Australia fiddles with fossil gas while the country swelters in record heat. It doesn't make sense",
            "author": "The Observer",
            "url": "https://article.wn.com/view/2025/10/26/Australia_fiddles_with_fossil_gas_while_the_country_swelters",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Sydney's record October heat, high winds battering Melbourne and New Zealand, algal bloom caused by South Australia's marine heatwave, coral in both the Great Barrier Reef and in Melbourne's waters due to the heatwave and high winds, and coral deaths in New Zealand."
        },
        {
            "published_date": "2025-10-26T01:31:15",
            "title": "Melissa expected to rapidly intensify into major hurricane in the Caribbean",
            "author": "NPR",
            "url": "https://www.onenewspage.com/n/US/1zs7vml4lq/Melissa-expected-to-rapidly-intensify-into-major-hurricane.htm",
            "url_media": "https://cdn.newsserve.net/en/knowledge/Caribbean_20190129.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Cuba, the Dominican Republic, Haiti and Jamaica are bracing for Hurricane Melissa. The storm is expected to grow into a powerful category 3 or stronger hurricane in the Caribbean in the next few years.      Â   2018. "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Hurricane Melissa, now Category 3, threatens heavy floods in Jamaica, Haiti",
            "author": "Al Jazeera",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_now_Category_3_threatens_heavy_floods_in_J",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Melissa has become a major Category 3 hurricane with potentially catastrophic consequences. Forecasters urge Jamaicans to take the weather threat seriously. It dropped torrential rain in the northern Caribbean and threatened disastrous flooding and landslides in Jamaica and southern Haiti. The U.S. weather forecasters warned that the lumbering hurricane is dangerous."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Ancient wetland older than Egypt's pyramids exposed on beach",
            "author": "system",
            "url": "https://article.wn.com/view/2025/10/26/Ancient_wetland_older_than_Egypts_pyramids_exposed_on_beach",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Harsh winter weather has exposed almost 100 preserved trees from an ancient wetland on an Esperance beach. There are fears over protecting the site on a popular four-wheel drive stretch of beach.       .   i   in "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Hurricane Melissa rapidly intensifying, could become Category 5 storm",
            "author": "system",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_rapidly_intensifying_could_become_Category",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Melissa is intensifying and could bring devastating effects to Jamaica and eastern Cuba in the coming days, the National Hurricane Center said Saturday night. The storm is expected to make landfall in Jamaica or Cuba within the next few days, it said. The hurricane center has a hurricane warning for Jamaica and Cuba."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "#EyeOnMelissa: MP Terrelonge oversees drain cleaning as Melissa nears",
            "author": "Jamaica Observer",
            "url": "https://article.wn.com/view/2025/10/26/EyeOnMelissa_MP_Terrelonge_oversees_drain_cleaning_as_Meliss",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Emergency preparations are underway in Alando Terrelonge's St Catherine East Central constituency due to Hurricane Melissa. Hurricane Melissa is now a Category 3 system and is moving closer to Jamaica. Terrelonges and Councillor Joy Bella Brown of Gregory Park Division are preparing for the storm."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Melissa expected to rapidly intensify into major hurricane in the Caribbean",
            "author": "National Public Radio",
            "url": "https://article.wn.com/view/2025/10/26/Melissa_expected_to_rapidly_intensify_into_major_hurricane_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cuba, the Dominican Republic, Haiti and Jamaica are bracing for Hurricane Melissa. The storm is expected to grow into a powerful category 3 or stronger hurricane soon.      Â   .   \"The storm is forecast to become a category 3 hurricane or stronger."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Risk of Bird Flu Downplayed Despite Seal Deaths",
            "author": "The Epoch Times",
            "url": "https://article.wn.com/view/2025/10/26/Risk_of_Bird_Flu_Downplayed_Despite_Seal_Deaths",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There have been a number of deaths in elephant seal pups on the sub-Antarctic territory of Heard Island. Agriculture Minister Julie Collins says samples taken from the pups need to be tested for bird flu. There is no imminent risk of bird flu reaching Australia."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Melissa strengthens into a Category 3 hurricane, threating catastrophic flooding in Jamaica, Haiti",
            "author": "The Associated Press",
            "url": "https://harrisondaily.com/stories/melissa-strengthens-into-a-category-3-hurricane-threating-catastrophic-flooding-in-jamaica-haiti,333912",
            "url_media": "https://mapi.associatedpress.com/v2/items/37fbd987aeda4684b9449e54fd6b1886.1/preview/preview.jpg?nfe=true&s=512&wm=false&app=MPK&tag=iid~37fbd987aeda4684b9449e54fd6b1886!rsn~1!cid~154475f79add49cdbcf40a7f770298a9!orgId~46776!qt~vR906tqs36eI!orgNm~HARRISON%20DAILY%20TIMES!role~Preview!mt~photo!fmt~JPEG%20Baseline",
            "country": "US",
            "language": "en",
            "summary": "Melissa has strengthened into a major Category 3 hurricane. It is threatening to cause catastrophic flooding in the northern Caribbean, including Haiti and Jamaica. It has already dumped a lot of rain on the area. It's expected to get even more rain in the coming days."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Hurricane Melissa monster Category 4, catastrophic threat for Jamaica, Haiti. Florida impact?",
            "author": "Herald-Tribune Sarasota",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_monster_Category_4_catastrophic_threat_for_e",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Melissa is expected to rapidly intensify into a powerful hurricane with devastating Caribbean impacts. AccuWeather meteorologists are expecting life-threatening flooding in Jamaica, the Dominican Republic and Cuba. Odds of Melissa's outer bands scraping southeast Florida are around 5%. Melissa is a hurricane."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "VIDEO: Hurricane Melissa Becomes Category 4 as Jamaica Braces for Impact",
            "author": "Breitbart",
            "url": "https://article.wn.com/view/2025/10/26/VIDEO_Hurricane_Melissa_Becomes_Category_4_as_Jamaica_Braces",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Melissa has been upgraded to a Category 4 hurricane. It is threatening Jamaica, Haiti, and Cuba while also threatening Cuba and the Dominican Republic.       in Haiti and Cuba.  in Cuba and in Dominican Republic it is threatening to make landfall. "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Cyprus records high temperatures and no rain for October, dams remain empty",
            "author": "CNA",
            "url": "https://article.wn.com/view/2025/10/26/Cyprus_records_high_temperatures_and_no_rain_for_October_dam",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Drought in Cyprus is prolonged as October brought no rain on the island. Cyprus is faced with serious water problems due to the lack of rain.   for the whole of October. For more information, go to: www.cnn.com/news/environment."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "#EyeOnMelissa: Farmers told to reap early where possible to minimise losses – Green",
            "author": "Jamaica Observer",
            "url": "https://article.wn.com/view/2025/10/26/EyeOnMelissa_Farmers_told_to_reap_early_where_possible_to_mi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Farmers were urged to harvest whatever crops they could ahead of Jamaica being impacted by Hurricane Melissa in order to minimise their losses. This was disclosed by Agriculture Minister Floyd Green during a special media briefing at Jamaica House on Saturday. He was talking to different types of farmers."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Hurricane Melissa strengthens into Category 3 storm — threatening catastrophic flooding in Jamaica, Haiti",
            "author": "New York Post",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_strengthens_into_Category_3_storm_threaten",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Melissa has become a major Category 3 hurricane. Forecasters warn of flooding and landslides in Jamaica and southern Haiti. Jamaicans are urged to be aware of the weather threat and take it seriously. US forecasters expect Melissa to strengthen further and be a major hurricane."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Global warming reshapes extreme rainfall, snowfall across Northern Hemisphere: study",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/10/26/Global_warming_reshapes_extreme_rainfall_snowfall_across_Nor_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Study sheds light on how global warming has reshaped extreme rainfall and snowfall across Northern Hemisphere over the past seven decades. Extreme precipitation is a critical factor in risk management, according to Xinhua.      Â   .   ... "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Hurricane Melissa strengthens into category 4 as it approaches Jamaica",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/10/26/Hurricane_Melissa_strengthens_into_category_4_as_it_approach_o",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Storm is threatening to cause catastrophic flooding in the northern Caribbean, including Haiti. It is expected to intensify further and cause more flooding. It's expected to hit the north Caribbean soon. It will bring heavy rains and flooding to the region. It could cause problems in Haiti. "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "Cyclone Montha threatens paddy harvest in Anakapalli district",
            "author": "The Hindu",
            "url": "https://article.wn.com/view/2025/10/26/Cyclone_Montha_threatens_paddy_harvest_in_Anakapalli_distric",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "1.38 lakh acres of paddy and other seasonal crops face damage as the cyclone approaches the Kakinada–Visakhapatnam coast. Officials urge farmers to take precautions and prepare for loss assessment.   Â. Â  "
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "#EyeOnMelissa: McKenzie urges Jamaicans to heed warnings as Hurricane Melissa nears",
            "author": "Jamaica Observer",
            "url": "https://article.wn.com/view/2025/10/26/EyeOnMelissa_McKenzie_urges_Jamaicans_to_heed_warnings_as_Hu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa is drawing closer to Jamaica. The weather system is moving slowly but definitely. People are being urged to take the threat seriously and follow all official instructions. The minister of local government and community development, Desmond McKenzie, said that based on the projections, the weather system will move slowly."
        },
        {
            "published_date": "2025-10-26T00:00:00",
            "title": "WATCH: #EyeOnMelissa: St Ann fisherfolk, vendors spend Sunday at riverside ahead of Melissa",
            "author": "Jamaica Observer",
            "url": "https://article.wn.com/view/2025/10/26/WATCH_EyeOnMelissa_St_Ann_fisherfolk_vendors_spend_Sunday_at",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Craft vendors and fishermen at White River in St Ann were observed on Sunday afternoon. Hurricane Melissa is bearing down on the island and is expected to make landfall in Jamaica soon.       - Jamaica News Agency. For confidential support, call the Samaritans on 08457 90 90 90 or visit a local Samaritans branch. "
        }
    ]
}