{
    "status": "ok",
    "total_articles": 160,
    "articles": [
        {
            "published_date": "2025-10-17T23:48:55",
            "title": "Keeping an eye out for eagles",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6943590",
            "url_media": "https://i.cbc.ca/ais/ba823b12-2983-4727-bd43-426161babfad,1760743630908/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "Volunteers in Kananaskis Country are taking part in the annual fall golden eagle count. After more than 30 years of counting, the numbers suggest a gradual decline in the bird's population. The count will continue for the next 30 years.  "
        },
        {
            "published_date": "2025-10-17T23:26:57",
            "title": "Mysterious 'warm blob' breaks records in the North Pacific Ocean",
            "author": "Mark Poynting",
            "url": "https://www.bbc.com/news/articles/ce3xynwwx4yo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/da28/live/a81aae10-ab8b-11f0-b2a1-6f537f66f9aa.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The waters of the north Pacific have had their warmest summer on record, according to BBC analysis. Sea surface temperatures between July and September were more than 0.25C above the previous high of 2022. The region has been warming quickly over the past couple of decades. The north Pacific's marine heatwave has already had consequences for weather on both sides of the Pacific."
        },
        {
            "published_date": "2025-10-17T23:12:00",
            "title": "Officials for years knew about flood risks in rural Alaska; the recent storm illustrated how little they have to show for it",
            "author": "",
            "url": "http://www.spokesman.com/stories/2025/oct/17/officials-for-years-knew-about-flood-risks-in-rura",
            "url_media": "https://thumb.spokesman.com/I-mL2-UQOjOCUDTqtVrb4IFmchY=/1200x630/smart/media.spokesman.com/photos/2025/10/17/68f2ee136e22e.hires.jpg",
            "country": "US",
            "language": "en",
            "summary": "The storm that hit Western Alaska over the weekend killed one person and destroyed dozens of homes. Alaska Native villages remain vulnerable to flooding exacerbated by melting sea ice, coastal erosion and storm surges. The zigzagging politics of state and federal administrations have hampered efforts to fortify Alaska Native communities against destructive storms."
        },
        {
            "published_date": "2025-10-17T23:00:37",
            "title": "Cool weather prescribed burn on WA's south coast should be expanded, environmental group says",
            "author": "Andrew Chounding",
            "url": "https://www.abc.net.au/news/2025-10-18/call-to-expand-cool-weather-burns-to-protect-the-environment/105896512",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/21660b441619382b26cb6fe04755722e?impolicy=wcms_watermark_news&cropH=1230&cropW=2187&xPos=5&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "In May, 350 hectares of West Cape Howe National Park was set ablaze in a prescribed burn intended to reduce bushfire damage. The Department of Biodiversity, Conservation and Attractions has been conducting prescribed burns in the park since 2016 as part of its bushfire mitigation strategy. The Leeuwin Group of scientists said the timing and style of the burn was chosen to reduce environmental impact."
        },
        {
            "published_date": "2025-10-17T23:00:00",
            "title": "3 more storms could form in East Sea this year, threatening Vietnam",
            "author": "Gia Chinh",
            "url": "https://www.msn.com/en-xl/news/other/3-more-storms-could-form-in-east-sea-this-year-threatening-vietnam/ar-AA1OH3UH",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "A new tropical depression has developed east of the Philippines and has a 70-80% chance of strengthening into a storm in the next couple of days. It is expected to enter the northern part of the East Sea between Oct. 19 and 20. So far this year, 11 storms and four tropical depressions have formed in the South China Sea. The most destructive event so far has been Storm Matmo, which made landfall in Guangxi Province on Oct. 5 and unleashed historic floods across northern Vietnam."
        },
        {
            "published_date": "2025-10-17T22:54:32",
            "title": "Natural disasters are affecting the nation's food supply",
            "author": "Amy Joi O'Donoghue",
            "url": "https://www.deseret.com/utah/2025/10/17/natural-disasters-are-affecting-the-nations-food-supply",
            "url_media": "https://uploads.deseret.com/deseretnews/icons/shop.svg?d=307",
            "country": "US",
            "language": "en",
            "summary": "Natural disasters are affecting the nation's food supply. FEMA estimates $3.5 billion in agricultural losses annually due to natural hazards. Drought is the single largest contributor, costing $1.9 billion per year. California leads the nation in losses, with farms in the state incurring an estimated $1 billion in losses annually. California reports an average loss of $20,528 per farm. Texas comes in second, with losses of $205 million."
        },
        {
            "published_date": "2025-10-17T22:46:19",
            "title": "Darkness Over Part of the Planet: Unveiling the Mysterious Phenomenon Seen from Space",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/darkness-over-part-of-the-planet-unveiling-the-mysterious-phenomenon-seen-from-space",
            "url_media": "https://i0.wp.com/www.archyde.com/wp-content/uploads/2025/05/jamescarternews-40x40.png?resize=40%2C40&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The Northern Hemisphere is reflecting a diminished amount of solar radiation compared to other regions of the Globe. The data is prompting further examination into its link with climate change and the planet's energy balance. Arctic sea ice extent in September 2025 was approximately 15% below the 1981-2010 average."
        },
        {
            "published_date": "2025-10-17T22:43:13",
            "title": "Greenhouse gases leak",
            "author": "",
            "url": "https://borneobulletin.com.bn/greenhouse-gases-leak",
            "url_media": "",
            "country": "BN",
            "language": "en",
            "summary": "The increase in CO2 in the atmosphere from 2023 to 2024 was the biggest one-year jump since records began in 1957. The update comes ahead of the November 10-21 COP30 UN climate summit in Belem, Brazil. CO2 accounts for about 66 per cent of the warming effect on the climate."
        },
        {
            "published_date": "2025-10-17T22:43:13",
            "title": "Climate gains, but pain ahead",
            "author": "",
            "url": "https://borneobulletin.com.bn/climate-gains-but-pain-ahead",
            "url_media": "",
            "country": "BN",
            "language": "en",
            "summary": "The world is on track to add nearly two months of dangerous superhot days each year by the end of the century. Since 2015, the world has already added 11 such days on average. Small and poor countries will be hit more often than the biggest carbon-polluting countries."
        },
        {
            "published_date": "2025-10-17T22:43:13",
            "title": "Australian rainforests no longer a carbon sink, says study",
            "author": "",
            "url": "https://borneobulletin.com.bn/australian-rainforests-no-longer-a-carbon-sink-says-study",
            "url_media": "",
            "country": "BN",
            "language": "en",
            "summary": "Australia's tropical rainforests are emitting more carbon dioxide than they absorb, according to new research. Extreme temperatures have caused more forest death than growth in Australia's northern tropics since 2000. The main cause was climate change, and its effects on the moisture in the atmosphere and drought."
        },
        {
            "published_date": "2025-10-17T22:24:15",
            "title": "Somalia Key Message Update: Poor xagaa rains limit September-October off-season harvest in the south",
            "author": "WDN",
            "url": "https://wardheernews.com/somalia-key-message-update-poor-xagaa-rains-limit-september-october-off-season-harvest-in-the-south",
            "url_media": "https://wardheernews.com/wp-content/uploads/2023/03/somali-drought.webp",
            "country": "SO",
            "language": "en",
            "summary": "Food security is deteriorating across most parts of northern and central Somalia. The July–September 2025 xagaa season resulted in mixed agroclimatic conditions across Somalia. In southern agropastoral and riverine areas, insufficient soil moisture drove reduced off-season harvests. In northern pastoral livelihood zones, the below-average gu rains slowed rangeland and livestock recovery following previous years of drought."
        },
        {
            "published_date": "2025-10-17T22:09:37",
            "title": "'Everything Is Starting to Collapse': Scientists Warn Coral Reefs Have Hit a Climate Tipping Point (and we may be next)",
            "author": "Eirwen Williams",
            "url": "https://www.sustainability-times.com/climate/everything-is-starting-to-collapse-scientists-warn-coral-reefs-have-hit-a-climate-tipping-point-and-we-may-be-next",
            "url_media": "https://www.sustainability-times.com/wp-content/uploads/2025/10/mass-coral-deaths-explode-first-climate-tipping-point-breach-sparks-global-fear-and-its-closer-than-you-think.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The collapse of coral reefs signals a major climate tipping point that threatens marine ecosystems worldwide. Recent warming has caused unprecedented bleaching of 80 percent of the world's reefs, affecting half-a-billion people dependent on them. The 2025 Global Tipping Points Report states that mass reef diebacks occur when global temperatures increase by approximately 1.2 degrees Celsius above preindustrial averages. This threshold has already been surpassed. Coral reefs are an early indicator of the destructive potential of unchecked climate change. Other Earth systems, such as the West Antarctic and Greenland ice sheets, are also at risk."
        },
        {
            "published_date": "2025-10-17T22:05:00",
            "title": "Are We Really on the Brink of a Sixth Mass Extinction?",
            "author": "Jenny Lehmann",
            "url": "https://www.discovermagazine.com/are-we-really-on-the-brink-of-a-sixth-mass-extinction-48159",
            "url_media": "https://cdn.discovermagazine.com/assets/image/57554/sixth-mass-extinction-x.jpg",
            "country": "US",
            "language": "en",
            "summary": "Some scientists argue that a sixth mass extinction is already underway, driven entirely by humans. John Wiens, a professor of ecology and evolutionary biology at the University of Arizona, questions whether these claims hold up under careful scientific scrutiny. Extinction measured across millions of years behaves differently than extinction measured across centuries. Wiens studied extinction over the past 500 years across higher taxa."
        },
        {
            "published_date": "2025-10-17T22:04:00",
            "title": "Antarctica shows rapid ice loss as warming mirrors Greenland's meltdown",
            "author": "Anadolu Agency",
            "url": "https://article.wn.com/view/2025/10/17/Antarctica_shows_rapid_ice_loss_as_warming_mirrors_Greenland",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antarctica's frozen stability is showing signs of unraveling under the pressure of global warming. Scientists observe increased surface melting, glacier acceleration and shrinking sea ice similar to trends seen in Greenland. Research published in Nature Geoscience shows this trend is similar to that of Greenland."
        },
        {
            "published_date": "2025-10-17T21:18:16",
            "title": "'Anti-aging' cooking trick goes viral after experts reveal compelling health benefits",
            "author": "Deirdre Bardolf",
            "url": "https://www.newsbreak.com/fox-news-510075/4298209778749-anti-aging-cooking-trick-goes-viral-after-experts-reveal-compelling-health-benefits",
            "url_media": "https://www.newsbreak.com/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fwow.fc40898b.png&w=48&q=75",
            "country": "PH",
            "language": "en",
            "summary": "High-heat cooking methods like grilling and frying create harmful compounds called AGEs that may accelerate aging and increase disease risk. Deirdre Bardolf is a partner publisher with 1.9 million followers on Facebook and Twitter and has a blog with 44,000 followers."
        },
        {
            "published_date": "2025-10-17T21:17:04",
            "title": "Woburn Clarkes Court Bay MPA stakeholder consultations",
            "author": "Now Grenada",
            "url": "https://nowgrenada.com/2025/10/woburn-clarkes-court-bay-mpa-stakeholder-consultations",
            "url_media": "https://nowgrenada.com/wp-content/uploads/2025/01/GSDTF.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Grenada Sustainable Development Trust Fund (GSDTF) invites all stakeholders invested in marine conservation to attend the upcoming events. The objective of the consultations is to introduce the Enhanced MPA Management and Monitoring of the Woburn Clarkes Court Bay Marine Protected Area."
        },
        {
            "published_date": "2025-10-17T20:57:00",
            "title": "Pentagon retreats from climate fight even as heat and storms slam troops",
            "author": "Black Hills Pioneer",
            "url": "https://article.wn.com/view/2025/10/17/Pentagon_retreats_from_climate_fight_even_as_heat_and_storms_b",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Floodlight reports the Pentagon is rolling back climate actions despite increasing heat and storms impacting troop readiness and safety, as reported by the Washington Post. The Pentagon has not commented on the report yet.   Â. Â   y   in full"
        },
        {
            "published_date": "2025-10-17T20:49:23",
            "title": "Antarctica shows rapid ice loss as warming mirrors Greenland's meltdown",
            "author": "Merve Berker",
            "url": "https://www.aa.com.tr/en/world/antarctica-shows-rapid-ice-loss-as-warming-mirrors-greenland-s-meltdown/3720131",
            "url_media": "https://cdnuploads.aa.com.tr/uploads/Contents/2025/10/17/thumbs_b_c_70b1c7e7c5f0497493f7c92e7ff22229.jpg?v=234802",
            "country": "TR",
            "language": "en",
            "summary": "Antarctica's frozen stability is showing signs of unraveling under the pressure of global warming. Scientists observe increased surface melting, glacier acceleration and shrinking sea ice similar to trends seen in Greenland. Ice loss has quadrupled since the 1990s, with weakened ice shelves failing to restrain outlet glaciers."
        },
        {
            "published_date": "2025-10-17T20:45:07",
            "title": "Brazil woman sails solo through Arctic: ‘Less and less sea ice'",
            "author": "dsingson",
            "url": "https://cebudailynews.inquirer.net/663859/brazil-woman-sails-solo-through-arctic-less-and-less-sea-ice",
            "url_media": "https://cebudailynews.inquirer.net/files/2025/10/AFP__20251017__78MJ2NQ__v1__HighRes__BrazilYachtingKlink-scaled.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Tamara Klink, 28, is the second woman and the first Latin American to complete the perilous Arctic journey from the Atlantic to the Pacific Ocean. Klink encountered 'very little' sea ice on her solo sail through the Northwest Passage. Global temperatures in 2024 were the hottest on record, surpassing 1.5C above pre-industrial levels for the first time."
        },
        {
            "published_date": "2025-10-17T20:34:20",
            "title": "Blue Jays' Game 5 Loss Taught Them that the Time for Good Manners Is Over",
            "author": "",
            "url": "https://ground.news/article/blue-jays-george-springer-exits-game-5-after-taking-ball-off-knee",
            "url_media": "https://ground.news/_next/image?url=https%3A%2F%2Fgroundnews.b-cdn.net%2Fassets%2FletterIcons%2Fsquare%2F6200EA%2FT.png%3Fwidth%3D48%26saturation%3D-100&w=128&q=75",
            "country": "US",
            "language": "en",
            "summary": "Now is the time for Toronto to be like Seattle. Seattle is the mean-spirited change they want to see in the world. Toronto should be like them.       .   in order to be a better place for people. "
        },
        {
            "published_date": "2025-10-17T20:19:15",
            "title": "Visualising climate change: Artist-led groups are using data to explore the climate crisis",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/10/17/Visualising_climate_change_Artistled_groups_are_using_data_t",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Artists are using data to depict the effects of climate change in innovative ways to draw attention to the issue.       - Art is an innovative way of drawing attention to climate change.  - The Guardian, January 25th, 2014."
        },
        {
            "published_date": "2025-10-17T20:01:29",
            "title": "Fire authorities warn of 'above average' fire season as NSW starts to warm up",
            "author": "Victoria Pengilley",
            "url": "https://www.abc.net.au/news/2025-10-18/nsw-above-average-fire-season-bushfire-risk-weather/105900120",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/ef71c09d1f670c0f683f94a230dcc26e?impolicy=wcms_watermark_news&cropH=2717&cropW=4830&xPos=94&yPos=995&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "In late 2023, residents across NSW were urged to brace for a dangerous summer, with warnings of El Niño leading to increased bushfires. The feared \"horror summer\" failed to materialise, with parts of the state instead being drenched by unexpected and at times, torrential rainfall. This summer, prolonged hot weather is expected to persist well into summer, particularly in already dry inland regions. Flooding earlier this year has also led to significant grass growth, creating a high fuel load that could ignite quickly. The RFS is far better prepared than it was during the devastating Black Summer fires six years ago, thanks to investments in new technology."
        },
        {
            "published_date": "2025-10-17T20:01:25",
            "title": "Bigger wheat crop expected in Western Australia this year",
            "author": "Sask Today",
            "url": "https://ground.news/article/bigger-wheat-crop-expected-in-western-australia-this-year",
            "url_media": "https://ground.news/_next/image?url=https%3A%2F%2Fgroundnews.b-cdn.net%2Finterests%2F8de1be07f14e13667dafc16629845394c0a3d807.jpg%3Fwidth%3D24&w=64&q=75",
            "country": "US",
            "language": "en",
            "summary": "Western Australia will produce nearly 1 million metric tons more wheat this season than was expected a month ago, bolstering expectations for a large Australian harvest. This will pressure global prices, as expected by the International Gratuitous Trade Association.      "
        },
        {
            "published_date": "2025-10-17T20:01:25",
            "title": "Bigger wheat crop expected in Western Australia this year",
            "author": "Doug Falconer",
            "url": "https://www.620ckrm.com/2025/10/17/bigger-wheat-crop-expected-in-western-australia-this-year",
            "url_media": "https://www.vmcdn.ca/f/files/moosejawtoday/images/agriculture/harvest-photo-ron-aug-2020.jpg;w=960",
            "country": "US",
            "language": "en",
            "summary": "Western Australia will produce nearly 1 million metric tons more wheat this season than was expected a month ago. The association has also raised its production forecasts for canola and for barley by 200,000 tons. Western Australia is now set to produce 12.6 million tons of wheat, a record-high 7.3 million tonnes of barley and 3.8 million tones of canola."
        },
        {
            "published_date": "2025-10-17T19:56:00",
            "title": "Earth's CO₂ Levels Just Broke a Record, And It's Not Good News",
            "author": "NDTV",
            "url": "https://article.wn.com/view/2025/10/17/Earths_CO_Levels_Just_Broke_a_Record_And_Its_Not_Good_News",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The WMO reports Earth's atmospheric CO₂ reached 422.8 ppm in 2024. It's the biggest annual rise ever recorded. The rise is driven by fossil-fuel emissions, wildfires and weakening carbon sinks, the surge is caused by climate change."
        },
        {
            "published_date": "2025-10-17T19:30:06",
            "title": "As Planet Burns, US Banking Agencies Ditch Climate Risk Rules",
            "author": "Stephen Prager",
            "url": "https://www.commondreams.org/news/bank-regulators-pull-climate-rules",
            "url_media": "https://www.commondreams.org/media-library/image.jpg?id=61774350&width=1200&height=600&coordinates=0%2C684%2C0%2C684",
            "country": "US",
            "language": "en",
            "summary": "Regulators rescinded guidelines for large financial institutions to consider climate risks when making decisions about business strategy, risk management, and strategic planning. The guidelines were first issued in 2023, when the US experienced a record number of weather and climate-related disasters, including a massive drought across the south and Midwest, historic wildfires in Hawaii, and major flooding events across the country. Public Citizen's climate program criticizes the withdrawal of the guidelines."
        },
        {
            "published_date": "2025-10-17T19:22:29",
            "title": "Brace Yourself: 57 Scorching Days Set to Become Annual Reality Globally",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/brace-yourself-57-scorching-days-set-to-become-annual-reality-globally",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/10/The-world-is-heading-to-add-57-superhot-days-a.au2Ffs2F76a740d8-619a-4c5d-b35f-5e6679164cf3.jpeg",
            "country": "NG",
            "language": "en",
            "summary": "The world is on track to add nearly two months of dangerous superhot days each year by the end of the century. The countries facing the most significant increases in extreme heat days are predominantly small, ocean-dependent nations like the Solomon Islands, Samoa, Panama, and Indonesia. The top carbon polluting countries, the United States, China and India are predicted to get only between 23 and 30 extra hot days by the century's end. Hawaii and Florida are the US states that will see the biggest increase in hot days."
        },
        {
            "published_date": "2025-10-17T19:21:04",
            "title": "Hottest Octobers in Oregon since 1895",
            "author": "Stacker",
            "url": "https://ktvz.com/news/2025/10/17/hottest-octobers-in-oregon-since-1895",
            "url_media": "https://images.stacker.com/w/1280/68sneakersun18AT.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2022, the continental United States experienced its third hottest July since 1895. 20 states saw one of their 10 hottest days in the same month. The Earth's temperature has climbed each decade since 1880 by about .14 degrees Fahrenheit. Stacker compiled a ranking of the hottest Octobers in Oregon since 1895 using data from the National Centers for Environmental Information."
        },
        {
            "published_date": "2025-10-17T19:07:26",
            "title": "HEADLINE: 'The Independent's 'Record CO₂ Surge' Story: Hype Without Context', By Anthony WATTS",
            "author": "Stephen Heins",
            "url": "https://stephenheins.substack.com/p/headline-the-independents-record",
            "url_media": "https://substackcdn.com/image/fetch/$s_!MFlP!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff141511a-d485-4eb4-adc3-eeb4c4f2a50c_192x192.jpeg",
            "country": "US",
            "language": "en",
            "summary": "There was a 3.5 ppm rise in CO2 in the atmosphere from 2023 to 2024, according to the World Meteorological Organization's (WMO) annual bulletin. The increase is within the historical trend. Natural processes, not industrial emissions, were the dominant factor behind the temporary bump."
        },
        {
            "published_date": "2025-10-17T19:03:09",
            "title": "HEADLINE: 'Shut The CCC Now!' By Paul Homewood",
            "author": "Stephen Heins",
            "url": "https://stephenheins.substack.com/p/headline-shut-the-ccc-now-by-paul",
            "url_media": "https://substackcdn.com/image/fetch/$s_!H-6k!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7dc720e9-c1d3-4594-8154-f6a5c92722fc_668x710.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The Climate Change Committee wrote to the government that the UK should be prepared to cope with weather extremes as a result of at least 2C of global warming by 2050. The committee released their last report in April this year, which said preparations in the UK for rising temperatures were 'either too slow, has stalled, or [are] heading in the wrong direction'. They say the UK could expect increased heatwaves, drought and flooding, and wildfire season would likely extend into autumn."
        },
        {
            "published_date": "2025-10-17T18:54:34",
            "title": "Around 900m poor exposed to climate shocks",
            "author": "AFP",
            "url": "https://www.thedailystar.net/news/world/news/around-900m-poor-exposed-climate-shocks-4012671",
            "url_media": "https://www.thedailystar.net/sites/all/themes/sloth/favicon.ico",
            "country": "BD",
            "language": "en",
            "summary": "Nearly 80 percent of the world's poorest are directly exposed to climate hazards exacerbated by global warming. About 18 percent of people live in acute multidimensional poverty based on factors like infant mortality, access to housing, sanitation, electricity and education. Sub-Saharan Africa and South Asia are particularly vulnerable to the impacts of climate change."
        },
        {
            "published_date": "2025-10-17T18:54:34",
            "title": "887m poor exposed to climate shocks: UN",
            "author": "AFP",
            "url": "https://www.thedailystar.net/news/world/news/887m-poor-exposed-climate-shocks-un-4012671",
            "url_media": "https://www.thedailystar.net/sites/all/themes/sloth/favicon.ico",
            "country": "BD",
            "language": "en",
            "summary": "Nearly 80 percent of the world's poorest are directly exposed to climate hazards exacerbated by global warming. About 18 percent of people live in acute multidimensional poverty based on factors like infant mortality, access to housing, sanitation, electricity and education. Sub-Saharan Africa and South Asia are particularly vulnerable to the impacts of climate change."
        },
        {
            "published_date": "2025-10-17T18:44:24",
            "title": "Beyond Pledges",
            "author": "Editorial",
            "url": "https://www.millenniumpost.in/editorial/beyond-pledges-631728",
            "url_media": "https://www.millenniumpost.in/images/logo.png",
            "country": "IN",
            "language": "en",
            "summary": "10 years after the signing of the Paris Agreement, the results are mixed and sobering. If all nations meet their emission-cutting pledges, the world could limit its temperature rise to around 2.6°C this century. For India, this means 30 fewer scorching days annually, a potential lifeline for millions who live on the margins of climate endurance. Since 2015, just 0.3°C of additional warming has increased the global tally of hot days by 11 each year and made heatwaves twice as likely in India and Pakistan."
        },
        {
            "published_date": "2025-10-17T18:32:00",
            "title": "Mother Nature gets fiesty with first Nor'Easter",
            "author": "Renee Meyer",
            "url": "https://www.blockislandtimes.com/news/mother-nature-gets-fiesty-with-first-nor-easter/article_d4ae71e7-507d-45b3-8eea-af176a84b3ac.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/blockislandtimes.com/content/tncms/assets/v3/editorial/3/7b/37bd341d-7e14-4560-b7fe-542f57c3f1c5/68f2940cbb484.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Nor'Easter was the first nor'easter of the season. There were three days of canceled ferries on Block Island due to the storm. High waters scoured out beach access paths on the east side of the island and filled the north parking lot at Fred Benson Town Beach."
        },
        {
            "published_date": "2025-10-17T18:17:12",
            "title": "Humans Driving Extinctions at Scale Not Seen in 66 Million Years",
            "author": "Rachael O'Connor",
            "url": "https://www.newsweek.com/humans-driving-mass-extinction-scale-not-seen-66-million-years-10894905",
            "url_media": "https://assets.newsweek.com/wp-content/uploads/2025/10/Copy-of-32-circle-inset-right-3.png?w=1200crop=1",
            "country": "US",
            "language": "en",
            "summary": "Researchers from the University of York have warned that humans are driving extinctions at a rate not seen since the mass extinction of the dinosaurs some 66 million years ago. They compared the loss of modern species with those preserved in fossil records. They believe the current rate of extinction is comparable to the Eocene–Oligocene extinction event, which took place around 34 million ago."
        },
        {
            "published_date": "2025-10-17T18:02:56",
            "title": "New bushfire research",
            "author": "",
            "url": "https://wyndham.starweekly.com.au/news/new-bushfire-research",
            "url_media": "https://wyndham.starweekly.com.au/wp-content/uploads/sites/7/2025/10/bush_510933_01.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The devastating 2019-20 bushfires inspired Rebecca Ryan to do her PhD research at the University of Wollongong. She found bushfires in south-eastern Australia have become more intense and more frequent over the past 200 years compared with the previous 3,000 years. This shift appears to be driven by changes in climate, vegetation, and human activity."
        },
        {
            "published_date": "2025-10-17T18:00:04",
            "title": "No 'new normal': Al Gore warning on climate complacency",
            "author": "Poppy Johnston",
            "url": "https://www.newcastleherald.com.au/story/9091497/no-new-normal-al-gore-warning-on-climate-complacency",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4e6ac0a0-8f2a-43b0-89b2-5b8c5e46c2f0.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Al Gore spoke at the Investor Group on Climate Change Summit in Sydney on Friday. He said climate change is happening now, bringing with it back-to-back floods and wildfires in Australia and around the world. Australia has been struck by floods, storms and a devastating algal bloom in the past year, events turbocharged by record-high ocean temperatures. NSW Climate Change Minister Penny Sharpe said her state has committed to mandatory climate disclosures for government agencies."
        },
        {
            "published_date": "2025-10-17T18:00:00",
            "title": "No 'new normal': Al Gore warning on climate complacency",
            "author": "Poppy Johnston",
            "url": "https://au.news.yahoo.com/no-normal-al-gore-warning-180000432.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/_3MSgZcMqt7WXTNQEUI7Eg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/aap.com.au/fd9c431be66643407560e6e2a2875b31",
            "country": "US",
            "language": "en",
            "summary": "Al Gore spoke at the Investor Group on Climate Change Summit in Sydney on Friday. He warned that climate change is happening now, not in the future. Australia has been hit by floods, storms and a devastating algal bloom in the past year. Australia is phasing in compulsory climate risk reporting. NSW has committed to mandatory climate disclosures for government agencies."
        },
        {
            "published_date": "2025-10-17T18:00:00",
            "title": "Laura Tingle",
            "author": "",
            "url": "https://www.abc.net.au/news/laura-tingle/9711054",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/7ee6f190de6d7dbb04203e514bfae9ec?impolicy=wcms_crop_resize&cropH=700&cropW=700&xPos=0&yPos=0&width=862&height=862&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Laura Tingle is the ABC's Global Affairs Editor. She was formerly the political editor for ABC's nightly current affairs program 7.30. Tingle has spent most of her 45-year career in journalism reporting on Australian federal politics and the country's major policy debates."
        },
        {
            "published_date": "2025-10-17T18:00:00",
            "title": "A $200 million redevelopment transformed this office block into homes. Could others follow suit?",
            "author": "Julie Power",
            "url": "https://csr.einnews.com/article_detail/859137823/LnpIpO-aGhz85uGT",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_auto/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/115b0177d0b4b393bf99d3a4f3563026f4562843",
            "country": "UA",
            "language": "en",
            "summary": "Caroline Pidcock and John McInerney moved into their three-bedroom apartment on Sydney's Kent Street in 2019. The building and construction sector is the largest emitter of greenhouse gases, accounting for 37 per cent of global emissions. They are calling for developers to be given financial incentives to encourage adaptive reuse of office blocks."
        },
        {
            "published_date": "2025-10-17T17:18:16",
            "title": "State Of The Climate 2024: ‘No Runaway Warming, No Climate Crisis'",
            "author": "Thomas Richard",
            "url": "https://climatechangedispatch.com/state-of-the-climate-2024-no-climate-crisis",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/10/antarctic-peninsula-penguins.jpeg",
            "country": "US",
            "language": "en",
            "summary": "2024 was the warmest year on record thanks to a strong El Niño. Most temperature increases occurred in the Northern Hemisphere. Sea level rise continues at a rate of 1-2 mm per year. Global sea ice extent has been stable or slightly increasing since 2018. Global snow cover remains stable. Storm and hurricane activity continues to fluctuate naturally. Global climate has remained in a stable state for millions of years."
        },
        {
            "published_date": "2025-10-17T17:16:30",
            "title": "Financing India's Renewable Energy Transition",
            "author": "",
            "url": "https://www.epw.in/journal/2025/42/commentary/financing-indias-renewable-energy-transition.html",
            "url_media": "https://www.epw.in/themes/contrib/epw/images/epw.ico",
            "country": "IN",
            "language": "en",
            "summary": "India is among the top 10 countries most affected by climate change. Developed nations have been the largest contributors to greenhouse gas (GHG) emissions during their industrialisation and economic growth, placing a disproportionate responsibility for the crisis on them. To continue reading, become a subscriber."
        },
        {
            "published_date": "2025-10-17T17:12:00",
            "title": "‘Solar maximum': More storms from the sun could bring more Northern Lights, which possibly came through Idaho in recent days",
            "author": "Matt Milner",
            "url": "https://www.idahopress.com/news/local/solar-maximum-more-storms-from-the-sun-could-bring-more-northern-lights-which-possibly-came/article_50cb49bc-5ad1-50c8-80c9-1345d4311b70.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/idahopress.com/content/tncms/assets/v3/editorial/2/e6/2e63e29f-644f-52c2-813b-fdd6e41bda81/68f26c8e59fbc.image.jpg?crop=1973%2C1036%2C12%2C0&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The sun is at the height of a cycle which sees its north and south poles flip approximately every 11 years. More of the world, including parts of the continental U.S., could see increased instances of Aurora Borealis lights over the next several months. "
        },
        {
            "published_date": "2025-10-17T17:01:00",
            "title": "Northland Nature: Birds are not the only animals that migrate in the fall",
            "author": "Retired Teacher Larry Weber",
            "url": "https://www.duluthnewstribune.com/sports/northland-outdoors/northland-nature-birds-are-not-the-only-animals-that-migrate-in-the-fall",
            "url_media": "https://cdn.forumcomm.com/dims4/default/e68fefd/2147483647/strip/true/crop/2256x1496+0+0/resize/1608x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F6c%2Fa4%2F35b8a1b44030a1947e784bf382a2%2Fdsc-0676-3.JPG",
            "country": "US",
            "language": "en",
            "summary": "This time of the year is well known for migration of birds and other animals. The Northland is famous for its bird migration. The monarch butterfly goes south to Mexico and the green darner dragonfly to the southern states. The garter snake and the red-bellied snake can be seen in the Northland."
        },
        {
            "published_date": "2025-10-17T16:28:45",
            "title": "As the peak period of Hilton Head's hurricane season ends, experts eye 2 systems",
            "author": "Lydia Larsen",
            "url": "https://www.islandpacket.com/news/weather/hurricane/article312541649.html",
            "url_media": "https://www.islandpacket.com/akam/13/pixel_51d1b6cc?a=dD02NjhmYzk3YzE0NmI3ZGQyMmZmOWVhOWIyZGQzZGYxZWYxZWYwMTAxJmpzPW9mZg==",
            "country": "US",
            "language": "en",
            "summary": "The Atlantic hurricane season is about to end. The National Hurricane Center is watching two possible systems in the Atlantic. There is a tropical wave over a thousand miles east of the Windward Islands. There's a 30% chance that the system will form a cyclone in the next seven days. The second system is located off the coast of the Northeast U.S. It could develop some subtropical characteristics over the weekend. The overall chance of cyclone formation is at 10% in the coming week."
        },
        {
            "published_date": "2025-10-17T16:17:00",
            "title": "Nearly 900 mn poor people exposed to climate shocks, UN warns",
            "author": "Bias Comparison",
            "url": "https://ground.news/article/nearly-900-mn-poor-people-exposed-to-climate-shocks-un-warns_b9d53f",
            "url_media": "https://ground.news/_next/image?url=https%3A%2F%2Fgroundnews.b-cdn.net%2Finterests%2F7b0bc756695f4c1a75f0d4d46745e45db65aa89c.jpg%3Fwidth%3D60&w=128&q=75",
            "country": "US",
            "language": "en",
            "summary": "Nearly 80% of the world's poor live in regions exposed to extreme heat, flooding and other climate hazards. South Asia and sub-Saharan Africa have the largest numbers of poor people living in regions affected by climate hazards with 380 million and 344 million respectively. Countries with higher current levels of multidimensional poverty are expected to experience the greatest temperature increases by the end of the century."
        },
        {
            "published_date": "2025-10-17T15:52:02",
            "title": "Europe's climate is changing fast – here's how it's affecting people and the economy",
            "author": "The Conversation",
            "url": "https://article.wn.com/view/2025/10/17/Europe_s_climate_is_changing_fast_here_s_how_it_s_affecting_",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Temperatures across Europe are rising at twice the global average. This is leading to more frequent and intense heatwaves, droughts, floods and other weather-related problems.    .   in 2024, the River Danube will be flooded. "
        },
        {
            "published_date": "2025-10-17T15:49:03",
            "title": "Exchange of genetic diversity between species accelerates evolutionary adaptation in songbirds",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/10/17/Exchange_of_genetic_diversity_between_species_accelerates_ev",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change is changing the environment and posing challenges for many animal species. An international study involving researchers from the Leibniz shows that evolutionary innovations are often the result of a genetic mosaic. The study was published in the journal \"Evolutionary Dynamics\". "
        },
        {
            "published_date": "2025-10-17T15:26:26",
            "title": "Antarctica's Melting Glaciers Mirror Greenland's Warnings: A Climate Crisis in Progress",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/antarcticas-melting-glaciers-mirror-greenlands-warnings-a-climate-crisis-in-progress",
            "url_media": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/shoesmith-1152x648.jpg",
            "country": "US",
            "language": "en",
            "summary": "Greenland's ice sheet has been melting for the past two decades, contributing to global sea-level rise. The Conger Ice Shelf collapsed in March 2024, covering approximately 1,100 km². Antarctica has experienced unprecedented warming in recent years, driven by both natural climate variability and human-caused greenhouse gas emissions. The combined ice loss from Greenland and Antarctica is a major driver of global sea level rise."
        },
        {
            "published_date": "2025-10-17T15:12:59",
            "title": "The Big Green Pivot to A Different Set of Lies, As the Paris Agreement Is Revealed to Have Been A Colossal Failure on It's Own Terms",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/the-big-green-pivot-to-a-different",
            "url_media": "https://substackcdn.com/image/fetch/$s_!yfay!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5d3f9e8-f01e-41d3-bee8-0c35f494ebff_1168x784.heic",
            "country": "US",
            "language": "en",
            "summary": "Doug Sheridan has examined the climate cult's success in reducing CO2 emissions and finds nothing but failure. Bloomberg writes that carbon emissions from human activities and wildfires rose last year, while the land and oceans' ability to absorb carbon diminished, leading to a record surge in the amount of the planet-warming gas in the atmosphere. $10 trillion spent globally on an 'electrify everything with renewables' strategy, global carbon emissions are up 8%."
        },
        {
            "published_date": "2025-10-17T15:11:32",
            "title": "Farmers' association welcomes proposed masterplan for mitigating landslides in hilly areas",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/news/cities/Coimbatore/farmers-association-welcomes-proposed-masterplan-for-mitigating-landslides-in-hilly-areas/article70176164.ece",
            "url_media": "https://www.thehindu.com/theme/images/og-image.png",
            "country": "IN",
            "language": "en",
            "summary": "Vivasayigal Sangam welcomes the proposed masterplan by the State Government for mitigating risks of landslides in Coimbatore, The Nilgiris, Salem, and Dindigul districts. Geological Survey of India carried out a study in the ghat section of Pollachi-Valparai Road and submitted a detailed report to the State Highways and Forest departments."
        },
        {
            "published_date": "2025-10-17T15:11:15",
            "title": "Scotland experienced UK's first MEGA FIRE as scientists issue urgent warning",
            "author": "",
            "url": "https://www.thescottishsun.co.uk/news/15462031/scotland-first-mega-fire-urgent-warning",
            "url_media": "https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/10/Off-platform-pics-2025-10-17T160857.687.png?w=1920&h=1080&crop=1",
            "country": "GB",
            "language": "en",
            "summary": "This year has already seen more wildfires than any year on record in Scotland. A mix of drier summers, heatwaves and dry plant life is fuelling the issue. Climate change brings more frequent and intense droughts and heatwaves, which are laying the groundwork for more severe fires."
        },
        {
            "published_date": "2025-10-17T15:08:48",
            "title": "COMMUNITY SPEAKER SERIES: K&P Trail marshes drying up",
            "author": "Hung Lam",
            "url": "https://www.thewhig.com/opinion/community-speaker-series-kp-trail-marshes-drying-up",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2025/10/1018-ki-community-speaker-series.ki_.jpg",
            "country": "CA",
            "language": "en",
            "summary": "There are no streams or rivers to feed the marshes in Kingston, so there is a loss of water. The fish may disappear. Herons and other species that feed on the fish may not return. Climate change may have contributed to the drought and dry wetlands."
        },
        {
            "published_date": "2025-10-17T14:43:00",
            "title": "PRCS AJK's chief for the execution of the RFL program in AJK",
            "author": "Urdu Point",
            "url": "https://article.wn.com/view/2025/10/17/PRCS_AJKs_chief_for_the_execution_of_the_RFL_program_in_AJK",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Pakistan Red Crescent Society AJK Chapter's Chairman Sardar Shafique Ahmed Khan says the AJK region is one of Pakistan's most vulnerable areas, facing multiple challenges such as cross-border firing and shelling, climate-induced disasters, migration, and man-made disasters."
        },
        {
            "published_date": "2025-10-17T14:40:00",
            "title": "Western Australia could reap record harvest as crop estimates rise again, GIWA says",
            "author": "Freelance Contributor",
            "url": "https://www.manitobacooperator.ca/daily/western-australia-could-reap-record-harvest-as-crop-estimates-rise-again-giwa-says",
            "url_media": "https://static.manitobacooperator.ca/wp-content/uploads/2025/10/06094307/GettyImages-838382580-e1757520463790.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Western Australia will produce nearly 1 million metric tons more wheat this season than expected a month ago. The Grain Industry Association of Western Australia also raised its production forecasts for canola by 490,000 tons and for barley by 200,000 tonnes. Western Australia is one of the world's biggest suppliers of grains and canola and its biggest export region."
        },
        {
            "published_date": "2025-10-17T14:27:00",
            "title": "Two from Congress say climate change hitting homeowners insurance, mortgages",
            "author": "Alan Wooten",
            "url": "https://www.sanfordherald.com/news/state/two-from-congress-say-climate-change-hitting-homeowners-insurance-mortgages/article_03c23edf-9d3e-553f-8e67-72269774ebb6.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/sanfordherald.com/content/tncms/assets/v3/editorial/6/f5/6f5e5db0-4f3d-5c5c-b387-82d881065a05/68f26121e8e45.preview.jpg?crop=1265%2C664%2C0%2C486&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Two members of Congress from North Carolina and Rhode Island say climate change is impacting insurance rates and access to mortgages. Sen. Sheldon Whitehouse, D-R.I., says it's hitting family pocketbooks in a big way.      "
        },
        {
            "published_date": "2025-10-17T14:21:13",
            "title": "Climate Change Will Displace 6.5 Million Americans by 2055",
            "author": "Business",
            "url": "https://www.newsghana.com.gh/climate-change-will-displace-6-5-million-americans-by-2055",
            "url_media": "https://b843437.smushcdn.com/843437/wp-content/uploads/2024/08/logo-newsghana.png?lossy=2&strip=1&webp=1",
            "country": "GH",
            "language": "en",
            "summary": "Climate change is forcing the largest internal migration in American history. 6.5 million people will flee flood zones over the next three decades. 50 million more people will settle in safer regions. Florida and Louisiana represent what researchers call 'risk seeking' patterns. Michigan and North Carolina show the opposite trend, with residents prioritizing safety and resilience."
        },
        {
            "published_date": "2025-10-17T14:18:00",
            "title": "'La Nina' phase: PMD rejects coldest winter in Pakistan this year",
            "author": "Web Desk",
            "url": "https://www.thenews.com.pk/latest/1351697-la-nina-phase-pmd-rejects-coldest-winter-in-pakistan-this-year",
            "url_media": "https://www.thenews.com.pk/assets/uploads/updates/2025-10-17/1351697_062606_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The Pakistan Meteorological Department (PMD) rejects the forecast of a more-than-usual winter in Pakistan due to La Niña. The Intersector Coordination Group (ISCG) had predicted that Pakistan is likely to experience one of its coldest winters in decades. UN-OCHA says marginally negative phases of both the El Niño Southern Oscillation and the Indian Ocean Dipole are expected to influence rainfall across Pakistan."
        },
        {
            "published_date": "2025-10-17T14:10:00",
            "title": "U.S. Drug Supply Deeply Dependent on Chinese Ingredients",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/u-s-drug-supply-deeply-dependent-on-chinese-ingredients/article_3685bcc9-b6e6-5a5c-9f12-692bd8590a2b.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/a/d7/ad7c35cb-5e5e-5f01-96a2-70eecc8d4ab5/68f24f78c5fdf.image.jpg?crop=1200%2C630%2C0%2C85",
            "country": "US",
            "language": "en",
            "summary": "Griffin, GA (30223) has some passing clouds. High around 80F. Winds SSE at 5 to 10 mph, but it's windy with low 55F temps falling to 55F in the afternoon. It's going to be cloudy."
        },
        {
            "published_date": "2025-10-17T14:00:41",
            "title": "#HaveItBothWays: Plants going uphill",
            "author": "John Robson",
            "url": "https://johnrobson.substack.com/p/haveitbothways-plants-going-uphill",
            "url_media": "https://substackcdn.com/image/fetch/$s_!h6_f!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8a2f1781-641e-416f-badb-cef9ef20ef2f_6000x4000.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The logic is impeccable. Cold temperature limits plant growth so as temperatures rise, the upper line where plants including trees can and do grow will travel uphill. It is even one of the ways we know it was warmer during the Medieval Warm Period: trees grew at higher altitudes."
        },
        {
            "published_date": "2025-10-17T14:00:22",
            "title": "Queensland anti-renewables group cited nonexistent papers in inquiry submissions using AI, publisher says",
            "author": "Graham Readfearn",
            "url": "https://www.theguardian.com/australia-news/2025/oct/18/queensland-anti-renewables-group-cited-nonexistent-papers-in-inquiry-submissions-using-ai-publisher-says",
            "url_media": "https://i.guim.co.uk/img/media/3a4bc615fe21d494e977f4054a939ee65874734a/468_0_2953_2362/master/2953.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=68d70273fb6c9a55001b72271328e849",
            "country": "GB",
            "language": "en",
            "summary": "Rainforest Reserves Australia is known for its anti-renewables stance. The organisation used AI to write more than 100 submissions to councils and state and federal governments since August 2024. RRA came to prominence opposing a small number of windfarm projects in north Queensland, but has become more vocal against renewable energy generally. An open letter criticising the Australian government's focus on renewable energy was signed by several notable Australians."
        },
        {
            "published_date": "2025-10-17T13:56:39",
            "title": "Race Against Time: Can Pakistan Turn the Tide on Ocean Destruction?",
            "author": "Pak Tribune",
            "url": "https://paktribune.com/race-against-time-can-pakistan-turn-the-tide-on-ocean-destruction",
            "url_media": "https://paktribune.com/wp-content/uploads/2025/10/tribune-corner-3-2.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's coastal and marine ecosystems are facing escalating threats from pollution, overfishing and weak environmental governance. Pakistan has taken some steps toward protection, such as declaring Churna Island a Marine Protected Area. Environmentalists warn that without bold and sustained efforts, the country may face irreversible damage to its oceans."
        },
        {
            "published_date": "2025-10-17T13:40:00",
            "title": "Oscar-Winning Icon Diane Keaton Died From Bacterial Pneumonia",
            "author": "",
            "url": "https://www.griffindailynews.com/lifestyles/health/oscar-winning-icon-diane-keaton-died-from-bacterial-pneumonia/article_7443ae29-3f18-5ad4-b42e-bfe27bbc0644.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/e/61/e616ead3-70c0-5f74-a704-6551f13e3101/68f24f7add0e5.image.jpg?crop=1200%2C630%2C0%2C71",
            "country": "US",
            "language": "en",
            "summary": "Griffin, GA (30223) has some passing clouds. High around 80F. Winds SSE at 5 to 10 mph, but it's windy with low 55F temps falling to 55F in the afternoon. It's going to be cloudy."
        },
        {
            "published_date": "2025-10-17T13:39:04",
            "title": "Hottest Octobers in Arizona since 1895",
            "author": "Stacker",
            "url": "https://kyma.com/stacker-arizona/2025/10/17/hottest-octobers-in-arizona-since-1895",
            "url_media": "https://kyma.b-cdn.net/2025/10/68sneakersun18AT.jpg",
            "country": "US",
            "language": "en",
            "summary": "In 2022, the continental United States experienced its third hottest July since 1895. 20 states saw one of their 10 hottest days in the same month. The Earth's temperature has climbed each decade since 1880 by about .14 degrees Fahrenheit. Stacker compiled a ranking of the hottest Octobers in Arizona since 1895 using data from the National Centers for Environmental Information."
        },
        {
            "published_date": "2025-10-17T13:30:27",
            "title": "German Word of the Day: die Kältewelle",
            "author": "Amanda Previdelli",
            "url": "https://www.thelocal.at/20251017/german-word-of-the-day-die-kaltewelle",
            "url_media": "https://assets.thelocal.com/cdn-cgi/rs:fit:1200/quality:75/plain/https://apiwp.thelocal.com/wp-content/uploads/2025/10/watermarks-logo-TL-Word-of-the-day-3.jpg@webp",
            "country": "AT",
            "language": "en",
            "summary": "Die Kältewelle is a compound of Kälte (cold) and Welle (wave). It means a short period of unusually cold weather. It's also used metaphorically for sudden emotional or political chill, like a cold spell between two countries."
        },
        {
            "published_date": "2025-10-17T13:30:17",
            "title": "Manipur experiencing erratic weather patterns: Guv Bhalla",
            "author": "Imphal",
            "url": "https://www.devdiscourse.com/article/science-environment/3666025-manipur-experiencing-erratic-weather-patterns-guv-bhalla",
            "url_media": "https://devdiscourse.blob.core.windows.net/imagegallery/11_03_2020_13_25_34_3607277.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Manipur Governor Ajay Kumar Bhalla said the state is witnessing erratic weather patterns with unpredictable rainfall and unprecedented temperatures reaching up to 43 degrees Celsius. He was speaking at the valedictory function of the two-day Indian Himalayan Region Climate Change Conclave here."
        },
        {
            "published_date": "2025-10-17T13:26:24",
            "title": "PMD dismisses claims of extremely cold winter in Pakistan",
            "author": "",
            "url": "https://www.nation.com.pk/17-Oct-2025/pmd-dismisses-claims-extremely-cold-winter-pakistan",
            "url_media": "https://www.nation.com.pk/digital_images/large/2025-10-17/pmd-dismisses-claims-extremely-cold-winter-pakistan-1760707546-5832.jpeg",
            "country": "PK",
            "language": "en",
            "summary": "The Pakistan Meteorological Department (PMD) has refuted reports predicting an 'extremely harsh winter' in 2024–25. PMD's winter outlook for December to February 2025 is based on data from the World Meteorological Organization (WMO) and international climate models. Most regions of Pakistan are likely to experience slightly above-normal temperatures with normal to slightly below-normal rainfall."
        },
        {
            "published_date": "2025-10-17T13:15:28",
            "title": "Students take to the streets for climate action",
            "author": "Barbados Today",
            "url": "https://barbadostoday.bb/2025/10/17/students-take-to-the-streets-for-climate-action",
            "url_media": "https://barbadostoday.bb/wp-content/uploads/2025/10/Grantley_Adams_Secondary_School_students_holding_the_sign_at_the_front_of_the_march-copy-1024x683.png",
            "country": "BB",
            "language": "en",
            "summary": "Students from primary and secondary schools from Barbados took part in the Student Climate March in Bridgetown on Thursday morning. The march was organised by the Ashley Lashley Foundation. It is the second time the foundation is hosting a student climate march. The initiative aims to encourage youth involvement in climate advocacy."
        },
        {
            "published_date": "2025-10-17T13:12:28",
            "title": "Hottest Octobers in Idaho since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-idaho-since-1895/article_544c047f-0bc1-56d7-b5ea-c93f8ced9d62.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/7/34/734692ee-dd74-55c1-84b4-b867f611adf7/68f244e72fcec.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide.   Â   .   "
        },
        {
            "published_date": "2025-10-17T13:12:27",
            "title": "Hottest Octobers in Arkansas since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-arkansas-since-1895/article_fba0448a-1567-51f0-b352-8d32dd0402d0.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/8/e5/8e55d311-7ad1-5fff-9414-90944758598c/68f248bc23348.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide, according to NOAA's data.    "
        },
        {
            "published_date": "2025-10-17T13:12:27",
            "title": "Hottest Octobers in Oregon since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-oregon-since-1895/article_e8158021-9521-5ab0-b8be-eb6e145bf4a3.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/7/05/7050beb2-68e5-56e4-ac80-69c01ccccef5/68f248b5c0da2.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide.   Â   .   "
        },
        {
            "published_date": "2025-10-17T13:12:26",
            "title": "Hottest Octobers in Arizona since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-arizona-since-1895/article_3da69c0a-3a03-5cce-ad5a-c6a85c67993e.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/2/85/2850e381-2561-5e64-8122-5f0d52ffba75/68f248bcb9f4d.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide, according to NOAA's data.    "
        },
        {
            "published_date": "2025-10-17T13:12:26",
            "title": "Hottest Octobers in Pennsylvania since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-pennsylvania-since-1895/article_6088365e-2b11-5b7c-a2db-75ba9e50df8f.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/6/79/679cba3b-44be-56cc-8a81-2845c3a72288/68f248b646e08.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide.   Â   .   "
        },
        {
            "published_date": "2025-10-17T13:12:25",
            "title": "Hottest Octobers in Michigan since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-michigan-since-1895/article_8f887462-7511-5312-9f74-69d46347d7c1.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/c/13/c13f98c6-f5ed-5fbf-95c3-71c616894363/68f24f6cdbdc6.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide.   Â   .   "
        },
        {
            "published_date": "2025-10-17T13:12:23",
            "title": "Hottest Octobers in Illinois since 1895",
            "author": "Stacker",
            "url": "https://www.santafenewmexican.com/life/features/hottest-octobers-in-illinois-since-1895/article_74d3aa55-8303-5921-bd89-479a55d44993.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/assets/v3/editorial/1/00/1000ded0-3124-52e4-bfa0-922f2bd95a54/68f244e68db81.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": " 2022 will be the third hottest July since 1895 in the continental United States. 20 states saw one of their 10 hottest days in the same month. The year prior, July marked the hottest month on record worldwide, according to NOAA's data.    "
        },
        {
            "published_date": "2025-10-17T13:00:51",
            "title": "Deforestation has 'not meaningfully declined' despite global pledge, experts warn",
            "author": "Aryan Rai",
            "url": "https://www.indiatoday.in/environment/story/global-climate-goal-deforestation-climate-change-global-warming-emissions-forest-fire-nations-working-brazil-amazon-2802810-2025-10-17",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202510/deforestation-kills-5-lakh-people-011403399-16x9.jpg?VersionId=ElRAey9_nu6Krf74FzooHy5LWc0wdqCG",
            "country": "IN",
            "language": "en",
            "summary": "Deforestation \"has not meaningfully declined\" despite a global pledge to halt forest destruction. Tropical primary forests were the hardest hit, with 6.7 million hectares (16.6 million acres) lost in 2024. Deforestation worldwide in 2024 was 3.1 million hectares above the maximum possible level to align with the 2030 goal. Next month's UN climate summit in the Amazon could be a turning point. Brazil will launch an innovative new fund that rewards countries with high tropical forest cover."
        },
        {
            "published_date": "2025-10-17T13:00:48",
            "title": "An Update on the Climate Facts and Fiction",
            "author": "Issues",
            "url": "https://www.realclearpolitics.com/2025/10/16/an_update_on_the_climate_facts_and_fiction_655619.html",
            "url_media": "https://www.realclearpolitics.com/asset/img/social_media_assets/site_logos/rcp.png",
            "country": "US",
            "language": "en",
            "summary": "Unwinding the twisted truths of the global warming activists is the key to understanding the activists' agenda, writes John Sutter. He explains it in terms of their political agenda and their political views.    \"They want to change the world\".  "
        },
        {
            "published_date": "2025-10-17T13:00:05",
            "title": "WRTH lays out climate adaptation plan",
            "author": "William Roller",
            "url": "https://www.record-bee.com/2025/10/17/wrth-lays-out-climate-adaptation-plan",
            "url_media": "https://www.record-bee.com/wp-content/uploads/2025/10/Climateplan1.jpg?w=1024&h=683",
            "country": "US",
            "language": "en",
            "summary": "Shannon Walker-Smith is conducting a tour of the county MACs to gauge priorities for adopting a county-wide Climate Adaption Plan. The first public comments praised the fire district's Watch Duty app, Sheriff Department's emergency broadcasts, and awareness of defensible space."
        },
        {
            "published_date": "2025-10-17T13:00:00",
            "title": "‘Bigger, hotter, faster': Global wildfires drive surge in climate-heating CO2 emissions",
            "author": "",
            "url": "https://www.malaymail.com/news/world/2025/10/17/bigger-hotter-faster-global-wildfires-drive-surge-in-climate-heating-co2-emissions/194936",
            "url_media": "https://www.malaymail.com/malaymail/uploads/images/2025/10/17/304775.jpg",
            "country": "MY",
            "language": "en",
            "summary": "Rampant wildfires in the Americas drove a jump in global greenhouse gas emissions from fires in the year to February. Global temperatures in 2024 were the hottest on record, going above 1.5°C relative to the pre-industrial period for the first time. Global fires emitted over eight billion tonnes of CO₂ in the 2024–2025 period."
        },
        {
            "published_date": "2025-10-17T12:55:22",
            "title": "Australia's rainforests go from carbon sinks to carbon emitters",
            "author": "Aryan Rai",
            "url": "https://www.indiatoday.in/environment/story/australia-climate-change-rainforest-carbon-sink-climate-mitigation-emissions-co2-global-warming-2804590-2025-10-17",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202510/amazon-rainforest-084214177-16x9.jpg?VersionId=8GZ90IR6MqVFFeICUS3h79Z2HP4OJetK",
            "country": "IN",
            "language": "en",
            "summary": "Australia's tropical rainforests are emitting more carbon dioxide than they absorb, according to new research. Extreme temperatures have caused more forest death than growth in Australia's northern tropics since 2000. Global emissions need to be halved by the end of the decade to limit warming to levels agreed under the 2015 Paris climate agreement."
        },
        {
            "published_date": "2025-10-17T12:48:57",
            "title": "UN: Nearly 900 million poor people exposed to climate shocks",
            "author": "leila yazdani",
            "url": "https://en.shafaqna.com/426537/un-nearly-900-million-poor-people-exposed-to-climate-shocks",
            "url_media": "https://en.shafaqna.com/wp-content/uploads/2022/02/cropped-new-logo-s-en-fine-1-32x32.png",
            "country": "AU",
            "language": "en",
            "summary": "Nearly 80% of the world's poorest are directly exposed to climate hazards exacerbated by global warming, according to the United Nations. The UN Development Programme's Haoliang Xu urges world leaders to look at climate action as action against poverty at COP30 in Brazil in November."
        },
        {
            "published_date": "2025-10-17T12:42:00",
            "title": "New Lake Ontario initiative tackles climate hazards alongside Lakes Huron and Superior projects",
            "author": "Mia Litzenberg",
            "url": "https://greatlakesecho.org/2025/10/17/new-lake-ontario-initiative-tackles-climate-hazards-alongside-lakes-huron-and-superior-projects",
            "url_media": "https://greatlakesecho.org/wp-content/uploads/2025/10/COASTAL-RESILIENCE-AUTHORITIES-1170x780.jpg",
            "country": "US",
            "language": "en",
            "summary": "Niagara Peninsula Conservation Authority launched the Lake Ontario Coastal Resilience Pilot Project last summer. The project aims to engage communities in developing a coastal resilience plan over the next four years. It is one of three pilot projects under Natural Resource Canada's Climate-Resilient Coastal Communities Program."
        },
        {
            "published_date": "2025-10-17T11:58:01",
            "title": "La Nina weather conditions looking likely for winter… what does that mean for us?",
            "author": "dougraflik",
            "url": "https://kfiz.com/la-nina-weather-conditions-looking-likely-for-winter-what-does-that-mean-for-us",
            "url_media": "https://kfiz.com/wp-content/uploads/2025/10/la-nina.jpg",
            "country": "US",
            "language": "en",
            "summary": "NOAA's National Weather Service Winter Outlook has been released. La Niña conditions are expected to develop later this fall and will be a factor in the winter outlook. The outlook shows near normal to slightly cooler than normal temperatures for Wisconsin with slightly above precipitation chances for the state."
        },
        {
            "published_date": "2025-10-17T11:33:00",
            "title": "UN warns poorest nations face 'unequal burden' of climate shocks",
            "author": "The News International",
            "url": "https://article.wn.com/view/2025/10/17/UN_warns_poorest_nations_face_unequal_burden_of_climate_shoc",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "The United Nations warned on Friday that nearly 80% of the world's poorest —around 900 million people — are directly exposed to climate risks worsened by global warming. The UN described it as a double and profoundly unequal burden and said that no one is exempt from it. "
        },
        {
            "published_date": "2025-10-17T11:32:11",
            "title": "Tracking Two Areas In Atlantic For Possible Development",
            "author": "The Weather Channel",
            "url": "https://www.yahoo.com/news/videos/tracking-two-areas-atlantic-possible-113211062.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/dISo5bFwE0HCECENV4Vvhg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_weather_channel_videos_110/d7674df650cff291e2b3b5df37728887",
            "country": "US",
            "language": "en",
            "summary": "The National Hurricane Center is keeping an eye on two areas to watch in the Atlantic. The one we are more concerned about is a tropical wave moving westward across the central Atlantic. Gradual development is possible as this system enters the Caribbean Sea next week. The second area of low pressure is located south of Nova Scotia, Canada. There is a low chance of any tropical or subtropical development."
        },
        {
            "published_date": "2025-10-17T11:07:24",
            "title": "Doug Sheridan: Climate Alarm's Constantly Shifting Narrative Pivots Again",
            "author": "David Blackmon",
            "url": "https://blackmon.substack.com/p/doug-sheridan-climate-alarms-constantly",
            "url_media": "https://substackcdn.com/image/fetch/$s_!jqNH!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc4d328a1-302c-4972-9d9c-696405c5b0db_673x665.png",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide emissions from human activities and wildfires rose last year, while the land and oceans' ability to absorb carbon diminished. The global average concentration of CO2 surged by 3.5 parts per million from 2023 to 2024, the largest yearly increase since modern measurements started in 1957."
        },
        {
            "published_date": "2025-10-17T11:06:06",
            "title": "Chilly morning, nice weekend ahead",
            "author": "Hannah Rahner",
            "url": "https://www.wbtw.com/weather-news/weather-forecasts/chilly-morning-nice-weekend-ahead",
            "url_media": "https://www.wbtw.com/wp-content/uploads/sites/22/2025/10/snapshot-63.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "It's the coldest morning of the fall season to date. Temperatures will start in the low to mid-40s inland and near 50 degrees for the beaches. Peak temperatures are expected to be 68-72 degrees. Saturday and Sunday will be nice in the mid and upper-70s with high pressure controlling throughout the weekend. It will be dry on Saturday before a cold front moves through on Sunday."
        },
        {
            "published_date": "2025-10-17T11:04:04",
            "title": "Africa faces disproportionate burden from climate change and adaptation costs",
            "author": "",
            "url": "https://thepoint.gm/africa/gambia/national-news/africa-faces-disproportionate-burden-from-climate-change-and-adaptation-costs",
            "url_media": "https://thepoint.gm/apple-touch-icon.png",
            "country": "GM",
            "language": "en",
            "summary": "The highest temperature anomalies in 2023 were recorded across northwestern Africa, especially in Morocco, coastal parts of Mauritania and northwest Algeria. Extreme heatwaves in July and August affected northern Africa. The rate of sea-level rise around Africa was close to or slightly higher than the global mean rate of 3.4 mm per year. At least 4 700 confirmed deaths in Libya were attributed to flooding following the Mediterranean cyclone 'Storm Daniel' in September. Parts of Morocco, Algeria, Tunisia, Nigeria, Cameroon, Ethiopia, Angola, Zambia, Zimbabwe, and Democratic Republic of Congo experienced severe drought."
        },
        {
            "published_date": "2025-10-17T10:59:59",
            "title": "Meet the bird, lighter than a bar of chocolate, that covers twice the distance of Earth as it migrates",
            "author": "Lifestyle Desk",
            "url": "https://indianexpress.com/article/lifestyle/pets-animals/meet-bird-lighter-than-bar-of-chocolate-twice-distance-earth-migration-10087378",
            "url_media": "https://images.indianexpress.com/2025/06/arctic-tern.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The Arctic Tern makes a round-trip migration of up to 70,000 km every year. It's like flying around the Earth twice in one go. Over its 30-year lifespan, a tern may travel more than 2.4 million km, which is roughly three round-trips to the Moon."
        },
        {
            "published_date": "2025-10-17T10:35:59",
            "title": "Farmworker Wage Rule, New NC Map, $83M SNAP Audit",
            "author": "Steve Anthony",
            "url": "https://wbt.com/1515881/farmworker-wage-rule-new-nc-map-83m-snap-audit",
            "url_media": "https://wbt.com/wp-content/uploads/sites/84/2024/09/17267529852336.jpg?quality=80&strip=all&w=700&crop=0,0,100,400px",
            "country": "US",
            "language": "en",
            "summary": "The U.S. Department of Labor has released a new rule revising how farmworker wages are calculated. Lawmakers in Raleigh have unveiled a proposed congressional map. Many homeowners affected by Hurricane Helene are still waiting on FEMA approval for property buyouts. $83 million in SNAP benefits were delayed to North Carolina recipients due to administrative inefficiencies."
        },
        {
            "published_date": "2025-10-17T10:30:00",
            "title": "What are ‘angel wings'? One of many reasons Ontario residents are warned not to feed birds",
            "author": "Metroland Staff",
            "url": "https://www.insidehalton.com/news/humane-society-not-to-feed-canada-geese-bread/article_7002ea00-67e2-5937-852f-4f4482dccc98.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/d/1f/d1f7e0c5-c7d6-5f63-9a64-61f26586dd65/68f15cf894d2d.image.jpg?crop=1200%2C630%2C0%2C119",
            "country": "CA",
            "language": "en",
            "summary": "A humane society in Southwestern Ontario warned about the dangers of feeding bread to Canada geese and other birds. Feeding wild birds bread can lead to severe consequences for the animals including a devastating condition called angel wing syndrome, which is caused by a lack of wing development."
        },
        {
            "published_date": "2025-10-17T10:30:00",
            "title": "What are ‘angel wings'? One of many reasons Ontario residents are warned not to feed birds",
            "author": "Metroland Staff",
            "url": "https://www.cambridgetimes.ca/news/humane-society-not-to-feed-canada-geese-bread/article_090d27b1-c202-526a-8c34-2363b4342c4f.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/cambridgetimes.ca/content/tncms/assets/v3/editorial/5/7c/57cfbc8c-df6b-5e46-b05d-a6fcd0552b0d/68f15cf8951ed.image.jpg?crop=1200%2C630%2C0%2C119",
            "country": "CA",
            "language": "en",
            "summary": "The Windsor/Essex County Humane Society in Southwestern Ontario warned about the dangers of feeding bread to Canada geese and other birds. Feeding bread to wild birds can lead to a condition called angel wing syndrome, where the last joint of the birds' wings twist outward and pokes out from their side. The condition cripples the birds and renders them unable to fly."
        },
        {
            "published_date": "2025-10-17T10:21:46",
            "title": "India's First Climate Readiness Index Ranks Andhra, Rajasthan, Gujarat As Top 3 Climate-Ready States",
            "author": "ETV Bharat",
            "url": "https://www.etvbharat.com/en/technology/india-climate-readiness-index-ranks-andhra-rajasthan-gujarat-as-top-3-climate-ready-states-enn25101701724",
            "url_media": "https://imgs.etvbharat.com/etvbharat/prod-images/17-10-2025/1200-675-25225216-thumbnail-16x9-jghg.jpg",
            "country": "IN",
            "language": "en",
            "summary": "By 2050, Indian heatwaves could exceed human survivability thresholds in shaded conditions, potentially impacting 500 million people. Andhra Pradesh, Rajasthan and Gujarat lead the Climate Readiness Index (CRI), a first-of-its-kind, indicator-based framework that evaluates preparedness across India's highest GHG-emitting states."
        },
        {
            "published_date": "2025-10-17T10:04:00",
            "title": "Fund of £50k to help fight climate change impacts in Surrey",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/10/17/Fund_of_50k_to_help_fight_climate_change_impacts_in_Surrey",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Surrey County Council says environmental challenges include species decline, flooding and fires, and fires. It's not clear what the future holds for the environment in the long-term. The council is concerned about species decline and flooding, among other things.   "
        },
        {
            "published_date": "2025-10-17T09:55:04",
            "title": "UN Warns: Nearly 900 Million Poor People Exposed to Climate Shocks",
            "author": "rama",
            "url": "https://sana.sy/en/uncategorized/2272849",
            "url_media": "https://cdn.sananews.sy/2025/10/UN-1.jpg",
            "country": "SY",
            "language": "en",
            "summary": "The United Nations warned Friday that about 900 million people are directly exposed to climate change hazards exacerbated by global warming. Haoliang Xu, acting administrator of the UN Development Programme, called on world leaders of the upcoming COP30 UN climate summit in Brazil in November to consider 'climate action as action against poverty'"
        },
        {
            "published_date": "2025-10-17T09:51:47",
            "title": "Australian rainforests no longer a carbon sink: study",
            "author": "e NCA",
            "url": "https://www.enca.com/lifestyle/australian-rainforests-no-longer-carbon-sink-study",
            "url_media": "https://www.enca.com/sites/default/files/styles/large/public/afp/2025-10/doc-78XT3T3-%40photo0.jpg.webp?itok=waa7SPYT",
            "country": "ZA",
            "language": "en",
            "summary": "Australia's tropical rainforests are emitting more carbon dioxide than they absorb. Extreme temperatures have caused more forest death than growth in Australia's northern tropics. The main cause was extreme temperatures linked to climate change, and its effects on the moisture in the atmosphere and drought."
        },
        {
            "published_date": "2025-10-17T09:48:42",
            "title": "Why Wildfires And Super Pollutants Have Become A ‘Vicious Circle'",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/10/17/Why_Wildfires_And_Super_Pollutants_Have_Become_A_Vicious_Cir",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Clean Air Fund chief executive Jane Burston said climate change creates an increased risk of wildfires, which increases the impact of climate change, which in turn increases the risk of climate-related disasters like climate change-caused droughts and wildfires.   "
        },
        {
            "published_date": "2025-10-17T09:48:00",
            "title": "Climate change could make it dangerous for humans to go outside",
            "author": "Bob Ward",
            "url": "https://www.express.co.uk/news/science/2122594/climate-change-dangerous-humans",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/151/1200x630/6495901.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Bob Ward is the Policy and Communications Director at the Grantham Institute. He believes that concerns over climate change are not rooted in hysteria and are not restricted to the non-scientific community. Global average temperature is already 1.4 degrees Celsius degrees higher than before the Industrial Revolution. "
        },
        {
            "published_date": "2025-10-17T09:45:15",
            "title": "UK Must Prepare for 2°C Global Warming by 2050, Climate Advisers Warn",
            "author": "Ishwi Singh",
            "url": "https://newsable.asianetnews.com/international/climate-change/uk-must-prepare-for-2-c-global-warming-by-2050-climate-advisers-warn-articleshow-1th8exf",
            "url_media": "https://static.asianetnews.com/images/w-1280,h-720,format-jpg,imgid-01k0278jbjkt38nh94gb18zf0p,imgname-gettyimages-521726988-1752421386609.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The UK is not prepared for a 2°C global warming rise by 2050, warns the Climate Change Committee. Many parts of the UK are already experiencing the effects of climate change. This year, the country has witnessed four heatwaves, lower-than-average rainfall in some regions and periods of drought. The chances of heatwaves occurring in any given year would increase from 40% to 80%, and sea levels could rise by 15-25 cm. The CCC recommends new homes and infrastructure are built with future temperature increases in mind."
        },
        {
            "published_date": "2025-10-17T09:34:37",
            "title": "900 million of the world's poor face rising threats from climate change",
            "author": "Francis",
            "url": "https://timeskuwait.com/900-million-of-the-worlds-poor-face-rising-threats-from-climate-change",
            "url_media": "https://timeskuwait.com/wp-content/uploads/2025/10/111-209.jpeg",
            "country": "KW",
            "language": "en",
            "summary": "Nearly 80 percent of the world's poor are directly exposed to climate risks, according to a new United Nations report. Sub-Saharan Africa and South Asia remain the most affected regions. The study calls for integrated solutions that combine poverty alleviation, emission reduction, climate adaptation, and ecosystem restoration."
        },
        {
            "published_date": "2025-10-17T09:27:00",
            "title": "Two from Congress say climate change hitting homeowners insurance, mortgages",
            "author": "Alan Wooten",
            "url": "https://www.newsbreak.com/the-center-square-509740/4297661424621-two-from-congress-say-climate-change-hitting-homeowners-insurance-mortgages",
            "url_media": "https://img.particlenews.com/img/id/3zlVIg_15kQ6TGs00",
            "country": "PH",
            "language": "en",
            "summary": "Climate change is impacting rising insurance rates and access to mortgages, says two members of Congress from North Carolina and Rhode Island. North Carolina Coastal Resources Commission prepared the 2024 Sea Level Rise Science Update for the state Department of Environmental Quality. The analysis predicts a 1-foot sea level rise in the next 25 years."
        },
        {
            "published_date": "2025-10-17T09:27:00",
            "title": "Rodent populations are on the rise due to climate change. See how to keep the out of your home.",
            "author": "The Augusta Chronicle",
            "url": "https://article.wn.com/view/2025/10/17/Rodent_populations_are_on_the_rise_due_to_climate_change_See",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Warmer winters mean longer breeding windows for rodents. Deer mice and Norway rats are a few of the most common rodent's homeowner's encounter. Climate change can cause an increase in rat numbers, as well as rising global temperatures.       .  "
        },
        {
            "published_date": "2025-10-17T09:19:17",
            "title": "Anticipated Surge in October Temperatures to Set New Records Across Numerous States",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/anticipated-surge-in-october-temperatures-to-set-new-records-across-numerous-states",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/10/Record-breaking-October-temperatures-expected-in-multiple-states.au2Ffs2F68d0b07f-58cf-4456-ae0a-62704eb5a501.png",
            "country": "NG",
            "language": "en",
            "summary": "There is a heatwave sweeping through the Australian outback. It is predicted to escalate over the weekend and in the coming days. South Australia, Queensland, New South Wales, and the Australian Capital Territory may all witness record-breaking temperatures for October. Sydney is set to have a cooler weekend with highs of 22 degrees. Canberra is expected to be hit with a heat surge early next week."
        },
        {
            "published_date": "2025-10-17T09:10:45",
            "title": "Volta Region Battles Hunger as Food Insecurity Deepens Across Ghana",
            "author": "Africa",
            "url": "https://www.newsghana.com.gh/volta-region-battles-hunger-as-food-insecurity-deepens-across-ghana",
            "url_media": "https://b843437.smushcdn.com/843437/wp-content/uploads/2024/08/logo-newsghana.png?lossy=2&strip=1&webp=1",
            "country": "GH",
            "language": "en",
            "summary": "The number of food-insecure Ghanaians rose by 900,000 during 2024. The Volta Region recorded the highest incidence of food insecurity at 52 percent in the fourth quarter of 2024, up slightly from 51.5 percent earlier in the year. In Greater Accra, despite economic challenges, food insecurity stands at 29 percent, up from 20.2 percent over the same period. Rural communities bear a disproportionate burden of the nation's hunger problem. Ghana spends approximately US$2 billion annually on imported food."
        },
        {
            "published_date": "2025-10-17T09:00:17",
            "title": "Continued global warming may fundamentally alter El Nino, La Nina, amplify temp changes: Study",
            "author": "New Delhi",
            "url": "https://www.devdiscourse.com/article/science-environment/3665583-continued-global-warming-may-fundamentally-alter-el-nino-la-nina-amplify-temp-changes-study",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_29_38_8242443.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "El Nino and La Nina climate cycles could undergo fundamental changes over the next 30-40 years under continued global warming, according to a new study. The changes could have wide-ranging whiplash impacts on regional hydroclimates. Global preparedness is important to deal with the amplified effects of an increasingly regular ENSO."
        },
        {
            "published_date": "2025-10-17T09:00:00",
            "title": "Shut The CCC Now!",
            "author": "Guest Blogger",
            "url": "https://wattsupwiththat.com/2025/10/17/shut-the-ccc-now",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/10/charlesrotter_headless_cartoon_chicken_running_in_panic_midjourney-copy.webp?fit=1024%2C512&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "The Climate Change Committee wrote a letter to the government, warning that the UK should be prepared to cope with weather extremes as a result of at least 2C of global warming by 2050. The letter is an attempt to garner political support to oppose the Conservatives and Reform plans to abolish them if they get the chance."
        },
        {
            "published_date": "2025-10-17T09:00:00",
            "title": "Words on Birds: Help birds survive the cold",
            "author": "Steve Grinley",
            "url": "https://www.newburyportnews.com/news/local_news/words-on-birds-help-birds-survive-the-cold/article_89a51a1d-ce68-4163-a001-4f6ab44267a7.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/newburyportnews.com/content/tncms/assets/v3/editorial/8/a4/8a4dbafe-7551-5fa5-884d-ad9217c0b4f6/65bbf522c6639.image.jpg?crop=333%2C333%2C349%2C141&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Juncos, white-throated and white-crowned sparrows are migrating through Plum Island. Most of the catbirds have headed south, but a few have lingered on the island. The cold nights have made it harder for them to migrate."
        },
        {
            "published_date": "2025-10-17T08:53:20",
            "title": "Herd on the Terrace: Climate heating up between Fortescue and Woodside",
            "author": "",
            "url": "https://thewest.com.au/business/herd-on-the-terrace/herd-on-the-terrace-climate-heating-up-between-fortescue-and-woodside--c-20345495",
            "url_media": "https://images.thewest.com.au/publication/C-20345495/da593624cd9a6b79d4b07d60d98d9a2829a41234-16x9-x57y0w2011h1131.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Herd on the Terrace is warming up between Fortescue and Woodside due to the climate change between the two places.       .   for confidential support call the Samaritans in the UK on 08457 90 90 90 or visit a local Samaritans branch."
        },
        {
            "published_date": "2025-10-17T08:53:00",
            "title": "Volunteers patrol Chicago streets to warn neighbors when ICE agents are near",
            "author": "",
            "url": "https://www.kdlg.org/2025-10-17/volunteers-patrol-chicago-streets-to-warn-neighbors-when-ice-agents-are-near",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/36cf3b2/2147483647/strip/true/crop/467x622+78+0/resize/150x200!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2024%2F04%2F01%2Fsergio-marti-nez-beltra-n_sq-2f4bdbd6594ebebe97f183c9c16f5dab9fcf46aa.jpg",
            "country": "US",
            "language": "en",
            "summary": "There's growing concern around the ICE presence in the Chicago area. Grassroots community efforts to oppose ICE are ramping up. Currently Playing on KDLG 670 AM and FM 89.9 is Public Radio for Alaska's Bristol Bay. It's also on Facebook, Twitter and LinkedIn."
        },
        {
            "published_date": "2025-10-17T08:52:39",
            "title": "How climate change and misaligned seasonal cues affect grey tree frogs and other wildlife",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/10/17/How_climate_change_and_misaligned_seasonal_cues_affect_grey_",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change poses a significant threat to grey tree frogs. Rising temperatures and changing rainfall patterns are altering the delicate ecosystems these frogs inhabit, leading to changes in their habitats, breeding patterns, and survival. It is affecting their habitats and breeding patterns. It's also affecting their survival."
        },
        {
            "published_date": "2025-10-17T08:51:40",
            "title": "Double whammy: Shanghai is sinking while sea level rises fast",
            "author": "South China Morning Post",
            "url": "https://article.wn.com/view/2025/10/17/Double_whammy_Shanghai_is_sinking_while_sea_level_rises_fast",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Shanghai is sinking while the sea level along China's coastline is rising fast. It's the fastest in 4,000 years. It could threaten China's financial hub and the global supply of resources.      Â   y  "
        },
        {
            "published_date": "2025-10-17T08:50:00",
            "title": "Our Enduring Approach To Changing Climate",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/our-enduring-approach-to-changing-climate-1552582",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Government has released New Zealand's first National Adaptation Framework. The Framework includes four pillars with 16 actions designed to ensure New Zealand is prepared for the effects of climate change. The first iteration of the map is expected by 2027 and will show where flooding is likely to happen."
        },
        {
            "published_date": "2025-10-17T08:47:10",
            "title": "15 mn in India affected by 2024-25 wildfires",
            "author": "",
            "url": "https://www.ahmedabadmirror.com/15-mn-in-india-affected-by-2024-25-wildfires/81901074.html",
            "url_media": "https://media.ahmedabadmirror.com/am/uploads/mediaGallery/image/1760639561923.jpg-org",
            "country": "IN",
            "language": "en",
            "summary": "15 million people in India were affected due to wildfires in 2024-25, with Uttar Pradesh being the most impacted region. India is among the worst affected countries, with 15 million in the Democratic Republic of Congo, 5 million each in Nigeria, China, Mozambique and South Sudan. A total of 3.7 million square kilometres was burned by wildfires globally in the same period."
        },
        {
            "published_date": "2025-10-17T08:45:00",
            "title": "ACES: Cooking for the climate",
            "author": "ACES",
            "url": "https://www.newburyportnews.com/opinion/columns/aces-cooking-for-the-climate/article_e7d297a0-1c40-40fb-a953-d7a2de29a7a2.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/newburyportnews.com/content/tncms/custom/image/867ad2ec-8965-11e5-8451-8f0d0d73f7e3.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "America is obsessed with cooking. It makes people feel good, creative and connected to others. Adding some environmental thinking to cooking might be helpful to the climate. ACES – The Alliance of Climate and Environmental Stewards is promoting environmental stewardship and leadership through its educational columns."
        },
        {
            "published_date": "2025-10-17T08:35:29",
            "title": "Climate hoax levels increase by record amount in 2024",
            "author": "",
            "url": "https://www.fark.com/comments/13847892/182273832",
            "url_media": "https://usrimg-full.fark.net/O/Ow/fark_OwOQolgNwCDKxjBm8R4ZobUmk_E.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1760932800&Signature=LMVnnCSSufptxFSe9lNsP%2FPxO8w%3D",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide (CO2) levels in the atmosphere soared by a record amount to new highs in 2024. There were 3.5 billion people on Earth when Confabulat was born. In 2025 there will be 8.2 billion people, so we need to get everyone spayed and neutered."
        },
        {
            "published_date": "2025-10-17T08:31:28",
            "title": "World on track to add 57 superhot days a year",
            "author": "",
            "url": "https://www.ahmedabadmirror.com/world-on-track-to-add-57-superhot-days-a-year/81901075.html",
            "url_media": "https://media.ahmedabadmirror.com/am/uploads/mediaGallery/image/1760639673434.jpg-org",
            "country": "IN",
            "language": "en",
            "summary": "The world is on track to add nearly two months of dangerous superhot days each year by the end of the century. Since 2015, the world has already added 11 such days on average. The weeklong southern Europe heat wave in 2023 is now 70% more likely and 0.6 C (1.1 F) warmer than it was 10 years ago."
        },
        {
            "published_date": "2025-10-17T08:30:00",
            "title": "Marine heat wave known as ‘the Blob' returns to Pacific",
            "author": "",
            "url": "https://www.thedailyworld.com/news/marine-heat-wave-known-as-the-blob-returns-to-pacific",
            "url_media": "https://www.thedailyworld.com/wp-content/uploads/2025/10/40630660_web1_251018-ADW-Blob_1.jpg",
            "country": "US",
            "language": "en",
            "summary": "A massive heat wave is hitting the Pacific Ocean from Kamchatka to California. Cool water is keeping surface temperatures near the Oregon and Washington coasts closer to normal. Since May, an ever-shifting mass of overheated water has occupied much of the northern half of Pacific Ocean. In early September, it covered 3 million square miles, about the size of the contiguous United States. This year's Blob has mostly spared the Pacific Northwest. Last year's blob harmed salmon and shellfish, fueled toxic algae blooms and killed seabirds by the millions."
        },
        {
            "published_date": "2025-10-17T08:15:00",
            "title": "Paris pledges would curb extreme heat but climate goals at risk",
            "author": "Bloomberg",
            "url": "https://economictimes.indiatimes.com/small-biz/sustainability/paris-pledges-would-curb-extreme-heat-but-climate-goals-at-risk/articleshow/124620312.cms",
            "url_media": "https://img.etimg.com/thumb/msid-124620378,width-1200,height-630,imgsize-611495,overlay-etrise/articleshow.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The Paris climate accord moderated the planet's warming trajectory to 2.6C above pre-industrial levels by the end of the century, according to new research from Climate Central and World Weather Attribution. The findings come as officials in the UK and the European Union raise doubts over whether enough is being done to meet the targets set out in Paris a decade ago."
        },
        {
            "published_date": "2025-10-17T08:11:34",
            "title": "Why Wildfires And Super Pollutants Have Become A ‘Vicious Circle'",
            "author": "Jamie Hailstone",
            "url": "https://www.forbes.com/sites/jamiehailstone/2025/10/17/why-wildfires-and-super-pollutants-have-become-a-vicious-circle",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/68f1f840e2b19841868925f7/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "There is growing evidence that climate change and wildfires are being exacerbated by climate change. Between March 2024 and February 2025, fires scorched 3.7 million square kilometres worldwide and emitted over 8 billion tonnes of carbon dioxide into the atmosphere. Wildfires in Eastern Siberia have been linked to elevated black carbon levels in the Arctic between 2019 and 2021. The Clean Air Fund is involved in a project in Bogota, Colombia where wildfires are increasingly happening within the city boundaries."
        },
        {
            "published_date": "2025-10-17T08:04:02",
            "title": "Rodent populations are on the rise due to climate change. See how to keep the out of your home.",
            "author": "Erica Van Buren",
            "url": "https://www.augustachronicle.com/story/news/environment/2025/10/17/climate-trends-like-warmer-winters-makes-longer-breeding-season-for-rodents/86728584007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/04/08/USAT/82991957007-20170706-t-234311-z-1553021740-rc-18-a-08-d-8-fe-0-rtrmadp-3-washingtonhantavirus.JPG?auto=webp&crop=3053,1718,x0,y153&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Rising global temperatures can cause longer breeding seasons and larger rodent populations. Longer rodent breeding seasons create health risks, fire hazards, and disease transmission. Rodents are opportunistic pests seeking food, warmth, and shelter wherever they can, which is why they're prevalent in homes and businesses."
        },
        {
            "published_date": "2025-10-17T08:00:23",
            "title": "Rising floods threaten rice fields, crops in Tay Ninh",
            "author": "Sggp",
            "url": "https://en.sggp.org.vn/rising-floods-threaten-rice-fields-crops-in-tay-ninh-post121079.html",
            "url_media": "https://image.sggp.org.vn/1200x630/Uploaded/2025/negesfjozly/2025_10_17/de-bao-3-1682-9721jpg-4091-7918.jpg",
            "country": "VN",
            "language": "en",
            "summary": "There is flooding in Dong Thap Muoi region of Tay Ninh Province due to prolonged heavy rains and floodwaters from upstream. Dozens of hectares of rice fields, vegetables, and fruit trees have been submerged. In Vinh Thanh Commune, several sections of embankments have overflowed or breached, leaving nearly 30 hectares deeply flooded and 180 more hectares waterlogged. Thousands of hectares used for rice and vegetable cultivation are also at high risk of flooding if heavy rain persists. Local task forces and residents are urgently reinforcing vulnerable sections using sandbags, bamboo stakes, and rock cages to protect the embankment and minimize flooding damage to the autumn–winter and upcoming winter–spring"
        },
        {
            "published_date": "2025-10-17T06:59:55",
            "title": "Earth faces nearly two more months of extreme heat every year",
            "author": "Craig Saueurs",
            "url": "https://www.euronews.com:443/green/2025/10/17/there-will-be-pain-scientists-warn-billions-face-dangerous-levels-of-heat-this-century",
            "url_media": "https://static.euronews.com/articles/stories/09/51/54/03/1200x675_cmsv2_b6375b01-a557-5434-8399-fb057a206147-9515403.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The world is on track to add nearly two months of dangerous superhot days each year by the end of the century. Small, poorer nations will be hit far more often than the biggest carbon-polluting countries. The weeklong southern Europe heat wave in 2023 is now 70% more likely and 0.6°C warmer than it was 10 years ago."
        },
        {
            "published_date": "2025-10-17T06:49:34",
            "title": "Double whammy: Shanghai is sinking while sea level rises fast",
            "author": "Holly Chik",
            "url": "https://www.scmp.com/news/china/science/article/3329369/double-whammy-shanghai-sinking-while-sea-level-rises-fast",
            "url_media": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/10/17/4eeeafeb-9f26-4a6e-8b70-4f1eefc3d42c_f7ae3008.jpg?itok=g_Xq0LDD&v=1760683001",
            "country": "HK",
            "language": "en",
            "summary": "The sea level along China's coastline is rising fast. Many of China's largest and most economically important cities are concentrated in delta regions, which are flat lands close to water. They are ideal for urban development but vulnerable to flooding. The average rate of the rise was around 1.5mm a year."
        },
        {
            "published_date": "2025-10-17T06:40:09",
            "title": "Nearly 900 mln poor people exposed to climate shocks: UN",
            "author": "",
            "url": "https://www.hurriyetdailynews.com/nearly-900-mln-poor-people-exposed-to-climate-shocks-un-214769",
            "url_media": "https://image.hurimg.com/i/hurriyet/75/200x200/68f20ef7a135420f47a2e8a5.jpg",
            "country": "TK",
            "language": "en",
            "summary": "Nearly 80 percent of the world's poorest are directly exposed to climate hazards exacerbated by global warming. About 18 percent of people live in \"acute multidimensional\" poverty based on factors like infant mortality and access to housing, sanitation, electricity and education. Sub-Saharan Africa and South Asia are particularly affected by such poverty."
        },
        {
            "published_date": "2025-10-17T06:29:44",
            "title": "Record-breaking October temperatures expected in multiple states",
            "author": "Joseph Sahyoun5:29pm",
            "url": "https://www.9news.com.au/national/record-heat-set-to-hit-three-states-october/a6114dca-4ae5-446e-8765-48d5aa6ffcbf",
            "url_media": "https://imageresizer.static9.net.au/2M5qsI4EWvpyWGsfUsxbI5NvKk0=/0x65:1080x672/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F68d0b07f-58cf-4456-ae0a-62704eb5a501",
            "country": "AU",
            "language": "en",
            "summary": "There is a large area of outback heat that is spreading across the country. South Australia, Queensland, NSW, and the ACT could all break their October heat records for October. Western Australia's north-west saw a large buildup of hot air last week. Parts of Australia's south-east are also set to be hit with premature heat later this weekend and into next week."
        },
        {
            "published_date": "2025-10-17T06:25:37",
            "title": "World to add about 57 superhot days a year",
            "author": "Seth Borenstein",
            "url": "https://qconline.com/article_276971c3-99b3-57db-bdfd-4e04f8b4f534.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/qconline.com/content/tncms/custom/image/d865ccfe-9f51-11e5-b21d-1fcfe817a822.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "The world is on track to add almost two months of dangerous superhot days each year by the end of the century. Poor small nations are hit more often than the biggest carbon-polluting countries, according to a study released Thursday. The study was released by the United Nations."
        },
        {
            "published_date": "2025-10-17T06:25:24",
            "title": "As the world discovers the Faroe Islands, there's a push for local food",
            "author": "Cara Anna",
            "url": "https://www.washingtonpost.com/lifestyle/2025/10/17/faroe-islands-food-farming-seafood-climate-travel/10343472-ab22-11f0-a2bc-82cf6840599d_story.html",
            "url_media": "https://palomaimages.washingtonpost.com/prod/512x288_VoraciouslyRecipes_tstmp_1623881856.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Faroe Islands have poor soil and little room for planting. Potatoes and rhubarb are local staples. The farmers' market in Torshavn looked sad because conditions aren't friendly for growing food there.   .    "
        },
        {
            "published_date": "2025-10-17T06:21:30",
            "title": "Climate chief says Queensland coal power extension is ‘for the birds'",
            "author": "Paul Karp",
            "url": "https://www.afr.com/politics/climate-chief-says-queensland-coal-power-extension-is-for-the-birds-20251017-p5n393",
            "url_media": "https://static.ffx.io/images/$zoom_0.1635%2C$multiply_4%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/f922acc879fb16375ac90ff341d6ae9be521bfee",
            "country": "AU",
            "language": "en",
            "summary": "Albanese government's climate change adviser ridiculed Queensland's plans to wind back its renewable energy targets and extend coal-fired power. Matt Kean told an Investor Group on Climate Change summit an extension of up to 19 years for coal power in Queensland was 'for the birds' and urged investors to pursue firmed renewable energy."
        },
        {
            "published_date": "2025-10-17T06:00:07",
            "title": "Manipur: Conclave On Indian Himalayan Region Climate Change Underway In Imphal",
            "author": "North East Today",
            "url": "https://northeasttoday.in/northeast/manipur-conclave-on-indian-himalayan-region-climate-change-underway-in-imphal",
            "url_media": "https://northeasttoday.in/wp-content/uploads/2025/10/IMG-20251017-WA0008.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Two-day Indian Himalayan Region Climate Change Conclave was inaugurated on Thursday at the City Convention Centre, Imphal. Dr. Puneet Kumar Goel, IAS, Chief Secretary, Government of Manipur, was the Chief Guest. Shri Arun Kumar Sinha, Principal Secretary (Forest, Environment & Climate Change), presided over the function."
        },
        {
            "published_date": "2025-10-17T05:58:30",
            "title": "Paris Agreement could help the world avoid 57 extreme heat days annually, study finds",
            "author": "THT Online",
            "url": "https://thehimalayantimes.com/environment/paris-agreement-could-help-the-world-avoid-57-extreme-heat-days-annually-study-finds",
            "url_media": "https://thehimalayantimes.com/thehimalayantimes/uploads/images/2025/10/17/43391.jpg",
            "country": "NP",
            "language": "en",
            "summary": "The 2015 Paris Agreement could help the world avert 57 extremely hot days each year if countries deliver on their current emission-cutting pledges and limit global warming to 2.6°C this century. Since 2015, a 0.3°C rise in global temperatures has already added 11 hot days per year."
        },
        {
            "published_date": "2025-10-17T05:48:55",
            "title": "CO₂ Levels Hit Record High in 2024: UN Warns of Climate Tipping Point",
            "author": "Ishwi Singh",
            "url": "https://newsable.asianetnews.com/international/climate-change/co2-levels-hit-record-high-in-2024-un-warns-of-climate-tipping-point-articleshow-9gwpftf",
            "url_media": "https://static.asianetnews.com/images/w-1280,h-720,format-jpg,imgid-01k5k029k386nb7zfahzfzcj47,imgname-wildfire-smoke--1--1758352975459.png",
            "country": "IN",
            "language": "en",
            "summary": "Carbon dioxide levels in the air reached a new all-time high in 2024, according to the United Nations. The report comes just before COP30, a major climate summit that will take place in Brazil in November. WMO urges immediate steps to cut emissions and slow climate change."
        },
        {
            "published_date": "2025-10-17T05:02:00",
            "title": "PACIFIC: Collision Of Crises Deepens Child Nutrition Challenges In PNG, Solomon Islands And Vanuatu",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/pacific-collision-of-crises-deepens-child-1552878",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1453749024858-4bca89bd9edc%3Fixlib%3Drb-1.2.1%26amp%3Bixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1307%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "A new Save the Children study warns that climate change is worsening child malnutrition in Papua New Guinea, Solomon Islands and Vanuatu. Melanesia faces a 'triple burden of malnutrition' as one in three Melanesian children faces stunting, anemia, or being overweight. In 2023, Vanuaton experienced three severe tropical cyclones."
        },
        {
            "published_date": "2025-10-17T05:01:38",
            "title": "Investment can create millions of jobs, spur growth in BD",
            "author": "Anniversary Issue-I",
            "url": "https://thefinancialexpress.com.bd/national/investment-can-create-millions-of-jobs-spur-growth-in-bd",
            "url_media": "https://tfe-bd.sgp1.cdn.digitaloceanspaces.com/posts/121300/climate-adaptation.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Investing in climate adaptation and resilience is a powerful economic strategy that can generate trillions in global economic gains and create millions of jobs. Global adaptation market is projected to reach US$1.3 trillion annually by 2030. Developed countries experience ten times more damage from extreme weather than the high-income nations. Scaling up adaptation measures could increase economic growth in the developing countries by up to 15 per cent by 2050."
        },
        {
            "published_date": "2025-10-17T04:41:56",
            "title": "Australia's Tropical Rainforests Cross Critical Tipping Point, Now Emitting More Carbon Than They Absorb, Finds Landmark Study",
            "author": "FPJ News Service",
            "url": "https://www.freepressjournal.in/world/australias-tropical-rainforests-cross-critical-tipping-point-now-emitting-more-carbon-than-they-absorb-finds-landmark-study",
            "url_media": "https://media.assettype.com/freepressjournal/import/2016/10/reservoirspl.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Australia's tropical rainforests are emitting more carbon than they absorb. It's the first recorded instance of any tropical forest on Earth switching from a carbon sink to a carbon source. Extreme heat, prolonged droughts, and more frequent cyclones have pushed tree mortality rates above growth levels."
        },
        {
            "published_date": "2025-10-17T04:38:00",
            "title": "Does Individual Climate Action Distract From Big Picture? New Research Has Answers",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/does-individual-climate-action-distract-from-1552864",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/def_rota/news2.jpeg",
            "country": "US",
            "language": "en",
            "summary": "New research suggests that trying to change people's climate habits won't hurt support for big picture solutions. Dr Omid Ghasemi is a Research Associate at the UNSW Institute for Climate Risk & Response investigating how behavioural science can drive climate action. The team surveyed and ran experiments with more than 1200 people from Iran and Australia."
        },
        {
            "published_date": "2025-10-17T04:34:21",
            "title": "Tennessee Conservation Council Assists Farmers in Rebuilding Post-Hurricane Helene",
            "author": "Internewscast",
            "url": "https://internewscast.com/local-news/tennessee-conservation-council-assists-farmers-in-rebuilding-post-hurricane-helene",
            "url_media": "https://www.wjhl.com/wp-content/uploads/sites/98/2021/04/holston-river.jpg?w=900",
            "country": "NG",
            "language": "en",
            "summary": "The Appalachian Resource Conservation and Development Council (ARCD) organized a Tennessee Stream Team Recruitment Event in Jonesborough, Tennessee. ARCD's mission is to restore the agricultural landscape in the aftermath of Hurricane Helene and recruit volunteers to help farmers affected by the disaster."
        },
        {
            "published_date": "2025-10-17T04:12:27",
            "title": "Nearly 900 mn poor people exposed to climate shocks, UN warns",
            "author": "Amélie BOTTOLLIER-DEPOIS AFP",
            "url": "https://www.wyomingnews.com/news/national/nearly-900-mn-poor-people-exposed-to-climate-shocks-un-warns/article_865884eb-e825-5a9d-996e-26b50b18db88.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/wyomingnews.com/content/tncms/assets/v3/editorial/e/62/e62ea50b-6387-5303-813f-ab9ff9112725/68f1d1db3b5a7.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "U.N.: About 900 million people are directly exposed to climate hazards exacerbated by global warming. The poorest are facing the harshest impact, says Haoliang Xu, acting administrator of the U.N. Development Programme. The world's poor are bearing a \"double and deeply unequal burden\""
        },
        {
            "published_date": "2025-10-17T04:00:00",
            "title": "Climate denialists can't ignore this evidence",
            "author": "Mark Gongloff",
            "url": "https://www.phillytrib.com/commentary/climate-denialists-can-t-ignore-this-evidence/article_302ae6f1-6b09-42eb-8dd1-8dfe710122a1.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/phillytrib.com/content/tncms/assets/v3/editorial/c/65/c657d934-1593-4466-9e70-ce1c3e743cad/68e80b6cb7572.image.jpg?crop=1024%2C538%2C0%2C72",
            "country": "US",
            "language": "en",
            "summary": "Zeke Hausfather, a climate scientist at Berkeley Earth, has produced a chart showing the percentage of the world's land that has experienced its hottest month on record in each decade since the 1870s. The planet is heating up as a result of the greenhouse gases humans pump into the atmosphere."
        },
        {
            "published_date": "2025-10-17T03:55:00",
            "title": "La Niña returns: What it means for South Africa",
            "author": "Yasmine Jacobs",
            "url": "https://iol.co.za/news/south-africa/2025-10-17-la-nia-returns-what-it-means-for-south-africa",
            "url_media": "https://iol-prod.appspot.com/image/c553fe63eb5c285d8ae13220f66b6d1f79c65047/1280/jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "La Niña is set to return. South Africans can expect a wetter-than-normal summer rainfall. There is a 55% chance of a return to ENSO-neutral conditions by January–March 2026. There will be an increased risk of flooding events and storms."
        },
        {
            "published_date": "2025-10-17T03:36:07",
            "title": "Chicago winter could be coldest, snowiest in years thanks to weather phenomenon called \"The Blob\"",
            "author": "David Yeomans",
            "url": "https://www.msn.com/en-us/weather/topstories/chicago-winter-could-be-coldest-snowiest-in-years-thanks-to-weather-phenomenon-called-the-blob/ar-AA1ODuZU",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "This winter could be similar to the winter of 2013-2014 because of a warm blob over the North Pacific Ocean. La Niña conditions favor a Great Lakes storm track and can lead to colder, snowier winters in Chicago. The winter of 2010-2011 was Chicago's 10th-snowiest on record with 56.3 inches."
        },
        {
            "published_date": "2025-10-17T02:55:20",
            "title": "Australia must declare war on the great white shark",
            "author": "Fred Pawle",
            "url": "https://www.spiked-online.com/2025/10/17/australia-must-declare-war-on-the-great-white-shark",
            "url_media": "https://www.spiked-online.com/wp-content/uploads/2025/10/shark-1536x864.jpg",
            "country": "GB",
            "language": "en",
            "summary": "There have been 21 fatal shark attacks in Australia in the past five years. Great whites have been protected in all Australian waters for 25 years. They are responsible for 19 of these attacks, but politicians and 'experts' refuse to lift the protections. The consequence for tourism is high."
        },
        {
            "published_date": "2025-10-17T02:05:00",
            "title": "Robins will thrive this autumn if 2 foods are left out in gardens",
            "author": "Claire Schofield",
            "url": "https://www.express.co.uk/life-style/garden/2121268/robins-thrive-autumn-foods-gardens",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/13/1200x630/6489438.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Robins don't migrate from the UK in the winter so gardeners are urged to leave food and water out for them on a regular basis. Robins need high energy foods to help them thrive at this time of the year so experts advise offering a combination of sunflower seeds and mealworms."
        },
        {
            "published_date": "2025-10-17T01:53:04",
            "title": "Norway's Meteorological Institute Fakes da Science™",
            "author": "epimetheus",
            "url": "https://fackel.substack.com/p/norways-meteorological-institute",
            "url_media": "https://substackcdn.com/image/fetch/$s_!Dt-H!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8216e5f5-3cfe-4146-8dd5-7db52bc5464a_1300x1481.png",
            "country": "US",
            "language": "en",
            "summary": "The sea ice in the Arctic has reached its lowest point for the summer season and measurements show that the ice continues to shrink. This year's minimum was the 14th lowest level since satellite measurements began in 1978. In Antarctica, where it has been winter and the sea ice has grown, the maximum extent after winter is the third lowest ever recorded. Sea ice is an important indicator of climate change."
        },
        {
            "published_date": "2025-10-17T01:33:15",
            "title": "New Webpage Showcases First Nations Climate Action",
            "author": "The National Tribune",
            "url": "https://nativeamericans.einnews.com/article_detail/858910114/UFX0DuiGf824TGyI",
            "url_media": "https://cdn.pixabay.com/photo/2016/07/20/20/51/car-1531273_960_720.jpg",
            "country": "UA",
            "language": "en",
            "summary": "First Nations people have cared for Country for over 65,000 years. Their deep knowledge of land, water and the ocean is vital as we tackle climate change. First Nations leadership is key to finding strong, fair solutions to the problem. The new webpage brings together strategies, partnerships and programs which highlight that First Nations people are at the heart of Australia's climate response."
        },
        {
            "published_date": "2025-10-17T01:30:00",
            "title": "UN agency says CO2 levels hit record high last year",
            "author": "JAMEY KEATEN",
            "url": "https://thecourier.com/news/645848/un-agency-says-co2-levels-hit-record-high-last-year",
            "url_media": "http://d3i5p6znmm9yua.cloudfront.net/360_FindlayCourier_Live/0/0/0/0/765/5/765005_1",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide levels in the atmosphere jumped by the highest amount on record last year, according to the World Meteorological Organization. CO2 growth rates have tripled since the 1960s and reached levels that existed 800,000 years ago. WMO calls on policymakers to take more steps to help reduce emissions."
        },
        {
            "published_date": "2025-10-17T01:13:05",
            "title": "New data reveals that building a home in WA takes three months longer than other states",
            "author": "",
            "url": "https://thewest.com.au/politics/state-politics/new-data-reveals-that-building-a-home-in-wa-takes-three-months-longer-than-other-states-c-20368836",
            "url_media": "https://images.thewest.com.au/publication/C-20368836/0ba7b8269e19018e3e4cd3b8562599a784a54948-16x9-x0y235w4528h2547.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Building a home in WA takes three months longer than other states, according to new data. The data was obtained from the West Australian newspaper.      Â   .   - The West Australian.  - This article has been updated."
        },
        {
            "published_date": "2025-10-17T01:13:00",
            "title": "Australian rainforests no longer a carbon sink: study",
            "author": "董欣怡",
            "url": "https://www.chinadaily.com.cn/a/202510/17/WS68f19852a310f735438b57b3.html",
            "url_media": "http://img2.chinadaily.com.cn/images/202510/17/68f19852a310f735017eff28.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "Australia's tropical rainforests are leaking more carbon dioxide than they absorb, according to a new study. The study has significant implications for emissions reduction targets. Australia is one of the world's biggest exporters of gas and thermal coal. Its carbon dioxide emissions per person are among the highest in the world."
        },
        {
            "published_date": "2025-10-17T00:46:20",
            "title": "Dustless Demolition Reports Climate Linked Mold Increase Across Okanagan Valley Homes",
            "author": "pressadvantage",
            "url": "https://www.azcentral.com/press-release/story/10050/dustless-demolition-reports-climate-linked-mold-increase-across-okanagan-valley-homes",
            "url_media": "https://azcentral.xpr-gannett.com/wp-content/uploads/sites/11/2025/05/image-14.webp",
            "country": "US",
            "language": "en",
            "summary": "Dustless Demolition reports a climate-driven surge in mold exposure throughout homes and properties in the Okanagan Valley. The company's technicians report seeing an increase in requests stemming from moisture buildup behind walls and in crawlspaces, attic insulation dampness, and HVAC condensation. Mold spores thrive in damp, warm conditions."
        },
        {
            "published_date": "2025-10-17T00:46:11",
            "title": "Fewer hot days if Paris goals met: New analysis",
            "author": "Jayashree Nandi",
            "url": "https://www.hindustantimes.com/india-news/fewer-hot-days-if-paris-goals-met-new-analysis-101760641637952.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/10/16/550x309/Researchers-warn-that-2-6-C-of-warming-will-still-_1760641632247.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The terms of the 2015 Paris Agreement could help the world avoid 57 hot days every year if countries follow through on their emission-cutting commitments and limit warming this century to 2.6°C. In a 4°C world, countries around the world would experience an average of 114 additional hot days per year. India is expected to record 30 fewer hot days if warming is kept to 2°C under current emission plans, compared to if the world is allowed to warm by 4 degrees C with no climate action."
        },
        {
            "published_date": "2025-10-17T00:33:00",
            "title": "AFMA Publishes Climate Risk Framework For Commonwealth Fisheries",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/afma-publishes-climate-risk-framework-for-1552749",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1545225383-f5596b804c22%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1055%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "The Australian Fisheries Management Authority (AFMA) has published a framework for integrating climate-related risks into decision-making for Commonwealth fisheries. The Climate Risk Framework replaces a draft version published by AFMA in 2024. It was used in a trial during 2024 and 2025 across several fisheries. It is part of AFMA's Climate Adaptation Program."
        },
        {
            "published_date": "2025-10-17T00:11:23",
            "title": "Adelaide overtakes major capital in global housing affordability ranks",
            "author": "Lydia Kellner",
            "url": "https://www.dailytelegraph.com.au/real-estate/national/adelaide-overtakes-major-capital-in-global-housing-affordability-ranks/news-story/dab2edce38128ee89b578586d580cd15",
            "url_media": "https://www.realestate.com.au/news/wp-content/uploads/2025/10/capi_dab2edce38128ee89b578586d580cd15_aeeb30cff3908cf62ea064cff2f5bc0c.jpeg",
            "country": "AU",
            "language": "en",
            "summary": "Adelaide is now the second least affordable city in Australia. The city-wide median house price is now $855,000, $5000 ahead of Melbourne. Sydney is still the world's second most expensive city (13.8), behind only Hong Kong (14.4)."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "APEC Climate Centre predicts below-normal rainfall this quarter",
            "author": "Business Line",
            "url": "https://article.wn.com/view/2025/10/17/APEC_Climate_Centre_predicts_belownormal_rainfall_this_quart",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Australia's Bureau suggests 'La Nina' watch as a watch to keep track of Nina's position.   i.e. La Nina is the name of a tropical cyclone. It's named after Nina the Great, the most powerful cyclone in the world."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "80% of world's poor live in regions exposed to climate hazards; South Asia has largest number: UN",
            "author": "Urdu Point",
            "url": "https://article.wn.com/view/2025/10/17/80_of_worlds_poor_live_in_regions_exposed_to_climate_hazards",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "80% of the world's poor live in regions exposed to extreme heat, flooding and other climate hazards. UN report says poverty is no longer a standalone socio-economic issue but interlinked with the effects of the climate emergency, which needs global action to address the issue."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Letter: Preparing for winter? Get pets ready, too",
            "author": "",
            "url": "https://www.unionleader.com/opinion/letters_to_editor/letter-preparing-for-winter-get-pets-ready-too/article_81a9eca6-2bba-447e-8860-026a0293317b.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/unionleader.com/content/tncms/custom/image/595a0f6c-8b6f-11e8-996b-c70bb6ec20ab.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "As you prepare for winter, don't forget about the pets. Climate change is affecting our weather patterns right here in New Hampshire. The first time extreme weather caused me to evacuate my home, I had my two cats with me. I was lucky to work for a veterinarian who housed my cats until I figured things out."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Researchers map emperor penguin habitats under climate extremes",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20251017/c0758dd438f446dfa0ad7fbf9fe6d38b/c.html",
            "url_media": "https://english.news.cn/20251017/c0758dd438f446dfa0ad7fbf9fe6d38b/zxcode_20251017c0758dd438f446dfa0ad7fbf9fe6d38b.jpg",
            "country": "CN",
            "language": "en",
            "summary": "Emperor penguins serve as early-warning sentinels for the Antarctic ecosystem and climate change. For every one degree Celsius rise in temperature, emperor penguins shift their breeding site 73 meters further, while each additional centimeter of snowfall adds another 66 meters to the move. Researchers from Sun Yat-sen University and the University of Montana developed guano indices to map emperor penguin breeding habitats."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Two from Congress say climate change hitting homeowners insurance, mortgages",
            "author": "Watauga Democrat",
            "url": "https://article.wn.com/view/2025/10/17/Two_from_Congress_say_climate_change_hitting_homeowners_insu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Two members of Congress from North Carolina and Rhode Island say climate change is impacting rising insurance rates and access to mortgages, and it's also affecting access to the Internet.    .   \"The Center Square\" is published by The Center Square, a news agency. "
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Northland Nature: Birds are not the only animals that migrate in the fall",
            "author": "Duluth News Tribune",
            "url": "https://article.wn.com/view/2025/10/17/Northland_Nature_Birds_are_not_the_only_animals_that_migrate",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "This time of the year is well known for the migration of birds. The birds are moving from one place to another to cope with the coming cold. The annual leaf drop from deciduous trees happens at about the middle of October, which is hard not to notice."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Shelter in Cabo Delgado, Mozambique: 'We're going to build this together' (CARE International UK)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/10/17/Shelter_in_Cabo_Delgado_Mozambique_We_re_going_to_build_this",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cabo Delgado is the northernmost province of Mozambique. Since 2017, it has suffered the impact of a deadly insurrection fuelled by poverty. The seven-year insurgency has claimed more than 4,000 lives, around half of them civilians. Over 609,000 people live in Cabo Delgado."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Earth from Space: Chilean glaciers",
            "author": "system",
            "url": "https://article.wn.com/view/2025/10/17/Earth_from_Space_Chilean_glaciers",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The changing face of the Chilean glaciers in the Laguna San Rafael National Park is featured in satellite images from 1987 and 2024. The glaciers are visible in these satellite images taken from 1987 to 2024. They can be seen in the images from LagunaSanRafael National Park."
        },
        {
            "published_date": "2025-10-17T00:00:00",
            "title": "Input sought on Cape Fear hazard mitigation plan",
            "author": "THE SANFORD HERALD",
            "url": "https://www.sanfordherald.com/archives/input-sought-on-cape-fear-hazard-mitigation-plan/article_45b59f09-ef88-562e-aa6b-f1df47aaaac5.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/sanfordherald.com/content/tncms/custom/image/b1cbacb0-2f45-11eb-9ba1-cfc8b4ead4fc.png?crop=80%2C80%2C71%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Chatham County Emergency Management is working with regional partners to update the Cape Fear Regional Hazard Mitigation Plan. The plan identifies long-term strategies to reduce risks and losses from natural disasters. Chatham County is seeking input from residents to help shape how the county prepares for and responds to future hazards."
        }
    ]
}