{
    "status": "ok",
    "total_articles": 223,
    "articles": [
        {
            "published_date": "2025-11-12T23:58:50",
            "title": "TOPSHOT - Artisanal miners push wheelbarrows out of the Golfview informal coal mine in Ermelo on September 25, 2025. As South Africa slowly begins to move away from coal - spurred by the landmark $8.5 billion Just Energy Transition deal struck at COP26 in 2021 - communities in mining areas that saw little benefit from decades of extraction fear they'll be left behind once again. Entire communities in Mpumalanga province rely on artisanal and illegal mining in the absence of other economic activities, and many depend on illegally sourced coal for cooking and heating. Yet as the government intensifies its crackdown on illegal mining, locals and experts say that support to help these communities transition remains almost nonexistent. (Photo by EMMANUEL CROSET / AFP) EMMANUEL CROSET",
            "author": "Line Fransson",
            "url": "https://www.dagbladet.no/nyheter/na-kan-du-glemme-15-gradersmalet/83834160",
            "url_media": "https://www.dagbladet.no/images/83843548.jpg?imageId=83843548&x=0&y=0&cropw=100&croph=100&panox=0&panoy=0&panow=100&panoh=100&width=1200&height=683",
            "country": "NO",
            "language": "en",
            "summary": "Paris-avtalen i 2015 skulle hindre global oppvarming på mer enn 1,5 grad. For verdens utslipp fortsetter å øke med 1,1 prosent i 2025, viser Global Carbon Project."
        },
        {
            "published_date": "2025-11-12T23:56:32",
            "title": "Study: Climate change poses risk to Sceilg Mhichíl",
            "author": "RTE",
            "url": "https://article.wn.com/view/2025/11/12/Study_Climate_change_poses_risk_to_Sceilg_Mhichil",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "A Climate Vulnerability Assessment report on Sceilg Mhichíl has found the site is at risk from threats posed by a changing climate. These threats include possible damage to the monastic structures and the importance of local community input into the continued protection of the site."
        },
        {
            "published_date": "2025-11-12T23:55:50",
            "title": "Polar vortex could make a white, but frigid Christmas in Canada this year: report",
            "author": "Kenn Oliver",
            "url": "https://vancouversun.com/news/canada/polar-vortex-cold-snow-weather-canada",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/11/cold-weather.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Some forecast models point to conditions favourable for snowfall this Christmas. The bad news is that it's due to the Arctic polar vortex, which could also bring extremely cold temperatures this holiday season. It's too early to say where in Canada the polar vortex blast may arrive, but Andrej Flis predicts a northerly flow from Western Canada and slowly moving east across the continent."
        },
        {
            "published_date": "2025-11-12T23:55:50",
            "title": "Polar vortex could make a white, but frigid Christmas in Canada this year: report",
            "author": "Kenn Oliver",
            "url": "https://www.thewhig.com/news/canada/polar-vortex-cold-snow-weather-canada",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/11/cold-weather.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The Arctic polar vortex could bring extremely cold temperatures this holiday season. Weather researcher Andrej Flis from Severe Weather Europe highlighted an atmospheric warming event in late November that could result in frigid polar air moving south in mid-December and lingering for up to two weeks. The timing of the event is earlier than normal."
        },
        {
            "published_date": "2025-11-12T23:45:00",
            "title": "Researchers raise red flags after observing concerning shift in marine species behavior: 'The past is no longer a good guide to the future'",
            "author": "Mandy Carr",
            "url": "https://www.yahoo.com/news/articles/researchers-raise-red-flags-observing-234500462.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/w4xKhGsbUBTGtPuBFNmL4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Nzg7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/a81edd033ba1deabf9dc74e48aa29fcc",
            "country": "US",
            "language": "en",
            "summary": "Marine life is moving to the poles at a rate of 59 km (36 miles) every decade. By 2040, Australia's oceans will be in uncharted waters due to rising temperatures, even if polluting gases are significantly cut. In 15 years, marine ecosystems will be facing extreme heat, oxygen loss, and acidity conditions."
        },
        {
            "published_date": "2025-11-12T23:41:51",
            "title": "Courtenay Repair Café a ‘vibrant place' for young and old",
            "author": "Dave Flawse",
            "url": "https://www.thepeterboroughexaminer.com/news/canada/courtenay-repair-caf-a-vibrant-place-for-young-and-old/article_5bc35812-fcf2-5a15-9027-5b44342b419b.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thepeterboroughexaminer.com/content/tncms/assets/v3/editorial/8/40/84036556-f774-5784-90dc-22a2c21e862d/69151d5b7e812.image.jpg?crop=1440%2C756%2C0%2C162&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Caila Holbrook's grandmother's old griddle cord got frayed and she was worried it might catch fire. The 70-year-old appliance is still working fine.       in the griddle's original condition.  in this griddle. "
        },
        {
            "published_date": "2025-11-12T23:41:39",
            "title": "Study: Climate change poses risk to Sceilg Mhichíl",
            "author": "Joan O'Sullivan",
            "url": "https://www.rte.ie/news/munster/2025/1112/1543685-sceilg-mhichil-climate",
            "url_media": "https://www.rte.ie/images/0016fd9b-1600.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Climate Vulnerability Assessment report on Sceilg Mhichíl has found the site is at risk from threats posed by a changing climate. The report was launched on Valentia Island this evening to reflect the importance of local community input into the protection of the site. The study involved contributions from both technical experts and the local community."
        },
        {
            "published_date": "2025-11-12T22:41:00",
            "title": "No time to recover: Hurricane Melissa and the Caribbean's compounding disaster trap as the storms keep coming",
            "author": "Wlrn Public Media",
            "url": "https://creditrating.einnews.com/article_detail/866723578/zJd0bwV83gzmciQP",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/fc3073e/2147483647/strip/true/crop/4792x2516+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe9%2F57%2F8c2936ee488e8b79b74837dcefd8%2Fap25300596958670.jpg",
            "country": "UA",
            "language": "en",
            "summary": "Farah Nibbs is an assistant professor of Emergency and Disaster Health Systems at the University of Maryland, Baltimore County. She studies how Caribbean island systems absorb, adapt to and recover from recurring shocks. Disasters hitting the Caribbean are compounding and can trigger infrastructure collapse, social erosion and economic debt spirals."
        },
        {
            "published_date": "2025-11-12T22:33:09",
            "title": "Red auroras observed in Hokkaido as geomagnetic storm hits Earth",
            "author": "Mainichi Japan",
            "url": "https://mainichi.jp/english/articles/20251113/p2g/00m/0na/002000c",
            "url_media": "https://cdn.mainichi.jp/vol1/2025/11/13/20251113p2g00m0na001000p/0c10.jpg?1",
            "country": "JP",
            "language": "en",
            "summary": "A geomagnetic storm caused by increased solar activity hit Earth on Wednesday night. Red auroras appeared in the lower part of the northern sky after sunset in parts of Hokkaido. Northern lights typically appear between latitudes of 60 and 70 degrees in the northern hemisphere."
        },
        {
            "published_date": "2025-11-12T22:01:47",
            "title": "India 9th among countries worst hit by climate disasters in last 30 years: Report",
            "author": "Pratip Acharya",
            "url": "https://indianexpress.com/article/india/india-9th-among-countries-worst-hit-by-climate-disasters-in-last-30-years-report-10362137",
            "url_media": "https://images.indianexpress.com/2025/11/bengal-darjeeling-landslides_20251112220015.jpg",
            "country": "IN",
            "language": "en",
            "summary": "India has been ranked 9th in the list of countries worst affected by climate-related disasters in the last 30 years. The last time this index was prepared, in 2023, India was ranked 8th. India's rank has also improved in list of worst affected countries in the previous year. Global 8.32 lakh lives were lost between 1995 and 2024 due to extreme weather events. India has recorded 80,000 fatalities, or nearly 9.6% of the global number."
        },
        {
            "published_date": "2025-11-12T21:41:00",
            "title": "Higher methane emissions from warmer lakes and reservoirs may exacerbate worst-case climate scenario",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/11/12/Higher_methane_emissions_from_warmer_lakes_and_reservoirs_ma",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Emissions of the greenhouse gas methane from lakes and reservoirs risk doubling by the end of the century due to climate change, according to the UNFCCC. It is the main source of CO2 emissions from the Earth's atmosphere. It's also a greenhouse gas."
        },
        {
            "published_date": "2025-11-12T21:41:00",
            "title": "Significant share of Arctic Ocean's dissolved carbon comes from land, study finds",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/11/12/Significant_share_of_Arctic_Oceans_dissolved_carbon_comes_fr",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change and the associated rising temperatures are melting more and more ice because of climate change and rising temperatures is leading to more melting.    in the world's glaciers are getting warmer because of the climate change, and melting more ice due to rising temperatures. "
        },
        {
            "published_date": "2025-11-12T21:41:00",
            "title": "Stepwise regression predicts Arctic sea-ice extent with high accuracy",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/11/12/Stepwise_regression_predicts_Arctic_seaice_extent_with_high_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Arctic is transitioning from a state dominated by thick thick ice to a \"New\" one due to global warming.       in the influence of global warming, the Arctic is changing from thick to thin ice due to changes in climate. "
        },
        {
            "published_date": "2025-11-12T21:31:24",
            "title": "Guest columnist Joe Silverman: Misperception in climate and Congress",
            "author": "Daily Hampshire Gazette",
            "url": "https://article.wn.com/view/2025/11/12/Guest_columnist_Joe_Silverman_Misperception_in_climate_and_C",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "65% of Americans don't discuss global warming with their friends or family, according to the Yale Program on Climate Change Communication's recent publication. However, those who do discuss it with their family and friends are more likely to be more concerned about it than those who don't."
        },
        {
            "published_date": "2025-11-12T21:23:05",
            "title": "Climate change is in the news during COP30. We've got tips to tackle your climate anxiety – abcnews.go.com",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/11/climate-change-is-in-the-news-during-cop30-weve-got-tips-to-tackle-your-climate-anxiety-abcnews-go-com",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change is in the news during COP30. We have tips to tackle your climate anxiety at abcnews.go.com/council30.    for people with climate anxiety about COP30 and how to deal with it during the event."
        },
        {
            "published_date": "2025-11-12T21:13:31",
            "title": "Persons in eastern Jamaica encouraged to step up food production following Hurricane Melissa",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/news/20251112/persons-eastern-jamaica-encouraged-step-food-production-following-hurricane",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/11/12/3280429/8400532.jpg?itok=aXTF3err",
            "country": "JM",
            "language": "en",
            "summary": "Hurricane Melissa devastated western parishes and this is expected to hamper food production and availability, with scarcity driving up prices. Rural Agricultural Development Authority (RADA) is urging persons in eastern Jamaica to increase agricultural output to help protect the island's food security. Francine Webb, RADA's senior plant health and food safety officer, said increased production in the east is absolutely critical."
        },
        {
            "published_date": "2025-11-12T21:03:00",
            "title": "Join CBC's Maritime Noon live from the Canadian Centre for Climate Change and Adaptation on Nov. 20 in P.E.I.",
            "author": "",
            "url": "https://www.cbc.ca/lite/story/9.6976482",
            "url_media": "https://www.cbc.ca/lite/favicon.ico",
            "country": "CA",
            "language": "en",
            "summary": "CBC's Maritime Noon is hosting a live broadcast on Thursday, Nov. 20 from the Canadian Centre for Climate Change and Adaptation in St. Peter's Bay, P.E.I. It will be broadcast live from noon to 1 p.m. ET. The conversation will focus on the effects of climate change on the Maritimes and the economy."
        },
        {
            "published_date": "2025-11-12T21:00:00",
            "title": "The poor smell the smoke first",
            "author": "Charles Onyango-Obbo",
            "url": "https://nation.africa/kenya/blogs-opinion/opinion/the-poor-smell-the-smoke-first-5262164",
            "url_media": "",
            "country": "KE",
            "language": "en",
            "summary": "A changing climate is making life unbearable for those in Nairobi's informal settlements. In eastern Uganda, farmers face a different exhaustion. In Turkana, the sun hangs low and merciless, the wind carries dust, and the water is scarce. In Dar es Salaam, trucks loaded with charcoal arrive every morning. Charcoal feeds households that cannot afford gas or electricity."
        },
        {
            "published_date": "2025-11-12T20:58:56",
            "title": "Another View: The realities of smallholder farmers must take center stage at COP30",
            "author": "Mary Robinson",
            "url": "https://www.marinij.com/2025/11/12/another-view-the-realities-of-smallholder-farmers-must-take-center-stage-at-cop30",
            "url_media": "https://www.marinij.com/wp-content/uploads/2025/04/SJM-L-HAWAIIRUM-04XX-02-1.jpg?w=1024&h=768",
            "country": "US",
            "language": "en",
            "summary": "Smallholder farmers grow a third of the world's food and nearly 70% of Africa's. They receive less than 1% of all climate finance. Over 150 disasters attributable to climate change occurred in 2024, and farmers are already being battered by droughts, floods, new pests and diseases. Wealthy nations have not delivered the $100 billion annual adaptation pledge."
        },
        {
            "published_date": "2025-11-12T20:55:27",
            "title": "Pink Robins Are Found Only in Australia—Photographer Captures Their Bright Neon Hues",
            "author": "Michael Wing",
            "url": "https://www.theepochtimes.com/bright/pink-robins-are-found-only-in-australia-photographer-captures-their-bright-neon-hues-5942552",
            "url_media": "https://img.theepochtimes.com/assets/uploads/2025/11/11/id5943118-32-robin-416-1080x720.jpg",
            "country": "US",
            "language": "en",
            "summary": "Deepak Karra moved from India to Australia and was surprised by the vivid colors of birds he saw while hiking. The exotic robin is found only in the southeastern states of Victoria, New South Wales and Tasmania and has a bright pink breast that contrasts sharply with its sleek black head, tail and back feathers."
        },
        {
            "published_date": "2025-11-12T20:48:54",
            "title": "Climate Risks and Resilience in Cape Coast, Ghana",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/climate-risks-and-resilience-in-cape-coast-ghana",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/11/Climate-Risks-and-Resilience-in-Cape-Coast-Ghana-1762980539.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Cape Coast Metropolis in Ghana's southern coast is at the center of research on climate change and urban resilience. The study notes that the city's vulnerability is exacerbated by its socio-economic conditions, which often limit adaptive capacity. The economic sectors most impacted by climate change in Cape Coast include agriculture and tourism. Social inequality magnifies the impacts of climate change."
        },
        {
            "published_date": "2025-11-12T20:41:11",
            "title": "Greenland: Migration release date confirmed for 2026",
            "author": "Mins Ago",
            "url": "https://www.dailyecho.co.uk/news/25618070.greenland-migration-release-date-confirmed-2026",
            "url_media": "https://www.dailyecho.co.uk/resources/images/18050518.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "The sequel to Greenland, Greenland: Migration, was partly filmed in Alton in May 2024. It will be released on January 9, 2026. The film stars Gerard Butler, Morena Baccarin, Roman Griffin Davis, Amber Rose Revah and Sophie Thompson. The original Greenland film grossed £41m worldwide."
        },
        {
            "published_date": "2025-11-12T20:22:44",
            "title": "Climate change measures helping at Skellig Michael but risk remains to monastic structures",
            "author": "Diarmuid Pepper",
            "url": "https://www.thejournal.ie/climate-change-management-measures-help-reduce-risks-to-skellig-michael-6872710-Nov2025",
            "url_media": "https://img2.thejournal.ie/article/6872710/river/?height=400&version=6872711",
            "country": "IE",
            "language": "en",
            "summary": "Report warns that the monastic structures at Sceilg Mhichíl could be at risk of collapse due to heavy rain and damage from water and wind. The history of the site has been 'one of subsidence and collapse in places'. It is one of ten World Heritage Properties selected to be part of the first National Geographic-funded 'Preserving Legacies' Project."
        },
        {
            "published_date": "2025-11-12T19:34:39",
            "title": "‘International collaboration' needed to deal with U.S. tariffs, trade deals: Axworthy",
            "author": "",
            "url": "https://www.ctvnews.ca/video/2025/11/12/international-collaboration-needed-to-deal-with-us-tariffs-trade-deals-axworthy",
            "url_media": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F11-12-2025%2Ft_dc03c36f328b47718da2c9cf2f56fd90_name_NCSG111225_AXWORTHY_1301.jpg?smart=true&auth=dbc60468cb2af93b146f6b9701169f5a70c26123878b56b3065cbfd63777ed33&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": "There are 'major problems' that need better global collaboration, according to former foreign affairs minister Lloyd Axworthy. Watch the video to find out what he is talking about here.       .   lloyd.axworthy.com."
        },
        {
            "published_date": "2025-11-12T18:50:00",
            "title": "No time to recover: Hurricane Melissa and the Caribbean's compounding disaster trap",
            "author": "Farah Nibbs",
            "url": "https://www.yahoo.com/news/articles/no-time-recover-hurricane-melissa-185000049.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/7ZJKdq4WFQ17P9UvVWvyzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_weather_channel_articles_180/272e25763cce32240bcfb289f2eafd19",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Melissa devastated communities in Jamaica, Cuba and Haiti in October 2025. Melissa didn't hit stable, resilient islands. It hit islands still rebuilding from the last hurricane. This is the new reality of the climate crisis. Disasters hitting the Caribbean are no longer sequential. They trigger infrastructure collapse, social erosion and economic debt spirals."
        },
        {
            "published_date": "2025-11-12T18:42:52",
            "title": "Stronger Water and Soil Policies Needed to Combat Climate Change and Erosion -- Environmental Protection",
            "author": "Jane Marsh",
            "url": "https://soilerosion.einnews.com/article_detail/866651001/6-NEHeRd0wOhFXHr",
            "url_media": "https://pubads.g.doubleclick.net/gampad/ad?iu=/5978/eof.ep/Article&t=item%253d685faeba_80ea_4d8d_9245_7f823718ad6e%26pos%253dm03%26Topic%253dGlobal_Climate_Change%252cRegulation&sz=468x60&tile=5&c=123456789",
            "country": "UA",
            "language": "en",
            "summary": "As global warming accelerates, erosion and water challenges are intensifying across coastlines and inland regions. Governments and scientists must collaborate on adaptive policies and sustainable land use to protect communities, conserve resources and strengthen climate resilience. Erosion occurs most frequently along coastlines, riverbanks and in dry regions."
        },
        {
            "published_date": "2025-11-12T18:40:00",
            "title": "Apocalyptic images of melting glaciers and sinking islands won't help anyone imagine a better future",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/11/12/Apocalyptic_images_of_melting_glaciers_and_sinking_islands_w_x",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "What do you picture when you think about climate change? For you, think about it as a person. For others, it's a planet.    for a cause or a cause of change. For them, the cause is the cause of climate change. "
        },
        {
            "published_date": "2025-11-12T18:34:22",
            "title": "Australia Bagpipes",
            "author": "JC DC RR",
            "url": "https://n.news.naver.com/mnews/article/077/0006811260",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/11/12/PAP20251112169401009_P2_20251112183422191.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Bagpipes from Australia are going to break a world record for the largest ever bagpipe ensemble playing \"It's a Long Way to the Top\" by AC/DC in Melbourne, Australia on Wednesday, November 12, 2025. Australia, New Zealand, Papua New Guinea, Pacific Islands and South Pacific are out."
        },
        {
            "published_date": "2025-11-12T18:28:17",
            "title": "COP30: When the storm outpaces the summit",
            "author": "Oman Observer",
            "url": "https://article.wn.com/view/2025/11/12/COP30_When_the_storm_outpaces_the_summit",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Thirty years have passed since the start of the climate talks and ten years since the Paris Agreement. Delegates are gathering in Bel�m for COP30. Hurricane Melissa has delivered a mess for the delegates.       .   \"Hurricane Melissa\" is a tropical storm."
        },
        {
            "published_date": "2025-11-12T18:23:21",
            "title": "Sandy Bay main road reopened to single-lane traffic; Barnett to Adelphi in St James impassable",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/news/20251112/sandy-bay-main-road-reopened-single-lane-traffic-barnett-adelphi-st-james",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/11/12/3280231/8400440.jpg?itok=9Updw1b4",
            "country": "JM",
            "language": "en",
            "summary": "Overnight rains in the western parishes have left the main road from Barnett to Adelphi in St James impassable due to heavy siltation. A section of the Northcoast Highway through Sandy Bay, Hanover has now been reopened to single-lane traffic. Flood waters were diverted onto the road, due to a downed tree, in the community of Capital Heights, St James. The NWA is working closely with the Jamaica Public Service Company Limited as there are several roads that are being impacted."
        },
        {
            "published_date": "2025-11-12T18:11:14",
            "title": "COP30: Experts convene to tackle sea‑level rise threats in Belem, Brazil",
            "author": "",
            "url": "http://www.ghanaweb.com/GhanaHomePage/business/COP30-Experts-convene-to-tackle-sea-level-rise-threats-in-Belem-Brazil-2009226",
            "url_media": "https://cdn.ghanaweb.com/imagelib/pics/494/49429875.jpg",
            "country": "GH",
            "language": "en",
            "summary": "Ghana's Minister of State for Climate Change and Sustainability spoke at the 2025 UN Climate Change Conference in Belém, Brazil. He warned that global sea levels have already risen by about 20 cm since 1900 and could climb by up to one cm by the end of the century if emissions remain unchecked. In Ghana, such a rise could result in the loss of up to 20 percent of land area, displacing more than 5 million people. The current US$738 million loss and damage fund is a fraction of what is needed."
        },
        {
            "published_date": "2025-11-12T18:10:12",
            "title": "Helping citizens share responsibility for democratic climate adaptation",
            "author": "Anniversary Issue-I",
            "url": "https://thefinancialexpress.com.bd/views/views/helping-citizens-share-responsibility-for-democratic-climate-adaptation",
            "url_media": "https://tfe-bd.sgp1.cdn.digitaloceanspaces.com/posts/124740/matiur-rahman-edited.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Dr Chloe Lucas is an environmental social scientist at the University of Tasmania. Her research questions how societies can share responsibility for adapting to climate change in ways that are democratic, inclusive and grounded in lived experience. The project uses innovative methodologies to explore how people make decisions about climate risk when faced with complex trade-offs."
        },
        {
            "published_date": "2025-11-12T18:00:00",
            "title": "Peppy Grove missing from national frog count",
            "author": "Perthnow",
            "url": "https://www.perthnow.com.au/wa/perth/central/western-suburbs/peppermint-grove-missing-from-frogid-week-count-as-experts-call-for-locals-to-hop-to-it-c-20633487",
            "url_media": "https://images.perthnow.com.au/publication/C-20633487/023925c7582ca226494106325d73a53444931d06-16x9-x0y248w4760h2678.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Peppermint Grove is the only suburb in metropolitan Perth without a single frog record on the national FrogID database. The Australian Museum's national Frog ID Week ends on Sunday. It's billed as the world's largest frog count. It uses smartphone recordings to identify frog species by their unique calls."
        },
        {
            "published_date": "2025-11-12T17:51:26",
            "title": "Iceland declares Atlantic current collapse national threat",
            "author": "Maleeha Zahid",
            "url": "https://dailytimes.com.pk/1399235/iceland-declares-atlantic-current-collapse-national-threat",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/11/12/PCX2E3CQNFNORJQWSSKMMZNQLA.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Iceland has classified the potential collapse of the Atlantic Meridional Overturning Circulation (AMOC) as a national security threat. The AMOC carries warm water from the tropics to the Arctic. Greenland's melting ice could disrupt the current and trigger extreme cold across Northern Europe. The government is assessing energy, food, and infrastructure vulnerabilities and preparing disaster response policies."
        },
        {
            "published_date": "2025-11-12T17:44:09",
            "title": "How Climate Change Can Lead to Earthquakes",
            "author": "Jeffrey Kluger",
            "url": "https://www.yahoo.com/news/articles/climate-change-lead-earthquakes-174409431.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/pJaSwmVTtXrCTUPrinfdzg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/time_72/db677659227c7d466adeee466c52317e",
            "country": "US",
            "language": "en",
            "summary": "Lake Turkana, the world's largest desert lake, in northern Kenya is affected by climate change. It is 155 miles long and 18 miles wide. It's located in the East African Rift Valley, an area home to numerous deep lakes and tectonic fractures. The researchers collected seismic data on 27 faults below Turkana over the past 10,000 years."
        },
        {
            "published_date": "2025-11-12T17:41:58",
            "title": "Resilience, Kindness, and Criticism: America's Response to Hurricane Helene",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3695264-resilience-kindness-and-criticism-americas-response-to-hurricane-helene",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "Hurricane Helene killed over 200 people and caused $78 billion in damages in Dandridge, Tennessee. Local regulations prevented further catastrophe, demonstrating the effectiveness of precautionary measures. As climate change ushers more powerful storms inland, questions about preparedness and resource allocation remain pressing."
        },
        {
            "published_date": "2025-11-12T17:41:23",
            "title": "Atlantic Ocean Current Collapse Could Trigger Modern Ice Age",
            "author": "Luis Mendoza",
            "url": "https://greekreporter.com/2025/11/12/atlantic-ocean-ice-age",
            "url_media": "https://greekreporter.com/wp-content/uploads/2025/11/Jokulsarlon-Glacial-Lagoon-Credit-United-Nations-CC-BY-2.0-min.jpg",
            "country": "GR",
            "language": "en",
            "summary": "Iceland declares collapse of Atlantic Meridional Overturning Circulation (AMOC) a national security risk and an 'existential threat' for the first time. Warming and an influx of cold freshwater from Greenland's melting ice sheet could weaken or even collapse the flow, with consequences that span beyond the North Atlantic. Scientists warn that AMOC has shut down in Earth's past, including events preceding the last Ice Age about 12,000 years ago."
        },
        {
            "published_date": "2025-11-12T17:27:47",
            "title": "Tracking Urban Gully Erosion in the Democratic Republic of the Congo: A",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/tracking-urban-gully-erosion-in-the-democratic-republic-of-the-congo-a-scientific-perspective",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/11/Tracking-Urban-Gully-Erosion-in-the-Democratic-Republic-of-the-Congo-A-Scientific-Perspective-1762968471.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Gullies are erosional features that form when water flow exceeds the soil's capacity to resist. Congolese and Belgian scientists studied the rise and intensification of urban gullies across 26 cities in the Democratic Republic of the Congo. Between 2004 and 2023, the study identified nearly 3,000 gullies, resulting in the displacement of over 118,000 residents."
        },
        {
            "published_date": "2025-11-12T17:17:49",
            "title": "Inside the world's longest-running grey seal count on remote UK islands",
            "author": "Tom Wilkinson",
            "url": "https://www.independent.co.uk/bulletin/news/grey-seals-farne-islands-pups-b2863975.html",
            "url_media": "https://static.independent.co.uk/2025/11/12/15/SEI274072369.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "The Farne Islands are one of England's largest grey seal colonies. The population has increased from 500 in 1952 to 3,624 in 2024. Modern counting methods now involve drones, replacing the older, more intrusive practice of painting seals, which was also dangerous for rangers."
        },
        {
            "published_date": "2025-11-12T17:17:49",
            "title": "Inside the world's longest-running grey seal count on remote UK islands",
            "author": "Tom Wilkinson",
            "url": "https://www.newsbreak.com/the-independent-517119/4344772481509-inside-the-world-s-longest-running-grey-seal-count-on-remote-uk-islands",
            "url_media": "https://www.newsbreak.com/the-independent-517119/4344772481509-inside-the-world-s-longest-running-grey-seal-count-on-remote-uk-islands",
            "country": "PH",
            "language": "en",
            "summary": "The world's longest-running grey seal population study has begun on the Farne Islands. Modern counting methods now involve drones, replacing the older, more intrusive practice of painting seals. The number of pups born on the islands has increased from 500 in 1952 to 3,624 in 2024, establishing it as one of England's largest grey seal colonies."
        },
        {
            "published_date": "2025-11-12T17:14:41",
            "title": "North Carolina Wrapup: March to October 2025",
            "author": "snowbored",
            "url": "https://www.dailykos.com/story/2025/11/12/2352887/-North-Carolina-Wrapup",
            "url_media": "https://cdn.prod.dailykos.com/images/1490714/story_image/Clipboard01.png?1760960076",
            "country": "US",
            "language": "en",
            "summary": "Hope Springs from Field PAC canvassed in North Carolina on March 1st and talked to 81,463 voters and had in-depth conversations with 168,620 of them. The biggest issue voters cared about were Economic Issues, the future of Social Security, Medicare and Medicaid and the impact on Rural Hospitals."
        },
        {
            "published_date": "2025-11-12T17:07:20",
            "title": "Stable Investments in Times of Instability (KfW Bankengruppe)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/11/12/Stable_Investments_in_Times_of_Instability_KfW_Bankengruppe",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "The international community is facing a shrinking budget for greenhouse gas emissions in order to limit global warming to 1.5 degrees Celsius and a rise in geoeconomic fragmentation. A joint discussion paper by PIK and PIK explains the current situation. PIK has written a discussion paper on the subject."
        },
        {
            "published_date": "2025-11-12T17:03:14",
            "title": "How Bill Gates's ‘tough talk' on climate change gets it wrong",
            "author": "The Hill",
            "url": "https://article.wn.com/view/2025/11/12/How_Bill_Gates_s_tough_talk_on_climate_change_gets_it_wrong",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "By treating the climate as a solely technological challenge, Gates draws incorrect conclusions, writes Andrew Keen. Keen: Gates is wrong to treat climate change as solely a technological challenge.       for the time being, it is not a problem that can be solved by technology."
        },
        {
            "published_date": "2025-11-12T16:56:48",
            "title": "A climate of confusion over global warming",
            "author": "Frank Perley",
            "url": "https://www.washingtontimes.com/news/2025/nov/12/climate-confusion-global-warming",
            "url_media": "https://twt-thumbs.washtimes.com/media/image/2025/11/12/Perley_AH_c0-268-1600-1201_s1200x700.jpg?c66b722dd709f9c8c05ff47cb99e4620da26f680",
            "country": "US",
            "language": "en",
            "summary": "There is a correlation between a decline in cloud cover and a rise in Earth temperatures. Bill Gates backed away from the climate catastrophe alarmism at the UN climate change conference in Brazil. The conference is the 30th annual meeting of the United Nations Conference of the Parties, which runs through Nov. 21."
        },
        {
            "published_date": "2025-11-12T16:54:59",
            "title": "Remembrance of Lost Species — PSR Wisconsin",
            "author": "8 O'Clock Buzz",
            "url": "https://www.wortfm.org/remembrance-of-lost-species-psr-wisconsin",
            "url_media": "https://d35i5brrnx3uxo.cloudfront.net/wp-content/uploads/2025/11/12105323/PSR.png",
            "country": "US",
            "language": "en",
            "summary": "Drs. Paul Sondel and Ann Behrmann from Physicians for Social Responsibility – Wisconsin talk with Jan Miyasaki about the assaults on animal, bird, and insect species around the world. The event is being held on December 4, 2025 from 6:15-9:00 pm at Science Hall, 550 N Park St."
        },
        {
            "published_date": "2025-11-12T16:53:05",
            "title": "Climate change is in the news during COP30. We've got tips to tackle your climate anxiety",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/11/climate-change-is-in-the-news-during-cop30-weve-got-tips-to-tackle-your-climate-anxiety-the-detroit-news",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change is in the news during COP30. The Detroit News offers tips to tackle your climate anxiety at COP30, which is taking place in Paris this year. The tips are based on a report from the Detroit News' sister paper, \"The Detroit News\"."
        },
        {
            "published_date": "2025-11-12T16:31:03",
            "title": "UN warns of difficult winter ahead for migrants",
            "author": "leila yazdani",
            "url": "https://en.shafaqna.com/428739/un-warns-of-difficult-winter-ahead-for-migrants",
            "url_media": "https://en.shafaqna.com/wp-content/uploads/2022/02/cropped-new-logo-s-en-fine-1-32x32.png",
            "country": "AU",
            "language": "en",
            "summary": "The UN warns that as winter approaches in the Northern Hemisphere, conditions could worsen for migrants, asylum seekers, and refugees, especially given the cuts to development aid. Climate change is also having an increasing impact on migrants and displaced people. The Northern Hemisphere is preparing for the onset of winter."
        },
        {
            "published_date": "2025-11-12T16:22:08",
            "title": "Climate change is making Indian floods deadlier: The rising rainfall putting lives at risk",
            "author": "News Desk",
            "url": "https://english.mathrubhumi.com/news/india/mumbai-floods-climate-change-deaths-u7bzru0j",
            "url_media": "https://img.mathrubhumi.com/view/acePublic/alias/contentid/1n52nf1wj9lyix3btwy/1/flood-rain-kerala-jpg.jpeg?f=16%3A9&w=1200&q=0.75",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is making Mumbai's monsoon floods worse, especially for children, women, and residents of slums. The majority of flood-related deaths occur in slum areas, highlighting the wealth and infrastructure divide in the city. Without interventions, rising sea levels could increase flood deaths by 20% in coming decades."
        },
        {
            "published_date": "2025-11-12T16:04:00",
            "title": "World's ‘fossil fuel obsession' threatens billions of lives: Amnesty",
            "author": "Al Jazeera",
            "url": "https://article.wn.com/view/2025/11/12/World_s_fossil_fuel_obsession_threatens_billions_of_lives_Am",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Amnesty International has released a report on Wednesday. It urges world leaders to halt an 'obsession' with energy sources that fuel the climate crisis. It found that at least 2 billion people are at risk around the world from fossil fuel infrastructure expansion and climate change."
        },
        {
            "published_date": "2025-11-12T16:00:00",
            "title": "Work with nature, not against it",
            "author": "",
            "url": "https://www.thestar.com.my/opinion/letters/2025/11/13/work-with-nature-not-against-it",
            "url_media": "https://apicms.thestar.com.my/uploads/images/2025/11/13/3619335.jpg",
            "country": "MY",
            "language": "en",
            "summary": "Climate change is increasing the severity of weather events like monsoons and typhoons. Cities are on the frontlines. Expert review of IPCC's Special Report on Climate Change and Cities will be released in early 2027. It will synthesise scientific knowledge on how climate change is transforming urban environments."
        },
        {
            "published_date": "2025-11-12T15:41:35",
            "title": "World's ‘fossil fuel obsession' threatens billions of lives: Amnesty",
            "author": "Jillian Kestler-D'Amours",
            "url": "https://www.yahoo.com/news/articles/world-fossil-fuel-obsession-threatens-154135303.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/nF_zHTy642Qx6WfSQZwL8w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/al_jazeera_289/1259dc9840e6a53427baded74ade69e9",
            "country": "US",
            "language": "en",
            "summary": "Amnesty International has released a report on the expansion of fossil fuel infrastructure that threatens billions of lives around the world. It warned that at least 2 billion people live within 5 km (3.1 miles) of more than 18,000 existing or 3,500 new sites that will affect 135 million more people. The industry has also been linked to human rights abuses, including killings and enforced disappearances against environmental activists and Indigenous peoples defending their territories."
        },
        {
            "published_date": "2025-11-12T15:41:35",
            "title": "World's ‘fossil fuel obsession' threatens billions of lives: Amnesty",
            "author": "",
            "url": "https://saudi.shafaqna.com/EN/AL/1844451",
            "url_media": "https://saudi.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Amnesty International warns fossil fuel infrastructure is a major source of human rights violations around the world. The world's \"fossil fuel obsession\" threatens billions of lives, according to Amnesty International. It is a threat to billions of people's lives, it warns."
        },
        {
            "published_date": "2025-11-12T15:41:35",
            "title": "World's ‘fossil fuel obsession' threatens billions of lives: Amnesty",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/11/worlds-fossil-fuel-obsession-threatens-billions-of-lives-amnesty",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "Amnesty International warns fossil fuel infrastructure is a 'major source of human rights violations' around the world. At least 2 billion people live within 5 km (3.1 miles) of more than 18,000 current or planned fossil fuel infrastructures. More than 3,500 new sites are being developed that will affect 135 million more people. Living near the infrastructure is associated with elevated risks of cancer, asthma, cardiovascular illnesses and other health problems."
        },
        {
            "published_date": "2025-11-12T15:39:00",
            "title": "Ariana Grande Has No Interest in Clarifying Her Thoughts on the Moon Landing",
            "author": "Rollingstone",
            "url": "https://article.wn.com/view/2025/11/12/Ariana_Grande_Has_No_Interest_in_Clarifying_Her_Thoughts_on_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "'I'm worried about Earth, god dammit!' the pop star exclaimed on her Facebook page. She is worried about the Earth.       .   \"I am worried about earth.\"  \"God dammit\".  \"I am concerned about Earth\"."
        },
        {
            "published_date": "2025-11-12T15:33:11",
            "title": "Food-snatching seagulls are more likely to leave you alone if you shout at them, researchers say",
            "author": "Rg My",
            "url": "https://www.thestar.com/news/world/europe/food-snatching-seagulls-are-more-likely-to-leave-you-alone-if-you-shout-at-them/article_4b9342d0-06ee-53d2-8040-618c37a2592e.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/5/ed/5edb1ff1-d2f3-531f-a17d-cdba4ed20c8a/6914b159d3e05.image.jpg?crop=1681%2C883%2C0%2C98&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Two seagulls fight over a chip stolen off a woman's lunch plate in Sydney, Australia Wednesday, Nov. 6, 2013. New for subscribers! Gift this article to your friends and family for free.   The Star bHasMigrated is published by Toronto Star."
        },
        {
            "published_date": "2025-11-12T15:30:00",
            "title": "As world gets hotter, rising use of cooling devices will increase dangerous emissions, UN body warns",
            "author": "Cheena Kapoor",
            "url": "https://scroll.in/article/1088499/as-world-gets-hotter-rising-use-of-cooling-devices-will-increase-dangerous-emissions-un-body-warns",
            "url_media": "https://sc0.blr1.cdn.digitaloceanspaces.com/book/209899-hpvhehpyyj-1760462766.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In April 2023, 200 people died in Uttar Pradesh's Ballia and Deoria districts due to extreme heat and humidity. Global Cooling Watch Report 2025 at COP30 details how the demand for cooling devices could more than triple by 2050 due to more extreme heat events. The report confirms that the surging demand for such devices would double cooling-related greenhouse gas emissions."
        },
        {
            "published_date": "2025-11-12T15:13:00",
            "title": "IN PHOTOS: Climate disasters killed 80,000 since 1995; a look at some of the recent extreme weather events",
            "author": "",
            "url": "https://www.mid-day.com/news/india-news/photo/in-photos-climate-disasters-led-to-80000-deaths-1-3-billion-affected-since-1995-take-a-look-at-recent-extreme-events-108230/1",
            "url_media": "https://images.mid-day.com/images/images/2025/nov/floodsclimaterisk-main_d.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate disasters affected 1.3 billion people and caused economic losses worth almost USD 170 billion from 1995 to 2024 in India. Global warming has made extreme weather events more likely and more severe. Global leaders should close the gap in climate finance and accelerate efforts to reduce emissions and strengthen resilience."
        },
        {
            "published_date": "2025-11-12T15:12:57",
            "title": "Experts Call for Stronger Action to Curb Environmental Degradation",
            "author": "Catherine Namugerwa",
            "url": "https://nilepost.co.ug/news/301857/experts-call-for-stronger-action-to-curb-environmental-degradation",
            "url_media": "https://nilepost.co.ug/new_cms/wp-content/uploads/2025/11/efe6f9f6-7ec1-470b-9c6f-8dc94e215690.jpeg",
            "country": "UG",
            "language": "en",
            "summary": "Uganda's greenhouse gas emissions are projected to increase significantly by 2030 unless proposed mitigation strategies are fully implemented. The country has since taken steps to develop national ambient air quality standards and integrate climate action into broader development plans. Environmentalists argue that sustainable land use, waste management, and tree planting must become national priorities."
        },
        {
            "published_date": "2025-11-12T15:09:36",
            "title": "Meteorologist Refutes The Independent's Over-The-Top Weather Disaster Claims",
            "author": "Anthony Watts",
            "url": "https://climatechangedispatch.com/meteorologist-refutes-independent-uk-weather-claims",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/11/weather-montage.jpg",
            "country": "US",
            "language": "en",
            "summary": "In The Independent's article, author David Simon warns that the climate crisis has moved from 'our children's future' into our homes. The weather hasn't turned unusually severe, nor is the U.K.'s continued survival threatened by flooding or sea level rise. Long-term data on hurricanes show that there has been no increase in hurricanes as the planet has modestly warmed. The IPCC's Sixth Assessment Report states that there is 'low confidence in any long-term trends in hurricane activity' and 'no detectable increase in global tropical cyclone frequency or landfall intensity'."
        },
        {
            "published_date": "2025-11-12T15:08:43",
            "title": "‘So magical': Sky watchers treated to spectacular aurora light show across Australia",
            "author": "Sydney Morning Herald",
            "url": "https://ground.news/article/so-magical-sky-watchers-treated-to-spectacular-aurora-light-show-across-australia",
            "url_media": "https://ground.news/_next/image?url=https%3A%2F%2Fgroundnews.b-cdn.net%2Finterests%2F173f0b70a07837de85a9f357358b637425ad92a6.jpg%3Fwidth%3D24&w=64&q=75",
            "country": "US",
            "language": "en",
            "summary": "The aurora australis dazzled sky watchers across a wide area as a severe solar storm impacted Earth. The southern lights are also known as aurora nocturna or aurora borealis.   .     .  "
        },
        {
            "published_date": "2025-11-12T15:07:17",
            "title": "From Anxiety to Action: Navigating Climate Woes",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3695022-from-anxiety-to-action-navigating-climate-woes",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "There is a growing climate change anxiety among people grappling with the effects of global warming. It's vital to channel climate concerns into manageable efforts, turning individual helplessness into empowering action. Participating in climate-focused groups like Climate Cafes can bolster resilience. Ceremonial actions provide purpose and hope."
        },
        {
            "published_date": "2025-11-12T15:05:00",
            "title": "How 'build-to-rent-to-own' could help more renters get a toehold in the housing market",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/11/12/How_buildtorenttoown_could_help_more_renters_get_a_toehold_i",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "There are record low housing prices and more Australians moving out of the country because of the low affordability. There are also more people moving to Australia because of low wages and low house prices. There is a need for more people to find a new place to live. "
        },
        {
            "published_date": "2025-11-12T15:03:43",
            "title": "Sustainable Switch Climate Focus: COP30, Typhoon Kalmaegi and Japan's bear attacks",
            "author": "Sharon Kits Kimathi",
            "url": "https://www.reuters.com/sustainability/sustainable-switch-climate-focus-cop30-typhoon-kalmaegi-japans-bear-attacks-2025-11-12",
            "url_media": "https://www.reuters.com/resizer/v2/4JKBVBHB4ZJRFBBG3L2ZLHOU2M.jpg?auth=21cffd5430d573c1d864617cece24ffa2265d352b5a32fa2f986e463daa16e0a&height=1005&width=1920&quality=80&smart=true",
            "country": "GB",
            "language": "en",
            "summary": "U.N. Secretary-General Antonio Guterres scolds nations for their failure to limit warming to 1.5 degrees Celsius. Brazil's President Luiz Inacio Lula da Silva warns that \"extremist forces\" are spreading lies about climate change for political gain. European nations throw their weight behind a $2.5 billion plan to save Congo rainforest."
        },
        {
            "published_date": "2025-11-12T15:03:00",
            "title": "The Liberals' so-called ‘founding principles' underpinning their decision to dump net zero fail the credibility test",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/11/12/The_Liberals_socalled_founding_principles_underpinning_their",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The party's imminent move to abandon the 2050 climate goal makes the environment the loser and Labor the biggest winner. Labor wants to make sure Australia does its fair share and is concerned about the environment and the future of the country's climate. It's a win-win situation. "
        },
        {
            "published_date": "2025-11-12T14:57:17",
            "title": "Iceland on alert amid Atlantic Ocean current's possible collapse",
            "author": "Reuters",
            "url": "https://www.reuters.com/video/watch/idRW140412112025RP1",
            "url_media": "https://ajo.prod.reuters.tv/api/v2/img/69149fd3e4b05771ad0734f9?height=1200&width=1200&quality=80&smart=true",
            "country": "GB",
            "language": "en",
            "summary": "Iceland has designated the potential collapse of the Atlantic Ocean current system as a national security concern and an existential threat. Vanesse Chan explains what it means if the Atlantic Meridional Overturning Circulation, or AMOC, collapses and what it would mean."
        },
        {
            "published_date": "2025-11-12T14:54:17",
            "title": "Iceland on alert amid Atlantic Ocean current's possible collapse",
            "author": "",
            "url": "https://www.yahoo.com/news/videos/iceland-alert-amid-atlantic-ocean-145417245.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/oRI83wVEQnpjNCr1kOjTpw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://cf-images.us-east-1.prod.boltdns.net/v1/jit/6415665815001/5fe1f5ec-5874-4c22-bce5-ecdb7d9b1b39/main/1280x720/1m16s335ms/match/image.jpg",
            "country": "US",
            "language": "en",
            "summary": "Iceland has declared the potential collapse of the Atlantic Meridional Overturning Circulation (AMOC) a national security concern and an existential threat. Warming temperatures are speeding the thaw of Arctic ice and causing meltwater from Greenland's ice sheet to pour into the ocean. A collapse of AMOC could trigger a modern-day ice age for Northern Europe."
        },
        {
            "published_date": "2025-11-12T14:42:58",
            "title": "Strong solar flare brings auroras to North America",
            "author": "Cbs News",
            "url": "https://kyma.com/news/national-world/2025/11/12/strong-solar-flare-brings-auroras-to-north-america",
            "url_media": "https://kyma.b-cdn.net/2025/11/AURORA-BOREALIS.jpg",
            "country": "US",
            "language": "en",
            "summary": "\"Strongest\" solar flare of the year brought severe geomagnetic activity to large portions of Canada and northern US states Tuesday. Northern lights will be visible up until November 13th, according to NOAA Space Weather Prediction Center. Claudette Gabbs captured aurora borealis over Ste Anne, Manitoba shortly after 7:00 p.m."
        },
        {
            "published_date": "2025-11-12T14:40:00",
            "title": "Scientists send 'disastrous' warning Gulf Stream on 'brink of collapse'",
            "author": "Alycia McNamara",
            "url": "https://www.express.co.uk/news/uk/2133106/scientists-send-disastrous-warning-gulf",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6547355.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The Gulf Stream could be on the verge of collapse, which would plunge the northern hemisphere into a new ice age. New research shows a temperature fingerprint between 1,000 and 2,000 metres below the ocean's surface suggests it could have been weakening for decades. Scientists analysed observational data, climate models and ocean simulations to track 75 years into the future."
        },
        {
            "published_date": "2025-11-12T14:20:44",
            "title": "Long-term strategic practices imperative to mitigate climate change's cascading crises: Expert",
            "author": "",
            "url": "https://www.app.com.pk/domestic/long-term-strategic-practices-imperative-to-mitigate-climate-changes-cascading-crises-expert",
            "url_media": "https://www.app.com.pk/wp-content/uploads/2025/07/App-Digital-Logo-English.png?x75699",
            "country": "PK",
            "language": "en",
            "summary": "Professor Dr. Amir Alamgir called for declaring a climate emergency in Pakistan. He was speaking at a panel discussion on 'Climate-induced Social Fragmentation and its link to Violent Extremism', organized by the Press Information Department (PID), here. The lack of fresh water is also leading to a decline in fish populations, which is another factor driving migration from rural areas to cities. Migrants moving from rural to urban areas are developing resentful attitudes towards city dwellers."
        },
        {
            "published_date": "2025-11-12T14:20:17",
            "title": "BBC has been spreading disinformation about climate change for decades",
            "author": "Rhoda",
            "url": "https://www.sgtreport.com/2025/11/bbc-has-been-spreading-disinformation-about-climate-change-for-decades",
            "url_media": "https://expose-news.com/wp-content/uploads/2025/11/image-1-1024x444.png",
            "country": "US",
            "language": "en",
            "summary": "BBC said in 2004 that the Maldives were going to be destroyed by rising sea levels due to climate change. 21 years later, they are still there and have a thriving tourist economy. Tourism now drives 28% of GDP, supported by more than 170 resorts."
        },
        {
            "published_date": "2025-11-12T14:17:40",
            "title": "Tragedy at Sea: 42 Missing After Migrant Boat Capsizes Near Libya",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/politics/3694928-tragedy-at-sea-42-missing-after-migrant-boat-capsizes-near-libya",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_09_2025_12_57_40_5538789.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A boat carrying 47 migrants capsized off the coast of Libya last week, leaving at least 42 people missing and presumed dead. Seven survivors were discovered by Libyan authorities near the al-Buri Oil Field six days later. More than 1,000 lives have been lost in Central Mediterranean in 2023, including over 500 off Libya's shores."
        },
        {
            "published_date": "2025-11-12T14:16:00",
            "title": "Jamaica and small island states want new push on 1.5C target",
            "author": "gulftoday",
            "url": "https://www.gulftoday.ae/opinion/2025/11/12/jamaica-and-small-island-states-want-new-push-on-15c-target",
            "url_media": "https://cdn4.premiumread.com/?url=https://gulftoday.ae/gulftoday/uploads/images/2025/11/12/1023411.jpg&w=800&q=100&f=webp&t=0.0.2",
            "country": "AE",
            "language": "en",
            "summary": "COP30 climate talks kicked off in Brazil's port city of Belem on Monday. UnaMay Gordon is urging negotiators to do more to limit global warming to the 1.5 degrees Celsius (2.7 degrees Fahrenheit) target set out in the Paris Agreement 10 years ago. The Alliance of Small Island States proposes a COP30 agenda item to more aggressively track targets."
        },
        {
            "published_date": "2025-11-12T14:15:24",
            "title": "Climate change is in the news during COP30. We've got tips to tackle your climate anxiety",
            "author": "Caleigh Wells",
            "url": "https://ca.finance.yahoo.com/news/climate-change-news-during-cop30-141524965.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/bpB__bLpBB0P9lA4BRz_uw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/cp_finance_889/3bf2e82fd15f95425860a5e09438d9aa",
            "country": "US",
            "language": "en",
            "summary": "A significant amount of Americans suffer from climate change anxiety. It's similar to general anxiety, but it's a more complex and ongoing problem. It activates different parts of the brain than Generalized Anxiety Disorder. Coping with climate change is an ongoing process. It requires repeated and variable action. The most effective way to combat it is to find other people who suffer from it and talk about it."
        },
        {
            "published_date": "2025-11-12T14:14:46",
            "title": "Climate change is in the news during COP30. We've got tips to tackle your climate anxiety",
            "author": "Caleigh Wells",
            "url": "https://www.washingtonpost.com/business/2025/11/12/climate-anxiety-mental-health-cop30-community-action/f0ddd3fc-bfd1-11f0-8eee-a78486b4c797_story.html",
            "url_media": "https://palomaimages.washingtonpost.com/prod/nl-management-2_tstmp_1704813440.jpg",
            "country": "US",
            "language": "en",
            "summary": "Every autumn, news feeds get flooded with stories about climate change. Global leaders gather to discuss efforts to limit our emissions of planet-warming gases. Some of the information coming out of the COP30 conference is bleak, but it's not just COP. Climate stories can be difficult to consume year-round."
        },
        {
            "published_date": "2025-11-12T14:14:34",
            "title": "QantasLink Mid-Air Emergency Sparks Investigation: Safety Concerns Over Adelaide Flight",
            "author": "Internewscast",
            "url": "https://internewscast.com/news/au/qantaslink-mid-air-emergency-sparks-investigation-safety-concerns-over-adelaide-flight",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/11/QantasLink-flight-investigated-following-mid-air-emergency-over-Adelaide.au2Ffs2F650048bf-6c91-4241-9d1e-3167a1585e13.png",
            "country": "NG",
            "language": "en",
            "summary": "A QantasLink flight was forced to make an emergency landing in Adelaide due to a mid-air incident. Senator Leah Blyth, Amy and three Liberal politicians were on board the flight. They were placed on a replacement flight two hours later. The plane landed safely and was towed away for inspection."
        },
        {
            "published_date": "2025-11-12T14:11:08",
            "title": "Meet the AMOC, the ocean current we rely on",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6964903",
            "url_media": "https://i.cbc.ca/ais/7b0d8d62-ca4e-40dc-8d19-78c2d350a3cf,1762287559104/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C3840%2C2160%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "The Atlantic Meridional Overturning Circulation (AMOC) is the ocean current that transfers 100 times the energy output of humans around the Earth. When its circulation slows, we're in for a wild ride. Watch Wild Wild Weather on CBC Gem."
        },
        {
            "published_date": "2025-11-12T14:10:51",
            "title": "A powerful, invisible force that will severely impact our lives: CO2",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6964904",
            "url_media": "https://i.cbc.ca/ais/f381f055-9cfe-4cbb-832b-78030bc8547c,1762287095804/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C4032%2C2268%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "CO2 levels in the atmosphere have hit record levels. CO2 is creating significant changes to our planet. Watch Wild Wild Weather on CBC Gem.       .   \"Wild Wild Weather\" is broadcast on CBC. Gem is a newsmagazine. "
        },
        {
            "published_date": "2025-11-12T14:04:22",
            "title": "Want to make America healthy again? Stop fueling climate change",
            "author": "Jonathan Levy",
            "url": "https://uk.news.yahoo.com/want-america-healthy-again-stop-140422381.html",
            "url_media": "https://media.zenfs.com/en/the_conversation_us_articles_815/95b0f88221f5b8e8c31f920b275f7a51",
            "country": "US",
            "language": "en",
            "summary": "There is growing evidence that climate change is a threat to public health. The Trump administration is moving to reverse the 2009 endangerment finding and lift limits on greenhouse gas emissions from vehicles and power plants. The administration's arguments are factually wrong and dangerous to Americans' health and safety."
        },
        {
            "published_date": "2025-11-12T14:03:32",
            "title": "Germany's Avian Agony: Record Bird Flu Outbreaks Ravage Poultry Industry",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/health/3694900-germanys-avian-agony-record-bird-flu-outbreaks-ravage-poultry-industry",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/11_06_2024_18_30_35_580564.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "There have been over 1,100 wild bird infections and 122 farm detections of bird flu in Germany since November 11, 2025. More than a million poultry were culled in Germany this season due to the bird flu. There is no significant impact on egg or poultry meat prices."
        },
        {
            "published_date": "2025-11-12T14:03:06",
            "title": "Absurdity Reigns At COP30 As Leaders Gaslight On Climate And Energy",
            "author": "Peter Murphy",
            "url": "https://climatechangedispatch.com/cop30-climate-gaslighting-energy-hypocrisy",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/11/prince-william-cop30.jpg",
            "country": "US",
            "language": "en",
            "summary": "This year's UN Climate Summit, COP30, is taking place in Belém, Brazil. UN Secretary-General António Guterres' opening speech raised hysteria and gaslighting to new heights. The world's three biggest polluters: China, the US, and India are absent for the annual UN climate summit Cop30. The host country's president, Luiz Inácio Lula da Silva, screeched about those in opposition to the UN's climate agenda."
        },
        {
            "published_date": "2025-11-12T14:00:00",
            "title": "SPACE.com Swallows Lies that Climate Change Is Making Wildfires Worse, It Isn't",
            "author": "Guest Blogger",
            "url": "https://wattsupwiththat.com/2025/11/12/space-com-swallows-lies-that-climate-change-is-making-wildfires-worse-it-isnt",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/03/charlesrotter_Texas_Panhandled_wildfires_Picasso_midjourney.webp?fit=1024%2C512&quality=75&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "SPACE.com ran a story claiming that 2024/2025's wildfires are proof that climate change is making wildfires larger and more severe. Ground based data and satellite data both show that wildfires have declined in number and acreage lost over the past century. The IPCC also reports that more precipitation is falling on average than in the previous 30 years of climate change."
        },
        {
            "published_date": "2025-11-12T13:48:00",
            "title": "New Atlantic current warning as collapse to plunge Europe and UK into Ice Age",
            "author": "Grace Piercy",
            "url": "https://www.express.co.uk/news/science/2132984/new-atlantic-current-warning-gulf-stream-collapse",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/151/1200x630/6546732.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The Atlantic Meridional Overturning Circulation (AMOC) is the primary ocean current system in the Atlantic Ocean. It is at its weakest in 1,600 years due to climate change. The collapse will start around 2050 when heavy, cold, and salty surface water fails to sink and blend with deeper ocean water, leading it to collapse within 50 to 100 years. Iceland has designated AMOC's potential collapse an existential threat and is planning for worst-case scenarios."
        },
        {
            "published_date": "2025-11-12T13:39:00",
            "title": "Jamaica to import fruits and vegetables after hurricane damage",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9784244/jamaica-to-import-fruits-and-vegetables-after-hurricane-damage",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0117.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "The agriculture sector has suffered losses estimated at J$29.5 billion (about US$191 million) due to Hurricane Melissa. Approximately 41,390 hectares of farmland have been affected, impacting more than 70,000 farmers. Domestic crops suffered widespread damage, with 32,400 hectares of vegetable lines destroyed, resulting in estimated losses of J$8.8 billion (US$57 million)"
        },
        {
            "published_date": "2025-11-12T13:36:04",
            "title": "India among top 10 countries affected by climate change",
            "author": "Statesman News Service",
            "url": "https://www.thestatesman.com/india/india-among-top-10-countries-affected-by-climate-change-1503510999.html",
            "url_media": "https://www.thestatesman.com/wp-content/uploads/2025/11/Untitled-design-34-9.webp",
            "country": "IN",
            "language": "en",
            "summary": "India is ranked 9th in the 2026 Climate Risk Index by German Watch. Dominica, Myanmar, and Honduras are the most impacted by extreme weather over the last 30 years. About 40 per cent of the world's population, over three billion people, resides in the eleven countries most severely affected by climate related extreme weather in the past 30 years, including India."
        },
        {
            "published_date": "2025-11-12T13:20:41",
            "title": "Record-Breaking Arctic Blast Turns Even The South Into An Icebox",
            "author": "HANNAH FINGERHUT",
            "url": "https://www.huffpost.com/entry/wintry-weather-november-2025_n_69148587e4b09f6fd8c45231",
            "url_media": "https://img.huffingtonpost.com/asset/6914858817000011949c54cd.jpeg?ops=1200_630",
            "country": "US",
            "language": "en",
            "summary": "18 million people are under a freeze warning across Alabama, Florida and Georgia. Several inches of snow blanketed areas along the eastern Great Lakes as the blast of cold air moved through. A record low of 28 degrees Fahrenheit at the airport in Jacksonville, Florida, on Tuesday morning broke the previous record of 35 degrees set in 1977."
        },
        {
            "published_date": "2025-11-12T13:06:00",
            "title": "Adaptation Isn't Backing Down – It's Stepping Up",
            "author": "Resilience",
            "url": "https://article.wn.com/view/2025/11/12/Adaptation_Isn_t_Backing_Down_It_s_Stepping_Up",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "COP30 is underway. It's being called the 'Adaptation COP' because it's the moment when the world adapts to the needs to change. The world needs to adapt to the COP30.      Â   i"
        },
        {
            "published_date": "2025-11-12T13:00:48",
            "title": "Slimantics: The Winds of (weather) War",
            "author": "Slim Smith",
            "url": "https://cdispatch.com/news/slimantics-the-winds-of-weather-war",
            "url_media": "https://cdispatch.com/wp-content/uploads/2024/10/Slim-Smith.jpg",
            "country": "US",
            "language": "en",
            "summary": "It was 26 degrees in Columbus on Tuesday morning. It warmed to 55 degrees eight hours later. The greatest 24-hour temperature change ever recorded happened in Loma, Montana on January 15, 1972 when the temperature rose from -54 degrees to 49 degrees, an astonishing 103 degrees in a day."
        },
        {
            "published_date": "2025-11-12T13:00:00",
            "title": "Why feedlots are future of Kenya's beef business",
            "author": "Mashariki Research",
            "url": "https://www.businessdailyafrica.com/bd/opinion-analysis/columnists/why-feedlots-are-future-of-kenya-s-beef-business-5262194",
            "url_media": "https://www.businessdailyafrica.com/resource/image/5240780/landscape_ratio3x2/1200/800/98e1c62a70dd7492c4cc3dcd9ccff709/jH/goatmeat.jpg",
            "country": "KE",
            "language": "en",
            "summary": "Kenya's beef industry is slowly changing due to climate change. The number of people facing food insecurity due to drought more than doubled from one million in July 2024 to over two million by early 2025. There is a steady growth of semi-intensive feedlots in Laikipia, Nakuru, and Kajiado."
        },
        {
            "published_date": "2025-11-12T12:49:29",
            "title": "The Cold Is All In Your Imagination Yet Winter Started Early on November 10",
            "author": "Dr. Sircus",
            "url": "https://drsircus.substack.com/p/the-cold-is-all-in-your-imagination",
            "url_media": "https://substackcdn.com/image/fetch/$s_!jg-G!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5825d550-05b0-4b16-b360-2651f215b709_1313x875.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The mainstream news has been warning for a week to prepare for the bitter cold. There is a record-breaking early-season Arctic outbreak in the US Midwest and eastern Canada, bringing the heaviest early November accumulations in decades and snarling transport from Cincinnati to Ottawa. The government and the press have lost their bet against Nature."
        },
        {
            "published_date": "2025-11-12T12:41:24",
            "title": "FORECAST: Another cold start in Southwest Florida",
            "author": "Trent Aric",
            "url": "https://www.fox4now.com/weather/forecast-another-cold-start-in-southwest-florida",
            "url_media": "https://ewscripps.brightspotcdn.com/dims4/default/2e218e8/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcf.cdn.uplynk.com%2Fause1%2Fslices%2F6d5%2F1fc9d2805b3e4e6c81b38049210ea338%2F6d5c6db0651b48bf95c42ae7c2a9f321%2Fposter_9e405cdb5c40400ba8e0e490c23d76cb.jpg",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are in the low to mid 40s across Southwest Florida this morning. Punta Gorda is currently sitting at 40° which is a new record low. The old record was 44° set in 1977. After the cold start the temperatures will climb into the mid 70s this morning as the wind turns more east. The 7-Day Forecast shows no chance of rain."
        },
        {
            "published_date": "2025-11-12T12:32:00",
            "title": "Energy bills in US likely to burn pockets of millions of Americans this winter as ...",
            "author": "The Economic Times",
            "url": "https://article.wn.com/view/2025/11/12/Energy_bills_in_US_likely_to_burn_pockets_of_millions_of_Ame_n",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A weakening polar vortex is threatening to unleash Arctic air across America and Europe. It's going to be a cold winter in the U.S. and Europe, as a result of the weakening of the polar vortex. It will be very cold in the winter. "
        },
        {
            "published_date": "2025-11-12T12:24:56",
            "title": "Intl experts raise alarm over the accelerating loss of biodiversity",
            "author": "China Daily",
            "url": "https://article.wn.com/view/2025/11/12/Intl_experts_raise_alarm_over_the_accelerating_loss_of_biodi",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "There is concern about the accelerating loss of biodiversity due to global environmental changes. There is a need for strengthened scientific research to address the issue. We are now in an epoch of anthropogenic, dramatic global environmental change. There are many manifestations of this change. "
        },
        {
            "published_date": "2025-11-12T12:22:57",
            "title": "Hurricane Melissa a warning sign of ‘warmer seas fueling stronger storms': Experts",
            "author": "Anadolu Agency",
            "url": "https://article.wn.com/view/2025/11/12/Hurricane_Melissa_a_warning_sign_of_warmer_seas_fueling_stro",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change will continue producing large storms, says James Baldini, professor of earth sciences at the University of Durham. Once heated at large scale and to depth, the oceans are slow to cool down again. It takes the 'right' atmospheric conditions for hurricanes to spin up."
        },
        {
            "published_date": "2025-11-12T12:19:35",
            "title": "Global wine production grows slightly from 60-year low",
            "author": "Jeronimo Gonzalez",
            "url": "https://www.yahoo.com/news/articles/global-wine-production-grows-slightly-121935150.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/YEq2Yh_V2cHY_k7xl.IRJQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/semafor_310/2cce276685425280054b22bc138054de",
            "country": "US",
            "language": "en",
            "summary": "Global wine production rose slightly in 2025 from a 60-year low. The UK produces some of the most sought-after sparkling wines, while vintners as far north as Finland produce award-winning bottles. Some of the world's biggest producers have struggled with drought and flooding driven by climate change."
        },
        {
            "published_date": "2025-11-12T12:08:00",
            "title": "Battling the Sea on the Outer Banks",
            "author": "New Yorker",
            "url": "https://article.wn.com/view/2025/11/12/Battling_the_Sea_on_the_Outer_Banks",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Daniel Pullen offers beautiful and striking images of the destruction that climate change has brought to his lifelong home as a result of man-made global warming. He is concerned about the impact of climate change on his lifetime home.   for more information visit Daniel Pullen's website."
        },
        {
            "published_date": "2025-11-12T12:07:18",
            "title": "Durham Museum of Life and Science hosts 5th Youth Climate Summit",
            "author": "Celeste Gracia",
            "url": "https://www.wunc.org/environment/2025-11-12/durham-museum-life-science-youth-climate-summit-activists",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/4bf0cff/2147483647/strip/true/crop/1600x840+0+114/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F40%2F68%2Fef31ca184708b995d8c05bb39545%2Fmls-111125-ycs-preview-51.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Museum of Life and Science in Durham hosted its 5th annual Youth Climate Summit for teens passionate about climate action. The event is driven by the Teen Advisory Council, a group of high school students that met once a week to plan the summit. Maya Thomas, a 16-year-old junior at East Chapel Hill High, was one member of this year's advisory council."
        },
        {
            "published_date": "2025-11-12T11:59:06",
            "title": "'Our dream is children will study, grow up'",
            "author": "Tanvir Ahmed",
            "url": "https://en.prothomalo.com/environment/climate-change/vc8hotfgmc",
            "url_media": "https://media.prothomalo.com/prothomalo-english%2F2025-11-11%2Fhrllg0tu%2FWhatsApp-Image-2025-11-11-at-10.48.46-AM-1.jpeg?rect=0%2C5%2C1600%2C840&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&overlay=&overlay_position=bottom&overlay_width_pct=1",
            "country": "US",
            "language": "en",
            "summary": "Rising sea levels and saline tides are moving further inland in Sutarkhali Union of Dacope upazila, Khulna due to climate change. Many people no longer want to live along the coast because of the scarcity of drinking water. Queen Mathilde of Belgium visited and observed the water collection activities under the Local Government Initiative on Climate Change project."
        },
        {
            "published_date": "2025-11-12T11:59:04",
            "title": "Extreme Rainfall Poses the Biggest Risk to Mumbai's Most Vulnerable People",
            "author": "",
            "url": "https://ground.news/article/flooding-risk-across-surrey-24-hr-heavy-rain-warning-issued",
            "url_media": "https://ground.news/_next/image?url=https%3A%2F%2Fgrnd.b-cdn.net%2Finterests%2F70047386bd108763915b966a2e21f35f62fb8e27.jpg%3Fwidth%3D48&w=128&q=75",
            "country": "US",
            "language": "en",
            "summary": "An assessment of death rates in India's coastal megacity of Mumbai reveals the impact of rain, high tides and flooding. Climate change will probably exacerbate the effects of such weather conditions in the coastal city, according to the experts.   .   "
        },
        {
            "published_date": "2025-11-12T11:56:00",
            "title": "And you thought today was hot, that's mild compared to this",
            "author": "",
            "url": "https://iol.co.za/dailynews/opinion/2025-11-12-and-you-thought-today-was-hot-thats-mild-compared-to-this",
            "url_media": "https://iol-prod.appspot.com/image/ae25eda41bb9fd536238a0bdae7eca2725eaf4b0/1000/jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "2023 Rio de Janeiro reaches 42.5°C. WHO calls for Israeli attacks on and around hospitals in Gaza to stop. Justin Welby resigns in the wake of the Makin Report into sadist John Smyth. Out Magazine names US President Barack Obama 'Ally of the Year'."
        },
        {
            "published_date": "2025-11-12T11:38:52",
            "title": "Lots of studies show warming affected Hurricane Melissa. Is that confusing?",
            "author": "Chelsea Harvey",
            "url": "https://www.eenews.net/articles/lots-of-studies-show-warming-affected-hurricane-melissa-is-that-confusing",
            "url_media": "https://static.politico.com/dims4/default/55a1666/2147483647/resize/1200/quality/100/?url=https://static.politico.com/04/ca/ef85d7d444fb8ad9f3e81bf009b6/https-delivery-gettyimages.com/downloads/2243485858",
            "country": "US",
            "language": "en",
            "summary": "One study after another has concluded that Hurricane Melissa was worsened by climate change. But each paper takes a different approach and presents its results in a unique way, which could sow public confusion. Attribution science has advanced in the past two decades, allowing scientists to analyze granular aspects of disasters like tropical cyclones, floods and wildfires."
        },
        {
            "published_date": "2025-11-12T11:35:05",
            "title": "Report: Global philanthropic funding for climate adaptation more than doubles to $870m",
            "author": "Jeannette Ickovics",
            "url": "https://www.businessgreen.com/news/4521712/report-global-philanthropic-funding-climate-adaptation-doubles-usd870m",
            "url_media": "https://image.chitra.live/api/v1/wps/f139962/d1625d2e-5bed-424a-bb6b-f4158261da0a/3/iStock-1145883808-water-risk-drought-river-dry-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Philanthropic funding for climate adaptation and resilience efforts worldwide reached an historic high of $870m last year. It has more than doubled over the past three years as charities increasingly shift their funding.    For confidential support call the National Suicide Prevention Lifeline on 1-800-273-8255 or visit a local Samaritans branch."
        },
        {
            "published_date": "2025-11-12T11:27:12",
            "title": "The Gulf Stream is on the verge of COLLAPSING, scientists warn - as they find a key 'fingerprint' confirming major ocean circulation system is weakening",
            "author": "JONATHAN CHADWICK",
            "url": "https://www.dailymail.co.uk/sciencetech/article-15283265/Gulf-Stream-fingerprint-ocean-circulation-weaken.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/11/12/11/103809691-0-image-m-25_1762946687225.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Gulf Stream is a small part of the Atlantic Meridional Overturning Circulation (AMOC), which transports warm water from the tropics to the northern hemisphere. The AMOC slowed down in the late 20th century and it could become more pronounced as the century progresses. If it were to collapse, large parts of Europe and North America could be plunged into a deep freeze."
        },
        {
            "published_date": "2025-11-12T11:13:20",
            "title": "PH, 7th most climate-battered nation, reels from strong storms as COP30 starts",
            "author": "Iya Gozum",
            "url": "https://www.rappler.com/environment/video-philippines-rank-climate-battered-nations-cop30",
            "url_media": "https://www.rappler.com/tachyon/2025/11/typhoon-uwan-baler-casiguran-road-auroro-damage-november-11-2025-004-scaled.jpg",
            "country": "PH",
            "language": "en",
            "summary": "The Philippines experienced 371 extreme weather events from 1995 until 2024. The first week of the 30th United Nations Climate Change Conference (COP30) is underway in Belém, Brazil. Rappler's climate reporter Iya Gozum explains why COP30 is relevant for disaster-prone countries like the Philippines."
        },
        {
            "published_date": "2025-11-12T11:02:00",
            "title": "Where the sky keeps bursting",
            "author": "The Washington Post",
            "url": "https://article.wn.com/view/2025/11/12/Where_the_sky_keeps_bursting",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Washington Post investigation shows why one region of the U.S. is increasingly vulnerable to extreme rainfall and floods, according to the report.    i.e., because of climate change, the region is more vulnerable to flooding and extreme rainfall.  i"
        },
        {
            "published_date": "2025-11-12T11:01:26",
            "title": "The world will fail to meet the Paris agreement's ambitious climate target",
            "author": "Rachel Dobbs",
            "url": "https://www.economist.com/the-world-ahead/2025/11/12/the-world-will-fail-to-meet-the-paris-agreements-ambitious-climate-target",
            "url_media": "",
            "country": "GB",
            "language": "en",
            "summary": "The Intergovernmental Panel on Climate Change has produced a range of 'scenarios' for global warming based on different assumptions about policies, technologies, energy use and population size. This approach proved hard for non-scientists to understand, let alone act upon."
        },
        {
            "published_date": "2025-11-12T11:00:01",
            "title": "New reports paint picture of an unlivable future with warming now expected to blow past key limit",
            "author": "Andrew Freedman",
            "url": "https://www.cnn.com/2025/11/12/climate/3-degrees-warming-reports-iea-united-nations",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1148857258.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "The world is on track for catastrophic warming. The worst impacts of the climate crisis are unfolding decades earlier than scientists predicted. Countries agreed in Paris in 2015 to limit global warming to 1.5 degrees Celsius above pre-industrial levels. The International Energy Agency concluded that the 1-5-degree pledge has now 'slipped out of reach,' as an energy-thirsty world continues to rely on fossil fuels. The United Nations found the world was on course for 2.3 to 2.5°C of warming over this century if governments follow through on their latest pledges."
        },
        {
            "published_date": "2025-11-12T11:00:01",
            "title": "New reports paint picture of an ‘extremely dangerous' future with warming expected to blow past key limit",
            "author": "Andrew Freedman",
            "url": "https://us.cnn.com/2025/11/12/climate/3-degrees-warming-reports-iea-united-nations",
            "url_media": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1148857258.jpg?c=16x9&q=w_800,c_fill",
            "country": "US",
            "language": "en",
            "summary": "The world is on track for catastrophic warming. The worst impacts of the climate crisis are unfolding decades earlier than scientists predicted. Countries agreed in Paris in 2015 to limit global warming to 1.5 degrees Celsius above pre-industrial levels. The International Energy Agency concluded that the 1-5-degree pledge has now 'slipped out of reach,' as an energy-thirsty world continues to rely on fossil fuels. The United Nations found the world was on course for 2.3 to 2.5°C of warming over this century if governments follow through on their latest pledges."
        },
        {
            "published_date": "2025-11-12T11:00:00",
            "title": "Battling the Sea on the Outer Banks",
            "author": "Bill McKibben",
            "url": "https://www.newyorker.com/culture/photo-booth/battling-the-sea-on-the-outer-banks",
            "url_media": "https://media.newyorker.com/photos/69128467600d2c22e908529f/16:9/w_1280,c_limit/mckibben-outer-banks-erosion-daniel-pullen-01.jpg",
            "country": "US",
            "language": "en",
            "summary": "Daniel Pullen's photographs show the destruction that climate change has brought to his lifelong home, the Outer Banks. The pictures are some of the most beautifully composed and striking images of the passage the planet is enduring. The Outer Banks are a nearly two-hundred-mile stretch of barrier islands between the mainland and the Atlantic, running from Roanoke Island, where the British first settled in 1585, down the North Carolina coast."
        },
        {
            "published_date": "2025-11-12T10:59:00",
            "title": "UK dad and son die in beach tragedy as sea conditions 'changed in an instant'",
            "author": "Rebecca Robinson",
            "url": "https://www.express.co.uk/news/uk/2132940/british-dad-son-die-beach-australia-inquest",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6546549.jpg",
            "country": "GB",
            "language": "en",
            "summary": "A father and son died in a beach tragedy in Australia after the sea conditions \"changed in an instant\", an inquest has heard. More details to follow.       .   in the inquest.  More information to follow  . "
        },
        {
            "published_date": "2025-11-12T10:54:44",
            "title": "Why COP30 must put inclusion on the agenda",
            "author": "Suryaprabha Sadasivan",
            "url": "https://www.hindustantimes.com/ht-insight/climate-change/why-cop30-must-put-inclusion-on-the-agenda-101762944177951.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/11/12/1600x900/logo/A-United-Nations-flag-is-near-the-logo-for-the-COP_1762876047977_1762944256683.jpg",
            "country": "IN",
            "language": "en",
            "summary": "As the world prepares for COP30 in Brazil, a crucial question looms over the climate negotiations: who is counted and who remains invisible in global climate action? One of the largest and most vulnerable groups is persons with disabilities. People with disabilities are two to four times more likely to be injured or killed during disasters than those without disabilities."
        },
        {
            "published_date": "2025-11-12T10:32:18",
            "title": "The world's first climate refugees will arrive in Australia in 2026",
            "author": "Sue-Lin Wong",
            "url": "https://www.economist.com/the-world-ahead/2025/11/12/the-worlds-first-climate-refugees-will-arrive-in-australia-in-2026",
            "url_media": "",
            "country": "GB",
            "language": "en",
            "summary": "A ustralia will receive the world's first officially recognised climate refugees in 2026. The arrivals are the product of a bilateral treaty that could redefine sovereignty, as climate change causes deadly levels of warming that threaten island nations. Sue-Lin Wong is South-East Asia correspondent for The Economist."
        },
        {
            "published_date": "2025-11-12T10:12:00",
            "title": "Report Warns of Rapid Global Ice Loss Acceleration",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/report-warns-of-rapid-global-ice-loss-1568946",
            "url_media": "https://www.dur.ac.uk/media/durham-university/central-news-and-events-images/news/Cryosphere-report---Web-.jpg",
            "country": "US",
            "language": "en",
            "summary": "The State of the Cryosphere Report is being presented at the COP 30 UN Climate Change Conference in Belém, Brazil. It warns that current climate commitments are leading to over 2°C of warming above pre-industrial levels, affecting billions of people. Professor Chris Stokes will address policymakers and governments at COP 30 on the need for more awareness about the effects of exceeding the 1.5°C rise in temperatures on ice sheets and sea levels."
        },
        {
            "published_date": "2025-11-12T10:09:00",
            "title": "Climate Talk Series Q\\u0026A: UGA's Marshall Shepherd highlights evidence of climate change",
            "author": "The Augusta Chronicle",
            "url": "https://article.wn.com/view/2025/11/12/Climate_Talk_Series_Q_u0026A_UGAs_Marshall_Shepherd_highligh",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dr. Marshall Shepherd is the director of the Geography and Atmospheric Sciences Program at the University of Michigan. He talks about the economic, agricultural, and infrastructure costs of climate change and its effects on the economy and society. Climate Talk is a series in which experts in the field of climate science shed light on the numerous impacts of the climate change."
        },
        {
            "published_date": "2025-11-12T10:00:00",
            "title": "Scientists are sounding the alarm about a dangerous problem that will soon affect 2 billion people — here's what to know",
            "author": "Laurelle Stelle",
            "url": "https://www.yahoo.com/news/articles/scientists-sounding-alarm-dangerous-problem-123000792.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/7NI6dK6a166581lhHYeJuA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MTc7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/8736db91cf2b33759cc1661e782266b0",
            "country": "US",
            "language": "en",
            "summary": "By the end of the century, more than 2 billion people will live in areas with an average temperature higher than 84.2 degrees Fahrenheit. The most affected areas will be countries around the equator: India, Nigeria, Indonesia, the Philippines, and Pakistan. If the Paris Agreement is met, the affected population would be limited to half a billion people."
        },
        {
            "published_date": "2025-11-12T10:00:00",
            "title": "There's No Quitting the Climate Fight",
            "author": "Wen Stephenson",
            "url": "https://www.thenation.com/article/environment/climate-fight-left-organzing",
            "url_media": "https://www.thenation.com/wp-content/uploads/2025/11/climate-planet-protest-getty.jpg",
            "country": "US",
            "language": "en",
            "summary": "This is the worst year for climate politics, but the struggle is far from over, writes an international team of 13 leading climate scientists in their State of the Climate Report for 2025. Bill Gates, in a now-infamous 'memo', instructs us to tamp down the 'alarmism' about climate change. The Lancet reports that global heating now kills an average of one person per minute."
        },
        {
            "published_date": "2025-11-12T10:00:00",
            "title": "Billions in losses for fisheries sector after Hurricane Melissa",
            "author": "",
            "url": "https://www.jamaicaobserver.com/2025/11/12/billions-losses-fisheries-sector-hurricane-melissa",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/f37125a4c86f2eec1d24bae1e31075a8.jpg",
            "country": "JM",
            "language": "en",
            "summary": "Hurricane Melissa made landfall on October 28 with sustained winds near 160 miles per hour, battering Jamaica for more than 12 hours and leaving behind widespread destruction. Early estimates put the economic losses above US$2.5 billion, affecting nearly every productive sector. The fisheries industry rakes in roughly J$20-billion-a-year and supports more than 20,000 registered fishers."
        },
        {
            "published_date": "2025-11-12T09:54:58",
            "title": "‘Out of control' migration alarms experts",
            "author": "Andrew Hedgman",
            "url": "https://au.news.yahoo.com/control-migration-alarms-experts-095458142.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/K3N06Vc3xKYHDJ0lLOnq3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/nca_newswire_424/09c2db5c95f9f1551b2a13b32b22667f",
            "country": "US",
            "language": "en",
            "summary": "There were 415,760 net permanent and long-term arrivals from 1 January to 30 September 2025, a 6 per cent increase on the previous record set in 2024. In the 12 months to September 2025 there were 468,390 arrivals, the highest 12-month total on record. 35,890 net arrivals in September 2025 was the second-highest on record, behind September 2023."
        },
        {
            "published_date": "2025-11-12T09:41:00",
            "title": "Decade-long IISc Study: Anthropogenic changes threaten eastern Himalayan birds",
            "author": "Chethan Kumar",
            "url": "https://timesofindia.indiatimes.com/india/decade-long-iisc-study-anthropogenic-changes-threaten-eastern-himalayan-birds/articleshow/125270789.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-125270792,width-1070,height-580,imgsize-1748205,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Insect-eating birds that live close to the forest floor in the Eastern Himalayas are facing serious survival challenges due to human-driven changes to their habitats. Researchers from IISc's Centre for Ecological Sciences tracked wild bird populations for over ten years in the Eaglenest Wildlife Sanctuary, Arunachal Pradesh. They found that logging and other disturbances are altering forest microclimates, making them hotter during the day and colder at night."
        },
        {
            "published_date": "2025-11-12T09:35:03",
            "title": "Experts warn of imminent impact of climate change at SIBF",
            "author": "Sharjah 24",
            "url": "https://sharjah24.ae/en/Articles/2025/11/12/Experts-warn-of-imminent-impact-of-climate-change-at-SIBF",
            "url_media": "https://sharjah24.ae/-/media/Sharjah24/Articles/2025/November-2025/12/Experts-warn-that-impact-of-climate-change-is-imminent-at-SIBF.png?20251112151308",
            "country": "AE",
            "language": "en",
            "summary": "Vince won the Royal Society Winton Prize for Science Books for her book 'Adventures in the Anthropocene'. She is optimistic about humanity's capacity to adapt to environmental change. Dr Fawaz Ahmed Al Mousa warns that the current warming period started around 11,000 years ago. Dr Ayoub Abu Deya calls for urgent and coordinated international action on climate change."
        },
        {
            "published_date": "2025-11-12T09:18:19",
            "title": "Iceland 'doomed' if Atlantic Ocean current collapses: Nation declares 'existential threat' from modern-day ice age and begins planning for disaster",
            "author": "TARYN KAUR PEDLER",
            "url": "https://www.dailymail.co.uk/sciencetech/article-15283201/Iceland-doomed-Atlantic-Ocean-current-collapses-Nation-declares-existential-threat-modern-day-ice-age-begins-planning-disaster.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/11/12/09/101032163-0-image-m-13_1762938964927.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Iceland has designated the potential collapse of the Atlantic Meridional Overturning Circulation or AMOC as an existential threat and has begun planning for worst-case scenarios. The AMOC is an ocean conveyor belt that moves warm water from the tropics to the northern Atlantic. It has collapsed in the past, notably before the last Ice Age that ended about 12,000 years ago. An AMOC collapse could become inevitable within the next couple of decades as global temperatures keep climbing."
        },
        {
            "published_date": "2025-11-12T09:11:48",
            "title": "Liberals still deciding fate of net zero policy",
            "author": "Jacob Greber",
            "url": "https://www.abc.net.au/news/2025-11-12/liberals-still-deciding-fate-of-net-zero-policy/106002484",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/def0ec41303de046e364b6a7c08b0689?impolicy=wcms_watermark_news&cropH=2160&cropW=3840&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "In Canberra, Liberal MPs are gathering to resolve their policy on climate change. 7.30's Political Editor Jacob Greber speaks to Sarah Ferguson with the latest on the issue.    .   for 7:30's political editor Sarah Ferguson. "
        },
        {
            "published_date": "2025-11-12T09:09:00",
            "title": "Average California Farm Loses $20,528 Annually to Natural Hazards",
            "author": "Trace One News Release",
            "url": "https://www.egcitizen.com/2025/11/12/553982/average-california-farm-loses-20-528-annually-to-natural-hazards",
            "url_media": "http://locable-assets-production.s3.amazonaws.com/uploads/resource/file/1254574/pexels-nc-farm-bureau-mark-9798989_20Photo_20by_20Mark_20Stebnicki_20httpswww.pexels.jpg?timestamp=1762984370",
            "country": "US",
            "language": "en",
            "summary": "California farms have the largest losses due to natural hazards. Drought is the most significant hazard affecting California's vast agricultural sector. California reports an average loss of $20,528 per farm on a per-farm basis, the highest of any state. Iowa, North Carolina, and Florida round out the top five, each suffering from drought and hurricanes."
        },
        {
            "published_date": "2025-11-12T09:06:00",
            "title": "Season's first cold spell hits US",
            "author": "",
            "url": "https://www.arkansasonline.com/news/2025/nov/12/seasons-first-cold-spell-hits-us",
            "url_media": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/211513330_5AWeather1112_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "country": "US",
            "language": "en",
            "summary": "18 million people are under a freeze warning across Alabama, Florida and Georgia. Several inches of snow blanketed areas along the eastern Great Lakes as the blast of cold air moved through. Iguanas begin to \"freeze\" and fall from trees when temperatures dip to 40 degrees or lower."
        },
        {
            "published_date": "2025-11-12T09:05:31",
            "title": "In hurricane-torn Jamaica, this couple's climate-resilient breadfruit program offers food and hope",
            "author": "Adriana Pérez",
            "url": "https://www.kentucky.com/news/nation-world/national/article312883439.html",
            "url_media": "https://www.kentucky.com/akam/13/pixel_5c1bdf5?a=dD04ZTQ1OWFkMmMyMDU5MzJlYmQyNmRjODJkNTM3N2JhZWQ3MDM0Zjk5JmpzPW9mZg==",
            "country": "US",
            "language": "en",
            "summary": "Mary and Mike McLaughlin's foundation planted 250,000 breadfruit trees in St. Elizabeth Parish, Jamaica, during Hurricane Melissa. Many of the trees are still standing after the storm. The foundation's mission is to grow breadfruit as a crop in areas vulnerable to extreme weather events."
        },
        {
            "published_date": "2025-11-12T09:03:23",
            "title": "Climate Talk Series Q&A: UGA's Marshall Shepherd highlights evidence of climate change",
            "author": "Erica Van Buren",
            "url": "https://www.augustachronicle.com/story/news/environment/2025/11/12/climate-talk-series-highlight-evidence-that-climate-change-is-happening-now/87211840007",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Dr. Marshall Shepherd is the director of the Department of Geography and Atmospheric Sciences at the University of Georgia. He believes that climate change is real and that it's changing due to human activity. The most conclusive evidence is in the heatwaves, intense rainstorms and drought conditions. In 2025, Georgia had 13 named storms, three of them Category 5."
        },
        {
            "published_date": "2025-11-12T08:36:37",
            "title": "Modeling Extreme Heat: Integrating Socioeconomic Factors",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/modeling-extreme-heat-integrating-socioeconomic-factors",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/11/Modeling-Extreme-Heat-Integrating-Socioeconomic-Factors-1762936600.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Extreme heat events are becoming more prevalent in our rapidly changing climate. This presents challenges for communities that already face socioeconomic difficulties. Traditional climate models focus on environmental factors and neglects how socioeconomic conditions amplify vulnerabilities during heat waves. The study illustrates the devastating consequences of extreme heat, particularly in areas with limited adaptive capacity. The authors discuss the potential for climate change to amplify existing disparities."
        },
        {
            "published_date": "2025-11-12T08:32:00",
            "title": "UK Report: Climate Change Hits Mental Health",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/uk-report-climate-change-hits-mental-health-1568908",
            "url_media": "https://www.gov.uk/assets/frontend/govuk-opengraph-image-4196a4d6333cf92aaf720047f56cfd91b3532d7635fc21ebcf0d5897df6b5f77.png",
            "country": "US",
            "language": "en",
            "summary": "Report by UK Health Security Agency (UKHSA) shows the impact climate change is having on the mental health of the UK population. Extreme weather such as flooding and heat are the biggest climate-related issues affecting mental health in the UK today. Farming, rural communities, those with livelihoods connected to the land and those with pre-existing health issues are at heightened risk."
        },
        {
            "published_date": "2025-11-12T08:30:00",
            "title": "Australia records highest net migrant arrivals ever, experts warn of unsustainable growth",
            "author": "Andrew Hedgman",
            "url": "https://www.news.com.au/finance/culture/australian-culture/australia-records-highest-net-migrant-arrivals-ever-experts-warn-of-unsustainable-growth/news-story/08e5e115e5a7eb7363a2001c52fad428",
            "url_media": "https://content.api.news/v3/images/bin/0f1e3927f5cea8af7c70d0a650a325d3",
            "country": "AU",
            "language": "en",
            "summary": "There were 415,760 net permanent and long-term arrivals from 1 January to 30 September 2025, a 6 per cent increase on the previous record set in 2024. In the 12 months to September 2025 there were 468,390 arrivals, the highest 12-month total on record. 35,890 net arrivals in September 2025 was the second-highest on record, behind September 2023."
        },
        {
            "published_date": "2025-11-12T08:30:00",
            "title": "Migration to Australia soars past all-time records in new data",
            "author": "Andrew Hedgman",
            "url": "https://www.couriermail.com.au/news/breaking-news/australia-records-highest-net-migrant-arrivals-ever-experts-warn-of-unsustainable-growth/news-story/08e5e115e5a7eb7363a2001c52fad428",
            "url_media": "https://content.api.news/v3/images/bin/0f1e3927f5cea8af7c70d0a650a325d3",
            "country": "AU",
            "language": "en",
            "summary": "There were 415,760 net permanent and long-term migrant arrivals in the first nine months of 2025, the highest on record for the period. In the 12 months to 30 September 2025 there were 468,390 arrivals. 35,890 arrivals in September 2025 was the second-highest September on record. Institute of Public Affairs warns current migrant arrival levels are unsustainable."
        },
        {
            "published_date": "2025-11-12T08:06:01",
            "title": "Iceland deems possible Atlantic current collapse a security risk",
            "author": "Alison Withers",
            "url": "https://www.reuters.com/sustainability/cop/iceland-sees-security-risk-existential-threat-atlantic-ocean-currents-possible-2025-11-12",
            "url_media": "https://www.reuters.com/resizer/v2/QBGP5CL5WNNJRMDY3CDHLYJFOI.jpg?auth=e73cac62ba5bb6e61981f9f36d68c1fe8c356de30fe7c1f83ed1fad1babd12f0&height=1005&width=1920&quality=80&smart=true",
            "country": "GB",
            "language": "en",
            "summary": "Iceland declares threat to Atlantic Ocean current a national security risk. Scientists warn current collapse could trigger modern-day ice age for Northern Europe. Iceland's government is planning for worst-case scenarios. The Atlantic Meridional Overturning Circulation, or AMOC, current brings warm water from the tropics northward toward the Arctic."
        },
        {
            "published_date": "2025-11-12T08:02:49",
            "title": "Iceland Sounds Alarm: AMOC Collapse as National Security Threat",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3694379-iceland-sounds-alarm-amoc-collapse-as-national-security-threat",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/11_03_2020_13_25_10_8590644.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Iceland's government has identified the potential collapse of a major Atlantic Ocean current system as a national security issue. The AMOC plays a crucial role in moderating Europe's winters by transporting warm water from the tropics northward. The increasing meltwater from Greenland's ice sheet could disrupt its flow, raising concerns of a modern-day ice age."
        },
        {
            "published_date": "2025-11-12T08:02:47",
            "title": "CGIAR@30: Just Transition Negotiation Updates (CGIAR System Organization",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/11/12/CGIAR_30_Just_Transition_Negotiation_Updates_CGIAR_System_Or",
            "url_media": "https://ecdn4.wn.com/or/assets/assets/wn/img/logo.png",
            "country": "US",
            "language": "en",
            "summary": "Just Transition Work Programme (JTWP) under the UNFCCC is gaining momentum. Climate action is about reducing emissions and ensuring the shift to a green economy is fair and inclusive, according to the JTWP's website. It's also about ensuring the environment is protected."
        },
        {
            "published_date": "2025-11-12T08:02:00",
            "title": "Iceland Sees Security Risk, Existential Threat in Atlantic Ocean Current's Possible Collapse",
            "author": "Alison Withers",
            "url": "https://www.usnews.com/news/world/articles/2025-11-12/iceland-sees-security-risk-existential-threat-in-atlantic-ocean-currents-possible-collapse",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Iceland has designated the potential collapse of a major Atlantic Ocean current system as a national security concern and an existential threat. The AMOC current brings warm water from the tropics northward toward the Arctic and keeps Europe's winters mild. A potential collapse could trigger a modern-day ice age, with winter temperatures across Northern Europe plummeting."
        },
        {
            "published_date": "2025-11-12T08:00:00",
            "title": "Record-low temperatures shock the Southeast U.S.",
            "author": "HANNAH FINGERHUT",
            "url": "https://www.lmtribune.com/wire/record-low-temperatures-shock-the-southeast-us-snowfall-blankets-parts-of-the-northeast-20807285",
            "url_media": "https://public-assets-prod.pubgen.ai/brand_4fc3eb37-4c8a-4951-9324-365f6e4b53fd/asset_8ca85ab1-88d2-5f12-9ecd-a12d981402c3.jpg?w=1200",
            "country": "US",
            "language": "en",
            "summary": "The first major cold spell of the season plunged parts of the southeastern U.S. into record-low temperatures. 18 million people are under a freeze warning across Alabama, Florida and Georgia. Several inches of snow blanketed areas along the eastern Great Lakes as the blast of cold air moved through. Florida faces a 'falling iguana advisory'"
        },
        {
            "published_date": "2025-11-12T08:00:00",
            "title": "Antigua and Barbuda calls for regional solidarity on climate mobility at COP30",
            "author": "A Hover",
            "url": "https://antiguaobserver.com/antigua-and-barbuda-calls-for-regional-solidarity-on-climate-mobility-at-cop30",
            "url_media": "https://antiguaobserver.com/wp-content/uploads/2025/11/front-climate-1-1.jpg",
            "country": "AG",
            "language": "en",
            "summary": "Antigua and Barbuda has called for stronger international collaboration and financing mechanisms to protect Caribbean people affected by climate-induced displacement. Ambassador Ruleta Camacho-Thomas delivered the keynote address on Climate Mobility in the Greater Caribbean at COP30 in Belém, Brazil."
        },
        {
            "published_date": "2025-11-12T07:58:28",
            "title": "Extreme weather events killed over 8.3 lakh people, cost world $4.5 trillion",
            "author": "",
            "url": "https://www.indiatoday.in/amp/environment/story/extreme-weather-events-climate-change-deaths-trillion-dollars-climate-mitigation-finance-heatwaves-2818026-2025-11-12",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202511/extreme-weather-events-killed-over-83-lakh-people--cost-world-45-trillion-12234111-16x9_0.jpg?VersionId=ANmIGkDGmPYu.KGSn1AFlQszzP4sDsO_",
            "country": "IN",
            "language": "en",
            "summary": "Extreme weather events claimed more than 8,32,000 lives and inflicted nearly $4.5 trillion in direct economic losses between 1995 and 2024. St. Vincent and the Grenadines emerged as the country most devastated by extreme weather in the 2026 index, while India ranked 15th. Dominica tops the long-term ranking from 1995 to 2024, followed by Myanmar and Honduras. Six of the ten most affected countries are from lower-middle-income groups, including Myanmar, Honduras, Haiti, the Philippines, Nicaragua, and India."
        },
        {
            "published_date": "2025-11-12T07:55:00",
            "title": "Record-breaking temperatures surprise millions: First cold wave hits US",
            "author": "Eli Stoanova",
            "url": "https://fakti.bg/en/world/1013994-record-breaking-temperatures-surprise-millions-first-cold-wave-hits-us",
            "url_media": "https://cdn4.focus.bg/fakti/photos/medium/696/rusia-naloji-zabrana-za-vlizane-na-30-aponci-v-otgovor-na-sankciite-na-tokio-1.webp",
            "country": "BG",
            "language": "en",
            "summary": "The first major cold wave of the season hit parts of the southeastern US, triggering record low temperatures and surprising nearly 18 million people. Several inches of snow covered areas around the Great Lakes, including Lake Michigan. At the Jacksonville, Florida, airport, an early morning low of -2 degrees Celsius was recorded, beating the previous record."
        },
        {
            "published_date": "2025-11-12T07:50:32",
            "title": "The Paris Agreement at 10: More Wins Than You Might Realize",
            "author": "Deutsche Welle",
            "url": "https://www.latestly.com/agency-news/the-paris-agreement-at-10-more-wins-than-you-might-realize-7201613.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/11/65663232_403-784x441.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Ten years after the Paris Agreement, global emissions keep climbing. Global growth in renewables has skyrocketed, even exceeding the expectations of optimists. The share of global energy provided by renewables has more than tripled since Paris Agreement. The world passed its first climate \"tipping point\" this year."
        },
        {
            "published_date": "2025-11-12T07:47:03",
            "title": "Nigeria: Investigation - Nigerian Govt Looks Away As Fishers Face Deadly Attacks, Declining Stocks (II)",
            "author": "Ini Ekott",
            "url": "https://allafrica.com/stories/202511120154.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Nigeria's small-scale fishers and women traders face twin threats of piracy and climate change. The country has no functional national fisheries policy and lacks comprehensive programmes to support them. There is no national registry, credit system, or insurance scheme for the millions who depend on the sea for their livelihoods."
        },
        {
            "published_date": "2025-11-12T07:42:02",
            "title": "The Paris Agreement at 10: More wins than you might realize – DW – 11/12/2025",
            "author": "Holly Young",
            "url": "https://www.dw.com/en/the-paris-climate-agreement-isnt-perfect-but-its-done-more-than-you-think/a-74556928",
            "url_media": "https://static.dw.com/image/65663232_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Ten years after the Paris Agreement, global emissions keep climbing, but solar, wind, and EV growth show climate action can work. The past decade has been the hottest on record, with last year topping the grim streak. Last year greenhouse gas emissions hit record levels and are now 65% higher than 1990 levels. The share of global energy provided by renewables has more than tripled since Paris Agreement."
        },
        {
            "published_date": "2025-11-12T07:42:00",
            "title": "Think the Paris Agreement failed? Here's what it actually achieved",
            "author": "Holly Young",
            "url": "https://uk.news.yahoo.com/think-paris-agreement-failed-heres-074200967.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/XR.XP37.3Xw5nTaSeLX2JQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/deutsche_welle_articles_124/92b49b1dc705f4f4b0daefdf890aab2c",
            "country": "US",
            "language": "en",
            "summary": "The Paris Agreement was signed by nearly 200 nations in 2015. It aims to limit global warming to below 2 degrees Celsius (3.6 degrees Fahrenheit) and cap the rise at 1.5 C. The past decade has been the hottest on record, with last year topping the grim streak. Last year, greenhouse gas emissions reached record levels and are now 65% higher than 1990 levels."
        },
        {
            "published_date": "2025-11-12T06:46:37",
            "title": "Agriculture sustains $29.5 billion in damage from Hurricane Melissa",
            "author": "Floyd Green",
            "url": "https://www.jamaicaobserver.com/2025/11/11/agriculture-sustains-29-5-billion-damage-hurricane-melissa",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/Floyd-Green-1024x682.jpg",
            "country": "JM",
            "language": "en",
            "summary": "Floyd Green, Minister of Agriculture, Fisheries and Mining, says the sector has suffered some $29.5 billion in losses following the passage of Hurricane Melissa. Approximately 41,390 hectares of farmland have been affected, impacting over 70,000 farmers. There was also a loss of 1,251,410 animals, including small ruminants, poultry and cattle."
        },
        {
            "published_date": "2025-11-12T06:46:00",
            "title": "Geopolitics Loom Over This Year's Climate Talks",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/geopolitics-loom-over-this-years-climate-talks-1568348",
            "url_media": "https://images.theconversation.com/files/701611/original/file-20251111-62-tra9x.jpg?ixlib=rb-4.1.0&q=45&auto=format&w=754&fit=clip",
            "country": "US",
            "language": "en",
            "summary": "Next month marks the tenth anniversary of the Paris Agreement. This is the year countries must submit their climate plans for 2035. The world's top two economies produce a remarkable 45% of total carbon dioxide emissions - 31.5% from China and 13.6% from the United States. The EU emissions are now only around 6% of the global tally, thanks to its early efforts."
        },
        {
            "published_date": "2025-11-12T06:41:11",
            "title": "Germanwatch Climate Risk Index warns of mounting toll; India among top 10 affected nations",
            "author": "Purnima Sah",
            "url": "https://www.thehindu.com/sci-tech/energy-and-environment/germanwatch-climate-risk-index-warns-of-mounting-toll-india-among-top-10-affected-nations/article70269706.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/sat8pf/article70270061.ece/alternates/LANDSCAPE_1200/COP30_Climate_Summit_91947.jpg",
            "country": "IN",
            "language": "en",
            "summary": "A new report, Climate Risk Index (CRI) 2026, was released at COP30 in Belém on Tuesday (November 11, 2025) evening. It finds that more than 832,000 people died, nearly 5.7 billion were affected, and economic losses exceeded $4.5 trillion between 1995 and 2024. Dominica, Myanmar, Honduras, St. Vincent and the Grenadines, Grenada, and Chad are the most affected countries. India ranks ninth among the countries most affected during this period."
        },
        {
            "published_date": "2025-11-12T06:17:18",
            "title": "epaselect KENYA FLOODS AND DISPLACEMENT IN LAKE NAIVASHA",
            "author": "DI CRS CS CRS CS",
            "url": "https://n.news.naver.com/mnews/article/091/0010048880",
            "url_media": "https://imgnews.pstatic.net/image/091/2025/11/12/PEP20251112074001009_P2_20251112061718589.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Thousands of people in Kihoto Etate, in Naivasha, Nakuru County, Kenya, have been affected by floods caused by the rising waters of Lake Naiv Sasha. Water levels has been rising to unprecedented levels that has been expanding the lake since 2020."
        },
        {
            "published_date": "2025-11-12T06:17:06",
            "title": "Mercury to dip to 17 degrees on Tue: Observatory",
            "author": "The Standard 英文虎報",
            "url": "https://www.thestandard.com.hk/hong-kong-news/article/316579/Mercury-to-dip-to-17-degrees-on-Tue-Observatory",
            "url_media": "https://image.hkstandard.com.hk/f/1024p0/0x0/100/none/9b526240878b36d8c0d514f0585652b6/2025-11/NE241111WT02.jpg",
            "country": "HK",
            "language": "en",
            "summary": " sugar as world gets hotter, according to a study by the American Institute of Health.    for more sugar.  for less sugar for more fat for more calories.  For more sugar for less fat for less calories. For more information, go to: "
        },
        {
            "published_date": "2025-11-12T06:00:00",
            "title": "Record-low temperatures shock Southeast, snowfall blankets parts of Northeast",
            "author": "Nam Y. Huh",
            "url": "https://www.decaturdaily.com/news/other_news/national/record-low-temperatures-shock-southeast-snowfall-blankets-parts-of-northeast/article_69635cd1-3c72-422e-abf3-ace65153ba40.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/decaturdaily.com/content/tncms/assets/v3/editorial/f/c7/fc7dee2a-0607-4c1e-ab8e-7c41675e673e/691377274f36e.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "18 million people are under a freeze warning across Alabama, Florida and Georgia. Several inches of snow blanketed areas along the eastern Great Lakes as the blast of cold air moved through the region. It's the first major cold spell of the season in the southeast."
        },
        {
            "published_date": "2025-11-12T05:48:29",
            "title": "At COP30, scientists want aggressive action on emissions to save cryosphere",
            "author": "Dipanita Nath",
            "url": "https://indianexpress.com/article/cities/pune/cop30-scientists-aggressive-action-on-emissions-to-save-cryosphere-10360685",
            "url_media": "https://images.indianexpress.com/2025/11/siachen_20251112054659.jpg",
            "country": "IN",
            "language": "en",
            "summary": "There is still a small window to prevent the worst-case scenario for Earth's cryosphere. Global temperatures are expected to exceed 1.5°C above pre-industrial levels within the next decade. Even 1°C of warming is enough to disrupt the stability of polar ice sheets and many glaciers will start melting at a lower temperature."
        },
        {
            "published_date": "2025-11-12T05:40:40",
            "title": "Investors flood housing market; Menulog calls last orders in Australia; and portraits of rock'n'roll royalty",
            "author": "Kris Swales",
            "url": "https://www.theguardian.com/australia-news/2025/nov/12/afternoon-update-wednesday-ntwnfb",
            "url_media": "https://i.guim.co.uk/img/media/6a4e2465ac6286a2d5263f2e67acd4e8f1bf1ea4/0_0_3333_2667/master/3333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2662417ac8d24417740b22d9f3ca4daa",
            "country": "GB",
            "language": "en",
            "summary": "There are calls for Labor to force banks to put the brakes on landlord lending after investors accounted for two in every five home loans from July to September. Barrie Wentzell shot the world's biggest stars between 1965 and 1975. Lauren Farrugia is now in her third trimester of pregnancy. A group of Liberal politicians were forced to turn back to Adelaide after smoke was detected on their flight."
        },
        {
            "published_date": "2025-11-12T05:35:50",
            "title": "Aurora australis to be visible for large parts of Australia in rare event",
            "author": "Yashee Sharma4:35pm",
            "url": "https://www.9news.com.au/national/aurora-australis-to-be-visible-for-large-parts-of-australia-due-to-severe-geomagnetic-storm/f77f85ae-b678-434d-bcb5-e3cc5c8ef738",
            "url_media": "https://imageresizer.static9.net.au/QAEu4Z81RFHzPnW2c7n2sUkkVqw=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F215f2f6a-ccc9-49d7-84b2-ffca6f3fbc8c",
            "country": "AU",
            "language": "en",
            "summary": "The aurora australis will be on display for mid to southeatherly parts of Australia tonight thanks to a severe geomagnetic storm impacting Earth. People as far east as Sydney and as far west as Perth will be able to witness the phenomenon from sunset about 8pm AEST."
        },
        {
            "published_date": "2025-11-12T05:31:28",
            "title": "Australia's top court rejects Russia's challenge to embassy eviction",
            "author": "",
            "url": "https://www.therecord.com/news/world/australia/australias-top-court-rejects-russias-challenge-to-embassy-eviction/article_421a6dc2-f269-5e56-bec6-232b78f5b7f9.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/therecord.com/content/tncms/assets/v3/editorial/b/0b/b0b1d951-c033-52a4-a736-1ad06ce432b7/69141f434a238.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "There is a fence surrounding a building on the grounds of a proposed new Russian embassy near the Australian Parliament in Canberra. An Australian Federal Police officer is standing on the fence and observing the building from his car. The embassy is proposed to be built on the site of the old Russian Embassy."
        },
        {
            "published_date": "2025-11-12T05:30:38",
            "title": "Climate disasters killed 80,000, hit 1.3 billion in India since 1995: Report",
            "author": "PTI",
            "url": "https://www.mid-day.com/news/india-news/article/climate-disasters-killed-80000-hit-13-billion-in-india-since-1995-report-23602793",
            "url_media": "https://images.mid-day.com/images/images/2025/nov/Fog-a-1762917682082_d.png",
            "country": "IN",
            "language": "en",
            "summary": "Climate disasters affected 1.3 billion people and caused economic losses worth almost USD 170 billion from 1995 to 2024, according to Germanwatch at COP30 in Belem, Brazil. The Climate Risk Index (CRI) 2026 was released by the environment think tank Germanwatch."
        },
        {
            "published_date": "2025-11-12T05:30:20",
            "title": "Australia's top court rejects Russia's challenge to embassy eviction",
            "author": "Rod Mcguirk",
            "url": "https://www.guardonline.com/news/world/australias-top-court-rejects-russias-challenge-to-embassy-eviction/article_8935063a-6402-56c4-a20b-f450d1315eae.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/guardonline.com/content/tncms/assets/v3/editorial/4/88/4884f0b5-1a2b-5a08-9dba-8ca287ed6c83/69141c5bdb3b3.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "A fence surrounds a building on the grounds of a proposed new Russian embassy near the Australian Parliament in Canberra. An Australian Federal Police officer is watching from his vehicle. The building will be located near the Parliament. It is proposed to be built on the site of the old Russian Embassy."
        },
        {
            "published_date": "2025-11-12T05:30:00",
            "title": "Jamaica still restoring roads and communications after Hurricane Melissa as death toll rises",
            "author": "Oleh Velhan",
            "url": "https://newsukraine.rbc.ua/news/jamaica-still-restoring-roads-and-communications-1762925331.html",
            "url_media": "https://newsukraine.rbc.ua/static/img/g/e/gettyimages_2243386676_9db4624b04adc59eecbfbfaab0676479_650x410__1__88b469ae99e7e4575f31afdf1a8b4dff_650x410_c359eba0470756fd03db066aaf6315d0_650x410.jpg",
            "country": "UA",
            "language": "en",
            "summary": "The confirmed death toll from Hurricane Melissa in Jamaica has risen to 45, with another 15 people still missing. Helicopters are dropping food and supplies to isolated communities. 30,000 households were evacuated and 1,100 people remain in 88 emergency shelters. 30 roads are still obstructed, but half of the population has regained mobile service, over 70% have access to water and electricity has been restored to more than 60% of consumers."
        },
        {
            "published_date": "2025-11-12T05:18:16",
            "title": "Resist political capture, prioritise people over profits, COP30 told",
            "author": "Chinedum Uwaegbulam",
            "url": "https://guardian.ng/news/resist-political-capture-prioritise-people-over-profits-cop30-told",
            "url_media": "https://cdn.guardian.ng/wp-content/uploads/2025/11/COP30-1280x720-1.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Germany provides €7 million for Climate Action in Agri-food Systems project in Nigeria, Cambodia and Bolivia. The project is aimed at accelerating climate-resilient food systems in Nigeria and establishing enabling institutional, strategic and financial conditions to facilitate ambitious climate protection across Nigeria's agricultural and food systems."
        },
        {
            "published_date": "2025-11-12T05:12:02",
            "title": "Farmers urged to diversify, build resilience after Melissa",
            "author": "Olivia Brown Gleaner Writer",
            "url": "https://jamaica-gleaner.com/article/news/20251112/farmers-urged-diversify-build-resilience-after-melissa",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/11/12/3279370/8398511.jpg?itok=IQLwYORn",
            "country": "JM",
            "language": "en",
            "summary": "Andre Anderson, president of the Clarendon branch of the Jamaica Agricultural Society (JAS), is urging farmers to adopt more resilient farming practices and diversify their crops as they work to rebuild after Hurricane Melissa. The agricultural sector has suffered losses exceeding $20 billion and 40 per cent of the layer flock destroyed."
        },
        {
            "published_date": "2025-11-12T05:11:38",
            "title": "Somalia: Minister - Climate Action Is Vital for Somalia's Sustainable Development",
            "author": "",
            "url": "https://allafrica.com/stories/202511120040.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Somalia's Minister of Environment and Climate Change has called for strengthened implementation of the country's Nationally Determined Contributions (NDCs) in a speech at a high-level climate meeting organized in cooperation with the United Nations. He stressed the importance of international cooperation, increased climate financing and the implementation of initiatives that directly benefit farmers, fishermen, pastoralists, and youth."
        },
        {
            "published_date": "2025-11-12T05:11:24",
            "title": "Climate Change (COP30) and CARICOM",
            "author": "",
            "url": "https://jamaica-gleaner.com/article/commentary/20251112/elizabeth-morgan-climate-change-cop30-and-caricom",
            "url_media": "https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/11/12/3279227/8399322.jpg?itok=uvF19laa",
            "country": "JM",
            "language": "en",
            "summary": "Hurricane Mellissa made landfall on Jamaica's southwest coast on Tuesday, October 28. She left in her wake damage and deaths in the Dominican Republic and Haiti as she passed off shore at Category 5. The 30th UN Conference on Climate Change (COP30) started in Belém, Brazil, at the entrance to the Amazon, with the Leaders' Summit on November 6-7. About 40 world leaders attended the summit. The USA is withdrawing from the Paris Climate Agreement and the UN Framework Convention on Climate change. CARICOM countries are experiencing climate change."
        },
        {
            "published_date": "2025-11-12T05:01:00",
            "title": "Coastal geologist Stan Riggs sets out on 10-book project",
            "author": "Catherine Kozak",
            "url": "https://coastalreview.org/2025/11/coastal-geologist-stan-riggs-sets-out-on-10-book-project",
            "url_media": "https://coastalreview.org/wp-content/uploads/2025/11/Stan-OBX.jpg",
            "country": "US",
            "language": "en",
            "summary": "Dr. Stan Riggs has written 10 books about North Carolina's northeast and central coastal region. The first volume of the series, Cape Lookout National Seashore, Paradigm for a Coastal System Ethic, was released in October. In October, NCLOW announced the appointment of Stanton Blakeslee to its board of directors to guide the nonprofit's future."
        },
        {
            "published_date": "2025-11-12T05:00:08",
            "title": "Humboldt Penguins in Peril: Chilean Scientists Raise Alarms",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3694149-humboldt-penguins-in-peril-chilean-scientists-raise-alarms",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "There are fewer than 20,000 Humboldt penguins left in the world. About 80% of the population lives along Chile's Pacific coast. The species is threatened by environmental changes and human activities.    The endangered status of the species requires urgent conservation efforts. "
        },
        {
            "published_date": "2025-11-12T05:00:00",
            "title": "Riggs to launch first book in series Sunday on Harkers Island",
            "author": "Staff Report",
            "url": "https://coastalreview.org/2025/11/riggs-to-launch-first-book-in-series-sunday-on-harkers-island",
            "url_media": "https://coastalreview.org/wp-content/uploads/2022/12/Stan-Riggs.png",
            "country": "US",
            "language": "en",
            "summary": "Stanley R. Riggs, professor emeritus at East Carolina University, will be at the Core Sound Waterfowl Museum and Heritage Center on Sunday at 3 p.m. to launch his new book 'Cape Lookout National Seashore: Paradigm for a Coastal System Ethic' which was released in October. He has spent more than six decades studying North Carolina's barrier islands."
        },
        {
            "published_date": "2025-11-12T04:48:15",
            "title": "80,000 dead, 1.3 billion lives disrupted: How climate disasters have wreaked havoc in India since 1995",
            "author": "",
            "url": "https://www.firstpost.com/explainers/80000-dead-1-3-billion-lives-disrupted-how-climate-disasters-have-wreaked-havoc-in-india-since-1995-13949879.html",
            "url_media": "https://images.firstpost.com/uploads/2025/11/2024-05-29T130242Z_506561703_RC2708A9TYLH_RTRMADP_3_ASIA-WEATHER-INDIA-HEATWAVE-2025-11-db4c30472fdd658de37d60933a860b2e-1200x675.jpg?im=FitAndFill=(1200,675)",
            "country": "IN",
            "language": "en",
            "summary": "India is one of the worst-hit countries by climate change. According to the Climate Risk Index, the country has seen 430 extreme weather conditions, affecting nearly 1.3 billion people since 1995. The report says the country's losses stemmed largely from repeated floods, cyclones, droughts and heat waves intensified with global warming."
        },
        {
            "published_date": "2025-11-12T04:45:01",
            "title": "Up Armidale Road: Hear the fire-inspired track performed for 21,000 NRL fans",
            "author": "armidaleexpress.com.au",
            "url": "https://ground.news/article/up-armidale-road-hear-the-fire-inspired-track-performed-for-21-000-nrl-fans",
            "url_media": "https://groundnews.b-cdn.net/assets/letterIcons/square/FFAB00/T.png?width=24",
            "country": "US",
            "language": "en",
            "summary": "Grace and Hugh's 'Up Armidale Road' celebrates NSW RFS volunteers and community resilience during the 'black summer' bushfires.    \"Up Armidsale Road\" is available to buy on the Internet at: http://www.justgiving.com/up-armidale-road."
        },
        {
            "published_date": "2025-11-12T04:45:01",
            "title": "Up Armidale Road: Hear the fire-inspired track performed for 21,000 NRL fans",
            "author": "Heath Forsyth",
            "url": "https://www.armidaleexpress.com.au/story/9110304/grace-and-hughs-song-honours-bushfire-heroes",
            "url_media": "https://www.armidaleexpress.com.au/images/transform/v1/crop/frm/220762904/7c89b7ef-1e38-461e-ac92-90a9831823b7.jpg/r0_45_1064_604_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Grace and Hugh's 'Up Armidale Road' is one of the finalists for the 2025 environmental music prize. It's a song inspired by the 2019-20 bushfire season and is performed by Grace and Hugh. It is in the running for the prize."
        },
        {
            "published_date": "2025-11-12T04:35:00",
            "title": "India Ranked 9th In Global Climate Risk Index: 30 Years, 80,000 Lives, $170 Billion Lost",
            "author": "News Desk",
            "url": "https://www.news18.com/india/india-ranked-9th-in-global-climate-risk-index-30-years-80000-lives-170-billion-lost-9700434.html",
            "url_media": "https://images.news18.com/ibnlive/uploads/2025/10/1-2025-10-27T085025.974-2025-10-9d3f8f579b00813ed8cef3e854624c0a-16x9.png",
            "country": "IN",
            "language": "en",
            "summary": "The Germanwatch Global Climate Risk Index (CRI) places India ninth globally among countries most impacted by climate disasters over the three-decade period spanning 1995 to 2024. India has endured nearly 430 extreme weather events, resulting in the devastating loss of more than 80,000 lives and cumulative economic losses reaching an estimated $170 billion over the last 30 years."
        },
        {
            "published_date": "2025-11-12T04:32:34",
            "title": "KENYA FLOODS AND DISPLACEMENT IN LAKE NAIVASHA",
            "author": "DI CRS CS CRS CS",
            "url": "https://n.news.naver.com/mnews/article/091/0010048783",
            "url_media": "https://imgnews.pstatic.net/image/091/2025/11/12/PEP20251112047201009_P2_20251112043234669.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Thousands of people in Kihoto Etate, in Naivasha, Nakuru County, Kenya, have been affected by floods caused by the rising waters of LakeNaivasha. Water levels has been rising to unprecedented levels that has been expanding the lake since 2020."
        },
        {
            "published_date": "2025-11-12T04:25:15",
            "title": "Protesters win fracking ban in WA",
            "author": "Riley Breen",
            "url": "https://www.greenleft.org.au/2025/1442/news/protesters-win-fracking-ban-wa",
            "url_media": "https://www.greenleft.org.au/sites/default/files/2025/11/12/frack-free-wa.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Hundreds of activists from across Western Australia greeted Labor's conference delegates, on November 8. They raised concerns over fracking, the AUKUS submarine deal and Labor's refusal to condemn Israel's genocide in Gaza. Delegates voted to ban fracking in WA, handing the ball to Labor to make it law."
        },
        {
            "published_date": "2025-11-12T04:20:00",
            "title": "2025 Iowa Climate Statement: Climate change impacts insurance premiums",
            "author": "Marcus McIntosh",
            "url": "https://www.kcci.com/article/2025-iowa-climate-statement-climate-change-impacts-insurance-premiums/69398299",
            "url_media": "https://kubrick.htvapps.com/vidthumb/7169afd2-c05b-4a29-90b1-ef2f34b05137/95da84f8-5e7c-4d18-8204-c8f114cf7ec1.jpg?crop=0.783xw:0.783xh;0.196xw,0&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather events caused by climate change are affecting insurance premiums for homeowners and farmers in Iowa. Experts emphasize that reducing climate-related costs begins with cutting greenhouse gas emissions from burning fossil fuels. University of Iowa professor Emma Stapleton encourages Iowans to contact their lawmakers to ask them to adopt and enforce stronger building standards."
        },
        {
            "published_date": "2025-11-12T04:09:01",
            "title": "Taiwan's Resilience: Battling the Aftermath of Typhoon Fung-wong",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3694114-taiwans-resilience-battling-the-aftermath-of-typhoon-fung-wong",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "Typhoon Fung-wong caused severe flooding on Taiwan's eastern coast. Over 8,300 people were evacuated due to flooding. The storm is expected to miss the crucial tech hub of Hsinchu. Forecasters worry about the impact of climate change."
        },
        {
            "published_date": "2025-11-12T04:08:27",
            "title": "Taiwan evacuates 8,300 and shuts schools before tropical storm brushes island",
            "author": "",
            "url": "https://www.wellandtribune.ca/life/taiwan-evacuates-8-300-and-shuts-schools-before-tropical-storm-brushes-island/article_5cd2de9a-8d87-56a2-9174-baa6d5fd658e.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/wellandtribune.ca/content/tncms/assets/v3/editorial/3/d3/3d311ed5-759b-5edc-bf1a-a9dc2495bb1c/69140dabdc27f.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Typhoon Fung-wong devastated Ilagan, Isabela province, northern Philippines on Tuesday November 11 after the onslaught of Typhoon Fung Wong. Welland Tribune is a well-known newspaper in Canada. It's free to subscribe to and gift this article to friends and family for free."
        },
        {
            "published_date": "2025-11-12T04:05:00",
            "title": "‘Uwan' death toll rises to 27",
            "author": "Ian Laqui",
            "url": "https://www.philstar.com/headlines/2025/11/12/2486710/uwan-death-toll-rises-27",
            "url_media": "https://media.philstar.com/photos/2025/11/09/evacuees-uwan-crowd_2025-11-09_17-56-03.jpg",
            "country": "PH",
            "language": "en",
            "summary": "The death toll from Super Typhoon Uwan has increased to 27. Ifugao has the highest number of reported deaths with nine, followed by Benguet with four. 36 people were injured across the provinces of Nueva Vizcaya, Mountain Province, Quezon, Catanduanes, Camarines Norte and Negros Occidental. Uwan affected 3,596,174 individuals or 1,006,149 families. Highest number of affected residents was recorded in Bicol with 1,414,412 people. "
        },
        {
            "published_date": "2025-11-12T04:04:54",
            "title": "Philippines launches first parametric insurance for 14,200 small fishers",
            "author": "Manila Standard Business",
            "url": "https://manilastandard.net/business/314667299/philippines-launches-first-parametric-insurance-for-14200-small-fishers.html",
            "url_media": "https://cdn.manilastandard.net/wp-content/uploads/2025/11/fisherman-pna.jpg",
            "country": "JP",
            "language": "en",
            "summary": "The Philippines has launched the country's first parametric insurance solution for small-scale fishers. The solution is designed to protect the livelihoods of 14,200 fishers across 24 coastal municipalities in the Philippines. The insurance offers coverage of up to $100 per policy cycle to offset income loss from dangerous weather."
        },
        {
            "published_date": "2025-11-12T03:45:00",
            "title": "Climate disasters killed 80,000, hit 1.3 billion in India since 1995",
            "author": "",
            "url": "https://www.millenniumpost.in/big-stories/climate-disasters-killed-80000-hit-13-billion-in-india-since-1995-635166",
            "url_media": "https://www.millenniumpost.in/h-upload/2025/11/12/999882-pti08152025000068a.jpg",
            "country": "IN",
            "language": "en",
            "summary": "India ranks ninth globally among countries most impacted by climate disasters over the past three decades. Climate disasters affected 1.3 billion people and caused economic losses worth almost USD 170 billion from 1995 to 2024. Dominica was the most-affected country, followed by Myanmar, Honduras, Libya, Haiti, Grenada, Philippines, Nicaragua, India and Bahamas."
        },
        {
            "published_date": "2025-11-12T03:44:22",
            "title": "The COP hypocrisy will cost us a fortune",
            "author": "Malcolm Roberts",
            "url": "https://www.spectator.com.au/2025/11/the-cop-hypocrisy-will-cost-us-a-fortune",
            "url_media": "https://www.spectator.com.au/wp-content/uploads/2025/11/GettyImages-2244865353.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The Albanese Labor government wants Australia to pay $1.5 billion for hosting a United Nations climate talkfest in Australia in 2026. Last year's conference of parties to the UNFCCC involved millionaires, billionaires, and politicians travelling around the world in fuel-guzzling private jets. One Nation stands for Australia, with Australians."
        },
        {
            "published_date": "2025-11-12T03:26:01",
            "title": "India Ranks Ninth Among Nations Worst Hit By Climate Disasters: Germanwatch Report",
            "author": "Saher Hiba Khan",
            "url": "https://www.outlookindia.com/national/india-ranks-ninth-among-nations-worst-hit-by-climate-disasters-germanwatch-report",
            "url_media": "https://media.assettype.com/outlookindia/import/public/uploads/articles/2021/12/21/Untitled_design_(31).jpg?w=1200&amp;ar=40%3A21&amp;auto=format%2Ccompress&amp;ogImage=true&amp;mode=crop&amp;enlarge=true&amp;overlay=false&amp;overlay_position=bottom&amp;overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "India ranks ninth globally among countries most impacted by climate-related disasters over the past three decades, with nearly 430 extreme weather events claiming more than 80,000 lives. The report was published on Tuesday at the COP30 climate summit in Belem, Brazil. Dominica was ranked the most-affected country, followed by Myanmar, Honduras, Libya, Haiti, Grenada, the Philippines, Nicaragua, India and the Bahamas."
        },
        {
            "published_date": "2025-11-12T03:15:00",
            "title": "Scientists issue warning on powerful phenomenon that could usher in 'new reality': 'We are rapidly approaching'",
            "author": "Craig Gerard",
            "url": "https://www.yahoo.com/news/articles/scientists-issue-warning-powerful-phenomenon-031500148.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ZYC7__ucreW2ttk3hiUmog--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/0a2e523269d80a4b6155fe2c6b529a7d",
            "country": "US",
            "language": "en",
            "summary": "The 2025 Global Tipping Points Report collects updates about environmental thresholds, both positive and negative. Global warming projects to surpass 1.5 degrees Celsius (2.7 degrees Fahrenheit) by the end of the century. If the planet continues to overheat, other terrible tipping points could be breached, including the irreparable melting of ice sheets, the collapse of ocean currents, and the death of essential rainforests. The report's release comes in the lead-up to the 30th annual United Nations Climate Change Conference."
        },
        {
            "published_date": "2025-11-12T02:57:13",
            "title": "WRI official: 'climate action does not mean slowing growth'-Ecns.cn",
            "author": "",
            "url": "http://www.ecns.cn/m/video/2025-11-12/detail-ihewyezc9797226.shtml",
            "url_media": "http://image.cns.com.cn/ecns_editor/transform/20251112/4o9I-hewyezc9797380.jpg",
            "country": "CN",
            "language": "en",
            "summary": "\"Climate action does not mean slowing growth, but it means growing smarter,\" said Adriana Lobo, managing director for Global Presence and National Action at the World Resources Institute, during a sideline event at the China Pavilion of the 30th United Nations climate change conference in Belém, Brazil."
        },
        {
            "published_date": "2025-11-12T02:35:17",
            "title": "India ninth among world's most climate-hit nations, as loss and damage fund opens first call for proposals",
            "author": "Sv Krishna Chaitanya",
            "url": "https://www.newindianexpress.com/states/tamil-nadu/2025/Nov/12/india-ninth-among-worlds-most-climate-hit-nations-as-loss-and-damage-fund-opens-first-call-for-proposals",
            "url_media": "https://media.newindianexpress.com/newindianexpress%2F2025-11-11%2Foduf27zp%2FIndia-9th-among.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "Extreme weather has claimed over 832,000 lives globally and caused $4.5 trillion in economic losses over 30 years. Six of the ten most affected countries are lower-middle-income nations. Dominica, Myanmar, Honduras, Libya, Haiti, Grenada, the Philippines, Nicaragua and the Bahamas are in the top ten. St. Vincent and the Grenadines and Grenada ranked first and second for the year 2024."
        },
        {
            "published_date": "2025-11-12T02:35:17",
            "title": "India nineth among nations hit by climate change: Global Risk Index",
            "author": "Sv Krishna Chaitanya",
            "url": "https://www.newindianexpress.com/states/tamil-nadu/2025/Nov/12/india-nineth-among-nations-hit-by-climate-change-global-risk-index",
            "url_media": "https://media.newindianexpress.com/newindianexpress%2F2025-11-11%2Foduf27zp%2FIndia-9th-among.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "India is one of the ten countries most affected by extreme weather events over the past three decades, according to the latest Climate Risk Index (CRI) 2026 released by Germanwatch at COP30 in Belém, Brazil. The index places India ninth, highlighting its growing vulnerability to heat waves, floods and cyclones that have intensified under global warming."
        },
        {
            "published_date": "2025-11-12T02:32:00",
            "title": "Total Fire Ban For Mallee 12 November",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/total-fire-ban-for-mallee-12-november-1568697",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=cdn.pixabay.com%2Fphoto%2F2019%2F05%2F19%2F09%2F04%2Fhipsters-4213520_640.jpg",
            "country": "US",
            "language": "en",
            "summary": "A Total Fire Ban (TFB) has been declared for the Mallee tomorrow, Thursday 13 November 2025. It means no fire can be lit in the open air or allowed to remain alight from 12.01am to 11.59pm on the day of the TFB. The TFB is due to the expected dry and windy conditions in the region tomorrow. CFA Chief Officer Jason Heffernan said harvest fires occurred in the last two weeks."
        },
        {
            "published_date": "2025-11-12T02:31:44",
            "title": "Record-low temperatures shock Southeast states while snowfall blankets parts of the Northeast",
            "author": "Hannah Fingerhut",
            "url": "https://www.adn.com/nation-world/2025/11/11/record-low-temperatures-shock-southeast-states-while-snowfall-blankets-parts-of-the-northeast",
            "url_media": "https://www.adn.com/resizer/v2/XW3WHWUUGNB3MKA33OPF6G6M7Y.jpg?smart=true&auth=3069b89f5191e4d04cf1d428522bf1ec6b68a93e3083c12b09ce7ae34eecd90f&width=1200&height=630",
            "country": "US",
            "language": "en",
            "summary": "The first major cold spell of the season plunged parts of the southeastern U.S. into record-low temperatures. 18 million people are under a freeze warning across Alabama, Florida and Georgia. Several inches of snow blanketed areas along the eastern Great Lakes as the blast of cold air moved through. Florida faces a 'falling iguana advisory'"
        },
        {
            "published_date": "2025-11-12T02:23:15",
            "title": "(Poster) China's Action: Together for a Greener World",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20251112/8f48c3100e98485c905324a0ef0cf891/c.html",
            "url_media": "https://english.news.cn/20251112/8f48c3100e98485c905324a0ef0cf891/202511128f48c3100e98485c905324a0ef0cf891_4a21b5b2d27e491ea9e93ebb27bf6926.jpg",
            "country": "CN",
            "language": "en",
            "summary": "China has actively supported and partnered with other developing countries in addressing climate change, according to Xinhua Global Service's report.      Â  “Advancing global climate cooperation” is Xinhua’s report on climate change. "
        },
        {
            "published_date": "2025-11-12T02:18:00",
            "title": "New report offers policy solutions to address housing and climate crises",
            "author": "Spectrum News Staff",
            "url": "https://ny1.com/nyc/all-boroughs/inside-city-hall/2025/11/12/new-report-offers-policy-solutions-to-address-housing-and-climate-crises",
            "url_media": "https://s7d2.scene7.com/is/image/TWCNews/ICH_KARLA_SOSA_111125",
            "country": "US",
            "language": "en",
            "summary": "A new report is calling on the incoming Mamdani administration to address the climate crisis as soon as possible. More than 19,000 homes across the city are at risk of being lost to coastal flooding by 2040. Karla Sosa, a project manager at the Environmental Defense Fund co-authored the report, joined 'Inside City Hall' on Tuesday."
        },
        {
            "published_date": "2025-11-12T02:08:00",
            "title": "Far North Qld residents urged to have say on region's biggest challenges",
            "author": "Sian Jeffries",
            "url": "https://www.couriermail.com.au/news/cairns/have-your-say-on-the-big-issues-facing-far-north-queensland/news-story/865ba7e91355a6ea492df5b83bb93fe3",
            "url_media": "https://content.api.news/v3/images/bin/86339a1da69bb32ed1c1275b0c7752fb",
            "country": "AU",
            "language": "en",
            "summary": "Your voice matters in Far North Queensland. Cairns Post readers are asked to complete a poll to identify the biggest issues affecting people across Cairntown, the Tablelands, the Cassowary Coast, Cape York and the Torres Strait. The results will help inform future planning and advocacy with council, state and federal governments."
        },
        {
            "published_date": "2025-11-12T02:08:00",
            "title": "Have your say on the big issues facing Far North Queensland",
            "author": "Sian Jeffries",
            "url": "https://www.cairnspost.com.au/news/cairns/have-your-say-on-the-big-issues-facing-far-north-queensland/news-story/865ba7e91355a6ea492df5b83bb93fe3",
            "url_media": "https://content.api.news/v3/images/bin/86339a1da69bb32ed1c1275b0c7752fb",
            "country": "AU",
            "language": "en",
            "summary": "Your voice matters in Far North Queensland. The poll is confidential and will help inform future planning and advocacy with council, state and federal governments. It only takes a couple of minutes and is confidential. Please add your voice today and pass the poll on to your neighbours, mates and colleagues."
        },
        {
            "published_date": "2025-11-12T02:05:01",
            "title": "The job paying $218k that needs Aussies to start NOW: 'The rewards are incredible'",
            "author": "Kylie Stevens",
            "url": "https://www.msn.com/en-in/lifestyle/smart-living/the-job-paying-218k-that-needs-aussies-to-start-now-the-rewards-are-incredible/ar-AA1QfX5n",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Time is running out to apply for a once-in-a-lifetime opportunity to work in Antarctica. The Australian Antarctic Program is looking for more than 300 qualified staff to work at its three scientific research stations and onboard RSV Nuyina for the 2026-27 season. The base salary and additional allowances start from $218,131."
        },
        {
            "published_date": "2025-11-12T02:01:51",
            "title": "The Liberal party's betrayal of younger voters on net zero isn't just a moral failure – it's electoral stupidity",
            "author": "Intifar Chowdhury",
            "url": "https://www.theguardian.com/commentisfree/2025/nov/12/the-liberal-partys-betrayal-of-younger-voters-on-net-zero-isnt-just-a-moral-failure-its-electoral-stupidity",
            "url_media": "https://i.guim.co.uk/img/media/0eb11ba8b997f6fe53890baaba75c782c0177f51/648_0_5396_4319/master/5396.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a8c0077038cc656deb0a9ccb2cd0d1da",
            "country": "GB",
            "language": "en",
            "summary": "The 2025 election defeat should have been a wake-up call for the Liberal party on the issue of climate and young people. In the May election, it attracted just one in five millennials (born after 1980) and only 27% of gen Z (born since 1996). This reflects a failure of the parties to connect with a critical demographic while holding on to a shrinking base of older, whiter, more regional and largely male voters."
        },
        {
            "published_date": "2025-11-12T02:00:18",
            "title": "Weather news: Temperatures dip to record lows across Australia's south-east",
            "author": "Emily Bennett1:00pm",
            "url": "https://www.9news.com.au/national/residents-shiver-as-temperatures-dip-to-record-levels-in-australias-southeast/6f44a346-d7f9-4806-9e9a-7a5416f21c0c",
            "url_media": "https://imageresizer.static9.net.au/X6VdSbewbxNQC9RfX3MkopdQJw8=/36x176:951x691/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F45512a52-650d-4f6f-9dc2-2bd2ca361dac",
            "country": "AU",
            "language": "en",
            "summary": "Canberra's minimum temperature of -2.3 degrees is 12 degrees below average for November. New November daily minimum temperature records were also broken in the NSW central west communities of Orange and Mudgee. The previous November record was -1.8 degrees from 1967. A series of cold fronts will bring \"abnormally cold weather\" in parts of southern and south-eastern Australia over the coming week."
        },
        {
            "published_date": "2025-11-12T01:58:58",
            "title": "Climate change creates 'poster child' for Canada's new wildlife report",
            "author": "Nathan Howes",
            "url": "https://ca.news.yahoo.com/climate-change-creates-poster-child-015858273.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ztJoSPFZSMvWgyH19KLh5g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk7Y2Y9d2VicA--/https://media.zenfs.com/en/the_weather_network_616/642799ab8eddb60db938ff9ad7b7f920",
            "country": "US",
            "language": "en",
            "summary": "The World Wildlife Fund Canada's 2025 edition of Living Planet Report Canada highlights the negative trend in Canada's biodiversity, with a 10% decline in the size of monitored vertebrate populations from 1970 to 2022 due to habitat loss, climate change, pollution, invasive species and disease. In Canada, snowy owl populations have declined by 56% since 1970. Five-lined skink, prairie dogs, sea otters, salmon, and black-tailed prairie dog are affected by climate change."
        },
        {
            "published_date": "2025-11-12T01:58:00",
            "title": "Ethiopia set to host UN's 2027 climate summit, 2026 undecided",
            "author": "Black Hills Pioneer",
            "url": "https://article.wn.com/view/2025/11/12/Ethiopia_set_to_host_UNs_2027_climate_summit_2026_undecided_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ethiopia will host the UN climate conference in 2027. Australia or Turkey will host next year's conference in 2015, but Ethiopia is most likely to host it in 2028. Australia is still unsure.    uncertain about hosting next year. "
        },
        {
            "published_date": "2025-11-12T01:47:15",
            "title": "India ranks ninth among most climate-affected countries in new global risk index",
            "author": "Jayanta Basu",
            "url": "https://www.telegraphindia.com/india/india-among-worlds-top-10-most-climate-impacted-nations-says-germanwatch-report-prnt/cid/2132442",
            "url_media": "https://assets.telegraphindia.com/telegraph/2025/Nov/1762911953_new-project-2025-11-12t064226-640.jpg",
            "country": "IN",
            "language": "en",
            "summary": "India is among the top 10 most climate-impacted countries in the world, according to a global report released in Belem on Tuesday evening. Dominica, Myanmar and Honduras have been most affected by extreme weather over the past 30 years. Almost all the countries ranked in the top 30 are in the global south. Five European countries and the US appear among top 30."
        },
        {
            "published_date": "2025-11-12T01:46:00",
            "title": "Global Climate Action 2025: Tracking Progress Post-Paris",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/global-climate-action-2025-tracking-progress-1568188",
            "url_media": "https://unfccc.int/sites/default/files/styles/hero_image/public/2025-11/rainforest-78516_1280.jpg?itok=lipVO_VS",
            "country": "US",
            "language": "en",
            "summary": "Climate action by non-Party stakeholders is a key driver for the implementation of the first global stocktake (GST) outcome, according to the 2025 Yearbook of Global Climate Action published by UN Climate Change today. The Yearbook comes at a pivotal moment for climate action 10 years after the adoption of the Paris Agreement."
        },
        {
            "published_date": "2025-11-12T01:41:54",
            "title": "Can we tackle climate change without net zero? Here's what it really means",
            "author": "Jo Lauder",
            "url": "https://www.abc.net.au/news/2025-11-12/what-does-net-zero-mean-and-why-we-need-it-to-act-on-climate/105996502",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/8fdba8f0051edfcf0e348ad8ab82fed4?impolicy=wcms_watermark_news&cropH=779&cropW=1385&xPos=309&yPos=204&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Net zero is a technical term for the point where temperatures will stabilise. It's often used to loosely describe support for climate policies and the efforts to bring emissions down. Without net zero, the world will continue to heat up. The Paris Agreement aims to keep global temperature increases as close to 1.5C and below 2C."
        },
        {
            "published_date": "2025-11-12T01:25:00",
            "title": "NASA scientist issues grim warning 37 years after his original prediction: 'Point of no return'",
            "author": "Michael Muir",
            "url": "https://www.yahoo.com/news/articles/nasa-scientist-issues-grim-warning-012500830.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/cTK_np56jvBj6_Uchm84JA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/0d12506a77e32d816c15841989bc9750",
            "country": "US",
            "language": "en",
            "summary": "NASA scientist issues grim warning 37 years after his original prediction: \"Point of no return\" for the Atlantic Meridional Overturning Circulation. The AMOC works like a conveyor belt that moves warm water north and cool water south. It takes a cubic meter of water over 1,000 years to complete the cycle. If it were to collapse, the consequences would be a catastrophe felt worldwide."
        },
        {
            "published_date": "2025-11-12T01:15:00",
            "title": "Residents make drastic decision to save home from looming threat: 'It was an important wake-up call for us'",
            "author": "Zachary Ehrmann",
            "url": "https://www.yahoo.com/news/articles/residents-drastic-decision-save-home-011500372.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/WYUcnMn9S2WrVBiHY9Az4Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/50adc27dd1166a985cb4e410744d00c9",
            "country": "US",
            "language": "en",
            "summary": "Carol Epstein and Jim Shafer are spending $500,000 to raise their Willard Beach home about five feet to prepare it for sea level rise. The sea level is projected to rise between 1.1 and 3.2 feet by 2050 and up to 9.3 feet by 2100. More than 50 homes in the Willard beach area are already expected to flood during major storms and many more at risk during high tide."
        },
        {
            "published_date": "2025-11-12T01:10:58",
            "title": "Bill Gates is wrong to quiet-quit climate fight",
            "author": "Dzul",
            "url": "https://themalaysianreserve.com/2025/11/12/bill-gates-is-wrong-to-quiet-quit-climate-fight",
            "url_media": "https://www.facebook.com/tr?id=283031649327915&ev=PageView&noscript=1",
            "country": "MY",
            "language": "en",
            "summary": "Bill Gates is giving ammunition to those fighting against further progress on climate change. The Microsoft Corp founder has long led the charge to keep the planet from overheating, dedicating money and attention to the cause and helping make real change possible. In a note on his website titled 'Three tough truths about climate,' Gates suggests negotiators at this month's COP30 climate summit in Brazil should help poor countries bolster their health and agricultural systems."
        },
        {
            "published_date": "2025-11-12T01:06:06",
            "title": "Foreign state attempted to target Australia's water supply, ASIO boss says",
            "author": "Eleanor Campbell",
            "url": "https://www.canberratimes.com.au/story/9109887/foreign-spies-targeted-australias-energy-networks-water-supply",
            "url_media": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/237852436/89ee94a6-4f03-472a-a449-e29360de7675.jpg/r0_354_6000_3504_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Foreign intelligence services have taken an interest in Australia's role in the AUKUS nuclear submarine pact with the US and UK. Dr Burgess revealed 24 major espionage and foreign interference attempts in the past three years.       .   \"Unhealthy\" interest in the pact."
        },
        {
            "published_date": "2025-11-12T01:00:00",
            "title": "As COP30 shows, rich nations and elites still block climate progress",
            "author": "Prasanna Mohanty",
            "url": "https://thefederal.com/category/business/as-cop30-shows-rich-nations-and-elites-still-block-climate-progress-215748",
            "url_media": "https://thefederal.com/h-upload/2025/11/11/576356-cop30.jpg",
            "country": "GB",
            "language": "en",
            "summary": "COP30 is taking place in Brazil's Belem. The UN Environment Programme's 'Emissions Gap Report 2025: Off Target', released on November 6, makes clear that climate change is accelerating. The past 11 years (2015-2025) are set to be the warmest on record. Global warming breached 1.5°C in 2024, according to the WMO."
        },
        {
            "published_date": "2025-11-12T00:30:00",
            "title": "India in top ten countries affected by extreme weather in the last 30 years: report",
            "author": "Priyali Prakash",
            "url": "https://www.thehindu.com/sci-tech/energy-and-environment/india-in-top-ten-countries-affected-by-extreme-weather-in-the-last-30-years-report/article70267118.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/8w05zd/article70267209.ece/alternates/LANDSCAPE_1200/20240829257L.jpg",
            "country": "IN",
            "language": "en",
            "summary": "India was ninth on the list of countries most affected by extreme weather events between 1995 and 2024, according to the new Climate Risk Index (CRI) 2026 report by Germanwatch. Saint Vincent and the Grenadines in the Caribbean was the worst affected country in 2024, followed by Grenada in the same region, and Chad in central Africa. India's rank for 2024 was 15."
        },
        {
            "published_date": "2025-11-12T00:30:00",
            "title": "Irish farm groups back call for ‘split gas' climate reporting",
            "author": "Ciaran Moran",
            "url": "https://www.independent.ie/farming/forestry-enviro/irish-farm-groups-back-call-for-split-gas-climate-reporting/a1435257134.html",
            "url_media": "https://focus.independent.ie/thumbor/6j8qRi-njWlZvOwgpEANRo2_14M=/0x0:3238x2158/629x0/prod-mh-ireland/9f6e5344-ce7c-47bc-957a-d08244b5159a/2251c73d-c8f8-4057-9089-09be5b197338/9f6e5344-ce7c-47bc-957a-d08244b5159a.jpg",
            "country": "IE",
            "language": "en",
            "summary": "FAI and Meat Industry Ireland have joined a global alliance of agricultural organisations calling for a major change in how greenhouse gas emissions are reported internationally. They are among 14 signatories to a joint statement published in recent days, ahead of COP30 in Brazil. They want UNFCCC to adopt a 'split gas' approach to emissions reporting."
        },
        {
            "published_date": "2025-11-12T00:30:00",
            "title": "A Jamaican Perspective on COP30 After Hurricane Melissa",
            "author": "Global Voices",
            "url": "https://www.newsgram.com/america/2025/11/12/jamaican-perspective-on-cop30-after-hurricane-melissa",
            "url_media": "https://media.assettype.com/newsgram%2F2025-11-11%2Fkms47lru%2FScreenshot-2025-11-11-233209.webp?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "US",
            "language": "en",
            "summary": "The United Nations Climate Change Conference, COP30, will be held in Belém, Brazil, from November 10 to 21. The Caribbean is sceptical about the environmental disruption these COP meetings cause. Small island developing states (SIDS) contribute the least to global greenhouse gas (GHG) emissions. The region will experience as much as USD 48 to 52 billion in damage from Hurricane Melissa."
        },
        {
            "published_date": "2025-11-12T00:07:00",
            "title": "Try this hack for keeping condensation off your windows",
            "author": "Canada Dot Com",
            "url": "https://article.wn.com/view/2025/11/12/Try_this_hack_for_keeping_condensation_off_your_windows",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "When the weather outside is bad, staying warm at home is a good idea. However, cranking the heat inside can lead to a potentially dangerous temperature rise inside.      Â  “I’ll keep you warm.”"
        },
        {
            "published_date": "2025-11-12T00:01:59",
            "title": "From a wintry chill to summertime sun, temperature rollercoaster this week in Houston",
            "author": "",
            "url": "https://abc13.com/post/houstons-temperature-rollercoaster-week-sees-wintry-mornings-sunny-afternoons/18144840",
            "url_media": "https://cdn.abcotvs.com/dip/images/18144915_111125-ktrk-rollercoaster-wx-sw-img.png?w=1600",
            "country": "GB",
            "language": "en",
            "summary": "The current La Niña is expected to last through at least February, which means a warmer and drier winter in Southeast Texas. The North Pacific \"Blob\" is responsible for the stormy pattern in the Pacific Northwest and the recent arctic blast in Houston. The cold streaks are getting shorter as the climate warms."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Severe storms cause widespread damage on Greece's northeastern islands",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20251112/da201c9c06ad4c0db2b5b41cb762d401/c.html",
            "url_media": "https://english.news.cn/2021newxl/images/20210928_rightShareYb_v1.png",
            "country": "CN",
            "language": "en",
            "summary": "Heavy rainfall and hailstorms have caused extensive flooding and damage to homes, businesses and crops in Greece's northeastern Aegean islands. On Lesvos Island, the town of Kalloni was among the hardest hit, with streets, houses and dozens of shops submerged after the Tsiknias River overflowed. The historic Kremasti Bridge also sustained damage when floodwaters carried a large shipping container into it. On Samos Island a powerful overnight storm brought torrential rain and hail the size of walnuts. Local authorities requested emergency financial aid from the government to repair infrastructure and support affected farmers."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "UN report highlights key role of non-state actors in climate action",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20251112/2ba9921d287a4a74afd8b3ccf59c31d6/c.html",
            "url_media": "https://english.news.cn/20251112/2ba9921d287a4a74afd8b3ccf59c31d6/zxcode_202511122ba9921d287a4a74afd8b3ccf59c31d6.jpg",
            "country": "CN",
            "language": "en",
            "summary": "Cities, businesses and civil society are playing a central role in implementing strategies to mitigate climate change, according to a UN report. The report was released Tuesday at the 30th United Nations climate change conference (COP30) being held in the Brazilian Amazon. Non-state actors are essential in advancing global efforts to curb global warming."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Philippines ranks 7th in climate risk index",
            "author": "Bella Cariaso",
            "url": "https://www.philstar.com/headlines/2025/11/12/2486592/philippines-ranks-7th-climate-risk-index",
            "url_media": "https://media.philstar.com/photos/2025/11/11/15_2025-11-11_22-22-42.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Philippines is ranked as the seventh most affected by extreme weather events in 2024, according to Germanwatch's latest Climate Risk Index. The report was presented at the 30th United Nations climate change conference (COP30) in Belém, Brazil. The Philippines should ensure that developed countries deliver on their promise of mobilizing $300 billion in climate financing for developing nations."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "India among top ten countries affected by extreme weather in the last 30 years, new ...",
            "author": "The Hindu",
            "url": "https://article.wn.com/view/2025/11/12/India_among_top_ten_countries_affected_by_extreme_weather_in",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "According to the report, India is highly affected by recurring extreme weather events, which have affected both people and the economy over the years, and have affected the lives of people and economy of the country. The report claims that India is very affected by such weather events."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Climate Change and Human Rights talks kick off in Sydney",
            "author": "FBC News",
            "url": "https://article.wn.com/view/2025/11/12/Climate_Change_and_Human_Rights_talks_kick_off_in_Sydney",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Representatives from Fiji and the Pacific are in Sydney, Australia for a fellowship focused on Climate Change and Climate Change in the Pacific and the Climate Change of the Fiji and Pacific region. They are currently in Sydney for the fellowship on climate change and climate change. "
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "(Poster) China's Action: Together for a Greener World",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/11/12/Poster_Chinas_Action_Together_for_a_Greener_World",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Advancing global climate cooperation, China has actively supported and partnered with other developing countries in addressing climate change. Scenery of ice flow in China's Heilongjiang early. Produced by Xinhua Global Service.   Â   y  "
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "US in fight against climate change: Never a leader, but still significant",
            "author": "Indian Express",
            "url": "https://article.wn.com/view/2025/11/12/US_in_fight_against_climate_change_Never_a_leader_but_still_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As the world's largest historical emitter of greenhouse gases, and also the country with the highest level of CO2 emissions, China needs to reduce its emissions to reduce global warming. It is also responsible for high levels of carbon dioxide emissions. It emits CO2 as well as other greenhouse gases."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Can we tackle climate change without net zero? Here's what it really means",
            "author": "system",
            "url": "https://article.wn.com/view/2025/11/12/Can_we_tackle_climate_change_without_net_zero_Here_s_what_it",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Coalition is debating whether to dump its commitment to the net zero climate target. Here's what that term actually means and what it doesn't mean.   .    \"Net zero\" is the term used to refer to the absence of greenhouse gas emissions."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Egrets dance over mudflats in Maoming's Dianbai",
            "author": "Alice Fung",
            "url": "https://www.newsgd.com/node_99363c4f3b/debd3aed96.shtml",
            "url_media": "https://nfassetoss.southcn.com/__asset/a36b63d187/32b0264e85.jpg",
            "country": "CN",
            "language": "en",
            "summary": "After the start of winter, the chilly wind has been blowing in northern China. Maoming's Dianbai district on the shore of the South China Sea remains warm. It's a key stop on the East Asian-Australasian Flyway migration route. More than 20 species of migratory birds, including egrets, bulbuls, and plovers, have arrived this year."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Global wildlife trade threatens species survival, biosecurity: study",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/11/12/Global_wildlife_trade_threatens_species_survival_biosecurity_u",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A new international study has revealed the vast and largely unmonitored trade of wildlife around the world. The study was conducted in collaboration with researchers from Australia, the United States, Europe, and South America. It warns of growing risks to biodiversity and biosecurity."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "What Bill Gates Overlooks About Climate Change",
            "author": "Project Syndicate",
            "url": "https://article.wn.com/view/2025/11/12/What_Bill_Gates_Overlooks_About_Climate_Change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bill Gates argues that we should de-emphasize the existential threat posed by climate change and put human welfare at the center of our climate strategies to prevent it from becoming a serious problem. He suggests putting the welfare of people at the centre of the climate strategy."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Heat Waves Will Be Less Extreme because of Paris Climate Agreement",
            "author": "Scientific American",
            "url": "https://article.wn.com/view/2025/11/12/Heat_Waves_Will_Be_Less_Extreme_because_of_Paris_Climate_Agr",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There will be less extreme heat in the future than there would be without the Paris climate agreement, according to the UNFCCC.   It's been ten years since the Paris agreement was signed and we haven't made much progress in reducing global warming. It's better than without the agreement."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "'Tino' destroys nearly P47M in crops, livestock in Cebu City",
            "author": "Sun Star",
            "url": "https://article.wn.com/view/2025/11/12/apostino_apos_destroys_nearly_p47m_in_crops_livestock_in_ceb",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Typhoon 'Tino' destroyed P47 million worth of crops, livestock and farm infrastructure in Cebu City's mountain barangays after it struck on November 4. The city provides around 40 to 50 percent of the vegetable supply. The shortfall can be filled by nearby areas such as Dalaguete and Cagayan."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Year's largest wave of migratory birds reaches Wuhan wetland",
            "author": "China Daily",
            "url": "https://article.wn.com/view/2025/11/12/Years_largest_wave_of_migratory_birds_reaches_Wuhan_wetland",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "This year's largest wave of migratory birds reached the wetland of Fuhe, Wuhan, Hubei province. Numerous species are gathering over the vast waters. Packs of bean geese and gray geese forage and rest in the strands."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Northern Lights shine across Northern Ireland",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/11/12/Northern_Lights_shine_across_Northern_Ireland",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Northern Lights, also known as the aurora borealis, are vibrant light displays that occur in the sky. They are usually seen near the polar regions, usually near the north pole. They're usually accompanied by a vibrant light display in the night sky."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "‘Africa can become a green leader': Interview with Mohamed Adow of Power Shift Africa",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/11/12/Africa_can_become_a_green_leader_Interview_with_Mohamed_Adow",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "2025 has been marked by extreme climate events in many parts of Africa. The Democratic Republic of Congo, Somalia and Chad have been hit hard by the effects of climate change. Many have also suffered the consequences of a drought and floods caused by the warming climate."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Beijing Expresses Strong Protest Over Hacking Accusations by Australia",
            "author": "Sputnik",
            "url": "https://article.wn.com/view/2025/11/12/Beijing_Expresses_Strong_Protest_Over_Hacking_Accusations_by",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Beijing has issued a strong protest over the accusation of cyber attacks by Australia, Chinese Foreign Ministry spokesman Guo Jiakun said on Wednesday. Australia has accused Beijing of such attacks.      Â   for the first time. "
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Conference travel emissions exceed research energy use",
            "author": "Space Daily",
            "url": "https://article.wn.com/view/2025/11/12/Conference_travel_emissions_exceed_research_energy_use",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists at the Institute of Science and Technology Austria evaluated the carbon footprint of travel to Berlin, Germany (SPX) Nov 11, 2025. They found it to be high and that travel there would have a negative impact on the environment.   . "
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Iceland 'doomed' if Atlantic Ocean current collapses: Nation declares 'existential threat' from modern-day ice age ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/11/12/Iceland_doomed_if_Atlantic_Ocean_current_collapses_Nation_de",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Iceland has designated the potential collapse of the Atlantic Ocean Current as an existential threat and has begun planning for worst-case scenarios. The Atlantic Meridional Overturning Circulation is a conveyor belt that moves warm water from the tropics to the northern Atlantic."
        },
        {
            "published_date": "2025-11-12T00:00:00",
            "title": "Think the Paris Agreement failed? Here's what It actually achieved",
            "author": "Deutsche Welle",
            "url": "https://article.wn.com/view/2025/11/12/think_the_paris_agreement_failed_here_aposs_what_it_actually",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Global emissions continue to rise a decade after the Paris Climate Agreement. However, solar, wind and EV growth demonstrate that climate action can work. Here's what has been achieved and what remains urgent.    - what is still urgent and what is not. "
        }
    ]
}