{
    "status": "ok",
    "total_articles": 65,
    "articles": [
        {
            "published_date": "2025-02-16T23:52:00",
            "title": "State hit by coldest Feb morning in 30 years",
            "author": "Zoe De Koning",
            "url": "https://www.msn.com/en-au/news/australia/state-hit-by-coldest-feb-morning-in-30-years/ar-AA1zaR9H",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Melburnians were caught off guard when temperatures dropped as low as 5C on Sunday morning following a week of scorching heat. A cold front has left a cold air mass across Tasmania, Victoria and southern and eastern NSW. Canberra dropped to 3.2C, while Sydney suburbs also felt the cool change."
        },
        {
            "published_date": "2025-02-16T23:52:00",
            "title": "Victorians brace for ‘rollercoaster' after coldest Feb morning in 30 years",
            "author": "Zoe De Koning",
            "url": "https://www.news.com.au/technology/environment/victorians-brace-for-rollercoaster-after-coldest-feb-morning-in-30-years/news-story/1d941126e60679f4f956efec6d82d95f",
            "url_media": "https://content.api.news/v3/images/bin/4fa38056ee7371ad439e4a3e2607535b",
            "country": "AU",
            "language": "en",
            "summary": "Melburnians were caught off guard when temperatures dropped to 5C on Sunday morning after a week of scorching heat. A cold front pushed through southeastern Australia over the weekend. The change from hot to cold has been dramatic. The mercury is expected to climb back up to 36C on Saturday."
        },
        {
            "published_date": "2025-02-16T22:44:27",
            "title": "24m Lagos residents threatened by climate challenges",
            "author": "Bayo Agboola",
            "url": "https://blueprint.ng/24m-lagos-residents-threatened-by-climate-challenges-researcher",
            "url_media": "https://blueprint.ng/wp-content/uploads/2023/11/Lagos-crowded-n-buses-1.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Dr Olalekan Fatoki, a researcher at the Forestry Research Institute of Nigeria (FRIN), Ibadan, has said that over 24 million Lagos residents are being threatened by climate challenges. Dr Fatoki said the climate challenges included rising sea levels, erratic rainfall, heat waves and severe flooding. Lagos is ranked as the tenth most vulnerable coastal city globally. Hamburg's renewable energy strategy stood out as a key lesson for Lagos."
        },
        {
            "published_date": "2025-02-16T22:40:00",
            "title": "Visitor Arrivals Up In 2024",
            "author": "Nz Airports Association",
            "url": "https://www.scoop.co.nz/stories/BU2502/S00160/visitor-arrivals-up-in-2024.htm",
            "url_media": "http://img.scoop.co.nz/stories/images/1908/scoop_image.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "Overseas visitor arrivals to New Zealand totalled 3.3 million in the December 2024 year. This was up 357,000 from the December 2023 year. Australia led the increase in visitor arrivals, up 127,000 (10 percent) from 2023. China followed with an increase of 97,000, and the United States with increase of 32,000."
        },
        {
            "published_date": "2025-02-16T20:59:00",
            "title": "Reader's View: Stop kicking climate change down the road",
            "author": "",
            "url": "https://www.duluthnewstribune.com/opinion/letters/readers-view-stop-kicking-climate-change-down-the-road",
            "url_media": "https://cdn.forumcomm.com/dims4/default/477eef7/2147483647/strip/true/crop/1800x1125+0+0/resize/1706x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fduluthnewstribune%2Fbinary%2FReader%27s%20View_binary_2722040.jpg",
            "country": "US",
            "language": "en",
            "summary": "Letters keep asking how atmospheric carbon dioxide, produced by man, cause global warming. Contrarians state that volcanoes on land and under the sea release about 200 million tons of carbon dioxide annually. The global fossil fuel carbon-dioxide emissions for 2003 tipped the scales at 26.8 billion tons."
        },
        {
            "published_date": "2025-02-16T20:16:43",
            "title": "Is leisure travel so bad for the planet that we are all better off just staying home?",
            "author": "Roddy Scheer",
            "url": "https://augustafreepress.com/news/is-leisure-travel-so-bad-for-the-planet-that-we-are-all-better-off-just-staying-home",
            "url_media": "https://augustafreepress.com/wp-content/uploads/2023/03/airplane.jpg?_t=1739737004",
            "country": "US",
            "language": "en",
            "summary": "According to the International Air Transport Association, in 2024 global air travel increased by 10.4%. Tourism accounts for about eight percent of world greenhouse gas emissions. A single round-trip flight from New York to Los Angeles emits 7.1 metric tons of carbon dioxide (CO 2). This is equivalent to the emissions from 1.7 gasoline-powered vehicles driven in one year."
        },
        {
            "published_date": "2025-02-16T19:53:50",
            "title": "Morning Mail: Ukraine warns Russia will ‘wage war on Nato', Climate 200 eyes Labor seats, why home building is so slow",
            "author": "Paul Gallagher",
            "url": "https://www.theguardian.com/australia-news/2025/feb/17/morning-mail-monday-ntwnfb",
            "url_media": "https://i.guim.co.uk/img/media/0e025921fa8ebf6ab9105e757f48a3a23325a073/0_226_4328_2596/master/4328.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ef9342634352fc52fb957e68e0c08948",
            "country": "GB",
            "language": "en",
            "summary": "Climate 200 is throwing its weight behind candidates in four Labor seats, including one held by a cabinet minister. There are calls for faster planning approvals and fewer regulations as a Productivity Commission report lays bare how home building across Australia has fallen behind and added to the affordability crisis. European leaders are meeting for a hastily arranged summit amid rising diplomatic tensions. Ukraine warns that Russia will 'wage war on Nato' if US support for Kyiv evaporates. Democracy across the globe is under threat from the retreat of the US into isolationism, and its likely replacement by China on the world stage."
        },
        {
            "published_date": "2025-02-16T18:00:16",
            "title": "Climate change is complicating a beloved Midwest pastime: Ice fishing",
            "author": "Inside Climate News",
            "url": "https://www.dailykos.com/stories/2025/2/16/2297324/-Climate-change-is-complicating-a-beloved-Midwest-pastime-Ice-fishing",
            "url_media": "https://cdn.prod.dailykos.com/images/1388440/story_image/AP976433575318.jpg?1737063829",
            "country": "US",
            "language": "en",
            "summary": "Last winter was the hottest on record in the contiguous United States, and the previous winter was among the warmest in many states' histories. The trend has been especially noticeable in Midwest states such as Wisconsin and Minnesota, where many communities depend on winter tourism and recreation that require cold and snowy conditions. Last year's ice cover in Wisconsin was the second lowest on record, only a month and a half' of ice cover."
        },
        {
            "published_date": "2025-02-16T18:00:00",
            "title": "The Great Antarctic Sea Ice Flipflop",
            "author": "Eric Worrall",
            "url": "https://wattsupwiththat.com/2025/02/16/the-great-antarctic-sea-ice-flipflop",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2023/09/192027709_twitter-post_normal_none.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "In 2014 NOAA blamed record high sea ice on global warming. Now NSIDC blames record low sea-ice on climate change. In 2013 the 'Spirit of Mawson' expedition got stuck in sea ice during a trip to Antarctica. The Antarctic sea ice has varied wildly for at least the last century."
        },
        {
            "published_date": "2025-02-16T16:03:00",
            "title": "Christchurch, underwater",
            "author": "Jane Shearer",
            "url": "https://newsroom.co.nz/2025/02/17/christchurch-underwater",
            "url_media": "https://i0.wp.com/newsroom.co.nz/wp-content/uploads/2025/02/heathcote.jpg?fit=1620%2C1080&ssl=1",
            "country": "NZ",
            "language": "en",
            "summary": "Christchurch will flood as a result of sea level rise. Extreme weather events will become more frequent due to climate change. The inland Canterbury Plains and foothills will get 15-40 percent more rain in winter. There will be 40-80 days a year over 25oC. Daytime temperatures will increase 2-5oC, pushing temperatures into the high thirties on the hottest days. The Canterbury Plains will become covered with wind turbines and solar panels."
        },
        {
            "published_date": "2025-02-16T16:00:00",
            "title": "Climate Column: Health and potential heather burning impact",
            "author": "Villages",
            "url": "https://www.darlingtonandstocktontimes.co.uk/news/24922321.climate-column-health-potential-heather-burning-impact",
            "url_media": "https://www.darlingtonandstocktontimes.co.uk/resources/images/19070488.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "This month's column from Climate Action Stokesley and Villages takes a look at the health impact of burning moorland heather. The main reasons for burning are to provide new buds for red grouse to eat, suppress trees and create firebreaks against wildfires. The Government banned the sale of wet wood in 2021 for phasing out completely by 2023. British Moorland, who manage seven grouse moors in Scotland, advocate mowing over burning in a \"narrow strip matrix\"."
        },
        {
            "published_date": "2025-02-16T15:04:09",
            "title": "UP Govt released ‘Mahakumbh Declaration on Climate Change', pledging to turn religious centres and shrines across the state green",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/02/16/UP_Govt_released_Mahakumbh_Declaration_on_Climate_Change_ple",
            "url_media": "https://article.wn.com/view/2025/02/16/[]",
            "country": "US",
            "language": "en",
            "summary": "Yogi Adityanath says climate change is drying up rivers and causing a rising frequency of extreme weather events. He urges people to take responsibility and work collectively for its solution. He warns of catastrophic consequences in the coming years due to the continuous release of greenhouse gases."
        },
        {
            "published_date": "2025-02-16T15:03:53",
            "title": "Scientists understood physics of climate change in the 1800s – thanks to a woman named Eunice Foote",
            "author": "Sylvia G. Dee",
            "url": "https://www.yahoo.com/news/scientists-understood-physics-climate-change-150353862.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/U4I1GC13GcIvOFqD94gRPA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01NzI-/https://media.zenfs.com/en/the_conversation_us_articles_815/97b5a7878259ac1c2b328eb03dedd784",
            "country": "US",
            "language": "en",
            "summary": "Eunice Foote discovered in 1856 that carbon dioxide is the driving force of global warming. Since 1900 atmospheric carbon dioxide has risen from 300 parts per million to 417 ppm as a result of human activities. The Arctic has already warmed by 3.8 C (6.8 F)"
        },
        {
            "published_date": "2025-02-16T14:56:54",
            "title": "Weather: What a difference a year makes!",
            "author": "",
            "url": "https://www.newsbreak.com/fox-17-news-west-michigan-563680/3815597563990-weather-what-a-difference-a-year-makes",
            "url_media": "https://img.particlenews.com/img/id/2tXom5_0z1gdTMG00",
            "country": "PH",
            "language": "en",
            "summary": "It was the warmest winter season in Grand Rapids in 125-years of record-keeping at the Grand Rapids National Weather Service office just a year ago. So far this season, the average high temperature for December, January and February is 31.7 degrees, which is 2 degrees below the 30-year climate average. It's going to get colder over the next couple of weeks."
        },
        {
            "published_date": "2025-02-16T14:00:00",
            "title": "Wrong, Earth.com, Cocoa Production Is Not ‘Under Extreme Climate Pressure' It's Improving",
            "author": "Guest Blogger",
            "url": "https://wattsupwiththat.com/2025/02/16/wrong-earth-com-cocoa-production-is-not-under-extreme-climate-pressure-its-improving",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/02/225017790_m.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Earth.com published a story claiming climate change is causing cocoa production to fall in West and Central Africa. Data show that cocoa production has increased during the last few decades of modest warming, rather than falling. There is no good reason found in botany, agronomy or climatology for thinking growing conditions in the region will change for the worse."
        },
        {
            "published_date": "2025-02-16T13:29:08",
            "title": "Some in Hurricane Helene-ravaged North Carolina embrace Trump's push to abolish FEMA",
            "author": "Makiya Seminera",
            "url": "https://www.nhregister.com/news/politics/article/some-in-hurricane-helene-ravaged-north-carolina-20170658.php",
            "url_media": "https://s.hdnux.com/photos/01/47/25/45/27089257/3/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Helene devastated western North Carolina more than four months ago. Many residents are frustrated with the federal response to the disaster. Vickie Revis lives in a trailer on her property after her home was destroyed by Hurricane Helene and Addisun Cole, 8, plays outside her grandmother's trailer."
        },
        {
            "published_date": "2025-02-16T12:38:00",
            "title": "Ghana's banking sector ranks 4th in sub-saharan Africa for climate resilience",
            "author": "House",
            "url": "https://www.modernghana.com/news/1379901/ghanas-banking-sector-ranks-4th-in-sub-saharan.html",
            "url_media": "https://cdn.modernghana.com/images/content/216202513829-nsjum8x432-whatsapp-image-2025-02-15-at-180250-copy.png",
            "country": "GH",
            "language": "en",
            "summary": "Ghana's banking sector has been ranked 4th in Sub-Saharan Africa for its resilience to natural disasters according to the latest Fitch Solutions Climate Change and Opportunities for SSA Banking Sectors report. Ghana's ranking places it behind South Africa, Côte d'Ivoire, and Botswana, but ahead of Rwanda, Senegal, and Kenya."
        },
        {
            "published_date": "2025-02-16T11:44:09",
            "title": "Rising Sea Levels",
            "author": "Bill Crews",
            "url": "https://www.4bc.com.au/podcast/rising-sea-levels",
            "url_media": "https://www.4bc.com.au/wp-content/uploads/sites/10/2025/02/shane-headshot.png",
            "country": "AU",
            "language": "en",
            "summary": "Bill speaks with Prof. Shane Keating about the rising temperatures of Australia's sea surface and the impact it has on the climate in Australia. Listen to Bill's podcast here.    -     .   \"Download this podcast here\""
        },
        {
            "published_date": "2025-02-16T11:21:09",
            "title": "Challenging Love: How Human Activity Hinders Animal Mating",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3266912-challenging-love-how-human-activity-hinders-animal-mating",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/30_05_2024_08_53_43_0415318.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A recent report highlights the dire effects of human activity on animal mating patterns. Animals face increased difficulties in finding mates due to habitat fragmentation, climate changes, and various forms of pollution caused by humans. Noise pollution has forced birds to modify their songs, while marine animals struggle with changes in oceanic soundscapes. Chemical pollution is leading to reproductive imbalances in fish and human-disturbed environments are pushing mammals like bears to adopt nocturnal habits. Introduced species have led to detrimental hybridizations, impacting native species' chances of survival and reproduction."
        },
        {
            "published_date": "2025-02-16T11:20:34",
            "title": "CM warns of extreme heat in Kerala, urges public to take precautions",
            "author": "",
            "url": "https://www.onmanorama.com/kerala/top-news/2025/02/16/kerala-heatwave-warning-cm-vijayans-alert.html",
            "url_media": "https://img.onmanorama.com/content/dam/mm/en/kerala/top-news/images/2024/5/1/summer-heat-water.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The summer heat is intensifying across Kerala. Pinarayi Vijayan has warned the public about the rising temperatures. He also highlighted the increased risk of fire outbreaks in places such as markets, waste collection centres, dumping yards, and buildings. He urged tourists and residents near forest areas to remain extra cautious and adhere to the Forest Department's guidelines."
        },
        {
            "published_date": "2025-02-16T11:00:08",
            "title": "DeSantis urged to declare emergency over toxic red tide algae off Florida coast",
            "author": "Richard Luscombe in Miami",
            "url": "https://www.yahoo.com/news/desantis-urged-declare-emergency-over-110008886.html",
            "url_media": "https://media.zenfs.com/en/the_guardian_765/0a3fcc1b18ec9c2051281070ff885829",
            "country": "US",
            "language": "en",
            "summary": "A worsening'red tide' algae bloom off Florida's south-west coast threatens tourist beaches and is being blamed for the deaths of wildlife including fish and dolphins. Several counties have issued health alerts in response to the outbreak. Red tides can cause skin irritation and respiratory distress in humans and animals. Conservationists are calling on the governor, Ron DeSantis, to declare an emergency. "
        },
        {
            "published_date": "2025-02-16T11:00:00",
            "title": "Getting green investment where it's needed most",
            "author": "",
            "url": "https://koreajoongangdaily.joins.com/news/2025-02-16/opinion/columns/Getting-green-investment-where-its-needed-most/2242585",
            "url_media": "https://koreajoongangdaily.joins.com/data/photo/2025/02/16/4bfb8506-7eee-4f16-9b8d-721813914a71.jpg",
            "country": "KR",
            "language": "en",
            "summary": "The UN Climate Change Conference (COP29) in Baku, Azerbaijan, concluded with the adoption of a New Collective Quantified Goal. Developed countries pledged at least $300 billion annually, and all actors agreed to scale up public and private finance for developing countries to $1.3 trillion per year by 2035. Public development banks will play an essential role in reaching these targets."
        },
        {
            "published_date": "2025-02-16T10:51:18",
            "title": "Here's when the weather will change dramatically for UK after freezing rain and snow",
            "author": "Jen Mills",
            "url": "https://www.msn.com/en-gb/weather/topstories/here-s-when-the-weather-will-change-dramatically-for-uk-after-freezing-rain-and-snow/ar-AA1z92mM",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will rise to 13°C or 14°C by the middle of the week. It comes after January saw widespread snow and ice, with people skiing down roads in Devon. Some areas may go 10 days without any sunshine, which is 'near record-breaking'."
        },
        {
            "published_date": "2025-02-16T10:05:37",
            "title": "Opinion: We need climate change outreach and a stop to fossil fuel industry misinformation",
            "author": "Ella Howie",
            "url": "https://www.citizen-times.com/story/opinion/2025/02/16/human-caused-climate-change-is-obcured-by-fossil-fuel-industry/78383430007",
            "url_media": "https://www.citizen-times.com/gcdn/authoring/authoring-images/2025/02/10/PASH/78383715007-ella-howie.jpg?crop=4031,2268,x0,y302&width=3200&height=1801&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "Tropical Storm Helene caused a once-in-a-thousand-year flood in North Carolina. Ella is an environmental student at Chapel Hill University studying the environment. She is concerned about the health of her parents, the safety of her community and the future of the planet."
        },
        {
            "published_date": "2025-02-16T10:00:00",
            "title": "SC's saltmarsh sparrows are going extinct. What do they tell us about a changing climate?",
            "author": "Jonah Chester",
            "url": "https://www.postandcourier.com/rising-waters/south-carolina-endangered-species-saltmarsh-sparrow/article_b7f6dd7a-9b9e-11ef-b81d-23dca3fd27fa.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/0/d7/0d79e1c6-dd02-11ef-a1e6-3fea0128943b/67980f4bb9ab2.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Aaron Given banded tens of thousands of birds on Kiawah Island to better understand the avian species that inhabit this sea island. The sparrows live exclusively in salt marshes along the Atlantic and Gulf Coast, and overwinter in coastal South Carolina. They have lost about 90 percent of their population since the late 1990s due to increased frequency and severity of tidal flooding. About 40 other South Carolina species are either awaiting a listing decision or \"under review\" by the Fish and Wildlife Service."
        },
        {
            "published_date": "2025-02-16T09:36:03",
            "title": "Trump ends climate work inside agency that responds to disasters",
            "author": "",
            "url": "https://www.luxtimes.lu/world/trump-ends-climate-work-inside-agency-that-responds-to-disasters/41267649.html",
            "url_media": "https://img.luxtimes.lu/public/luxembourg/sh6z5b-president-trump-arrives-on-air-force-one-in-west-palm-beach-florida-34070568.jpeg/alternates/SIXTEEN_NINE_1200/president-trump-arrives-on-air-force-one-in-west-palm-beach-florida-34070568.jpeg",
            "country": "LU",
            "language": "en",
            "summary": "The Department of Homeland Security ordered an immediate stop to work connected to climate change and the elimination of climate-related terms across the agency. The changes are meant to bring 'alignment' with Trump's executive orders that reverse multiple climate related orders by former President Joe Biden. The directive from DHS Secretary Kristi Noem marks the latest move by President Donald Trump and his appointees to roll back federal efforts to address global warming. It could affect disaster response capabilities overseen by DHS and the Federal Emergency Management Agency."
        },
        {
            "published_date": "2025-02-16T09:09:00",
            "title": "The Latest IPCC Report: What New Climate Data Reveals About Our Future",
            "author": "John Dyson",
            "url": "https://www.msn.com/en-us/weather/topstories/the-latest-ipcc-report-what-new-climate-data-reveals-about-our-future/ar-AA1z93tI",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "IPCC has just released its latest report on climate change. The report is enlightening and sobering. Global temperatures are rising due to human activities. Polar ice caps are melting and sea levels are rising. Natural disasters are becoming more frequent and more severe. Renewable energy is an opportunity to reduce emissions and save the planet."
        },
        {
            "published_date": "2025-02-16T09:00:43",
            "title": "Government backs plan to tackle rising sea levels",
            "author": "TDT",
            "url": "https://www.newsofbahrain.com/bahrain/108723.html",
            "url_media": "https://www.newsofbahrain.com/admin/post/upload/A_k84GTb5QdD_2025-02-16_1739688955resized_pic.jpg",
            "country": "BH",
            "language": "en",
            "summary": "Bahrain's government has backed a parliamentary proposal to prepare for rising sea levels. Measures being considered include extending shorelines, setting up rock barriers offshore and weaving protective features into urban development plans. There are also proposals to build waterfront walkways that would serve both as coastal defences and business opportunities."
        },
        {
            "published_date": "2025-02-16T09:00:00",
            "title": "Wick's windy January can be measured on Beaufort scale",
            "author": "",
            "url": "https://www.johnogroat-journal.co.uk/news/wick-s-windy-january-can-be-measured-on-beaufort-scale-374343",
            "url_media": "https://www.johnogroat-journal.co.uk/_media/img/IGFTD80RH76O76725A58.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Wick's January 2025 is the coldest since 2021 and driest since 2022. The mean air temperature for January 2025 was 3.69C (38.64F). The highest daily maximum was 12.9C (55.2F) recorded on January 17 and the lowest daily minimum was 0.88C (33.58F). It is the 32nd least wet January since 1910."
        },
        {
            "published_date": "2025-02-16T08:00:00",
            "title": "Climate changes, even without humans",
            "author": "news@pressenterprise.net",
            "url": "https://www.pressenterpriseonline.com/daily/021625/page/21/story/climate-changes-even-without-humans",
            "url_media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg",
            "country": "US",
            "language": "en",
            "summary": "The United Nations, many universities, many companies and many political figures are convinced that the Earth is heating up and that there is climate change. They believe there is a link between climate change and man-made global warming. The Earth is getting warmer and there's a risk of climate change, according to the UN."
        },
        {
            "published_date": "2025-02-16T07:35:31",
            "title": "Jewish leaders' warning after white supremacist boot camp on Melbourne beach",
            "author": "",
            "url": "https://www.smh.com.au/national/jewish-leaders-warning-after-white-supremacist-boot-camp-on-melbourne-beach-20250216-p5lck8.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/ff2e751ca9804519b09125fd4a2156e6cbe41aa0",
            "country": "AU",
            "language": "en",
            "summary": "Jewish leaders have warned Australia could be sleep-walking into a Nazi nightmare after a video emerged of white supremacists holding a boot camp at Elwood beach. The boot camp was organised by white supremacists.      Â   in the video. "
        },
        {
            "published_date": "2025-02-16T07:35:31",
            "title": "Jewish leaders' warning after white supremacist boot camp on Melbourne beach",
            "author": "",
            "url": "https://www.theage.com.au/national/jewish-leaders-warning-after-white-supremacist-boot-camp-on-melbourne-beach-20250216-p5lck8.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/ff2e751ca9804519b09125fd4a2156e6cbe41aa0",
            "country": "AU",
            "language": "en",
            "summary": "Jewish leaders have warned Australia could be sleep-walking into a Nazi nightmare after a video emerged of white supremacists holding a boot camp at Elwood beach. The boot camp was organised by white supremacists.      Â   in the video. "
        },
        {
            "published_date": "2025-02-16T07:21:56",
            "title": "Why the US is freezing as the planet reaches record warmth",
            "author": "Umair Irfan",
            "url": "https://news.knowledia.com/all/all/articles/why-the-us-is-freezing-as-the-planet-reaches-record-warmth-bafea35c8a3e6d8cfcc52ea4367025799a249f25",
            "url_media": "https://platform.vox.com/wp-content/uploads/sites/2/2025/02/GettyImages-2192674267.jpg?quality=90&strip=all&crop=0,10.729320983584,100,78.541358032832",
            "country": "FR",
            "language": "en",
            "summary": "January 2025 was the hottest January ever measured on planet Earth. The planet was between 2.95 degrees Fahrenheit and 3.15 degrees F (1.64 Celsius) warmer than the average January at the dawn of the Industrial Revolution. January was the 18th month out of the last 19 to have global average air temperatures greater than 2.7 F above pre-industrial levels."
        },
        {
            "published_date": "2025-02-16T07:13:00",
            "title": "Red-winged blackbirds, other birds due to return soon",
            "author": "Bryan Stevens",
            "url": "https://www.timesnews.net/sports/the-appalachian-adventurer/red-winged-blackbirds-other-birds-due-to-return-soon/article_928bff93-4f4c-599e-a312-91dad3c71577.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/timesnews.net/content/tncms/assets/v3/editorial/e/b2/eb2c1eff-8d2a-52ba-9b3d-6f589775ac8e/67b301c9060d4.image.jpg?crop=1140%2C599%2C0%2C270",
            "country": "US",
            "language": "en",
            "summary": "February's the shortest month and it's more than halfway over. There are already signs that birds are ready to embrace the shift in seasons as winter advances, albeit in fits and starts, toward spring, and some birds are already showing signs of being ready for spring."
        },
        {
            "published_date": "2025-02-16T06:41:14",
            "title": "Flood warning issued for Western Australia after powerful cyclone wreaked havoc",
            "author": "FRASER BARTON",
            "url": "https://www.dailymail.co.uk/news/article-14402535/Flood-warning-issued-Western-Australia-powerful-cyclone-wreaked-havoc.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/02/16/04/95259253-0-image-a-22_1739681868290.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Tropical Cyclone Zelia brought heavy rain and damaging winds to Western Australia's north on Friday. No deaths or injuries were reported. River levels have begun to ease in the Pilbara region but the flood threat has not completely passed. A major flood peak was observed along the De Grey River at Coolenar Pool, east of Port Hedland, early on Sunday morning. The river level was at 8.98 metres and above the flood levels of March 2000."
        },
        {
            "published_date": "2025-02-16T06:00:00",
            "title": "Letter: Cutting climate-related funding will harm Maine",
            "author": "Opinion Contributor",
            "url": "https://www.bangordailynews.com/2025/02/16/opinion/letters/letter-cutting-climate-related-funding-will-harm-maine-joam40zk0w",
            "url_media": "https://i0.wp.com/bdn-data.s3.amazonaws.com/uploads/2025/02/IMG_7071.jpg?fit=1200%2C900&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "NOAA was asked to supply a list of active climate-related grant funding to the Trump administration. Alexis Garretson is concerned about potential cuts to climate research and mitigation efforts. She urges policymakers, scientists and the public to push for continued federal funding of climate research."
        },
        {
            "published_date": "2025-02-16T05:57:25",
            "title": "Assam to witness rising temperatures, changing rainfall patterns by 2040: Study",
            "author": "The Assam Tribune",
            "url": "https://assamtribune.com/assam/assam-to-witness-rising-temperatures-changing-rainfall-patterns-by-2040-study-1568349",
            "url_media": "https://assamtribune.com/h-upload/2024/10/27/1663213-climate-cahnge.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Mean annual temperatures in some districts of Assam may rise by up to 0.83 degrees Celsius by 2040. Jorhat and Majuli are likely to experience the highest levels exceeding 31 degrees. Nagaon is projected to see a 1.95 degree Celsius rise in annual wet bulb temperature. The Northeast monsoon could see extended dry periods of up to 68.12 days, and Darrang may face a 7.54 per cent increase in dry spells during the season."
        },
        {
            "published_date": "2025-02-16T05:56:48",
            "title": "Global Warming Science No Longer Settled: Two Studies Find a New Cause for Warmer Temps",
            "author": "Jeffrey A. Tucker",
            "url": "https://www.todayville.com/global-warming-science-no-longer-settled-two-studies-find-a-new-cause-for-warmer-temps",
            "url_media": "https://i2.wp.com/www.todayville.com/wp-content/uploads/2024/07/tvrd-hdn-heat-temperature-climate-change-global-warming-image-2024-07-01.jpg?fit=600%2C399&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Robert F. Kennedy, Jr.'s confirmation as the Secretary of Health and Human Services in the US is the ultimate repudiation of the Covidid policy response to global warming. The US government has spent almost half a trillion dollars on climate change initiatives since the 'problem' was identified."
        },
        {
            "published_date": "2025-02-16T05:18:16",
            "title": "DHS shifts focus, halting climate change work and terminology in latest move by Donald Trump appointees",
            "author": "Livemint",
            "url": "https://www.livemint.com/news/us-news/dhs-shifts-focus-halting-climate-change-work-and-terminology-in-latest-move-by-donald-trump-appointees/amp-11739681647880.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/02/16/1600x900/Kristi_Noem_1739682798119_1739682798443.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The US Department of Homeland Security ordered an immediate halt to all climate change-related work and the removal of climate-related terminology. The directive from DHS Secretary Kristi Noem represents the latest effort by President Donald Trump and his appointees to reverse federal initiatives aimed at combating global warming. This move could impact disaster response operations, which fall under DHS jurisdiction."
        },
        {
            "published_date": "2025-02-16T04:30:19",
            "title": "Burning reality – A fiery sign of climate change in Pakistan",
            "author": "JAVAID UR RAHMAN",
            "url": "https://www.nation.com.pk/16-Feb-2025/burning-reality-a-fiery-sign-of-climate-change-in-pakistan",
            "url_media": "https://www.nation.com.pk/print_images/large/2025-02-16/burning-reality-a-fiery-sign-of-climate-change-in-pakistan-1739680185-2468.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Wildfires have intensified globally in recent years due to climate change. Pakistan has experienced a 12.7 percent rise in wildfires from 2001 to 2020, mainly affecting Punjab and Sindh. In 2024, Punjab witnessed an 89% rise in forest fires compared to the previous year, with 377 incidents reported. Balochistan experienced one of its worst wildfire outbreaks in early 2025, claiming the lives of at least 35 people and burning thousands of acres of forest."
        },
        {
            "published_date": "2025-02-16T04:03:25",
            "title": "What is carbon capture?",
            "author": "Vasudevan Mukunth",
            "url": "https://www.thehindu.com/sci-tech/science/what-is-carbon-capture/article69225500.ece",
            "url_media": "https://th-i.thgim.com/public/sci-tech/science/1rd4vg/article69225498.ece/alternates/LANDSCAPE_1200/bro-takes-photos-q5j43pNFvzE-unsplash.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Global warming is the result of greenhouse gases, especially carbon dioxide (CO 2). Carbon capture and sequestration (CCS) is an important technology that aims to reduce CO 2 emissions. CCS has been controversial as it could create more room to pollute by removing CO 2 from the air. It is also more expensive than switching to renewable energy."
        },
        {
            "published_date": "2025-02-16T03:07:05",
            "title": "Bar-Tailed Godwit",
            "author": "Moushumi Mahanta",
            "url": "https://www.livemint.com/web-stories/5-birds-that-migrate-thousands-of-miles-every-year-11739533351480.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/02/14/600x338/pexels-dastan-3329858_1739534236729_1739534264945.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Native to the Southern Hemisphere, these birds migrate to the Northern Hemisphere. Their round-trip migration can cover an astonishing 27,000 miles and can last for up to 30 days at a time. The migration is very long and very difficult.    "
        },
        {
            "published_date": "2025-02-16T03:05:23",
            "title": "Radio mitigates climate change severity in Africa",
            "author": "John Masuku",
            "url": "https://www.thestandard.co.zw/standard-style/article/200038354/radio-mitigates-climate-change-severity-in-africa",
            "url_media": "https://cdn.thestandard.co.zw/images/thestandard/uploads/2025/02/hE5Qm88OVEeHNVBqTPizXE41MeBAfNPfx6W8q6lA.jpg",
            "country": "ZW",
            "language": "en",
            "summary": "On Thursday February 13, 2025 Africa joined the rest of world to celebrate the role that radio plays in the understanding, management and impact of climate change. African radio stations have unknowingly covered climate change for many decades dating back to Western colonial rule. The main focus among grassroots communities is weather reporting and environmental conservation. Radio can also help empower individuals to take immediate action and encourage communities to work together, thus increasing their adaptive capacity."
        },
        {
            "published_date": "2025-02-16T02:45:00",
            "title": "Trump's withdrawal from the Paris Agreement risks a global climate crisis",
            "author": "",
            "url": "https://www.greenleft.org.au/content/trumps-withdrawal-paris-agreement-risks-global-climate-crisis",
            "url_media": "https://www.greenleft.org.au/sites/default/files/p12_la_fires.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Donald Trump has withdrawn the US from the Paris Climate Agreement. The US is the second-largest emitter of greenhouse gases and the largest periodic contributor to total carbon dioxide emissions. Trump's administration has rolled back numerous environmental policies, reduced incentives to transition away from fossil fuels, slashed funding for developing nations coping with climate change, and expanded oil and gas drilling. Chris Wright, the new Secretary of Energy, stated his top priority is to boost domestic energy productions."
        },
        {
            "published_date": "2025-02-16T02:18:39",
            "title": "Indore Weather Updates: Temperature Rises Again As Effect Of Western Disturbance Wanes",
            "author": "Staff Reporter",
            "url": "https://www.freepressjournal.in/indore/indore-weather-updates-temperature-rises-again-as-effect-of-western-disturbance-wanes",
            "url_media": "https://media.assettype.com/freepressjournal/2025-02-16/74q0jkxq/Tarun-Weather.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The western disturbance over the Himalayas has waned, leading to a rise in temperature in Indore. On Saturday, the maximum temperature was recorded at 31.6 degrees Celsius, while the minimum temperature stood at 16 degrees Celsius. The humidity level was 30 per cent, and westerly winds blew at speeds of 10-27 km per hour. Another western disturbance is expected to become active over the mountains on February 17. This system will also impact the region."
        },
        {
            "published_date": "2025-02-16T01:53:28",
            "title": "Coldest February night on record in parts of Victoria with summer snow in the Alps",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-02-16/coldest-february-night-on-record-parts-of-victoria-snow-buller/104942512",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/2144b0eaf071949edb4428e9354649b9?impolicy=wcms_watermark_news&cropH=1152&cropW=2048&xPos=0&yPos=192&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Melbourne shivered through its coldest February night on record on Saturday. The temperature in the city dipped to 9.9 degrees Celsius, breaking the previous February record of 10C on February 15, 2017. At Mount Baw Baw, a 26-year-old record was broken when the overnight temperature plummeted to minus 1.4C. The Hunters Hill weather station, 90 kilometres east of Albury-Wodonga, also recorded itscoldest February morning on record, reaching 2C overnight Saturday. A cold front that moved into Victoria on Friday was dragging very cold air from the Southern Ocean over the state."
        },
        {
            "published_date": "2025-02-16T01:52:00",
            "title": "Threat of flooding persists in wake of powerful cyclone",
            "author": "Fraser Barton",
            "url": "https://www.newcastleherald.com.au/story/8893412/threat-of-flooding-persists-in-wake-of-powerful-cyclone",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c8c0a854-df6d-4518-903d-aa728dcd6696.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Tropical Cyclone Zelia brought heavy rain and damaging winds after crossing the coast near Port Hedland as a category four on Friday. River levels have begun to ease in the Pilbara region but the flood threat has not completely passed. A major flood peak was observed along the De Grey River at Coolenar Pool, east of Port Hedlands, early on Sunday morning. Major flooding was also recorded along the Nullagine River at Nullagine and Tumbinna Pool, and along the Coongan River at Marble Bar and Marble Bar Rd Crossing. Emergency crews in WA are assessing the damage, but the downgraded weather system is still dumping significant rain on parts of the Pil"
        },
        {
            "published_date": "2025-02-16T01:52:00",
            "title": "Threat of flooding persists in wake of powerful cyclone",
            "author": "Fraser Barton",
            "url": "https://www.bordermail.com.au/story/8893412/threat-of-flooding-persists-in-wake-of-powerful-cyclone",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c8c0a854-df6d-4518-903d-aa728dcd6696.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Flooding threats persist for regional communities in the wake of a powerful cyclone that tore through Western Australia's north, especially in the north-eastern part of the state, where the cyclone touched down.    - i.e. in the Northern Territory. "
        },
        {
            "published_date": "2025-02-16T01:52:00",
            "title": "Threat of flooding persists in wake of powerful cyclone",
            "author": "Fraser Barton",
            "url": "https://www.goulburnpost.com.au/story/8893412/threat-of-flooding-persists-in-wake-of-powerful-cyclone",
            "url_media": "https://www.goulburnpost.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c8c0a854-df6d-4518-903d-aa728dcd6696.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Tropical Cyclone Zelia brought heavy rain and damaging winds to Western Australia's north. No deaths or injuries were reported. River levels have begun to ease in the Pilbara region but the flood threat has not completely passed. A major flood peak was observed along the De Grey River at Coolenar Pool, east of Port Hedland, early on Sunday morning. Major flooding was also recorded along the Nullagine River at Nullagine and Tumbinna Pool, and along the Coongan River at Marble Bar Rd Crossing."
        },
        {
            "published_date": "2025-02-16T01:26:49",
            "title": "Pivoting change",
            "author": "Soha Nisar",
            "url": "https://www.thenews.com.pk/tns/detail/1283140-pivoting-change",
            "url_media": "https://www.thenews.com.pk/assets/uploads/tns/2025-02-16/1283140_062138_tns.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Donald Trump's decision to withdraw from the Paris Climate Agreement has sent shockwaves through international climate efforts. For Pakistan, the Paris Agreement symbolised more than a global pact; it was a lifeline. Pakistan bears a disproportionate share of climate impacts, from glacial melts to catastrophic floods. Pakistan's sprawling rural areas and growing urban populations represent vast opportunities to pioneer sustainable solutions. Investments in energy efficiency, smart grids and green infrastructure can transform Pakistan into a model of climate resilience for the Global South. Pakistan must pivot from waiting for global powers to act and chart its own path."
        },
        {
            "published_date": "2025-02-16T01:00:00",
            "title": "LETTER: Why has climate change all but disappeared from the public's attention?",
            "author": "Letter To The Editor",
            "url": "https://www.guelphtoday.com/letters-to-the-editor/letter-why-has-climate-change-all-but-disappeared-from-the-publics-attention-10219133",
            "url_media": "https://www.vmcdn.ca/f/files/shared/miscellaneous-stock-images/letterstotheeditor.jpeg;w=1200;h=800;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "Polls show that top issues for Ontarians are the cost of food and housing, and health care. Each of these worries is influenced negatively by climate change. WHO estimates climate-change driven health costs will rise globally to $3-5 billion by 2030. 2.5 million Ontarians have no family doctor, over 1,000 ERs closed in 2023, and by Sep '24 2,000 patients/day were waiting on stretchers in hospital hallways. MPPs are accountable to the public. They should take pressure off the health care system by slowing climate change and incentivizing the transition to cleaner energy."
        },
        {
            "published_date": "2025-02-16T00:50:27",
            "title": "Here's the Exact Date This Asteroid Could Make Impact in 2032",
            "author": "Matthew James",
            "url": "https://hudsonvalleypost.com/ixp/704/p/exact-date-asteroid-2032",
            "url_media": "https://townsquare.media/site/704/files/2025/02/attachment-I-O-U-11.jpg?w=1200&q=75&format=natural",
            "country": "US",
            "language": "en",
            "summary": "The chances of Asteroid 2024 YR4 smacking into Earth in 2032 are getting higher. NASA plans to use the James Webb Space Telescope in March 2025 to observe the asteroid. The asteroid is estimated to be between 130 and 300 feet wide and could release energy equivalent to 7.6 megatons of TNT."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Getting green investment where it's needed most",
            "author": "Oman Observer",
            "url": "https://article.wn.com/view/2025/02/16/Getting_green_investment_where_it_s_needed_most",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The effects of global warming are unfolding before our eyes. Uncontrollable fires ravage the Amazon and rising sea levels threaten to submerge Pacific islands. Droughts and floods are also ravaging the region. The world is seeing the effects of climate change."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Musk and Trump on the nose in Australia and politicians wise to steer clear of them",
            "author": "system",
            "url": "https://article.wn.com/view/2025/02/16/Musk_and_Trump_on_the_nose_in_Australia_and_politicians_wise",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New data shows Australians are looking for answers to their economic malaise and that the obsessions of super-rich Americans are not the same as their own.    - The Australian National Bureau of Economic Research.  - New data shows that Australians are making it clear they want answers. "
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Climate change  to boost non-agri water use: WB",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/02/16/Climate_change_to_boost_nonagri_water_use_WB",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The use of water for non-agricultural purposes in Pakistan is expected to rise significantly due to climate change. With a high-growth rate of 4.9% per year and a 3°C temperature increase by 2047, water demand is projected to grow by 60%."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Opinion: We need climate change outreach and a stop to fossil fuel industry misinformation",
            "author": "Citizen Times",
            "url": "https://article.wn.com/view/2025/02/16/Opinion_We_need_climate_change_outreach_and_a_stop_to_fossil",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Recent catastrophic weather events are not isolated incidents, they are part of an escalating, global phenomenon. Even for those who deny the threat of an unstable climate, it is impossible to ignore how unusual Tropical Storm Helene is. It's always easier to say 'This doesn't affect me' than to confront an uncomfortable truth."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Climate change to boost non-agri water use: World Bank",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/02/16/Climate_change_to_boost_nonagri_water_use_World_Bank",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The use of water for non-agricultural purposes in Pakistan is expected to rise significantly due to climate change. With a high-growth rate of 4.9% per year and a 3°C temperature increase by 2047, water demand is projected to grow by 60%."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "La Niña's waning impact on global warming",
            "author": "The Philadelphia Inquirer",
            "url": "https://article.wn.com/view/2025/02/16/La_Nina_s_waning_impact_on_global_warming",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "January 2025 was the hottest on record, reaching a whole 1.7 degrees Celsius above pre-industrial levels. If many climate change initiatives are taken, it will be even warmer in 2025.    i.e. more than 1.5 degrees Celsius. "
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Delhi records second-hottest day of season as mercury touches 28.6 deg C",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/02/16/Delhi_records_secondhottest_day_of_season_as_mercury_touches",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It was the second-hottest day of the season in Delhi on Saturday. The maximum temperature was 28.6 degrees Celsius. The hottest day was on February 11 when the maximum temperature reached 29.7 degrees Celsius in Delhi.      "
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Reader's View: Stop kicking climate change down the road",
            "author": "Duluth News Tribune",
            "url": "https://article.wn.com/view/2025/02/16/Readers_View_Stop_kicking_climate_change_down_the_road",
            "url_media": "https://article.wn.com/view/2025/02/16/[]",
            "country": "US",
            "language": "en",
            "summary": "Letters keep asking how atmospheric carbon dioxide, produced by man, cause global warming. Of every one million molecules in the atmosphere, 424 of them are carbon dioxide. There are thousands of underwater volcanoes, but that amount is minuscule compared to man-made carbon."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Trump Administration Halts Climate Initiatives Within Disaster Response Agency",
            "author": "The Arabian Post",
            "url": "https://article.wn.com/view/2025/02/16/Trump_Administration_Halts_Climate_Initiatives_Within_Disast",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration has ordered the Department of Homeland Security to terminate all climate-related activities, effectively removing climate considerations from the agency responsible for managing disaster responses across the United States. This directive, issued through an internal memo, was issued by the Department's Homeland Security."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Census reveals decline in Cook Islands Māori speakers in NZ",
            "author": "Cook Islands News",
            "url": "https://article.wn.com/view/2025/02/16/Census_reveals_decline_in_Cook_Islands_Maori_speakers_in_NZ",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The number of Cook Islands Māori speakers is declining, raising concerns about the language's future. There are calls for greater support for language revitalisation efforts. There is a growing Cook Islands population in New Zealand, but there are also fewer Māorid speakers."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Scientists Pinpoint ‘Tipping Point' for Greenland's Melting Ice Sheet",
            "author": "Gizmodo",
            "url": "https://article.wn.com/view/2025/02/16/scientists_pinpoint_8216tipping_point_8217_for_greenland_821",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The vast landmass is melting due to climate change and may rapidly cause the complete loss of the island's ice due to rapid climate change. The ice on the island is melting very rapidly due to the changing climate. The island's population is decreasing very fast. "
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Climate change and gender",
            "author": "Dr Sharmila Faruqi",
            "url": "https://www.thenews.com.pk/print/1283237-climate-change-and-gender",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-02-16/1283237_014606_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "When Pakistan was hit by record-breaking floods in 2022, a third of the country went underwater. Razia lost her home, her crops, her security and her family. She spent her nights awake, keeping watch over her daughters, fearing for their safety. Women make up 70% of the world's poor and produce 50-80% of world's food, but they own less than 20% of land. They are 14 times more likely to die in disasters than men, and they are vulnerable to trafficking, sexual violence, and forced marriage."
        },
        {
            "published_date": "2025-02-16T00:00:00",
            "title": "Are Robins A Sign Of Spring?",
            "author": "Katie Finch",
            "url": "https://www.post-journal.com/life/nature/2025/02/are-robins-a-sign-of-spring",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.post-journal.com/images/2025/02/14012132/Robins-1-368x500.jpg",
            "country": "US",
            "language": "en",
            "summary": "There have been many sightings of American Robins in February. Robins are omnivores and their diet changes with the season. They can be seen in any month of the year throughout most of the United States, but also in Canada and Alaska during the spring and summer breeding season and in Florida, Mexico, and Central America for the winter season."
        }
    ]
}