{
    "status": "ok",
    "total_articles": 148,
    "articles": [
        {
            "published_date": "2025-04-29T23:52:42",
            "title": "Trump administration dismisses 400 authors of National Climate Assessment",
            "author": "Class",
            "url": "https://www.columbian.com/news/2025/apr/29/trump-administration-dismisses-400-authors-of-national-climate-assessment",
            "url_media": "https://www.columbian.com/wp-content/themes/columbian2/static/img/og/default-2022.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed all 400 authors of the National Climate Assessment. The assessment's scope is being reevaluated. The report provides information to policymakers, the U.S. military, emergency responders, farmers, private companies and the federal government. It was published every four to five years since 2000."
        },
        {
            "published_date": "2025-04-29T23:22:25",
            "title": "UK is not ready for coming climate ‘disaster,' government advisers warn",
            "author": "Emily Beament",
            "url": "https://www.independent.co.uk/climate-change/uk-climate-change-disaster-environment-floods-b2741564.html",
            "url_media": "https://static.independent.co.uk/2025/03/31/00/0e04d456fad72bfa34894feda6be3128Y29udGVudHNlYXJjaGFwaSwxNzQzMjc2ODg1-2.78635381.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "The UK is unprepared for the escalating threats of climate change, the Climate Change Committee (CCC) has warned. It is accusing the government of inaction in the face of impending floods, heatwaves, droughts, and wildfires. The report underscores the economic repercussions of climate inaction, forecasting a 7 per cent blow to the UK's economic output by 2050."
        },
        {
            "published_date": "2025-04-29T23:06:37",
            "title": "Britain unprepared for worsening impact of climate change, advisers say",
            "author": "Susanna Twidale",
            "url": "https://www.reuters.com/sustainability/cop/britain-unprepared-worsening-impact-climate-change-advisers-say-2025-04-29",
            "url_media": "https://www.reuters.com/resizer/v2/AXRZV74VORMARPWN7R7FA3OVTI.jpg?auth=fd9feb10bbdc9eaeddf28abb3d4547684916e8560066ac3779054a256188c91b&height=1005&width=1920&quality=80&smart=true",
            "country": "GB",
            "language": "en",
            "summary": "Britain is unprepared for the worsening impacts of climate change, independent climate advisers say. Britain was hit by flooding last year and in recent years it has suffered heatwaves, droughts and wildfires. Climate change is pushing the planet's temperature to levels never before experienced by modern humans."
        },
        {
            "published_date": "2025-04-29T23:05:00",
            "title": "How to Bird-Watch: A Traveler's Guide",
            "author": "Hector Acuna",
            "url": "https://www.myheraldreview.com/news/lifestyle/how-to-bird-watch-a-traveler-s-guide/article_969024fd-e00b-4f87-aae3-7f83fe155e99.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/myheraldreview.com/content/tncms/assets/v3/editorial/f/7b/f7b1e5a7-ddac-400e-a057-637620be3564/68115b91d4fd6.image.jpg?crop=1439%2C756%2C0%2C576&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "According to the U.S. Fish and Wildlife Service, 96 million Americans are bird-watchers. 37% of the population aged 16 and above observe from home. 43 million have traveled 1 mile or more to go birding. Amy Tan is the author of the book 'The Backyard Bird Chronicles'."
        },
        {
            "published_date": "2025-04-29T23:03:35",
            "title": "'It's a huge loss': Trump administration dismisses scientists preparing climate report",
            "author": "Ian James",
            "url": "https://www.msn.com/en-us/news/politics/it-s-a-huge-loss-trump-administration-dismisses-scientists-preparing-climate-report/ar-AA1DSl7e",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed more than 400 scientists and other experts who had begun to write the latest National Climate Assessment report. The report details the latest science on climate change and reports on progress in addressing global warming. It is required every four years under a 1990 law. Scientists fear the Trump administration could shut down the effort or enlist other authors to write a different report that seeks to attack climate science."
        },
        {
            "published_date": "2025-04-29T23:03:35",
            "title": "'It's a huge loss': Trump administration dismisses scientists preparing climate report",
            "author": "Ian James",
            "url": "https://www.yahoo.com/news/huge-loss-trump-administration-dismisses-230335741.html",
            "url_media": "https://media.zenfs.com/en/la_times_articles_853/1dd2fd9506e0dfa94540f058f3bebadf",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed more than 400 scientists and other experts who had begun to write the latest National Climate Assessment report. The report details the latest science on climate change and reports on progress in addressing global warming. It is required by law, but there are no specific requirements about who should write the report or the form."
        },
        {
            "published_date": "2025-04-29T23:02:35",
            "title": "Britain Faces Urgent Challenge: Unprepared for Intensifying Climate Impacts",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3364286-britain-faces-urgent-challenge-unprepared-for-intensifying-climate-impacts",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/24_04_2025_16_34_28_6190426.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Britain is unprepared for the intensifying impacts of climate change. The number of homes at risk of flooding could rise to 8 million by 2050. Heat-related deaths could exceed 10,000 annually by the same year. Report urges the government to improve coordination across sectors like infrastructure and healthcare to mitigate these impacts effectively."
        },
        {
            "published_date": "2025-04-29T23:00:00",
            "title": "6.3 million homes and properties in UK currently 'at serious risk' of flooding",
            "author": "Matthew Evans",
            "url": "https://uk.news.yahoo.com/6-3-million-homes-properties-230000170.html",
            "url_media": "https://media.zenfs.com/en/lancashire_telegraph_157/bab3be165400f6e77eb380850400b108",
            "country": "US",
            "language": "en",
            "summary": "6.3 million homes and properties in the UK are currently at risk of flooding. This is set to rise to 8 million by 2050. Early deaths from heatwaves are projected to rise from the 3,000 seen in 2022's record hot summer to 10,000 a year by mid-century. Half the UK's prime agricultural farmland is at risk from flooding. Schools, hospitals and care homes are among the most vulnerable to impacts such as heatwaves."
        },
        {
            "published_date": "2025-04-29T22:47:24",
            "title": "Millions of birds are flying over Tennessee this week. Here's why",
            "author": "Alex Libby",
            "url": "https://www.yahoo.com/news/millions-birds-flying-over-tennessee-224724636.html",
            "url_media": "https://media.zenfs.com/en/wkrn_articles_723/7182784a94e39655aaf62e877a1adea8",
            "country": "US",
            "language": "en",
            "summary": "The current weather conditions are causing the number of birds flying north to explode in Tennessee. More than 1.5 million birds flew over Davidson County alone Monday night. The best place to look for birds in Nashville is at Shelby Bottoms Nature Center or Warner Parks Nature Center. Experts are banding birds at Warner Parks from 8 a.m. to noon on Saturday, May 3."
        },
        {
            "published_date": "2025-04-29T22:30:33",
            "title": "Hedging our bets: the existential questions facing Australia's next government in unpredictable times",
            "author": "Ben Doherty",
            "url": "https://www.theguardian.com/australia-news/2025/apr/30/australia-election-2025-national-security-existential-questions-facing-next-government-labor-coalition",
            "url_media": "https://i.guim.co.uk/img/media/0268cc159204f46a47d86d6574108a5c38b7d710/9_0_3534_2121/master/3534.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3dee8b3e67705521a1f49ae36542ddb5",
            "country": "GB",
            "language": "en",
            "summary": "The world is a more dangerous place. Global conflicts have doubled over the past five years. In 2024 alone, one person in eight was exposed to conflict. Australia is caught between two global giants: its 'great and powerful friend' and security benefactor, the US, and an assertive military power that is also its largest trading partner, China. Donald Trump's unpredictability makes it hard to be an US ally right now."
        },
        {
            "published_date": "2025-04-29T22:24:45",
            "title": "Horn of Africa to be wetter than usual from May to July, says ICPAC",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250429/775a80facaa74f65886c224a854a8c92/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Most parts of the Horn of Africa are expected to be wetter than usual between May and July 2025. Only a few areas, including northern Ethiopia, western South Sudan, and northeastern Tanzania, will experience drier-than-usual conditions. The corresponding seasonal temperatures are likely to be warmer than usual."
        },
        {
            "published_date": "2025-04-29T22:20:24",
            "title": "As global players focus on the Arctic, US icebreakers are scarce",
            "author": "Kent E. Calder",
            "url": "https://asiatimes.com/2025/04/as-global-players-focus-on-the-arctic-us-icebreakers-are-scarce",
            "url_media": "https://asiatimes.com/wp-content/uploads/2025/04/Picture1-e1745940675976.png",
            "country": "HK",
            "language": "en",
            "summary": "The Arctic is warming four times faster than the rest of the planet due to climate change. The waters of the Arctic Sea, which stretch from Russia's northern Siberian shores across Alaska to Greenland, are opening at an unprecedented pace. The region harbors roughly a quarter of the unexplored oil and natural gas reserves on earth and 150 rare earth deposits worth around $1 trillion. The Arctic Ocean is an area of unusual importance and a natural zone of conflict due to its geographic value. It is across the North Pole that the United States and Russia lie in closest proximity, making the Arctic seas an arena of rivalry in the nuclear age."
        },
        {
            "published_date": "2025-04-29T21:51:56",
            "title": "Trump boots climate scientists from climate science report",
            "author": "Umair Irfan",
            "url": "https://www.vox.com/the-logoff-newsletter-trump/411048/trump-national-climate-assessment-scientists",
            "url_media": "https://platform.vox.com/wp-content/uploads/sites/2/2025/04/gettyimages-2211796667.jpg?quality=90&strip=all&crop=0%2C10.752607989199%2C100%2C78.494784021602&w=1200",
            "country": "US",
            "language": "en",
            "summary": "Trump administration dismissed hundreds of scientists this week who were working on a major report on climate change. The National Climate Assessment is a federal compendium of climate science focused on how climate change is affecting the US. The report is mandated by Congress and only another act of Congress could legally undo it. Environmental groups can sue to force the report's assembly and publication."
        },
        {
            "published_date": "2025-04-29T21:51:05",
            "title": "Snow recedes, raising water worries",
            "author": "DHNS",
            "url": "https://www.deccanherald.com/opinion/editorial/snow-recedes-raising-water-worries-3517005",
            "url_media": "https://images.deccanherald.com/deccanherald%2F2025-04-29%2F7gyqrxma%2FiStock-485966046.jpg?rect=0%2C24%2C1262%2C663&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "The Hindu Kush region is ecologically sensitive and is among the first to be seriously impacted by climate change. It is also among the most vulnerable to environmental damage from climate change, according to the UNFCCC. The region needs special attention because of its ecological sensitivity."
        },
        {
            "published_date": "2025-04-29T21:38:53",
            "title": "Call for climate-resilient Islamabad",
            "author": "Our Correspondent",
            "url": "https://tribune.com.pk/story/2543078/call-for-climate-resilient-islamabad",
            "url_media": "https://i.tribune.com.pk/media/images/islamabad-wires1/islamabad-wires1.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Climate experts, meteorologists, and policy specialists have called for an urgent overhaul of Islamabad's urban planning. Participants raised concerns over the capital's increasing exposure to climate shocks, the urban heat island effect, and rapid degradation of green spaces due to unregulated urban sprawl. Dr Shafqat Munir stressed the importance of more accessible and effective communication regarding extreme weather events."
        },
        {
            "published_date": "2025-04-29T21:17:38",
            "title": "Federal job losses hit home in Alaska. How hard? We don't know yet.",
            "author": "Alaska Public Media",
            "url": "https://alaskapublic.org/news/2025-04-29/federal-job-losses-hit-home-in-alaska-how-hard-we-dont-know-yet",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/9e77484/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F34%2F94%2Ff888962b424c9be19f7bd828c40a%2Fdanruthrauff-202504-ruskin.jpg",
            "country": "US",
            "language": "en",
            "summary": "Dan Ruthrauff is a former employee of the U.S. Geological Survey's Alaska Science Center. About 10 of his colleagues quit in mid-April, out of 62 people who worked in his ecosystems unit. About 15,000 Alaskans worked for the federal government when Trump took office this year."
        },
        {
            "published_date": "2025-04-29T21:01:11",
            "title": "Okaloosa County to host second public meeting on flood vulnerability assessment",
            "author": "",
            "url": "https://www.nwfdailynews.com/story/news/local/2025/04/29/okaloosa-county-flood-risk-meeting-set-for-april-30-in-crestview/83334089007",
            "url_media": "https://www.gannett-cdn.com/presto/2020/09/16/NNWF/00b61468-f3a0-47ab-b65a-5e4f8b9694c4-IMG_26141.jpg?auto=webp&crop=1173,660,x0,y89&format=pjpg&width=1200",
            "country": "US",
            "language": "en",
            "summary": "Okaloosa County will host the second public meeting for its Vulnerability Assessment Project on April 30 from 5:30 to 7 p.m. at Warriors Hall, 201 Stillwell Blvd. in Crestview. The meeting is open to all residents interested in learning about future flood mitigation efforts and the potential impacts of flood events on the community."
        },
        {
            "published_date": "2025-04-29T21:00:00",
            "title": "Climate Anxiety? Or Just Another Political Map Masquerading as Science?",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/04/29/climate-anxiety-or-just-another-political-map-masquerading-as-science",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/04/Axios-anxiety1.webp?fit=711%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Axios created a map showing where Americans are most concerned about climate change. The most 'anxious' areas align with Democrat strongholds. There is no established medical consensus that climate change is causing widespread mental illness in the U.S., but young people are bombarded with terms like 'eco-grief,' 'climate trauma,' and 'solastalgia' because of fear of climate change, according to the American Psychological Association."
        },
        {
            "published_date": "2025-04-29T20:57:40",
            "title": "Authors of National Climate Assessment dismissed by Trump administration",
            "author": "Ross O'Keefe",
            "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3395484/national-climate-assessment-trump-administration-cuts",
            "url_media": "https://www.washingtonexaminer.com/wp-content/uploads/2025/02/AP24267806507693-scaled.webp",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration fired all scientists working on the National Climate Assessment. The report informs state and local governments on how to prepare for natural disasters and other weather events. The next one was due in 2028. The administration has proposed steep cuts to the National Oceanic and Atmospheric Administration and has cut several environmental regulations."
        },
        {
            "published_date": "2025-04-29T20:52:45",
            "title": "African climate experts seek stronger strategies for continental resilience",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250429/d98ad1d556b548e0af8da9817588c75a/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "African climate and disaster risk experts gathered in Kigali, the capital of Rwanda, to explore innovative approaches and develop stronger strategies for building climate resilience across the continent. The 15th session of the African Risk Capacity Conference of the Parties (COP) brought together delegates from African Union members to discuss disaster preparedness and response strategies."
        },
        {
            "published_date": "2025-04-29T20:47:13",
            "title": "UK has hottest day of the year and could reach 30C at earliest point on record",
            "author": "PA News Agency",
            "url": "https://www.borehamwoodtimes.co.uk/news/national/25125996.uk-hottest-day-year-reach-30c-earliest-point-record",
            "url_media": "https://www.borehamwoodtimes.co.uk/resources/images/19391540.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "Tuesday was the hottest day of the year so far in the UK. Temperatures could hit 30C at the earliest point on record, which would be the hottest on record for this time of year in the country. It's expected to get up to 30C tomorrow."
        },
        {
            "published_date": "2025-04-29T20:31:15",
            "title": "Explore four ways climate change may affect Florida in 2025",
            "author": "With Ai Summarization",
            "url": "https://www.miamiherald.com/news/local/article305335886.html",
            "url_media": "https://www.miamiherald.com/latest-news/dalyr9/picture299066665/alternates/LANDSCAPE_1140/IMG_IMG_Chang_Gang_MJO_1_5_1_I9P2S3QU_L839021837.JPG",
            "country": "US",
            "language": "en",
            "summary": "South Florida faces growing challenges from climate change. Miami is expected to see two feet of sea level rise by 2060 and as many as 23,000 people at risk for coastal flooding by 2050. Extreme weather like hurricanes and torrential rain is already damaging homes and raising costs for farmers. Cities are using updated flood predictions to plan for new developments. Building resilience and reducing emissions will be key steps moving forward."
        },
        {
            "published_date": "2025-04-29T20:00:00",
            "title": "Cut the green tape: Farmers",
            "author": "Contributed",
            "url": "https://www.sheppnews.com.au/news/cut-the-green-tape-farmers",
            "url_media": "https://imengine.public.prod.mmg.navigacloud.com?uuid=acb349c0-a0fe-5085-86c4-2a11c1864027&function=original&type=preview",
            "country": "AU",
            "language": "en",
            "summary": "Farmers are calling for an urgent overhaul of the nation's environmental policies that are hurting both farmers and the landscape. They want the federal politicians to commit to an urgent change in the current policies.      Â   .   , "
        },
        {
            "published_date": "2025-04-29T19:33:10",
            "title": "Julie Moore & Kerrick Johnson: Unfunded Laws Have Only Theoretical Benefits",
            "author": "Caledonian Record",
            "url": "https://article.wn.com/view/2025/04/29/Julie_Moore_Kerrick_Johnson_Unfunded_Laws_Have_Only_Theoreti",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Vermont's Global Warming Solutions Act (GWSA) and Climate Superfund Act (Act 122) have been signed into law by President Obama.    .   vermont has two climate laws.  vm.wsa and act 122 have passed."
        },
        {
            "published_date": "2025-04-29T19:09:04",
            "title": "Saint John River water levels on the rise after heavy weekend rain",
            "author": "Avery MacRae",
            "url": "https://www.ctvnews.ca/atlantic/new-brunswick/article/saint-john-river-water-levels-on-the-rise-after-heavy-weekend-rain",
            "url_media": "https://www.ctvnews.ca/resizer/v2/SG25DM2EVZDCJMYIQRO6342YQU.jpeg?smart=true&auth=9b23315ec138279c39ed55a4515102dbe7ec0456592c1d587b9a64b28a21a8ad&width=1200&height=630",
            "country": "CA",
            "language": "en",
            "summary": "The rising water levels have forced the closure of some walking trails in Fredericton because of the rising water level. The walking trails are closed due to the rising waters levels in the area. The water levels are rising due to higher than normal levels of water. "
        },
        {
            "published_date": "2025-04-29T19:02:10",
            "title": "Drone Footage Shows Dramatic Erosion Threatening to Topple Beach Homes Over Cliff",
            "author": "Miguel A. Melendez",
            "url": "https://www.mensjournal.com/news/drone-footage-erosion-threatening-homes-famed-beach-town",
            "url_media": "https://www.mensjournal.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjE0NTUxMjg2NzM1OTcxMzUx/scenic-view-of-lake-against-sky-during-sunsetbenton-harbormichiganunited-statesusa.jpg",
            "country": "US",
            "language": "en",
            "summary": "Some homes with views of Lake Michigan in Benton Harbor are in danger of falling off the cliff due to climate change. The Michigan Department of Environment, Great Lakes, and Energy designated sections of the shoreline as \"high risk erosion areas\" due to high water levels, powerful storms, seasonal ice damage and human activity."
        },
        {
            "published_date": "2025-04-29T19:02:08",
            "title": "Climate change increases the risk of simultaneous wildfires",
            "author": "Science Daily",
            "url": "https://article.wn.com/view/2025/04/29/Climate_change_increases_the_risk_of_simultaneous_wildfires",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change is increasing the risk of wildfires in many regions of the world. This is due partly to specific weather conditions, known as fire weather, that can be caused by climate change.    .      in this case, the weather conditions can be due to specific fire weather. "
        },
        {
            "published_date": "2025-04-29T19:02:00",
            "title": "Trump admin fires climate researchers working on 2028 report",
            "author": "Hannah Nightingale",
            "url": "https://thepostmillennial.com/trump-admin-fires-climate-researchers-working-on-2028-report",
            "url_media": "https://mr.cdn.ignitecdn.com/client_assets/thepostmillennial_com/media/picture/67f6/e424/6270/1ae0/80c8/3d25/original_IMG_2698.jpeg?1744233510",
            "country": "CA",
            "language": "en",
            "summary": "Hundreds of scientists and experts who were working on the government's report on how global warming is affecting the country have been dismissed by the Trump administration. The report was supposed to be released in early 2028. The federal government has published a report every few years since 2000 outlining how climate change would affect the country."
        },
        {
            "published_date": "2025-04-29T18:54:07",
            "title": "How to conserve species in a much hotter world",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/04/29/How_to_conserve_species_in_a_much_hotter_world",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "By 2075, the planet will be 3-5°C (5-9°F) hotter than the preindustrial average. Mongabay asks how humanity can help nature improve its climate resilience in the years to come. In 50 years, climate change will be the biggest threat to many species in the world."
        },
        {
            "published_date": "2025-04-29T18:23:00",
            "title": "Taiwan sees 3rd coldest spring since 2011",
            "author": "",
            "url": "https://www.taiwannews.com.tw/en/news/6097547",
            "url_media": "https://image.taiwannews.com.tw/2025%2F03%2F29%2F5573ea08c2084c8485d888709daf9e37.jpg",
            "country": "TW",
            "language": "en",
            "summary": "Taiwan has seen the third coldest spring since 2011, with an average temperature of 20.4 degrees C. The February-April period was affected by cold air masses from the north and convection from the South China Sea to the waters east of the Philippines. Taipei recorded 30 days with temperatures below 14 C this spring, the third most in the past 20 years."
        },
        {
            "published_date": "2025-04-29T18:15:29",
            "title": "NiMet Stresses Need To Integrate Meteorological Data Into Urban Transformation",
            "author": "Omowumi Samuel",
            "url": "https://von.gov.ng/nimet-stresses-need-to-integrate-meteorological-data-into-urban-transformation",
            "url_media": "https://von.gov.ng/wp-content/uploads/2025/04/IMG-20250429-WA0008-1.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Prof. Charles Anosike is the Director General and Chief Executive Officer of the Nigerian Meteorological Agency. He was speaking at the Abuja City Environmental Sustainability Summit organized by the Special Assistant to the President on Climate Change Matters, Comrade Yussuf Olatunji Kelani. The theme of the event is 'Sustainable Urban Transformation: Building a Resilient and Green Abuja'."
        },
        {
            "published_date": "2025-04-29T18:05:06",
            "title": "Trump administration dismisses scientists working on National Climate Assessment",
            "author": "Rachel Frazin",
            "url": "https://www.yahoo.com/news/trump-administration-dismisses-scientists-working-180506705.html",
            "url_media": "https://media.zenfs.com/en/the_hill_articles_341/43bd930a2c8807ff80cf44d4f3707169",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed all of the scientists working on the sixth National Climate Assessment on Monday. The report details the way the changing climate impacts the U.S. It is mandated by Congress under the Global Change Research Act of 1990. It comes as the administration has downplayed the impacts of climate change and has gone after programs related to the issue."
        },
        {
            "published_date": "2025-04-29T17:51:21",
            "title": "Warm spring, early summer and looming fire risk in the West",
            "author": "Sydney Jezik",
            "url": "https://www.yahoo.com/news/warm-spring-early-summer-looming-175121345.html",
            "url_media": "https://media.zenfs.com/en/deseret_news_992/378a1bbfa4f834a3726d9ef619d716c3",
            "country": "US",
            "language": "en",
            "summary": "The Climate Prediction Center predicts that temperatures will rise above seasonal averages in the United States, especially in the West. Wildfire risk will increase in Southern California, Arizona, New Mexico, Utah and Colorado. Human activity is the dominant driver of global warming. Pollution levels are highest in cities, including in Fresno, Bakersfield, Los Angeles, Phoenix, Arizona and Dallas."
        },
        {
            "published_date": "2025-04-29T17:51:09",
            "title": "US climate assessment in doubt as Trump dismisses authors",
            "author": "Laurel Leader-Call",
            "url": "https://article.wn.com/view/2025/04/29/US_climate_assessment_in_doubt_as_Trump_dismisses_authors_3",
            "url_media": "https://i.ytimg.com/vi/9627-SFTIg4/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Trump administration fired the authors of the United States' premier climate report. Scientists say the move threatens to derail the assessment vital to preparing for global warming.      Â   .   in the U.S. President Donald Trump's administration has fired the  "
        },
        {
            "published_date": "2025-04-29T17:38:39",
            "title": "100 Days of Conflicted Justice",
            "author": "Julia Conley",
            "url": "https://www.commondreams.org/newswire/100-days-of-conflicted-justice",
            "url_media": "https://www.commondreams.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjEwMDM4OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc0OTE0ODI1N30.nWE-dO3LpGCfrP6HKKrgMGYA-9xT8aazabGiQTfcsrM/image.png?width=210",
            "country": "US",
            "language": "en",
            "summary": "All current assessment participants from the 6th National Climate Assessment on the coasts chapter have been dismissed from their roles, according to the Union of Concerned Scientists. The assessment has been released every few years since 2000 and gives a rundown of how global warming is impacting different sectors of the economy, ecosystems and communities."
        },
        {
            "published_date": "2025-04-29T17:33:21",
            "title": "Drought, conflict, migration: Kurdistan's new challenge",
            "author": "Jan Ilhan Kizilhan",
            "url": "https://www.rudaw.net/english/kurdistan/290420252",
            "url_media": "https://www.rudaw.net/s3/rudaw.net/ContentFiles/867331Image1.jpg?mode=crop&quality=70&rand=1&scale=both&w=752&h=472&version=7611843",
            "country": "IQ",
            "language": "en",
            "summary": "There is a significant increase in average temperatures in Kurdistan due to climate change. There is a 40 percent decline in water availability in the Tigris and Euphrates rivers in recent decades due to dam construction and climate change itself. The integration of internal migrants significantly burdens education, healthcare, and housing sectors, increasing the risk of social tensions. Water scarcity and competition over dwindling resources can intensify existing ethnic and political tensions."
        },
        {
            "published_date": "2025-04-29T17:31:01",
            "title": "NiMet DG Emphasises Need To Integrate Meteorological Data Into Urban Transformation",
            "author": "Daily Independent",
            "url": "https://www.latestnigeriannews.com/p/4290612/nimet-dg-emphasises-need-to-integrate-meteorological-data-into-urban-transformat.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Prof. Charles Anosike, the Director-General of the Nigerian Meteorological Agency (NiMet), has said it is imperative to integrate meteorological data into urban transformation to ensure adequate preparedness for climate disasters. This is because of the increasing challenges of climate change and growing populations."
        },
        {
            "published_date": "2025-04-29T17:25:09",
            "title": "Ice Age Humans Were Skilled Firebenders, Scientists Find",
            "author": "Futurism",
            "url": "https://article.wn.com/view/2025/04/29/Ice_Age_Humans_Were_Skilled_Firebenders_Scientists_Find",
            "url_media": "https://i.ytimg.com/vi/3jL4S4X97sQ/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hominids have been using fire for at least a million years. Human fire-wielding skills during the last great Ice Age became so advanced that they would have made Bobby Flay proud. There is little evidence from the height of the Ice Age. "
        },
        {
            "published_date": "2025-04-29T17:00:00",
            "title": "Why humanity's 'greatest ally against climate change' may be about to switch sides",
            "author": "Comment Editor",
            "url": "https://www.scotsman.com/news/opinion/columnists/why-humanitys-greatest-ally-against-climate-change-may-be-about-to-switch-sides-5102710",
            "url_media": "https://www.scotsman.com/jpim-static/image/2025/04/29/13/36/GettyImages-1532805819.jpeg?width=1200&auto=webp&quality=75&trim=117,234,189,233&crop=",
            "country": "GB",
            "language": "en",
            "summary": "Global warming is affecting the oceans as well as the land and the consequences for humanity could be just as profound. The average global ocean temperature on Sunday was 20.88 degrees Celsius. The Copernicus graph shows a sudden depature from the usual seasonal pattern in May 2023."
        },
        {
            "published_date": "2025-04-29T16:52:54",
            "title": "Homes feet from falling off eroding cliff along Lake Michigan",
            "author": "Jesse Ferrell",
            "url": "https://www.yahoo.com/news/homes-feet-falling-off-eroding-165254708.html",
            "url_media": "https://media.zenfs.com/en/accuweather_297/4831fdcd1aa34b8b01ea7016e8126def",
            "country": "US",
            "language": "en",
            "summary": "Parts of the Great Lakes coast have been losing a foot or more of shoreline each year for at least 15 years. Benton Harbor, Michigan is one of these areas. Nathan Voytovick of Nate's Dronography captured a video of the erosion encroaching on homes perched on steep cliffs."
        },
        {
            "published_date": "2025-04-29T16:51:00",
            "title": "Op-Ed: Cutting money for energy efficiency isn't just unwise, it's plain dangerous for vulnerable Arizonans",
            "author": "Dr. Brian Drummond AZ Mirror",
            "url": "https://www.myheraldreview.com/opinion/commentary/op-ed-cutting-money-for-energy-efficiency-isn-t-just-unwise-it-s-plain-dangerous/article_ecf3123c-3117-4efc-9527-58216be56c77.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/myheraldreview.com/content/tncms/assets/v3/editorial/6/34/63401a92-f2df-11ef-bd7c-d730382cf068/67bcbe324f52e.image.jpg?crop=611%2C321%2C0%2C198",
            "country": "US",
            "language": "en",
            "summary": "Extreme heat is the leading weather-related cause of death in the U.S. Children, outdoor workers, communities of color, and those with chronic conditions like asthma or heart disease are most at risk. Arizona's summers are getting longer and hotter, so keeping cool is a matter of survival."
        },
        {
            "published_date": "2025-04-29T16:50:48",
            "title": "Climate Crisis and Extreme Weather",
            "author": "",
            "url": "https://defence.pk/threads/climate-crisis-and-extreme-weather.782235",
            "url_media": "https://defence.pk/attachments/download-jpeg.1038237/",
            "country": "PK",
            "language": "en",
            "summary": "The Earth is getting hotter because of CO2 emissions. Global temperatures have climbed about 1.1°C since the 1800s. If we don't cut emissions fast, we could be looking at 2.7°C or more by the end of the century. Extreme weather events are getting worse because of climate change. Heatwaves are getting longer and more brutal. Hurricanes and tropical storms are getting fiercer. Wildfires are choking the air."
        },
        {
            "published_date": "2025-04-29T16:06:05",
            "title": "Trump dismisses contributors to key US report on climate crisis preparedness",
            "author": "Mark Oliver",
            "url": "https://www.theguardian.com/us-news/2025/apr/29/trump-fires-climate-report-contributors",
            "url_media": "https://i.guim.co.uk/img/media/d72f551fa2af329423280230e0baaf43305d48bd/0_135_4048_2429/master/4048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7ce3be5949f5dd9d676378a555cfb373",
            "country": "GB",
            "language": "en",
            "summary": "Donald Trump's administration dismissed all contributors to the US government's flagship study on how to prepare for climate change impacts. The National Climate Assessment (NCA) is due for publication in 2028. It is used by federal and local governments to understand the impacts of climate change."
        },
        {
            "published_date": "2025-04-29T15:44:59",
            "title": "Horn of Africa to be wetter than usual from May to July, says ICPAC",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/04/29/Horn_of_Africa_to_be_wetter_than_usual_from_May_to_July_says_v",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Most parts of the Horn of Africa are expected to be wetter than usual between May and July 2025. The corresponding seasonal temperatures are also forecast to be warmer than usual, according to IICPAC.      Â   i  "
        },
        {
            "published_date": "2025-04-29T15:38:31",
            "title": "NiMet DG/CEO Anosike Stresses The Need To Integrate Meteorological Data Into Urban Transformation",
            "author": "Daily Times",
            "url": "https://www.latestnigeriannews.com/p/4290348/nimet-dgceo-anosike-stresses-the-need-to-integrate-meteorological-data-into-urba.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Prof. Charles Anosike is the Director General and Chief Executive Officer of the Nigerian Meteorological Agency. He stressed the need to integrate meteorological data into urban transformation to ensure adequate preparedness for climate disasters. He was speaking at the Abuja City. "
        },
        {
            "published_date": "2025-04-29T15:32:31",
            "title": "NiMet DG Stresses Need To Integrate Meteorological Data Into Urban Transformation",
            "author": "Latestnigeriannews",
            "url": "https://www.latestnigeriannews.com/p/4290323/nimet-dg-stresses-need-to-integrate-meteorological-data-into-urban-transformatio.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Charles Anosike is the Director-General and Chief Executive Officer of the Nigerian Meteorological Agency. He stressed the need for meteorological data to be integrated into urban transformation to ensure adequate preparedness for climate disasters. He made this statement on Tuesday at the Abuja City."
        },
        {
            "published_date": "2025-04-29T15:25:48",
            "title": "This is what the warm weather is doing to your brain",
            "author": "Camilla Foster",
            "url": "https://www.independent.co.uk/bulletin/lifestyle/uk-heatwave-hot-weather-brain-health-b2741653.html",
            "url_media": "https://static.independent.co.uk/2022/07/18/11/iStock-1328691019.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Hot weather can negatively affect cognitive functions like memory, focus and decision-making. It can also increase irritability and aggression due to disrupted sleep and heightened stress responses. Warm weather can positively impact the brain by increasing sunlight exposure and boosting serotonin and vitamin D levels. People with neurological conditions like MS, epilepsy, and migraines are more vulnerable to heat-related cognitive and emotional changes."
        },
        {
            "published_date": "2025-04-29T15:11:57",
            "title": "Rights advocates claim erosion of global human rights exacerbated by Trump",
            "author": "Jurist",
            "url": "https://article.wn.com/view/2025/04/29/Rights_advocates_claim_erosion_of_global_human_rights_exacer",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Amnesty International released a report on Tuesday that highlighted a general decline in human rights around the globe since Donald Trump took office. It is due to a rise of authoritarianism and corporate greed emboldened by the Trump administration, according to Amnesty International.   "
        },
        {
            "published_date": "2025-04-29T14:35:35",
            "title": "Coastal communities seek solution to adverse climatic conditions",
            "author": "Pius Dukor",
            "url": "https://businessday.ng/news/article/coastal-communities-seek-solution-to-adverse-climatic-conditions",
            "url_media": "https://cdn.businessday.ng/wp-content/uploads/2025/04/Untitled-design-65-1-1.png",
            "country": "NG",
            "language": "en",
            "summary": "Environmentalists predict that coastal communities in the Niger Delta and other African communities will be submerged by 2030-2050 due to climate change. The issue was a major part of the discussion at a two-day 'Learning and Sharing Workshop on Impact of Climate Change As a Cause of Conflict in Coastal Communities' in Port Harcourt, the Rivers State capital. The workshop was organised by the Academic Associates Peace Works and the European Union."
        },
        {
            "published_date": "2025-04-29T14:32:53",
            "title": "Ice Age Humans Were Bona Fide Firebenders, Scientists Find",
            "author": "",
            "url": "https://futurism.com/ice-age-humans-fire-mastery",
            "url_media": "https://wordpress-assets.futurism.com/2025/04/ice-age-humans-fire-mastery.jpg",
            "country": "US",
            "language": "en",
            "summary": "Archaeologists have found three Ice Age fireplaces in modern-day Ukraine from the coldest portion of the last Ice Age, between 26,500 and 19,000 years ago. Remnants of bone and animal fats were found in the fireplaces, which suggests they were used for cooking."
        },
        {
            "published_date": "2025-04-29T14:32:53",
            "title": "Ice Age Humans Were Skilled Firebenders, Scientists Find",
            "author": "Noor Al-Sibai",
            "url": "https://www.yahoo.com/news/ice-age-humans-were-skilled-143253761.html",
            "url_media": "https://media.zenfs.com/en/futurism_981/dee92c937cab82874f69cc3fdb2b26ff",
            "country": "US",
            "language": "en",
            "summary": "Hominids have been using fire for at least a million years. Three Ice Age hearths from modern-day Ukraine were found to have been used by hunter-gatherers between 26,500 and 19,000 years ago. They burned up to 600 degrees Celsius, or more than 1,100 degrees Fahrenheit."
        },
        {
            "published_date": "2025-04-29T14:32:10",
            "title": "The impact of climate change on St. Paul Island: a community in crisis",
            "author": "The  Washington Post",
            "url": "https://iol.co.za/weekend-argus/news/2025-04-29-the-impact-of-climate-change-on-st-paul-island-a-community-in-crisis",
            "url_media": "https://iol-prod.appspot.com/image/316ab94ab02522f219d52d044a639e5df2b9ce4a/5486/jpeg",
            "country": "ZA",
            "language": "en",
            "summary": "St. Paul island in the Bering Sea has been ravaged by climate change. The island's economy and community has been affected by the change. Warming waters have wiped out populations of fish, birds and crabs and exposed coastlines to more winter storms. The number of city employees dropped from 43 to 18, the police force disbanded, and prices rose at the island's lone grocery store."
        },
        {
            "published_date": "2025-04-29T14:17:25",
            "title": "Imo stakeholders advocate inclusive policies to maximise climate opportunities",
            "author": "Anthony Ufoh",
            "url": "https://guardian.ng/news/imo-stakeholders-advocate-inclusive-policies-to-maximise-climate-opportunities",
            "url_media": "https://cdn.guardian.ng/wp-content/uploads/2020/10/Uzodinma.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Stakeholders in Imo State have called for inclusive and resilient climate action through the formulation of policies. The call was made at the public launch of a knowledge paper on 'Advancing Inclusive Climate Governance' organised by Space for Change in collaboration with the Ministry of Environment and Sanitation in the state. Governor Hope Uzodimma reiterated the commitment of his administration in tackling climate challenges. Speaker of the State House of Assembly, Hon. Chike Olemgbe, Commissioner for Niger Delta, Major Ejikeme Emenike and HRM Eze Emmanuel Okeke were also in attendance."
        },
        {
            "published_date": "2025-04-29T14:01:53",
            "title": "US climate assessment in doubt as Trump dismisses authors",
            "author": "Issam AHMED AFP",
            "url": "https://www.thepress.net/news/national/us-climate-assessment-in-doubt-as-trump-dismisses-authors/article_a1a2e4ca-5b65-5d53-b0f4-6537a0ea508a.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/thepress.net/content/tncms/assets/v3/editorial/9/fd/9fd01ab9-ad76-50e6-a841-64cbf4745054/681052ce45670.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump's administration fired the authors of the United States' premier climate report. The decision follows mass firings earlier this month at the US Global Change Research Program (USGCRP), the body overseeing the congressionally required report. It marks the latest flashpoint in Trump's efforts to reshape the federal government."
        },
        {
            "published_date": "2025-04-29T14:01:53",
            "title": "US climate assessment in doubt as Trump dismisses authors",
            "author": "Issam AHMED AFP",
            "url": "https://www.mtdemocrat.com/news/national/us-climate-assessment-in-doubt-as-trump-dismisses-authors/article_bf9bfa6f-54b8-527e-af0a-5364c96ba011.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/mtdemocrat.com/content/tncms/assets/v3/editorial/3/2c/32ccb57c-f833-5a6a-b208-a7192e762491/68105257719cc.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The authors of the Sixth National Climate Assessment have been fired by the Trump administration. The report's scope is being reevaluated and the authors are being released from their roles. Scientists say the move threatens to derail a key assessment vital to preparing for global warming. "
        },
        {
            "published_date": "2025-04-29T14:00:55",
            "title": "Presidential orders could affect Yolo County",
            "author": "Jim Smith",
            "url": "https://www.dailydemocrat.com/2025/04/29/presidential-orders-could-affect-yolo-county",
            "url_media": "https://www.dailydemocrat.com/wp-content/uploads/2018/08/WDD-Filler-Photo.png",
            "country": "US",
            "language": "en",
            "summary": "New orders from President Donald Trump could affect Yolo County's Climate Action Plan and the service delivery models for providing 'illegal immigrants' with social security or health care, as well as the 'service delivery models' for providing social security and health care for illegal immigrants."
        },
        {
            "published_date": "2025-04-29T13:53:00",
            "title": "Tide of trash: volunteers battle to save Lee County's beaches",
            "author": "Shea Helton",
            "url": "https://news.wgcu.org/human-interest/2025-04-29/tide-of-trash-volunteers-battle-to-save-lee-countys-beaches",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/2109e05/2147483647/strip/true/crop/424x223+0+30/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F0f%2F2a543edd409dbcaa4a47a485d5ff%2Flee-county-beach-cleanups-b.JPG",
            "country": "US",
            "language": "en",
            "summary": "In the past year alone, volunteers in Lee County have collected more than 50,000 pounds of trash from beaches, waterways, and mangroves. Organized events like the International Costal Cleanup and Monofilament Madness mobilized hundreds of residents, divers, and boaters to protect Southwest Florida's fragile costal ecosystems. Environmentalists warn that without stronger preventative measures and public awareness, the problem will continue to escalate."
        },
        {
            "published_date": "2025-04-29T13:17:25",
            "title": "Antarctic sea ice extent is 17% HIGHER today than in 1979 – Ice doesn't LIE, but climate scientists do",
            "author": "Tags",
            "url": "https://www.naturalnews.com/2025-04-29-antarctic-sea-ice-extent-is-17-higher-today-than-in-1979.html",
            "url_media": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/04/T2017-HRR-Climate-change-mass-hypnosis-hallucination.jpg",
            "country": "US",
            "language": "en",
            "summary": "Antarctic sea ice extent is 17% HIGHER today than in 1979. Tropical ocean temperatures have undergone a striking cooling trend over the past year. The cooling trend could suppress the upcoming Atlantic hurricane season, challenging assumptions about rising storm intensity due to global warming."
        },
        {
            "published_date": "2025-04-29T13:13:00",
            "title": "May 15 workshop to boost climate resilience, community action",
            "author": "",
            "url": "https://www.boothbayregister.com/article/may-15-workshop-boost-climate-resilience-community-action/257383",
            "url_media": "https://www.boothbayregister.com/sites/default/files/2025/04/field/image/UTF-8May%2015%20Flyer.jpg",
            "country": "US",
            "language": "en",
            "summary": "Boothbay Region Climate Action Team (BRCAT) is hosting a public climate workshop on May 15 at 6 p.m. at Barters Island Community Hall. The workshop is part of BRCAT's efforts to foster connections that help mitigate the impacts of climate change through locally tailored planning and actionable solutions."
        },
        {
            "published_date": "2025-04-29T13:03:45",
            "title": "Sugarcane farming fuels climate change in Busoga",
            "author": "",
            "url": "https://www.monitor.co.ug/uganda/news/national/sugarcane-farming-fuels-climate-change-in-busoga-5021686",
            "url_media": "https://www.monitor.co.ug/resource/blob/4917416/4526f5efc7c69dc5e403d53234011fdc/reg01pix-data.jpg",
            "country": "UG",
            "language": "en",
            "summary": "The rapid expansion of sugarcane farming in Busoga Sub-region is fuelling climate change, according to local leaders and scientists. Forests have been cleared to make way for the plantations. Busoga's forest cover now stands at 16 percent, down from the national average of 36 percent."
        },
        {
            "published_date": "2025-04-29T12:15:58",
            "title": "Scientist sounds alarm after disturbing photo from Arctic expedition resurfaces: 'Feels like they could just sink at any moment'",
            "author": "Mike Taylor",
            "url": "https://www.yahoo.com/news/scientist-sounds-alarm-disturbing-photo-121558211.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/9SxazeP0bYNERRWxTm0fUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/4f5dfa89434f47d48c408c3b64f10f5c",
            "country": "US",
            "language": "en",
            "summary": "A photo from 2019 shows sled dogs trudging through meltwater atop Greenland's ice sheet. It was taken by climate scientist Steffen Olsen of the Danish Meteorological Institute. The photo is symbolic of the changing climate and offers a glimpse of the future. The Greenland ice sheet is melting rapidly."
        },
        {
            "published_date": "2025-04-29T12:15:31",
            "title": "Scientists issue dire warning as iconic American city sinks into the sea: 'Human intervention has made it worse'",
            "author": "Timothy McGill",
            "url": "https://www.yahoo.com/news/scientists-issue-dire-warning-iconic-121531478.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/F7OAFAbPCIKejcgYi8VkHg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/the_cool_down_737/a9f2221df445661ee54ab50171bd62cf",
            "country": "US",
            "language": "en",
            "summary": "New Orleans is sinking at the rate of one to two inches per year. Rising sea levels on the planet are exacerbating the problem. The Intergovernmental Panel on Climate Change has projected sea levels to rise 1.4 to 2.8 feet by the end of this century. Tulane University received a grant to study how sea-level rise will impact more than 1800 military installations worldwide."
        },
        {
            "published_date": "2025-04-29T12:15:12",
            "title": "Worsening phenomenon threatens global economy by forcing closure of major ports: 'A lot of money will have to be invested'",
            "author": "Sara Traynor",
            "url": "https://www.yahoo.com/news/worsening-phenomenon-threatens-global-economy-121512744.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/687ksRVV1AyVCtTESJakqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/c4402f29a3a71487f9918014e40a084b",
            "country": "US",
            "language": "en",
            "summary": "Key South American trading ports are preparing for winter storm surges. Rising sea levels, caused by the planet's warming, have rendered the sea wall in San Antonio, Chile, nearly obsolete. Last year, trade was halted for 10 days after it was battered by huge waves. Extreme weather caused Ecuador's Manta to shut down for several days."
        },
        {
            "published_date": "2025-04-29T12:14:05",
            "title": "Keep safe in hot weather: First aid and health response charity St John Ambulance explains how you can stay safe in hot weather:",
            "author": "Hazel Thompson",
            "url": "https://www.thescarboroughnews.co.uk/health/keep-safe-in-hot-weather-first-aid-and-health-response-charity-st-john-ambulance-explains-how-you-can-stay-safe-in-hot-weather-5104991",
            "url_media": "https://www.thescarboroughnews.co.uk/webimg/b25lY21zOjVjZWFkYjVhLWE1ZjAtNGVmZi04YzlhLWNkNmE5MGUwMzZhNDo4ZjYzMTNiNS1mYWNhLTQ5NWQtYmVmNy05NjljMTE3OTRmZGY=.jpg?width=640&auto=webp&quality=75&crop=3:2,smart&trim=",
            "country": "GB",
            "language": "en",
            "summary": "Knowing how to spot the symptoms and treat common heat-related conditions such as heat exhaustion, sunburn and dehydration can prevent hospital visits and save lives. St John Ambulance's Head of Clinical Strategy and Policy, Lydia Scroggs, says it's important to be aware of the dangers of the sun."
        },
        {
            "published_date": "2025-04-29T12:00:57",
            "title": "World Bank approves support to Dominica for disaster resilience",
            "author": "Malaika",
            "url": "https://dominicanewsonline.com/news/homepage/homepage-carousel/world-bank-approves-support-to-dominica-for-disaster-resilience",
            "url_media": "https://dominicanewsonline.com/news/wp-content/uploads/2025/04/25-days-after-Hurricane-Maria-destroyed-Dominica-in-2017.-Photo-Credit-Zaimis-Olmos-e1745902874474.jpg",
            "country": "DO",
            "language": "en",
            "summary": "The World Bank's Board of Executive Directors has given its green light to new financial support for Dominica. The Development Policy Credit amounts to a total of US$ 24 million. Dominica's development has been adversely affected by a series of natural disasters and climate-related challenges. Public debt soared to 118.2 percent of GDP in 2020 and remains elevated at 103 percent in 2024. The government is implementing a new risk-based asset management system for public buildings aimed at enhancing disaster preparedness and informing investments in resilient infrastructure."
        },
        {
            "published_date": "2025-04-29T11:46:57",
            "title": "Opinion Climate change in the Asia-Pacific: Empty classrooms, stalled dreams, a generation falling behind",
            "author": "Derek Langford",
            "url": "https://indianexpress.com/article/opinion/columns/climate-change-asia-pacific-empty-classrooms-stalled-dreams-generation-falling-behind-9972707",
            "url_media": "https://images.indianexpress.com/2025/04/heatwave-in-india.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is transforming Cambodia's floating villages. Over the past decade, erratic rainfall, prolonged droughts, and rising temperatures have dwindled fish populations. This is both an economic and educational crisis for Cambodia, where 12 per cent of the GDP depends on fish exports. UNICEF's Children's Climate Risk Index estimates that over 1 billion children are at 'extremely high risk' from the impacts of climate change. In 2024, extreme weather disrupted the education of at least 242 million children. Education is a crucial part of the solution."
        },
        {
            "published_date": "2025-04-29T11:30:17",
            "title": "Trump Dismisses Climate Change Report's Authors",
            "author": "",
            "url": "https://www.newsmax.com/politics/activists-science-climate/2025/04/29/id/1208733",
            "url_media": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=4984cf78-df23-4c13-b7ba-86a09b2c798b&SiteName=Newsmax",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration disbanded the authors of the Sixth National Climate Assessment (NCA6) on Monday. The decision follows mass firings earlier this month at the U.S. Global Change Research Program (USGCRP), the federal body overseeing the report. It is the latest flashpoint in Trump's sweeping efforts to reshape the federal government, particularly in the realm of science."
        },
        {
            "published_date": "2025-04-29T11:20:47",
            "title": "Bird migration in the Ozarks reaches peak",
            "author": "Tom Schmidt",
            "url": "https://www.yahoo.com/news/bird-migration-ozarks-reaches-peak-112047850.html",
            "url_media": "https://media.zenfs.com/en/kolr_springfield_articles_251/02605f10edca6923a6e36cdb04af783e",
            "country": "US",
            "language": "en",
            "summary": "Missouri bird migration runs from April 28 to May 17. Over 41 million birds are estimated to have flown over Missouri on the night of April 28, and over 370 million nationwide. Some common bird species migrating through Missouri this spring are the Great Crested Flycatcher, Swainson's Thrush, Nashville Warbler, and Eastern Kingbird."
        },
        {
            "published_date": "2025-04-29T11:15:15",
            "title": "Rural America is hungry. Is Congress about to make that worse?",
            "author": "José Andrés",
            "url": "https://www.washingtonpost.com/opinions/2025/04/29/snap-cuts-rural-jose-andres",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BWQ3N6QSKCGQIWVH643TYCD6WI_size-normalized.jpg&w=1440",
            "country": "US",
            "language": "en",
            "summary": "José Andrés is a chef, restaurateur and founder of the nonprofit organization World Central Kitchen. Seven months ago, he helped deliver food and water to western North Carolina, where Hurricane Helene had caused devastating floods. He delivered RVs to area families earlier this month."
        },
        {
            "published_date": "2025-04-29T11:06:31",
            "title": "Global warming may stop summertime school sports in Japan from 2060s",
            "author": "Kyodo News",
            "url": "https://kyodonews.net/news/2025/04/16a9cd012aeb-global-warming-may-stop-summertime-school-sports-in-japan-from-2060s.html",
            "url_media": "https://img.kyodonews.net/english/public/images/posts/3560afe4a4e6ef806cb4eb329bed363f/cropped_image_l.jpg",
            "country": "JP",
            "language": "en",
            "summary": "In the most pessimistic global warming scenario, intense outdoor sporting activity would need to be avoided in July and August in most parts of Japan apart from the northern main island of Hokkaido. Extracurricular activities normally take place in the late afternoon in Japan, though the situation may differ during the summer vacation period."
        },
        {
            "published_date": "2025-04-29T11:05:40",
            "title": "Weather gone rogue: Western Disturbances disrupt India's climate and agricultural timetable",
            "author": "",
            "url": "https://www.theweek.in/news/india/2025/04/29/weather-gone-rogue-western-disturbances-disrupt-india-s-climate-monsoon-timing-and-agricultural-timetable.html",
            "url_media": "https://www.theweek.in/content/dam/week/week/news/india/images/2025/4/29/ani rain.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The heat stress of the last four months has adversely affected the Western Disturbances. Back-to-back WD have led to heavy rainfall spells across hill states, while keeping prolonged heat waves at bay in the northwestern plains. The heat directly impacts many crops, including mangoes, which need the heat in order to ripen. The changes brought about by climate change mean that the subtropical westerly jet has widened."
        },
        {
            "published_date": "2025-04-29T11:00:06",
            "title": "Pakistan may hit 120 degrees this week. It could be a global record.",
            "author": "Ben Noll",
            "url": "https://www.washingtonpost.com/weather/2025/04/29/pakistan-heat-temperature-record-south-asia",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NR6WV3DKF2S527FHW6BKSPPWVU_size-normalized.jpg&w=1440",
            "country": "US",
            "language": "en",
            "summary": "Temperatures in central and southern Pakistan rose to 118 degrees last weekend and are forecast to climb through Wednesday. Pakistan Meteorological Department predicted heat wave conditions from April 26 to 30 and advises the public to take precautionary measures. The global April temperature record is 122 degrees Fahrenheit."
        },
        {
            "published_date": "2025-04-29T10:50:28",
            "title": "'Climate Change Reconsidered' offers fresh perspective in the climate change debate",
            "author": "Tags",
            "url": "https://www.naturalnews.com/2025-04-29-fresh-perspective-in-the-climate-change-debate.html",
            "url_media": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/04/Climate-change-withered-tree-and-dry-earth-1.jpeg",
            "country": "US",
            "language": "en",
            "summary": "'Climate Change Reconsidered' offers fresh perspective in the climate change debate. The report challenges the IPCC's assertion that most warming since the mid-20th century is due to human greenhouse gas emissions. It also highlights issues with climate models, the role of plant life in carbon sequestration, and evidence of historical climate variability."
        },
        {
            "published_date": "2025-04-29T10:47:00",
            "title": "India's Changing Monsoon Patterns, Warmer Climate Threaten Bay of Bengal's Marine Life: Study",
            "author": "Srishti Choudhary",
            "url": "https://www.news18.com/india/indias-changing-monsoon-patterns-warmer-climate-threaten-bay-of-bengals-marine-life-study-ws-kl-9317006.html",
            "url_media": "https://images.news18.com/ibnlive/uploads/2025/04/new-2025-04-b872a402d32dd0ed368dbe0270f1709e-16x9.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Future projections show climate change-induced warmer surface waters, strong freshwater run-off and weaker winds could lead to sharp fall in marine productivity in Bay of Bengal. The Bay supplies nearly 8% of the world's fishery production. The study has long-term consequences for fisheries and coastal livelihoods."
        },
        {
            "published_date": "2025-04-29T10:40:57",
            "title": "Cyprus heating twice as fast as global average, future generations face water scarcity",
            "author": "Vassos Vassiliou",
            "url": "https://in-cyprus.philenews.com/local/cyprus-future-generations-face-severe-climate-changes-audit-office-report",
            "url_media": "https://in-cyprus.philenews.com/wp-content/uploads/2024/09/dam-drought.jpg",
            "country": "CY",
            "language": "en",
            "summary": "Cyprus is warming twice as fast as the global average. The average temperature has risen by 1.8°C in Nicosia and 2.9°C  in Limassol over the past century. Annual rainfall has decreased by 87mm (15.6mm) in the past 92 years. 91% of Cyprus is now classified as climatically critical or sensitive. Water resources were insufficient to meet demands in 2010, 2013-17, and 2020-22. The audit revealed excessive extraction in 14 of 22 Groundwater Systems."
        },
        {
            "published_date": "2025-04-29T10:31:00",
            "title": "New Research: Rethink Darwin Wildlife Conservation",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/new-research-rethink-darwin-wildlife-1451143",
            "url_media": "https://www.cdu.edu.au/files/styles/content_desktop_1x/public/2025-04/Far%20Eastern%20Curlew.jpg?itok=VcgGQ3sV",
            "country": "US",
            "language": "en",
            "summary": "Darwin volunteers have worked to protect migratory shorebirds for more than 50 years. The Federal Environment Protection Biodiversity Conservation Act 1999 protects 14 shorebird species. Two of them are considered critically endangered, four are endangered, and eight are vulnerable. Habitat degradation is the leading cause of population decline among these species. 65 per cent of the tidal flats favoured by shorebirds lost over the last 50 years due to rapid changes in land use."
        },
        {
            "published_date": "2025-04-29T10:10:30",
            "title": "NASA unveils the alarming impact of 60 years of climate change on our planet",
            "author": "Kirti",
            "url": "https://kalingatv.com/miscellany/nasa-unveils-the-alarming-impact-of-60-years-of-climate-change-on-our-planet",
            "url_media": "https://kalingatv.com/wp-content/uploads/2025/04/NASA-climate-change-report.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The planet Earth has drastically changed over the last few decades. The deforestation of the Amazon rainforest is a critical issue. The Arctic is witnessing record ice melts. Ocean acidification has risen by 30%. Plastic pollution has reached epidemic levels. Urban settlements that were once thought to be safe are now threatened by sea-level rise. Renewable energy sources such as wind and solar power are on the increase, and nations are uniting to cut carbon emissions."
        },
        {
            "published_date": "2025-04-29T10:08:00",
            "title": "Australia Climate Disclosures to Hit Agriculture: Report",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/australia-climate-disclosures-to-hit-1451115",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/newsdevelopments-image.jpg",
            "country": "US",
            "language": "en",
            "summary": "New climate-related financial disclosure (CRFD) regime commenced from January 1 this year. Direct reporting requirements are limited to large companies, including those in food and agri, as well as \"some very large agricultural operations\". The indirect reporting requirements cover emissions along the value chain which are not directly owned or controlled by the reporting company. Longer term, farmers can expect greater supply chain engagement on climate."
        },
        {
            "published_date": "2025-04-29T10:05:46",
            "title": "VIDEO: The political debate over migration heats up",
            "author": "Laura Tingle",
            "url": "https://www.abc.net.au/news/2025-04-29/the-political-debate-over-migration-heats-up/105231546",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/6b7a85a2df557a6a21d70121d5462c51?impolicy=wcms_watermark_news&cropH=576&cropW=1024&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Record migration numbers on top of a long brewing housing crisis have made the debate about how many people come to Australia a contentious one. Laura Tingle is political editor of The Daily Mail Australia's political magazine.       .   for the Daily Mail."
        },
        {
            "published_date": "2025-04-29T10:05:00",
            "title": "US dismisses all authors of National Climate Assessment, email says",
            "author": "",
            "url": "https://www.hawaiitribune-herald.com/2025/04/29/nation-world-news/us-dismisses-all-authors-of-national-climate-assessment-email-says",
            "url_media": "https://www.hawaiitribune-herald.com/wp-content/uploads/2025/04/web1_2025-04-28T205702Z_2_LYNXMPEL3R0ZQ_RTROPTP_4_USA-TRUMP.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed all contributors to the sixth National Climate Assessment, which informs federal and local governments on how to prepare for climate change impacts. The report is due for publication in 2028. The scope of the report is being evaluated in accordance with the Global Change Research Act of 1990. The last assessment was published in 2023."
        },
        {
            "published_date": "2025-04-29T09:56:09",
            "title": "'Verde Island Passage is under siege': Advocates at Our Ocean Conference Fossil Fuel Expansion as a Human Rights Crisis",
            "author": "Journal Online",
            "url": "https://journal.com.ph/verde-island-passage-is-under-siege-advocates-at-our-ocean-conference-fossil-fuel-expansion-as-a-human-rights-crisis",
            "url_media": "https://journal.com.ph/wp-content/uploads/2025/04/Verde-Island-Passage-is-under-siege-1200x800.jpg",
            "country": "PH",
            "language": "en",
            "summary": "The Center for Energy, Ecology, and Development (CEED) and international organizations are convening at the 10th Our Ocean Conference (OOC) in Busan, South Korea. CEED stressed the increasing threats facing the Verde Island Passage (VIP) and the broader Coral Triangle. The think-tank stressed that the expansion of gas and liquified natural gas (LNG) infrastructure in the VIP and other marine hotspots constitutes a violation of human rights."
        },
        {
            "published_date": "2025-04-29T09:54:46",
            "title": "⚡When Is Stop Food Waste Day 2025? Know Date, Aim and Significance of the Annual US Event",
            "author": "",
            "url": "https://www.latestly.com/quickly/lifestyle/festivals-events/when-is-stop-food-waste-day-2025-know-date-aim-and-significance-of-the-annual-us-event-6813466.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/04/34-Stop-Food-Waste-Day.jpg",
            "country": "IN",
            "language": "en",
            "summary": "8% of all greenhouse gas emissions each year are due to food loss and waste. Wasting food is a waste of the energy to grow, harvest, process, and cook. Food waste in landfills can cause methane emissions, which is a potent greenhouse gas."
        },
        {
            "published_date": "2025-04-29T09:52:03",
            "title": "Decoding Humid Heatwaves: Insights and Implications",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3363310-decoding-humid-heatwaves-insights-and-implications",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/29_04_2025_09_52_03_0222699.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A study by the University of Leeds and UK Centre for Ecology and Hydrology documents the connection between rainfall patterns, land conditions and the onset of humid heatwaves in tropical and subtropical regions. It stresses the need for advanced early warning systems and serious cuts in greenhouse gas emissions to safeguard at-risk populations."
        },
        {
            "published_date": "2025-04-29T09:36:30",
            "title": "Weather Woes Impact Castor Seed Production: A Grim Forecast for 2024-25",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3363284-weather-woes-impact-castor-seed-production-a-grim-forecast-for-2024-25",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/29_04_2025_09_36_29_7406067.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Production of castor seeds in India is set to decline by 21% in the 2024-25 crop year. Rising temperatures since February have affected crop yields in key districts of Gujarat and Rajasthan. Gujarat, the primary producing state, anticipates a production drop to 12.26 lakh tonnes, down from 15.74 lakh tonnes last year."
        },
        {
            "published_date": "2025-04-29T09:29:46",
            "title": "Trump Administration Fires Authors of Key U.S. Climate Report",
            "author": "Anna Hartz",
            "url": "https://www.msn.com/en-nz/news/other/trump-administration-fires-authors-of-key-u-s-climate-report/ar-AA1DPkOx",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration fired the authors of a long-standing U.S. climate report. The report has helped guide American climate policy for over 25 years. It is written every five years and brings together research on how climate change affects every part of the country. The next edition is due in 2027."
        },
        {
            "published_date": "2025-04-29T09:14:10",
            "title": "Trump Tells NASA to Stick to Space, NOAA to Stick to Weather, and Both to Drop the Alarmist Climate Modeling",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/trump-tells-nasa-to-stick-to-space",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F15e05a60-5817-40ef-9d3e-02f1ea1a4fae_1500x1000.heic",
            "country": "US",
            "language": "en",
            "summary": "Trump administration is cutting funding for climate research at NASA, NOAA and other federal agencies. Steve Goreham is a speaker, author, and columnist on energy, sustainability, climate change, and policy. There are more than 40 climate models operating across the world, with 13 of the leading models located in the US. The models are operated by National Aeronautics and Space Administration in New York City, the National Oceanic and Atmospheric Administration in Princeton, New Jersey, and the Department of Energy in Boulder, Colorado."
        },
        {
            "published_date": "2025-04-29T09:10:38",
            "title": "The Cause Of The Mysterious Milky Stream",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/04/29/The_Cause_Of_The_Mysterious_Milky_Stream",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "The stream at Guthrie Park, Havelock North, has turned the colour of milk. It's not the first time the stream has turned this colour.    for a regular user of the park, she has seen it happen before. She's seen it before. "
        },
        {
            "published_date": "2025-04-29T09:01:56",
            "title": "'People are going to get hurt': What proposed DOGE cuts could mean for NOAA's weather buoys",
            "author": "Gareth McGrath",
            "url": "https://www.yahoo.com/news/people-going-hurt-proposed-doge-090156818.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/9qVYgmfj0A0Szbz59FceqQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/star-news/c51306b699da08fb758d6ff597c0fa7c",
            "country": "US",
            "language": "en",
            "summary": "President Trump proposed $1.6 billion in budget cuts to NOAA. The Coastal Ocean Research and Monitoring Program run out of the University of North Carolina Wilmington is one of the programs facing potential shutdown. The program operates 18 buoys that provide real-time observations of marine weather and oceanographic conditions along the coasts of North and South Carolina and Florida's east coast."
        },
        {
            "published_date": "2025-04-29T08:55:17",
            "title": "DOCUMENTARY: Coastal greenbelts are lifelines to Philippine communities",
            "author": "Jee Geronimo",
            "url": "https://www.rappler.com/environment/documentary-coastal-greenbelts-lifelines-communities-philippines",
            "url_media": "https://www.rappler.com/tachyon/2025/04/documentary-coastal-greenbelts-scaled.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Coastal greenbelts are strips of natural or artificially created coastal vegetation designed to prevent coastal erosion and mitigate the impacts of disasters and climate change. Rappler goes to Balanga, Bataan, where their award-winning urban wetland takes precedence over development."
        },
        {
            "published_date": "2025-04-29T08:50:29",
            "title": "Heavy rains a threat to summer crops",
            "author": "e NCA",
            "url": "https://www.enca.com/videos/discussion-heavy-rains-threat-summer-crops",
            "url_media": "https://www.enca.com/sites/default/files/styles/large/public/2024-11/Agriculture%20tractor.PNG.webp?itok=r3NNWfxt",
            "country": "ZA",
            "language": "en",
            "summary": "Saturated fields make it difficult to plant or harvest summer crops. Farmers are worried about lower yields and financial losses. Even more rain is expected in the near-future, which poses a serious threat to the summer crops in South Africa's fields.   "
        },
        {
            "published_date": "2025-04-29T08:33:06",
            "title": "‘Youthquake': Could climate-conscious kids sway Australia's election?",
            "author": "",
            "url": "https://dnyuz.com/2025/04/29/youthquake-could-climate-conscious-kids-sway-australias-election",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/04/1745915583_‘Youthquake-Could-climate-conscious-kids-sway-Australias-election.jpg",
            "country": "US",
            "language": "en",
            "summary": "Gen Z and Millennials are going to make up almost 50% of voters this election, outnumbering baby boomers for the first time. This demographic shift has been described as a 'youthquake' by Natasha Abhayawickrama, a 20-year-old campaigner for the Australian Youth Climate Coalition. Over three-quarters of young Australians aged 16-25 are concerned about climate change, with 67% saying it's negatively impacting their mental health."
        },
        {
            "published_date": "2025-04-29T08:23:29",
            "title": "Tony Blair says Net Zero push has become 'irrational' and 'hysterical' and warns critics of green energy costs must not be dismissed as 'climate deniers'",
            "author": "DAVID WILCOCK",
            "url": "https://www.dailymail.co.uk/news/article-14658727/Tony-Blair-Net-Zero-push-irrational-hysterical-climate-deniers.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/04/29/09/97813075-0-image-m-29_1745914998559.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Tony Blair says the current climate change debate is irrational and needs a pragmatic reset to win over voters. He criticises the UN climate summits as 'a forum that frankly doesn't have the heft to drive action and impact' He questions the Net Zero move to phase out fossil fuels."
        },
        {
            "published_date": "2025-04-29T08:23:29",
            "title": "Tony Blair says Net Zero push has become 'irrational' and 'hysterical'",
            "author": "David Wilcock",
            "url": "https://www.msn.com/en-us/weather/topstories/tony-blair-says-net-zero-push-has-become-irrational-and-hysterical/ar-AA1DP9OE",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Tony Blair says the current climate change debate is irrational and needs a pragmatic reset to win over voters. He criticises the UN climate summits as 'a forum that frankly doesn't have the heft to drive action and impact' He questions the Net Zero move to phase out fossil fuels."
        },
        {
            "published_date": "2025-04-29T08:19:20",
            "title": "Could climate-conscious kids sway Australia's election?   – DW – 04/29/2025",
            "author": "Stuart Braun",
            "url": "https://www.dw.com/en/youthquake-could-climate-conscious-kids-sway-australias-election/a-72374409",
            "url_media": "https://static.dw.com/image/61823465_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Gen Z and Millennials are going to make up almost 50% of voters this election, outnumbering baby boomers for the first time. They are angry about climate change inaction. They want to see a quicker transition to renewable energy and a \"crackdown\" on emissions and waste from big corporations. The incumbent center-left Labour government promotes clean energy, but it has come under fire for approving new coal and gas projects since it came to power."
        },
        {
            "published_date": "2025-04-29T08:02:42",
            "title": "Coastal Farmers in Bangladesh Combat Soil Salinity",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3363177-coastal-farmers-in-bangladesh-combat-soil-salinity",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/15_03_2019_08_13_36_6645867.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "There is an increase in soil salinity along the coast of Bangladesh. The intrusion of saltwater, climate change, storms, and shrimp farming has left many farms unviable outside the rainy months. Government and NGOs are helping farmers like Rita Bashar to improve their livelihoods."
        },
        {
            "published_date": "2025-04-29T07:47:00",
            "title": "NASA reveals how 60 years of climate change have transformed Earth from vibrant blue to a troubled world",
            "author": "TOI Science Desk",
            "url": "https://timesofindia.indiatimes.com/science/nasa-reveals-how-60-years-of-climate-change-have-transformed-earth-from-vibrant-blue-to-a-troubled-world/articleshow/120715835.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120716084,width-1070,height-580,imgsize-67520,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In 1972, Apollo 17 astronauts took a photo of Earth from the South Pole to all continents. It was a pioneering picture that united people and filled them with respect for the world. Over the last decades, the complexion of the planet has changed radically. Melting oceans, felled trees, and blanket pollution have altered the hue of the world from above. Deforestation and the Amazon's struggle for survival are the main causes of climate change."
        },
        {
            "published_date": "2025-04-29T07:36:46",
            "title": "Autumn scenery in New Zealand",
            "author": "新华网",
            "url": "https://english.news.cn/20250429/729cf40c58c34a39b5c5b6cdec903247/c.html",
            "url_media": "https://english.news.cn/20250429/729cf40c58c34a39b5c5b6cdec903247/20250429729cf40c58c34a39b5c5b6cdec903247_2025042930554f24c2f94462a75ab0136f59d74f.jpg",
            "country": "CN",
            "language": "en",
            "summary": "This photo taken on April 26, 2025 shows the autumn scenery in the Clutha River in New Zealand's South Island. People take a walk in Arrowtown, New Zealand, on April 25, 2025. People walk on fallen leaves in Christchurch on April 27 2025."
        },
        {
            "published_date": "2025-04-29T07:31:41",
            "title": "Companies linked to $28T in climate damage",
            "author": "Seth Borenstein",
            "url": "https://dailyprogress.com/article_34cc2158-1203-512b-bac4-9061302c8986.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/dailyprogress.com/content/tncms/assets/v3/editorial/8/fb/8fb17b47-4f56-5706-b9fe-2e1462a3d181/68108031b1a03.image.jpg?crop=889%2C467%2C0%2C13",
            "country": "US",
            "language": "en",
            "summary": "The world's biggest corporations have caused $28 trillion in climate damage, according to a Dartmouth College study. More than half of the figure comes from 10 fossil fuel providers: Saudi Aramco, Gazprom, Chevron, ExxonMobil, BP, Shell, National Iranian Oil Co., Pemex, Coal India and British Coal Corp. The study is an effort to make it easier for people and governments to hold companies accountable."
        },
        {
            "published_date": "2025-04-29T07:15:00",
            "title": "Rainfall Sparks Extreme Humid Heat in Tropics/Subtropics",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/rainfall-sparks-extreme-humid-heat-in-1451452",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1532619675605-1ede6c2ed2b0%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Scientists from the University of Leeds and the UK Centre for Ecology and Hydrology have provided the first analysis of how recent rainfall can interact with dry or moist land conditions to influence the risk of extreme humid heat in the global tropics and subtropics. Humid heatwaves are on the rise due to climate change and can be damaging and even fatal to human and animal health."
        },
        {
            "published_date": "2025-04-29T06:38:01",
            "title": "Monsoon changes threaten Bay of Bengal: Your favourite fish curry is at risk",
            "author": "",
            "url": "https://www.indiatoday.in/science/story/monsoon-changes-threaten-bay-of-bengal-your-favourite-fish-curry-is-at-risk-2716733-2025-04-29",
            "url_media": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202504/bay-of-bengal-monsoon-change-293329503-16x9_0.jpg?VersionId=bphsBWh7RI.F3VLJ6MRrH7o68Snpm3go",
            "country": "IN",
            "language": "en",
            "summary": "Extreme weather events in India's summer monsoon could permanently disrupt the Bay of Bengal's marine productivity, jeopardising food security for millions. Over 150 million people rely on the Bay's fisheries for protein and livelihoods. The Bay supplies nearly 8% of the world's fishery production, including critical species like hilsa, a dietary staple for coastal communities."
        },
        {
            "published_date": "2025-04-29T06:14:14",
            "title": "New climate justice book to launch at Bocas Lit Fest",
            "author": "Newsday",
            "url": "https://newsday.co.tt/2025/04/29/new-climate-justice-book-to-launch-at-bocas-lit-fest",
            "url_media": "https://newsday.co.tt/wp-content/uploads/2025/04/24023899-664x1024.jpg",
            "country": "TT",
            "language": "en",
            "summary": "The Cropper Foundation commissioned and published a new collection of creative writing, Writing For Our Lives, a collection of fiction, creative non-fiction, and poems on the global climate crisis. The anthology will be available for sale at the Bocas Lit Fest at Nalis on May 3-4 and at Paper Based Bookshop from May 5 onwards."
        },
        {
            "published_date": "2025-04-29T06:00:00",
            "title": "World Bank Backs Dominica's Fiscal, Disaster Resilience",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/world-bank-backs-dominicas-fiscal-disaster-1450981",
            "url_media": "https://www.worldbank.org/content/dam/photos/780x439/2020/mar/Donut-Photo-16SMs.jpg",
            "country": "US",
            "language": "en",
            "summary": "The World Bank's Board of Executive Directors has approved new financing to support Dominica in its efforts to strengthen domestic revenue mobilization, enhance financial sector resilience, and promote biodiversity conservation and disaster preparedness. The Development Policy Credit comprises an envelope of US$ 24 million. Dominica's development has been set back by natural disasters and climate-related shocks."
        },
        {
            "published_date": "2025-04-29T05:55:08",
            "title": "Mauritius: Building a Sustainable Future for Families Amid Adversities of Climate Change",
            "author": "",
            "url": "https://allafrica.com/stories/202504290055.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "Climate change disrupts families, deepens poverty and creates social imbalance, says the Minister of Gender Equality and Family Welfare, Mrs Marie Arianne Navarre-Marie. She was speaking at the launching ceremony of a working session on the 'Impact of Climate Change on Families' held at the Richelieu Women Empowerment Centre."
        },
        {
            "published_date": "2025-04-29T05:54:25",
            "title": "How one author aims to keep hope alive as Trump upends climate, environmental work: Beat ...",
            "author": "The Oregonian",
            "url": "https://article.wn.com/view/2025/04/29/How_one_author_aims_to_keep_hope_alive_as_Trump_upends_clima",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "In recent months, climate and environmental work have been under threat in the U.S. with the Trump administration dismantling climate legislation, freezing funds and intimidating universities, states and nonprofits. Despite the chaos, environmental work continues to be done despite the chaos in the United States."
        },
        {
            "published_date": "2025-04-29T05:17:02",
            "title": "All Authors Working on Flagship U.S. Climate Report Are Dismissed",
            "author": "New York Times.com",
            "url": "https://southfloridareporter.com/all-authors-working-on-flagship-u-s-climate-report-are-dismissed",
            "url_media": "https://southfloridareporter.com/wp-content/uploads/2025/04/calming-summer-natural-marine-blue-background-sea-sky-with-white-clouds.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration dismissed the scientists and experts who had been compiling the federal government's flagship report on how global warming is affecting the country. The National Climate Assessment is required by Congress. The last report came out in 2023 and is used by state and local governments as well as private companies to prepare for the effects of heat waves, floods, droughts and other climate-related calamities. The sixth report is planned for early 2028."
        },
        {
            "published_date": "2025-04-29T04:48:40",
            "title": "Rising Tide of Danger: Experts Warn Niger Delta Coastal Communities May Disappear by 2050 'Latest Naira Dollar Rate News – Naija247news'",
            "author": "Business",
            "url": "https://naija247news.com/2025/04/29/rising-tide-of-danger-experts-warn-niger-delta-coastal-communities-may-disappear-by-2050",
            "url_media": "https://naija247news.com/wp-content/uploads/2025/04/IMG_3969.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Rising sea levels, saltwater intrusion, and recurrent flooding are fueling displacement, resource scarcity, and escalating communal conflicts across the Niger Delta. The workshop, themed 'Conflicts in Coastal Communities,' was organized under the aegis of the C7 Project, with funding support from the European Union. It gathered environmental advocates, government representatives, and community leaders from five Niger Delta states — Rivers, Bayelsa, Akwa Ibom, Cross River, Delta, and Rivers. They called for urgent government action to protect the region's coastal communities."
        },
        {
            "published_date": "2025-04-29T04:46:55",
            "title": "Keep Your Backyard Safer, Cooler This Summer With These Tips",
            "author": "Pui Kwan Cheung",
            "url": "https://www.ndtv.com/feature/keep-your-backyard-safer-cooler-this-summer-with-these-tips-8283293",
            "url_media": "https://c.ndtvimg.com/2025-04/01qp65mg_backyard-generic-pexels_625x300_29_April_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
            "country": "IN",
            "language": "en",
            "summary": "Artificial turf is dangerous in hot summers. Children, elderly people and pets are particularly susceptible to burns from contact with artificial turf on a hot day. Watering your lawn or planting a shady tree can also dramatically change how hot your backyard feels in summer. The research was part of a project demonstrating the benefits of green space in residential properties. The project received funding from Horticulture Innovation Australia."
        },
        {
            "published_date": "2025-04-29T04:17:00",
            "title": "NASA reveals how 60 years of climate change have transformed Earth from vibrant blue to a troubled world",
            "author": "TOI Science Desk",
            "url": "https://www.msn.com/en-in/news/other/nasa-reveals-how-60-years-of-climate-change-have-transformed-earth-from-vibrant-blue-to-a-troubled-world/ar-AA1DO51c",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "In 1972, Apollo 17 astronauts took a photo of Earth from the South Pole to all continents. The image of a bright blue world glowing against the darkness of space touched hearts all over the world. NASA's EPIC camera today photographs the Earth much more troubled. Melting oceans, felled trees, and blanket pollution have altered the hue of the world from above. Deforestation and the Amazon's struggle for survival are also facing extreme alteration. Environmentalists warned of the dangers of carbon emissions and the threat of global warming since the 1970s."
        },
        {
            "published_date": "2025-04-29T04:12:59",
            "title": "WA scientists working on national climate assessment among hundreds dismissed",
            "author": "Matthew Smith",
            "url": "https://www.yahoo.com/news/wa-scientists-working-national-climate-041259023.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/68NjZaqCTVyht7iIu9is8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/kcpq_fox_local_articles_135/53d131c04d5ebf46db6265d1f0c5908c",
            "country": "US",
            "language": "en",
            "summary": "Hundreds of scientists working on the sixth edition of the National Climate Assessment have been dismissed. A number of them were in Washington state. The report is expected to be released in 2028. It is meant to be policy neutral and summarizes the state of climate change in plain language rather than make policy recommendations."
        },
        {
            "published_date": "2025-04-29T03:46:26",
            "title": "The Devastating Face of Rising Temperatures: Threats to Health, Food Security, and Life",
            "author": "",
            "url": "https://countercurrents.org/2025/04/the-devastating-face-of-rising-temperatures-threats-to-health-food-security-and-life",
            "url_media": "https://cdn.countercurrents.org/2024/07/Global-Warming.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures are having severe consequences on health, food security, and human life in general. Global warming is affecting all aspects of human life. The increasing frequency of natural disasters is displacing people and creating a new crisis of climate refugees. The loss of biodiversity directly impacts human life by disrupting food chains and ecological balance."
        },
        {
            "published_date": "2025-04-29T03:12:37",
            "title": "US climate assessment thrown into doubt as Trump dismisses authors",
            "author": "Patrick T. Fallon",
            "url": "https://www.thepress.net/news/national/us-climate-assessment-thrown-into-doubt-as-trump-dismisses-authors/article_a1a2e4ca-5b65-5d53-b0f4-6537a0ea508a.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/thepress.net/content/tncms/assets/v3/editorial/9/fd/9fd01ab9-ad76-50e6-a841-64cbf4745054/681052ce45670.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump's administration disbanded the authors of the United States' premier climate report. The decision follows mass firings earlier this month at the US Global Change Research Program, the federal body overseeing the report. It's the latest flashpoint in Trump's sweeping efforts to reshape the federal government, particularly in the realm of science."
        },
        {
            "published_date": "2025-04-29T03:12:37",
            "title": "US climate assessment thrown into doubt as Trump dismisses authors",
            "author": "AFP AFP",
            "url": "https://www.themountainpress.com/news/national/us-climate-assessment-thrown-into-doubt-as-trump-dismisses-authors/article_052ffeb9-5c87-55f8-bbac-5501c9860845.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/themountainpress.com/content/tncms/assets/v3/editorial/b/27/b2760a63-8069-53ab-a5e4-fb79b2ca9979/681052623a865.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump's administration disbanded the authors of the United States' premier climate report. The report's scope is being \"reevaluated\" and the participants are being \"released from their roles\" with no timeline offered for potential reengagement. Scientists say the move threatens to derail a critical assessment mandated by Congress."
        },
        {
            "published_date": "2025-04-29T03:12:37",
            "title": "US climate assessment thrown into doubt as Trump dismisses authors",
            "author": "AFP",
            "url": "https://www.yahoo.com/news/us-climate-assessment-thrown-doubt-031237607.html",
            "url_media": "https://media.zenfs.com/en/afp.com/539963aed56784f54630f8081b744454",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump's administration disbanded the authors of the Sixth National Climate Assessment (NCA6) on Monday. The decision follows mass firings earlier this month at the US Global Change Research Program (USGCRP), the federal body overseeing the report. It is the latest flashpoint in Trump's sweeping efforts to reshape the federal government, particularly in the realm of science."
        },
        {
            "published_date": "2025-04-29T03:00:56",
            "title": "How the Australia Institute transformed into immigration propagandists",
            "author": "Leith van Onselen",
            "url": "https://www.macrobusiness.com.au/2025/04/how-the-australia-institute-transformed-into-immigration-propagandists",
            "url_media": "https://api.macrobusiness.com.au/wp-content/uploads/2024/04/Housing-liar.png",
            "country": "AU",
            "language": "en",
            "summary": "The population of Australia has grown by 25 per cent since the Sydney Olympics in 2000. Since 2000, Australia's population has grown more than the entire population of Sydney at that time. The Australia Insititute used to talk sense on immigration. In 2015, TAI published an article."
        },
        {
            "published_date": "2025-04-29T02:44:31",
            "title": "Increase the risk of flooding in the northwest of the Pacific Virginia Technology News",
            "author": "News Desk",
            "url": "https://exbulletin.com/uncategorized/3024137",
            "url_media": "https://i0.wp.com/news.vt.edu/content/news_vt_edu/en/articles/2025/03/cascadia-subduction-zone-earthquake-flooding-expansion-tina-dura/_jcr_content/image.transform/l-medium/image.jpg?resize=1000%2C600&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "There is a risk of earthquakes and tsunamis in the CASCADIA region, where the Pacific Plate meets another tectonic plate. The last earthquake in the region resulted between 1.5 to 6.5 feet of Earth along the coastal line immediately drowned. The area is not populated, but most of the estuary of rivers has a society."
        },
        {
            "published_date": "2025-04-29T02:27:15",
            "title": "Trump administration targets scientists behind key climate assessment",
            "author": "Valerie Volcovici",
            "url": "https://www.japantimes.co.jp/environment/2025/04/29/climate-change/national-climate-assessment-authors",
            "url_media": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/29/466056.jpg?v=3.1",
            "country": "JP",
            "language": "en",
            "summary": "The sixth National Climate Assessment is due for publication in 2028. The scope of the report is being evaluated in accordance with the Global Change Research Act of 1990. Trump's administration has targeted scientific research in several areas in sweeping government job cuts to curtail wasteful spending."
        },
        {
            "published_date": "2025-04-29T01:42:00",
            "title": "Simultaneous Wildfire Risk Rises with Climate Change",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/simultaneous-wildfire-risk-rises-with-climate-1450826",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1543286386-713bdd548da4%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D750%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "The west coast of North America and the east coast of Australia have been hit hard by wildfires. Scientists studied the timing of fire weather seasons in the two regions as a result of climate change. They found that the fire weather days have been increasingly overlapping since 1979. The greatest likelihood of overlap occurs between July and December. It poses a challenge for cooperation between US, Canadian and Australian fire services."
        },
        {
            "published_date": "2025-04-29T01:00:58",
            "title": "China doubles-down on coal use",
            "author": "Leith van Onselen",
            "url": "https://www.macrobusiness.com.au/2025/04/china-doubles-down-on-coal-use",
            "url_media": "https://api.macrobusiness.com.au/wp-content/uploads/2024/12/China-pollution.png",
            "country": "AU",
            "language": "en",
            "summary": "China is the world's largest carbon emitter, accounting for 31.5% of global emissions in 2023. China's insatiable coal consumption has largely driven its near exponential rise in emissions. China accounts for 30% more coal consumption than the rest of the world combined."
        },
        {
            "published_date": "2025-04-29T00:43:15",
            "title": "High-resolution climate models reveal how Tasman Sea temperatures may influence Antarctic peninsula warming",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/29/Highresolution_climate_models_reveal_how_Tasman_Sea_temperat",
            "url_media": "https://article.wn.com/view/2025/04/29/[]",
            "country": "US",
            "language": "en",
            "summary": "Antarctic Peninsula is one of the fastest-warming regions on Earth. Temperatures have risen five times faster than the rest of the planet.      Â   in the last century. Â \"The Antarctic Peninsula has seen five times the increase in temperature than other regions. "
        },
        {
            "published_date": "2025-04-29T00:39:41",
            "title": "Environmental Change and Degradation",
            "author": "",
            "url": "https://www.nation.com.pk/29-Apr-2025/environmental-change-and-degradation",
            "url_media": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
            "country": "PK",
            "language": "en",
            "summary": "There are increasing levels of pollution, deforestation, biodiversity loss, and rising global temperatures. The effects of environmental degradation are evident in erratic weather patterns, frequent natural disasters, and declining public health. Communities, particularly in vulnerable regions, are facing challenges such as water scarcity, food insecurity, and displacement due to climate-related events."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Thawing permafrost dots Siberia with rash of mounds",
            "author": "Ekaterina ANISIMOVA",
            "url": "https://starlocalmedia.com/news/national/thawing-permafrost-dots-siberia-with-rash-of-mounds/article_b8212131-cad3-5d54-99fc-8a04dd7147e7.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/starlocalmedia.com/content/tncms/assets/v3/editorial/3/7d/37d3de59-8852-5b00-8bb0-5f19a840800a/6811964f03520.image.jpg?crop=288%2C288%2C112%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The ever more rapid thaw of the permafrost is changing the landscape around Churapcha in eastern Siberia, cracking up houses and releasing greenhouse gases. A growing number of little mounds are appearing across the region of Yakutia in the Russian Far East."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Thawing permafrost dots Siberia with rash of mounds",
            "author": "Ekaterina ANISIMOVA",
            "url": "https://www.dailygazette.com/news/national/thawing-permafrost-dots-siberia-with-rash-of-mounds/article_b640c1b9-1204-5a8e-8e4d-a29d78848ada.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/8/2e/82e73b1d-5c84-5f0f-a53c-c5ca88d3fe4a/681195eb20dae.image.jpg?crop=288%2C288%2C112%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The rapid thaw of the permafrost is changing the landscape around Churapcha in eastern Siberia, cracking up houses and releasing greenhouse gases. A growing number of little mounds are appearing across the region of Yakutia in the Russian Far East."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Antarctic sea ice extent is 17% HIGHER today than in 1979 â Ice doesnât LIE, ...",
            "author": "Natural News",
            "url": "https://article.wn.com/view/2025/04/29/Antarctic_sea_ice_extent_is_17_HIGHER_today_than_in_1979_a_I",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It's getting colder, slowly but surely, so you need some ice for your drink. The Climate Change Apocalypse is over folks, it’s getting colder and the world is getting colder.    .   It’ll get cold. "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "‘Last chance for humanity': the cold reality of monitoring global heating on a glacier",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/29/Last_chance_for_humanity_the_cold_reality_of_monitoring_glob",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scientists on Union glacier in Antarctica fear the region is reaching a dangerous tipping point. They are powerless and resigned to the forces of nature, says one of them, and they are resigned to being left to nature's will. The scientists are worried about the future of the Union glacier."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "One of the biggest questions in Mars science may have been answered by the Curiosity rover",
            "author": "Chemistry World",
            "url": "https://article.wn.com/view/2025/04/29/One_of_the_biggest_questions_in_Mars_science_may_have_been_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Mystery of where all the carbon dioxide went has puzzled scientists for years. It once made the red planet far more hospitable, but scientists don't know where it came from.       .   in this case, it's not on Earth."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Extreme monsoon from global warming may lead to dip in sea fish catch: Report",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/04/29/Extreme_monsoon_from_global_warming_may_lead_to_dip_in_sea_f",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A study published in Nature warns that global warming could intensify monsoon rainfall in South Asia disrupting marine life. It also warns that it could disrupt the monsoon in the South Asia.   Â   in Nature, Nature, July 25th, 2013."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Climate Veritas Publishes Book Explaining Why Burning Fossil Fuels Doesn't Cause Climate Change",
            "author": "PR Newswire",
            "url": "https://article.wn.com/view/2025/04/29/Climate_Veritas_Publishes_Book_Explaining_Why_Burning_Fossil",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Darwin Throne, co-founder of Climate Veritas, has published a book that explains why the UN IPCC Assessment Report claim that Human Activity is \"unequivocally\" causing climate change is totally wrong. The CO2 model of the IPCC is based on faulty models and theories."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Climate Anxiety Is Taking Its Toll on Young People",
            "author": "Time Magazine",
            "url": "https://article.wn.com/view/2025/04/29/Climate_Anxiety_Is_Taking_Its_Toll_on_Young_People",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is taking a toll on the environment and on human minds. Researchers have been describing what they variously label eco-distress, exo-anxiety, or even eco-grief. It's a suite of symptoms including depression, anxiety, and post-traumatic stress."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Trump administration dismisses authors of key climate report",
            "author": "The Washington Post",
            "url": "https://article.wn.com/view/2025/04/29/Trump_administration_dismisses_authors_of_key_climate_report",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The report on the domestic effects of climate change could be delayed, scrapped or watered down, experts say. The move means the congressionally mandated report may be delayed or even scrapped.       .   for the report. For more information, go to: http://www.cnn.com/2013/01/25/climate-change/"
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Data Refutes Euronews\\u2019 Climate Change Claims On Europe\\u2019s 2024 Severe Weather",
            "author": "Principia Scientific",
            "url": "https://article.wn.com/view/2025/04/29/Data_Refutes_Euronews_u2019_Climate_Change_Claims_On_Europe_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A recent Euronews post claims that Europe is experiencing very severe impacts from climate change in 2024 due to heatwaves, floods, storms and heatwaves due to climate change, and that Europe suffered the 'serious impacts' of climate change. Euronew claims Europe will be worse off in the future."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Action to mitigate climate change is tough — and it just got harder",
            "author": "Grand Rapids Business Journal",
            "url": "https://article.wn.com/view/2025/04/29/Action_to_mitigate_climate_change_is_tough_and_it_just_got_h",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dennis Strahle is a farmer in Eagle Township west of Lansing, Michigan. He grows English walnuts, elderberries, hazelnuts, pears, plums, cherries and more. He saw an apricot on the ground and decided to buy it."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Trump dismisses contributors to key US report on climate crisis preparedness",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/29/Trump_dismisses_contributors_to_key_US_report_on_climate_cri",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The assessment is used by federal and local governments to prepare for climate disasters. It is mandated by Congress. It's intended to be used by the federal government and local government to prep for disasters. The assessment is based on the UNFCCC's assessment. "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "African climate experts seek stronger strategies for continental resilience",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/04/29/African_climate_experts_seek_stronger_strategies_for_contine",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "African climate and disaster risk experts gathered in Kigali, the capital of Rwanda, to explore innovative approaches and develop stronger strategies for building climate resilience across the continent. It is the 15th session of the African Risk Capacity (ARC) Conference of the Parties (COP). Rwanda is proud to host this important session."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Today sees the beginning of Khamaseen winds in Egypt: Climate center warns",
            "author": "Egypt Today",
            "url": "https://article.wn.com/view/2025/04/29/Today_sees_the_beginning_of_Khamaseen_winds_in_Egypt_Climate",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dr. Mohamed Ali Fahim is head of the Climate Information Center at the Ministry of Agriculture and Land Reclamation. He reviewed the weather fluctuations as part of a review of climate forecast model updates at the Climate Change Information Center and forecasts from the Meteorological Authority."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "As global players focus on the Arctic, US icebreakers are scarce",
            "author": "Asiatimes",
            "url": "https://article.wn.com/view/2025/04/29/As_global_players_focus_on_the_Arctic_US_icebreakers_are_sca",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In the past two decades, the Arctic has grown five degrees Celsius warmer. The Arctic is warming four times as fast as the rest of the planet. Climate scientists expect that the Arctic will continue to get warmer in the future.   Â   "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Trump's National Climate Assessment: No funding and all authors cut loose",
            "author": "Ars Technica",
            "url": "https://article.wn.com/view/2025/04/29/Trump_s_National_Climate_Assessment_No_funding_and_all_autho",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As part of the Global Change Research Act of 1990, the government must produce a National Climate Assessment every four years. This document is intended to provide an overview of the changing state of our knowledge about the process itself and its impact on our environment. Past versions have been."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Industrial Waste Is Turning Into Rock in Just Decades, Study Suggests",
            "author": "Gizmodo",
            "url": "https://article.wn.com/view/2025/04/29/Industrial_Waste_Is_Turning_Into_Rock_in_Just_Decades_Study_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Researchers warn that current land management models don't account for accelerated rock formation processes, as they do for human-driven rock formation.       .   in this case, the rock formation process is accelerated by humans, not by natural processes."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Smart Bets: Music for MANNA",
            "author": "Mountain Xpress",
            "url": "https://article.wn.com/view/2025/04/29/Smart_Bets_Music_for_MANNA",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tropical Storm Helene destroyed the headquarters and warehouse of the MANNA FoodBank. Thousands of households in Western North Carolina rely on the food bank for assistance. To help MANNA meet its need, donate to their website here.    . "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "From drizzle to storms: São Paulo upended by climate change",
            "author": "France24",
            "url": "https://article.wn.com/view/2025/04/29/From_drizzle_to_storms_Sao_Paulo_upended_by_climate_change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As climate change advances, extreme weather is hitting São Paulo harder and more often. This year's summer storms have already left six people dead and one person missing, double the previous year's death toll and one more than last year's number of people missing."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Tempted To Turn On The Aircon? Science Says Use Fans Until It's 27°C",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/04/29/Tempted_To_Turn_On_The_Aircon_Science_Says_Use_Fans_Until_It",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Many Australians struggle to keep themselves cool due to rising electricity prices. This is becoming a major health concern for many people.       .   ...   in this article. In this article, Menafn is talking about The Conversation. "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Global warming may stop summertime school sports in Japan from 2060s",
            "author": "Kyodo",
            "url": "https://article.wn.com/view/2025/04/29/Global_warming_may_stop_summertime_school_sports_in_Japan_fr",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Without serious efforts to tackle global warming, students in the 2060s or later may no longer be able to engage in outdoor sports in summer in most parts of Japan. In the most pessimistic global warming scenario, the team's heat stress projections showed that all activities will be affected."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Scientists Tally Oil Majors' Climate Damage With Eye to Legal Liability",
            "author": "Live Mint",
            "url": "https://article.wn.com/view/2025/04/29/Scientists_Tally_Oil_Majors_Climate_Damage_With_Eye_to_Legal",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New research breaks down economic losses from global warming and attributes them to individual companies. It could bolster lawsuits against big emitters, which is good news for the environmental groups who are already planning to sue them for their emissions of greenhouse gases, which are harmful to the environment."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Cambodia's floating schools face climate crisis – DW – 04/29/2025",
            "author": "Akanksha Saxena",
            "url": "https://www.dw.com/en/cambodias-floating-schools-face-climate-crisis/video-72389723",
            "url_media": "https://static.dw.com/image/72389605_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "On Cambodia's Tonle Sap lake, children from floating villages embark on daily boat journeys to school. Climate change is making these trips perilous, threatening both their education and way of life. April 29, 2025 is the anniversary of the founding of Cambodia's government. "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Cambodia's floating schools face brunt of climate crisis – DW – 04/29/2025",
            "author": "Akanksha Saxena",
            "url": "https://www.dw.com/en/cambodias-floating-schools-face-brunt-of-climate-crisis/video-72389723",
            "url_media": "https://static.dw.com/image/72389605_6.jpg",
            "country": "DE",
            "language": "en",
            "summary": "On Cambodia's Tonle Sap lake, children from floating villages embark on daily boat journeys to school. Climate change is making these trips perilous, threatening both their education and their way of life. Akanksha Saxena will be born on April 29, 2025."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Loss of FEMA program spells disaster for communities and their projects",
            "author": "",
            "url": "https://www.thealpenanews.com/news/national-news-apwire/2025/04/loss-of-fema-program-spells-disaster-for-communities-and-their-projects",
            "url_media": "http://d14e0irai0gcaa.cloudfront.net/www.thealpenanews.com/images/2016/11/15143024/fblike.jpg",
            "country": "US",
            "language": "en",
            "summary": "FEMA revoked upwards of $3.6 billion in funding earmarked for communities like Mount Pleasant, North Carolina. The Building Resilient Infrastructure and Communities program was eliminated this month. FEMA called the grants 'wasteful' and 'politicized' but officials and residents say they were a vital use of government resources to proactively protect lives, infrastructure and economies."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Tony Blair says Net Zero push has become 'irrational' and 'hysterical' and warns critics of ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/04/29/Tony_Blair_says_Net_Zero_push_has_become_irrational_and_hyst",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The climate change debate needs a pragmatic reset to win over voters, Tony Blair warns. Most people in developed countries believe in climate change, but they are turning away from politics because of the political uncertainty.   in the UK and in the US. In developed countries most people believe it is real."
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "India's Changing Monsoon Patterns, Warmer Climate Threaten Bay of Bengal's Marine Life: Study",
            "author": "News18",
            "url": "https://article.wn.com/view/2025/04/29/India_s_Changing_Monsoon_Patterns_Warmer_Climate_Threaten_Ba",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Future projections show climate change-induced warmer surface waters, strong freshwater run-off and weaker winds could lead to sharp fall in marine productivity in Bay of Bengal due to decline of marine productivity due to warming sea surface temperature.   Â. Â "
        },
        {
            "published_date": "2025-04-29T00:00:00",
            "title": "Parts of Mindanao cloudy with rain showers due to LPA",
            "author": "The Manila Times",
            "url": "https://article.wn.com/view/2025/04/29/Parts_of_Mindanao_cloudy_with_rain_showers_due_to_LPA",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A trough or extension of a low pressure area has been affecting Mindanao, particularly Caraga and Davao Region, the state weather agency Pagasa said on Tuesday. The trough is embedded along the intertropical convergence zone (ITCZ).  "
        }
    ]
}