{
    "status": "ok",
    "total_articles": 174,
    "articles": [
        {
            "published_date": "2025-04-17T23:40:18",
            "title": "Biodiversity under threat: Moths, elephants bear brunt of climate change",
            "author": "Iylia Marsya Iskandar",
            "url": "https://www.nst.com.my/news/nation/2025/04/1203587/biodiversity-under-threat-moths-elephants-bear-brunt-climate-change",
            "url_media": "https://assets.nst.com.my/images/articles/180425nstOped03_1744933205.jpg",
            "country": "MY",
            "language": "en",
            "summary": "There are 1,000 moth species endemic to Gunung Kinabalu in Sabah, but some have been flying higher than usual due to warmer temperatures. WWF-Malaysia warns that climate change is threatening ecosystems, including forests, peat swamps, mangroves, wetlands, seagrass beds and coral reefs. Even animals associated with hot climates, such as elephants, face risks from climate change."
        },
        {
            "published_date": "2025-04-17T23:25:25",
            "title": "What is weather modification and why does Florida want to ban it?",
            "author": "Tampa Bay Times",
            "url": "https://article.wn.com/view/2025/04/17/What_is_weather_modification_and_why_does_Florida_want_to_ba",
            "url_media": "https://i.ytimg.com/vi/SgM3r8xKfGE/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Fears of weather modification have been heightened in the past year. Lawmakers across the country and in Florida want to ban the practice. Weather modification is just as it sounds: It's the act of controlling the weather and it can be done by any person."
        },
        {
            "published_date": "2025-04-17T23:00:00",
            "title": "Nebraska's High Plains Regional Climate Center shuttered amid Trump cuts",
            "author": "Chris Dunker",
            "url": "https://journalstar.com/news/state-regional/weather/article_ca94cd23-cd5e-4f5b-bc90-dcd239497ace.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/journalstar.com/content/tncms/assets/v3/editorial/c/a9/ca94cd23-cd5e-4f5b-bc90-dcd239497ace/6801874c165f2.preview.jpg?crop=1686%2C885%2C0%2C171&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The High Plains Regional Climate Center at the University of Nebraska-Lincoln shut down on Thursday after the Trump administration allowed its funding through the National Oceanic and Atmospheric Agency to lapse. The center provides data that feeds into CropWatch, a tool used by farmers to help manage their fields, and the Cattle Comfort Index, used by ranchers to monitor weather-related stress on their animals. It also fed data into the National Drought Mitigation Center, which hosts the U.S. Drought Monitor used to track drought conditions across the country."
        },
        {
            "published_date": "2025-04-17T22:12:54",
            "title": "TURTLE TENSION: Beach conditions pose challenges for upcoming nesting season",
            "author": "Alex Orenczuk",
            "url": "https://www.fox4now.com/north-port-englewood/turtle-tension-beach-conditions-pose-challenges-for-upcoming-nesting-season",
            "url_media": "https://ewscripps.brightspotcdn.com/dims4/default/71eabaa/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F8e%2Ff5%2F24bd8754493e8381118d622dfcd7%2Fturtlepatrol.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hurricanes Helene and Milton flooded the island with storm surge, washing away sand dunes and vegetation the turtles used to nest. The lack of vegetation is going to be one of the biggest issues for nesting season on Englewood Beach and other nearby beaches. Without vegetation and dunes, more light pollution can disorient turtles looking to nest, as well as hatchlings looking for the water. Charlotte County installed a black fence to cut down on the light pollution."
        },
        {
            "published_date": "2025-04-17T22:09:22",
            "title": "Coastal management model plays the long game against the rising tides",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/17/Coastal_management_model_plays_the_long_game_against_the_ris",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Coastal cities follow a standard playbook to protect against rising sea levels in a warming world, according to the World Resources Institute (WRI). WRI advises coastal cities to build sea defences to prevent sea levels rise. WRI has a website with more information on sea defences."
        },
        {
            "published_date": "2025-04-17T21:46:00",
            "title": "Karachi braces for potential heatwave starting today",
            "author": "inp",
            "url": "https://dailytimes.com.pk/1288587/karachi-braces-for-potential-heatwave-starting-today",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2020/08/app-icon-192x192-1.png",
            "country": "PK",
            "language": "en",
            "summary": "Temperatures continue to rise across Pakistan's southern Sindh province. The highest temperature on Tuesday was recorded in Nawabshah at a scorching 47°C, while Larkana and Jacobabad also saw the mercury rise to 46°C. The potential heatwave is expected to grip Karachi starting Sunday and last until Wednesday or Thursday next week. Local authorities have begun setting up relief stalls across various districts of the city."
        },
        {
            "published_date": "2025-04-17T21:36:27",
            "title": "Stakeholders advocate immediate action to protect Nigeria's climate future",
            "author": "Fortune Eromonsele",
            "url": "https://www.premiumtimesng.com/news/top-news/788741-stakeholders-advocate-immediate-action-to-protect-nigerias-climate-future.html",
            "url_media": "https://media.premiumtimesng.com/wp-content/files/2025/04/NCIC-33-scaled-e1744925092823.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria Climate Innovation Centre (NCIC) unveiled its Nigeria climate impact outlook in Abuja on Thursday. The event brought together climate advocates, development partners, journalists, and innovators to discuss practical solutions for building a more sustainable future for the country. Finnish Ambassador to Nigeria, Sanna Selin, highlighted Finland's commitment to global climate action and the importance of international partnerships in tackling climate change."
        },
        {
            "published_date": "2025-04-17T20:20:34",
            "title": "Support NOAA Research: The Moment to Act Is Now",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/support-noaa-research-the-moment-to-act-is-now",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Support-NOAA-Research-The-Moment-to-Act-Is-Now.jpeg",
            "country": "TR",
            "language": "en",
            "summary": "The American Meteorological Society (AMS) and National Weather Association (NWA) oppose the proposed budgetary elimination of NOAA's Office of Oceanic and Atmospheric Research (OAR). This proposed policy is part of the administration's 2026 budget passback. OAR's laboratories are instrumental in the continuous refinement of the complex numerical weather prediction models. Doppler radar technology allows meteorologists to discern storm structures, wind velocities, precipitation intensity, and the formation of the doppler."
        },
        {
            "published_date": "2025-04-17T20:16:00",
            "title": "Most Of Northland Now In Open Fire Season",
            "author": "8:16 am Press Release: Fire",
            "url": "https://www.scoop.co.nz/stories/AK2504/S00647/most-of-northland-now-in-open-fire-season.htm",
            "url_media": "https://mc-store1.s3.amazonaws.com/media/nn/beta1-scoop-co-nz/posts/d0J73C902ZExtaEk.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "Fire and Emergency New Zealand has moved most of Te Tai Tokerau Northland District back to an open fire season from 12am this morning, Friday 18 April. Muriwhenua remains in a restricted fire season where permits are still required, and outdoor fires are still prohibited on off-shore islands."
        },
        {
            "published_date": "2025-04-17T20:02:32",
            "title": "Republicans in Gulf states push to embrace Gulf of America name",
            "author": "The Associated Press",
            "url": "https://www.thestar.com/news/world/united-states/republicans-in-gulf-states-push-to-embrace-gulf-of-america-name/article_41c63413-d77d-5fdd-bbde-1a7b2c4a68e7.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/5/34/53486478-e39f-538e-af72-ae3d33db4c03/6801601a06113.image.jpg?crop=1618%2C849%2C0%2C115&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Southern Republicans are pushing their states to formally embrace the name Gulf of America. Florida Gov. Ron DeSantis signed two bills this week requiring the use of 'Gulf of America' in state law and textbooks. Louisiana Gov. Jeff Landry in March signed an executive order directing state materials to reflect the name change."
        },
        {
            "published_date": "2025-04-17T19:43:08",
            "title": "Climate Change Myths Part 1: Polar Bears, Arctic Ice, and Food Shortages",
            "author": "",
            "url": "https://www.todayville.com/climate-change-myths-part-1-polar-bears-arctic-ice-and-food-shortages",
            "url_media": "https://i2.wp.com/www.todayville.com/wp-content/uploads/2025/04/tvrd-stossel-global-warming-myths-image-2025-04-17.jpg?fit=560%2C320&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Climate change alarmists are wrong. John Stossel has received 19 Emmy Awards and has been honored five times for excellence in consumer reporting by the National Press Club. His economic programs have been adapted into teaching kits by a non-profit organization 'Stossel in the Classroom' and are seen by more than 12 million students every year."
        },
        {
            "published_date": "2025-04-17T19:30:20",
            "title": "WINDREF: Revised Invitation to Bid: Design–Build Services for Shoreline Stabilisation Works",
            "author": "Now Grenada",
            "url": "https://nowgrenada.com/2025/04/windref-invitation-to-bid-design-build-services-for-shoreline-stabilisation-works",
            "url_media": "https://nowgrenada.com/wp-content/uploads/2023/08/Windref-etc-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Telescope's Coastline Project, St Andrew, Grenada, has been affected by the direct and indirect effects of climate change. The project will be implemented in Telescope, on the shores of Little Bay, within the Grenville Bay Area (GBA). Windrift Islands Research & Education Foundation invites interested firms to submit Proposals to provide design-build services for shoreline stabilisation works within the project community. The deadline for submission of proposals is 3 pm on 23 May 2025. The bid process is conducted according to the procedures specified in the Caribbean Biodiversity Fund (CBF) Implementing Agency."
        },
        {
            "published_date": "2025-04-17T19:22:20",
            "title": "Peter Dutton: Australia opposition leader clarifies he believes in climate change after debate",
            "author": "Ottilie Mitchell",
            "url": "https://news.knowledia.com/all/all/articles/peter-dutton-australia-opposition-leader-clarifies-he-believes-in-0b1af912a64ed45e4351f638b902c803ddfbb921",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/cf9e/live/d4a97f90-1b5a-11f0-8f7b-f14ee83762cb.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Peter Dutton has clarified he believes in climate change after facing backlash for comments made during an election debate on Wednesday night. He had previously said that flooding and natural disasters were \"part of the history of our state of this country\". The comments generated outrage from climate groups and mockery from Anthony Albanese."
        },
        {
            "published_date": "2025-04-17T19:13:05",
            "title": "Over half of NOAA's Regional Climate Centers' websites go dark due to ‘lapse in federal funding'",
            "author": "this form",
            "url": "https://dnyuz.com/2025/04/17/over-half-of-noaas-regional-climate-centers-websites-go-dark-due-to-lapse-in-federal-funding",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/04/Over-half-of-NOAAs-Regional-Climate-Centers-websites-go-dark.jpg",
            "country": "US",
            "language": "en",
            "summary": "There are six Regional Climate Centers covering different states. Four of the six websites were non-functioning on Thursday. Funding for the High Plains Regional Climate Center program lapsed on April 17, 2025 due to a suspension of federal funding from NOAA through the Department of Commerce. All data and services offered under the HPRCC contract, including this website, are unavailable."
        },
        {
            "published_date": "2025-04-17T19:06:00",
            "title": "Climate change poses growing threat to Australia's blood supply",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250417/592a643fd12c40ecbc9ca69eced24768/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Climate change is set to disrupt global blood supplies. Australia is particularly vulnerable to the effects of extreme weather, rising disease rates, and shifting donor health patterns. The study follows the aftermath of Ex-Tropical Cyclone Alfred last month, which led to over 3,500 cancelled blood donation appointments in New South Wales and Queensland."
        },
        {
            "published_date": "2025-04-17T18:45:14",
            "title": "Rams to honor LA firefighters by drafting from fire station",
            "author": "",
            "url": "https://www.griffindailynews.com/sports/national/rams-to-honor-la-firefighters-by-drafting-from-fire-station/article_97c173ec-df15-58fe-94ca-dfa6dcd77051.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/f/c0/fc000ba3-8672-50dd-9c85-f937ab1d00e1/680141a93bf51.image.jpg?crop=1099%2C577%2C0%2C78",
            "country": "US",
            "language": "en",
            "summary": "Griffin, GA (30223) is experiencing sun and clouds mixed. High 77F. Winds SE at 5 to 10 mph. Tomorrow will be mostly clear, with low near 50F temps falling to near 50°F. It will be light and variable."
        },
        {
            "published_date": "2025-04-17T18:19:07",
            "title": "Greta Thunberg Fast Facts",
            "author": "News-Press Now",
            "url": "https://article.wn.com/view/2025/04/17/Greta_Thunberg_Fast_Facts",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Environmental activist Greta Thunberg was born on January 3, 2003 in Stockholm, Sweden. Her father, Svante, was critical of her for not being mature enough to tell it like it is. Greta doesn't care about being popular, she cares about climate justice and the living planet."
        },
        {
            "published_date": "2025-04-17T18:13:27",
            "title": "A mysterious, 100-year solar cycle may have just restarted — and it could mean decades of dangerous space weather",
            "author": "Harry Baker",
            "url": "https://news.knowledia.com/all/all/articles/a-mysterious-100-year-solar-cycle-may-have-just-restarted-and-it-could-1e07c800f03b1a4d729e5f73775e0617613a9224",
            "url_media": "https://cdn.mos.cms.futurecdn.net/7jayXJqMFEKziWvnBA8eMF.jpg",
            "country": "FR",
            "language": "en",
            "summary": "A new paper suggests that a mysterious 100-year-long solar cycle may have just \"turned over\". The next few decades could see further increases in solar activity that may threaten Earth-orbiting spacecraft and trigger auroras across the globe. However, other experts are skeptical of the new findings."
        },
        {
            "published_date": "2025-04-17T18:06:11",
            "title": "The difference in global temperature if Canada goes net-zero by 2050 or not Unmeasurable even by 2100 (0.018°C difference) Run in the UN's own climate model, MAGICC",
            "author": "Lawyer Lisa",
            "url": "https://lawyerlisa.substack.com/p/the-difference-in-global-temperature",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F7c250806-6c38-4913-ab8e-dd9e666e4032_1080x1779.jpeg",
            "country": "US",
            "language": "en",
            "summary": "'The difference in global temperature if Canada goes net-zero by 2050 or not is unmeasurable even by 2100 (0.018°C difference) according to UN's own climate model, MAGICC'. Bjorn Lomborg wants central bank digital currency and a carbon tax to replace the Paris Agreement."
        },
        {
            "published_date": "2025-04-17T18:00:00",
            "title": "Most Americans fear global warming. Here's why few discuss it",
            "author": "Saul Elbein",
            "url": "https://www.yahoo.com/news/most-americans-fear-global-warming-180000385.html",
            "url_media": "https://media.zenfs.com/en/the_hill_articles_341/421d588e3e596e6dc141d2a38e69811e",
            "country": "US",
            "language": "en",
            "summary": "A majority of Americans see climate change as a 'major threat' to the country's well-being, according to Pew Research Center. But nearly two-thirds of Americans 'rarely or never' discuss climate change with their friends or family. The Trump administration has cast fears of planetary heating as a fringe, minority concern."
        },
        {
            "published_date": "2025-04-17T17:31:00",
            "title": "Godwit Days Festival Lands in Arcata",
            "author": "Kali Cozyris",
            "url": "https://www.northcoastjournal.com/AEBlog/archives/2025/04/17/godwit-days-festival-lands-in-arcata",
            "url_media": "https://media1.northcoastjournal.com/northcoast/imager/u/slideshow/32615481/crafts9__1_.webp",
            "country": "US",
            "language": "en",
            "summary": "Celebrate spring migration at Godwit Days Spring Migration Bird Festival, April 17–20 at the Arcata Community Center. Enjoy nearly 100 field trips, lectures and workshops, plus a free bird fair with live raptors, artists, vendors and family activities. Keynote speaker is Michael Kauffmann on Friday, April 18 at 6:30 p.m. and Rosemary Mosco on Saturday, April 19 at 7 pm."
        },
        {
            "published_date": "2025-04-17T17:30:03",
            "title": "Wild weather warning as cyclone moves closer to coast",
            "author": "Aaron Bunch",
            "url": "https://www.bordermail.com.au/story/8945689/wild-weather-warning-as-cyclone-moves-closer-to-coast",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/88779930-d469-4681-8cd2-4600a4d47e13.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Tropical cyclone is heading towards remote communities in Australia's northwest. Residents are being urged to prepare for damaging winds and heavy rain as a tropical cyclone barrels towards them. The storm is expected to bring heavy rain and strong winds.    in remote communities."
        },
        {
            "published_date": "2025-04-17T17:28:00",
            "title": "Wildfires threaten millions in southwestern US",
            "author": "ONA",
            "url": "https://timesofoman.com/article/156992-wildfires-threaten-millions-in-southwestern-us",
            "url_media": "https://shabiba.eu-central-1.linodeobjects.com/2025/04/1744896535-1744896535-2jrxtrmsti6r-700x400.jpeg",
            "country": "OM",
            "language": "en",
            "summary": "More than 4.5 million people are on a red alert due to the weather conditions. High temperatures, strong winds, and low relative humidity are expected to continue through the weekend in the southwestern United States. New Mexico is facing an extreme risk due to wind gusts that could reach 60 mph today, with relative humidity between 5 and 10 percent. Eastern Arizona and New Mexico are at critical risk, the second-highest level, because of dry and windy conditions."
        },
        {
            "published_date": "2025-04-17T17:25:26",
            "title": "TikTok Tourism Is Ruining Antarctica",
            "author": "Luis Prada",
            "url": "https://www.vice.com/en/article/tiktok-tourism-is-ruining-antarctica",
            "url_media": "https://www.vice.com/wp-content/uploads/sites/2/2025/04/tiktok-tourism-is-ruining-antarctica.jpg?w=1200",
            "country": "US",
            "language": "en",
            "summary": "Antarctica used to be considered a pristine place, but now it's getting hit from all sides. The New York Times published a feature about a cruise ship port in Ushuaia, Argentina, that has turned the small port town into a bustling hub of wealthy tourists who are willing to pay $18,000 a pop for cruise tickets to Antarctica. Since 2014, Antarctic tourism has spiked 215 percent."
        },
        {
            "published_date": "2025-04-17T17:18:00",
            "title": "Europe, Fastest-warming Continent, Endures Hottest Year In 2024",
            "author": "BERNAMA",
            "url": "https://www.bernama.com/en/world/news.php?id=2413826",
            "url_media": "https://www.bernama.com/storage/photos/54a58627ed53bb0034cc42553caef70d6800c74d03a33",
            "country": "MY",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves, and unprecedented climate extremes. Europe remains the world's fastest-warming continent, experiencing \"serious impacts from extreme weather and climate change.\" Sea surface temperatures for the European region and Mediterranean Sea were the highest ever recorded."
        },
        {
            "published_date": "2025-04-17T17:01:17",
            "title": "Trump spending cuts hit two sea level rise protection projects in Boston",
            "author": "",
            "url": "https://www.bostonglobe.com/2025/04/17/science/trump-fema-bric-grant-boston-coastal-resilience",
            "url_media": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/R5JEXRET62DRN5Z7S7AX7ZTL3Y.jpg?auth=66a7769790e6f64c43a21221832e226b45e46ef59e6cc9ca8272ba8d80a8b438&width=1440",
            "country": "US",
            "language": "en",
            "summary": "The federal government has cut funding for the Building Resilient Infrastructure and Communities grant program. Boston's climate leaders are pushing ahead with their plans to protect the 47-mile-long coastline from rising sea levels. Chelsea and Everett lost out on a $50 million grant they were expecting."
        },
        {
            "published_date": "2025-04-17T17:00:00",
            "title": "10 countries facing the worst of climate change",
            "author": "TIMESOFINDIA.COM",
            "url": "https://timesofindia.indiatimes.com/life-style/travel/news/10-countries-facing-the-worst-of-climate-change/articleshow/120380195.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120380400,width-1070,height-580,imgsize-2097476,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is no longer a threat, but a pressing global issue driven by human activities. Top 10 countries that are especially vulnerable to climate change are: Bangladesh, Pakistan, Vietnam, Myanmar, Mozambique, Nepal, Sri Lanka, Vietnam and Zimbabwe are the most vulnerable countries."
        },
        {
            "published_date": "2025-04-17T16:57:29",
            "title": "Europe's 2024 Climate Crisis Breaks Alarming Records",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/europe-fastest-warming-continent-endured-hottest-year-2024-861",
            "url_media": "https://one.newkerala.com/images/t/newkerala-com-news250.webp",
            "country": "IN",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves, and unprecedented climate extremes. At least 335 people died and 413,000 were affected by storms and floods. Sea surface temperatures for Europe and Mediterranean Sea were the highest-ever recorded. The proportion of electricity generation by renewables in Europe reached a record high in 2024."
        },
        {
            "published_date": "2025-04-17T16:21:04",
            "title": "Climate change will make rice toxic, say researchers",
            "author": "Ars Technica",
            "url": "https://article.wn.com/view/2025/04/17/Climate_change_will_make_rice_toxic_say_researchers",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Rice, the world's most consumed grain, will become more toxic as the atmosphere heats and carbon dioxide emissions rise, putting billions of people at risk of cancers and other diseases, according to new research. The research was published in the journal \"The International Journal of Agricultural Policy."
        },
        {
            "published_date": "2025-04-17T16:10:40",
            "title": "The Great Moose Migration: Why are millions of people watching elk in Sweden?",
            "author": "",
            "url": "https://www.bbc.com/newsround/articles/c20xzqxd9zpo",
            "url_media": "https://ichef.bbci.co.uk/ace/branded_newsround/1200/cpsprodpb/2f18/live/27981ed0-1b80-11f0-b4df-6fb796236a3c.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Millions of people in Sweden are watching a live broadcast of elk migration. The show is called The Great Moose Migration. It follows the animals as they make their annual journey toward greener, summer pastures in the north of the country. This year's migration began a week ahead of schedule because of the warmer weather."
        },
        {
            "published_date": "2025-04-17T15:55:00",
            "title": "Letter: Strength from numbers",
            "author": "",
            "url": "https://www.hometownsource.com/sun_thisweek/free/letter-strength-from-numbers/article_541c96c7-8985-4a4a-bfdb-628712abb9ea.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/hometownsource.com/content/tncms/custom/image/0112cd40-67cf-11e7-9def-43053d0492ca.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "To the editor: People are concerned about the impact of climate change. Government is acting but not as much as some of us wish. Faith communities can provide leadership, direction, better communication and inspiration for protecting the Earth we all live on, writes the editor."
        },
        {
            "published_date": "2025-04-17T15:03:44",
            "title": "Got climate questions? We want to hear them",
            "author": "Avery Bleichfeld",
            "url": "https://baystatebanner.com/2025/04/17/got-climate-questions-we-want-to-hear-them",
            "url_media": "https://baystatebanner.com/wp-content/uploads/2018/04/cropped-Banner_web_icon-copy-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "In January, scientists recognized 2024 as the hottest year on record. Polls show people care about climate change and its impacts. The Banner is launching Encyclopedia Climatica, a new effort featuring burning questions about the climate and environment. Submit your questions about climate and the environment to the Banner online at tinyurl.com/banner-climate-questions."
        },
        {
            "published_date": "2025-04-17T15:01:52",
            "title": "A mysterious, 100-year solar cycle may have just restarted — and it could mean decades of dangerous space weather",
            "author": "Harry Baker",
            "url": "https://www.yahoo.com/news/mysterious-100-solar-cycle-may-150152529.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/ZBjGTThAzp0Ucifax_ppaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/82ef4270d85777b4d04c5ebf18b1a57c",
            "country": "US",
            "language": "en",
            "summary": "The current solar maximum may be due to the Centennial Gleissberg Cycle (CGC), a variation in the intensity of sunspot cycles that rises and falls every 80 to 100 years. The CGC might have just \"turned over\" or started again. This could explain why the ongoing solar maximum has ended up being much harder to predict than initially expected."
        },
        {
            "published_date": "2025-04-17T15:00:00",
            "title": "Rain possible in region this week amid ‘exceptional drought' in Mohave County",
            "author": "TAYLOR SCHWARTZ-OLSON",
            "url": "https://www.mohavedailynews.com/townnews/meteorology/rain-possible-in-region-this-week-amid-exceptional-drought-in-mohave-county/article_dcd1b7e5-8b88-5026-b848-d39ab1650c97.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/mohavedailynews.com/content/tncms/custom/image/b954e330-b3ae-11ed-8535-cfe1aff8bb88.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "Mohave and La Paz Counties are experiencing drought. March was the 29th warmest of the 131 years recorded in Arizona. Rain might be in the short and long-term forecast for the region, but it's unlikely to be much in the near future."
        },
        {
            "published_date": "2025-04-17T14:59:45",
            "title": "Australian scientists report sixth mass bleaching event on Great Barrier Reef",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250417/428cfd01254741b28962ea5adf0a8f33/c.html",
            "url_media": "https://english.news.cn/20250417/428cfd01254741b28962ea5adf0a8f33/zxcode_20250417428cfd01254741b28962ea5adf0a8f33.jpg",
            "country": "CN",
            "language": "en",
            "summary": "The Great Barrier Reef experienced a mass coral bleaching event in the summer of 2024-25 due to prolonged heat stress. It is the sixth mass bleaching on the reef since 2016 and the second time in a row it has happened in consecutive years. The head of oceans at the World Wide Fund for Nature said bleaching is \"becoming the new normal\" for the reef."
        },
        {
            "published_date": "2025-04-17T14:30:00",
            "title": "Save climate funding",
            "author": "Daniel Salamon",
            "url": "https://www.qchron.com/opinion/letters_to_the_editor/save-climate-funding/article_1ca8f8b4-a642-46e2-bf8b-85c219816a3d.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/qchron.com/content/tncms/custom/image/cb4307cc-ba65-11e7-a449-77ff8e00a1ca.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "Queens homeowners should be afraid of action the Trump administration is about to rain down on them. Trump pulled federally approved funding to improve climate resilience and is gunning for New York's Climate Superfund Act. New York stands to see the loss of 80,000 homes to sea level rise, many of them in Queens. Gov. Hochul must stand up to Trump's harmful actions."
        },
        {
            "published_date": "2025-04-17T14:08:45",
            "title": "Europe, fastest-warming continent, endures hottest year in 2024",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250417/70d6e633a44a49b9b187de6d4bb93f65/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves and unprecedented climate extremes. At least 335 people lost their lives and 413,000 were affected by storms and floods. The proportion of electricity generation by renewables in Europe reached a record high in 2024."
        },
        {
            "published_date": "2025-04-17T14:00:00",
            "title": "Six months after Hurricane Helene, Washington's promises of aid remain empty",
            "author": "Lynne Russo",
            "url": "https://thehill.com/opinion/congress-blog/5251896-hurricane-helene-recovery-paralyzed",
            "url_media": "https://thehill.com/wp-content/uploads/sites/2/2025/01/AP25024650083213-e1737742364151.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump promised to help Western North Carolina recover from Hurricane Helene two and a half months ago, but the region has not received any federal aid. The recovery from the hurricane will require more than $60 billion. Wildfires threaten to deepen the devastation. Washington's failure is America's failure."
        },
        {
            "published_date": "2025-04-17T14:00:00",
            "title": "Opinion - 6 months after Hurricane Helene, Washington's promises of aid remain empty",
            "author": "Lynne Russo",
            "url": "https://www.yahoo.com/news/opinion-6-months-hurricane-helene-140000837.html",
            "url_media": "https://media.zenfs.com/en/the_hill_articles_341/12d58ce7f650220fda791161249a5b09",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Helene devastated Western North Carolina two and a half months ago. Donald Trump visited the region five days into his presidency and promised to help the region recover and rebuild. The region has not received any federal aid despite Congress approving $110 billion in disaster relief in December. Wildfires threaten to deepen the devastation."
        },
        {
            "published_date": "2025-04-17T13:52:15",
            "title": "Australians' trust in U.S. falls to new low: poll",
            "author": "huaxia",
            "url": "https://english.news.cn/asiapacific/20250417/a6a1133032944d91a8f47ce8fe61248f/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Australians' trust in the United States has fallen 20 points since the start of the second Trump presidency. The previous low was recorded in 2020 when 51 percent of participants said they trust the U.S. to act responsibly either \"somewhat\" or \"a great deal\". The trust has since fallen to 65 percent in 2022."
        },
        {
            "published_date": "2025-04-17T13:41:00",
            "title": "Storm hits Himachal, damages crops and power lines",
            "author": "",
            "url": "https://www.freshplaza.com/north-america/article/9724394/storm-hits-himachal-damages-crops-and-power-lines",
            "url_media": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/StockPhotos/Climate/Climate_FP_img_0130.jpg?preset=OgImage",
            "country": "NL",
            "language": "en",
            "summary": "A thunderstorm with high-velocity winds of 50 to 100 km/h, accompanied by lightning and rain, swept across Himachal Pradesh, India. This weather event disrupted normal activities, uprooted trees and damaged power lines, leaving many areas without electricity. The storm inflicted damage on crops, including wheat in the plains and apples in hilly regions like Shimla, Kullu, and Chamba. A flash flood blocked the Pangi-Udaipur road, leaving 66 police personnel and government staff stranded."
        },
        {
            "published_date": "2025-04-17T13:30:00",
            "title": "A Prairie Welcoming Party for the Sandhill Cranes",
            "author": "Erinn Springer",
            "url": "https://www.myheraldreview.com/a-prairie-welcoming-party-for-the-sandhill-cranes/article_db3c47ce-f096-4fd6-b182-91d796952639.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/myheraldreview.com/content/tncms/assets/v3/editorial/8/09/8094a954-b796-4d90-b723-cfcb534a45eb/67fec46217147.image.jpg?crop=1609%2C844%2C0%2C63&resize=1200%2C629&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Hundreds of thousands of sandhill cranes have converged on the Platte River Valley in central Nebraska each spring. They rest and refuel on their annual path from the southern U.S. and Mexico to the Arctic regions of Canada, Alaska and Siberia, where they breed. Jane Goodall tries to make the trip every year to witness the phenomenon."
        },
        {
            "published_date": "2025-04-17T13:22:45",
            "title": "Surigao Sunset",
            "author": "Ivy Marie Mangadlao",
            "url": "https://mindanews.com/photo-of-the-day/2025/04/surigao-sunset",
            "url_media": "https://mindanews.com/wp-content/uploads/2025/04/17sunset-copy.jpg",
            "country": "PH",
            "language": "en",
            "summary": "Fishermen return to shore aboard their boats as the sun sets in Barangay Mabua, Surigao City on Thursday (17 April 2024). MindaNews photo by IVY MARIE MANGADLAO shows fishermen returning to shore."
        },
        {
            "published_date": "2025-04-17T13:15:06",
            "title": "Dogs Are Bad for the Environment, Report Claims",
            "author": "Paul Tamburro",
            "url": "https://www.yahoo.com/news/dogs-bad-environment-report-claims-131506886.html",
            "url_media": "https://media.zenfs.com/en/dog_time_927/e2ab77ec770ff6abaa1a8cbe2384daea",
            "country": "US",
            "language": "en",
            "summary": "A report claims that dogs are bad for the environment. According to the report, the environmental impact of owned dogs is 'far greater, more insidious, and more concerning than is generally recognized' The report was published in Australia's Pacific Conservation Biology journal. The number of dogs contributes to global carbon emissions, water and land use via the pet food industry and the dog food industry's environmental footprint is 'enormous and growing'"
        },
        {
            "published_date": "2025-04-17T13:14:00",
            "title": "ELIUD OWALO: Transforming lives the BETA way through blue economy",
            "author": "ELIUD OWALO",
            "url": "https://www.the-star.co.ke/opinion/2025-04-17-owalo-transforming-lives-the-beta-way-through-blue-economy",
            "url_media": "https://cdn.radioafrica.digital/image/2025/04/8042079d-3427-4473-a5ef-fbaef4a36943.jpg?1744898798703",
            "country": "KE",
            "language": "en",
            "summary": "Kenya's Blue Economy has the potential to generate up to Sh500 billion annually, about 3.3 per cent of GDP in 2023. However, it contributed just 0.6 per cent in 2017. The government is harnessing aquatic and maritime resources to create jobs, fight poverty and uplift livelihoods in the Blue Economy."
        },
        {
            "published_date": "2025-04-17T13:13:00",
            "title": "Drought Update: Abnormally dry to severe conditions continue",
            "author": "Jim Howard",
            "url": "https://www.witn.com/2025/04/17/drought-update-abnormally-dry-severe-conditions-continue",
            "url_media": "https://gray-witn-prod.gtv-cdn.com/resizer/v2/I2TVDP7CW5B47KQEVEFDRW4PYQ.JPG?auth=0a45957b58f5d06fb1dfe48f2df350eac6f92c43ae9d6371d13a7c1e627fc574&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "The latest drought update shows no improvements across eastern North Carolina. The severe drought conditions continue across western Onslow County and are expanding into portions of Craven & Pender Counties. The next chance of rain is next week.   .    "
        },
        {
            "published_date": "2025-04-17T13:04:04",
            "title": "Eco guilt strikes most Americans four times a month",
            "author": "Talker Research",
            "url": "https://www.elpasoinc.com/lifestyle/outdoors/eco-guilt-strikes-most-americans-four-times-a-month/article_c1f09314-1d4a-56a9-897a-64866f28f4be.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/elpasoinc.com/content/tncms/assets/v3/editorial/7/4b/74b6ff27-a5ed-52cc-80e8-c2996dfae64a/6800fedab3dfe.image.jpg?crop=1500%2C788%2C0%2C168&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The average American experiences 48 days of annual 'eco guilt' because they feel they could be doing more to help the environment, according to the study.       .   \"Eco-guilt\" is a feeling that one should do more for the environment. "
        },
        {
            "published_date": "2025-04-17T13:04:04",
            "title": "Eco guilt strikes most Americans four times a month",
            "author": "Talker Research",
            "url": "https://www.mdjonline.com/plus/eco-guilt-strikes-most-americans-four-times-a-month/article_a2b08ae0-faa6-51b9-bbbb-4877c1ac8ab1.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/mdjonline.com/content/tncms/assets/v3/editorial/0/66/0666912c-4e04-51f6-9d36-f2130d1fb432/6800ff05f0014.image.jpg?crop=1500%2C788%2C0%2C168&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The average American experiences 48 days of annual 'eco guilt' because they feel they could be doing more to help the environment, according to the talker.news report. It's part of the BLOX Digital Content Exchange, which is part of BLOX Media Exchange."
        },
        {
            "published_date": "2025-04-17T13:03:15",
            "title": "A Sure Sign of Civilizational Decline Is A 21-Year Old Who Wants to Make Her 15-Year Old Self Proud of Her \"Climate Anxiety\"",
            "author": "Thomas J Shepstone",
            "url": "https://energysecurityfreedom.substack.com/p/the-surest-sign-of-civilizational",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa8ff11f4-48b7-4ed6-8d21-19fea840b85c_1500x1000.heic",
            "country": "US",
            "language": "en",
            "summary": "JoNova shares a story about young people's concern about climate change and eco-anxiety. Alexa Stuart, 21, has been worried about the climate since she was 15. She gatecrashed PM Anthony Albanese's campaign pitstop earlier this month to protest the federal government's climate policies."
        },
        {
            "published_date": "2025-04-17T13:00:00",
            "title": "The New York Times' Claim That Climate Change Threatens the Global Economy Is False",
            "author": "Anthony Watts",
            "url": "https://wattsupwiththat.com/2025/04/17/the-new-york-times-claim-that-climate-change-threatens-the-global-economy-is-false",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/04/NYT-economic-doomsday-fake-news2.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "David Gelles wrote an article in the New York Times about the economic impact of climate change. The article is based on faulty analysis and a flawed understanding of economics and history. The IPCC's high-emissions pathway, RCP8.5, is increasingly implausible. Global and regional GDPs have continued to increase, more people are in poverty, and fewer are mired in poverty."
        },
        {
            "published_date": "2025-04-17T12:34:33",
            "title": "Grimston reader's stunning photos of Northern Lights over Bawsey ruins",
            "author": "Jeremy Ransome",
            "url": "https://www.lynnnews.co.uk/news/reader-s-stunning-photos-of-northern-lights-over-ruins-9413505",
            "url_media": "https://www.lynnnews.co.uk/_media/img/34FNGCDEPC387LVLGFCH.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Julie Smart took photos of Northern Lights over Bawsey ruins on Wednesday night. The current solar storm has weakened but with overall solar activity remaining high, more sightings are expected in coming weeks and months. The Sun is currently at a maximum in its 11-year solar cycle."
        },
        {
            "published_date": "2025-04-17T12:09:11",
            "title": "Scientists report sixth mass bleaching event on Great Barrier Reef",
            "author": "Climate",
            "url": "https://news.cgtn.com/news/2025-04-17/Scientists-report-sixth-mass-bleaching-event-on-Great-Barrier-Reef-1CEkkWNFi5W/p.html",
            "url_media": "https://news.cgtn.com/news/2025-04-17/Scientists-report-sixth-mass-bleaching-event-on-Great-Barrier-Reef-1CEkkWNFi5W/img/56f93d1748a7458585fc911a6d240c23/56f93d1748a7458585fc911a6d240c23-1920.png",
            "country": "CN",
            "language": "en",
            "summary": "The Great Barrier Reef experienced a mass coral bleaching event in the summer of 2024-25. It is the sixth mass bleaching on the reef since 2016 and the second time in two years that it has happened in consecutive years. Of 162 inshore and mid-shelf reefs monitored from the air, 41 percent recorded medium to high bleaching prevalence."
        },
        {
            "published_date": "2025-04-17T12:00:00",
            "title": "Taking the pulse: are the Swiss losing interest in climate change fight?",
            "author": "Simon Bradley",
            "url": "https://www.swissinfo.ch/eng/climate-change/taking-the-pulse-are-the-swiss-losing-interest-in-climate-change-fight/89177330",
            "url_media": "https://www.swissinfo.ch/content/wp-content/uploads/sites/13/2025/04/655404330_highres.jpg?ver=5aa2d2b8&fit=1200,800",
            "country": "CH",
            "language": "en",
            "summary": "There was a climate protest in Bern's main square in September 2019. Around 6,000 people attended the protest. Switzerland is already suffering from hot summers, melting glaciers, and snow-poor winters. In February, voters rejected the ambitious 'environmental responsibility' initiative, while 53% opposed a proposal to expand the motorway network."
        },
        {
            "published_date": "2025-04-17T11:52:54",
            "title": "The climate crisis truth that Trump's re-election helped expose",
            "author": "Mike Berners-Lee",
            "url": "https://www.independent.co.uk/climate-change/trump-climate-crisis-truth-cop-27-b2735052.html",
            "url_media": "https://static.independent.co.uk/2025/04/16/15/13/GettyImages-1925904618.jpg?trim=116,0,117,0&width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "After three decades of climate meetings, the carbon emissions curve is still rising year-on-year. Every year we are making the climate worse by a larger amount than the year before. The climate Cops have been perverted almost from the beginning by the cynical, well-funded and effective action of vested business interests. Trump's election shows that our climate response has been hopeless. The first step is to frame our response in a new way. We need to create an environment in which the price that is paid for being found to have deliberately misled the public is so high that it is not worth the risk of being caught."
        },
        {
            "published_date": "2025-04-17T11:45:04",
            "title": "Peter Dutton insists he 'believes in climate change' after refusing to say if impacts of global heating worsening",
            "author": "Dan Jervis-Bardy",
            "url": "https://news.knowledia.com/all/all/articles/peter-dutton-insists-he-believes-in-climate-change-after-refusing-to-9e78b1dae28909f18e19d79d190265e647faa34a",
            "url_media": "https://i.guim.co.uk/img/media/ea382b2e109c5b41dd94b612858314624516b0cd/226_342_7304_4382/master/7304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5083b341c3c1a08c2d18a64545c75df1",
            "country": "FR",
            "language": "en",
            "summary": "Peter Dutton refused to state if the impacts of climate change were worsening in his home state of Queensland during Wednesday night's election leaders' debate. The prime minister, Anthony Albanese, seized on Dutton's comments and asked him if he believes in gravity. Leading climate and environment groups were alarmed at his comments."
        },
        {
            "published_date": "2025-04-17T11:45:04",
            "title": "America's retreat on foreign aid and climate is reshaping world order, Anthony Albanese says",
            "author": "Josh Butler",
            "url": "https://news.knowledia.com/all/all/articles/america-s-retreat-on-foreign-aid-and-climate-is-reshaping-world-order-16e6186ba8d6e74f033af25757e6070af7a4e311",
            "url_media": "https://i.guim.co.uk/img/media/65aeb636fe1aabbc211a4adc22735bf668559baa/0_328_7881_4731/master/7881.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c4874c752d7cc8b8af82984d8bc43678",
            "country": "FR",
            "language": "en",
            "summary": "Anthony Albanese says America's retreat from global politics is reshaping the world's political order. If re-elected at the 3 May election, Albanese's government will go further on gambling harms and violence against women. Albanese claims critics have \"weaponised\" Labor's push for an Environmental Protection Agency. Labor has been putting significant resources into the Brisbane seat of Dickson."
        },
        {
            "published_date": "2025-04-17T11:43:23",
            "title": "Europe, fastest-warming continent, endures hottest year in 2024",
            "author": "Climate",
            "url": "https://news.cgtn.com/news/2025-04-17/Europe-fastest-warming-continent-endures-hottest-year-in-2024-1CEjdR4QbCw/p.html",
            "url_media": "https://news.cgtn.com/news/2025-04-17/Europe-fastest-warming-continent-endures-hottest-year-in-2024-1CEjdR4QbCw/img/6c4c0b164b4e42cfaef9c67d16e88b97/6c4c0b164b4e42cfaef9c67d16e88b97-1920.png",
            "country": "CN",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves, and unprecedented climate extremes. At least 335 people lost their lives and 413,000 were affected by storms and floods. Europe recorded its second-highest number of days with \"strong,\" \"very strong,\" and \"extreme\" heat stress. The proportion of electricity generation by renewables in Europe reached a record high in 2024."
        },
        {
            "published_date": "2025-04-17T11:41:21",
            "title": "Marine Heatwaves Surge 3x in 80 Years Amid Climate Crisis",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/extreme-marine-heatwaves-tripled-past-80-years-study-902",
            "url_media": "https://one.newkerala.com/images/t/newkerala-com-news250.webp",
            "country": "IN",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming. Global warming is responsible for almost half of the occurrence of marine heatwaves. Rising global temperatures are making extreme ocean heat events last longer and become more intense."
        },
        {
            "published_date": "2025-04-17T11:33:10",
            "title": "Chocolate prices up by almost half in three years",
            "author": "Josie Clarke",
            "url": "https://www.standard.co.uk/business/business-news/chocolate-prices-up-by-almost-half-in-three-years-b1223013.html",
            "url_media": "https://static.standard.co.uk/2025/04/17/12/6ef8a5f9621f4f2a135874caa9f804a6Y29udGVudHNlYXJjaGFwaSwxNzQ0OTc1ODUw-2.25947049.jpg?width=1200&auto=webp&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "Farmers in England had their second worst cocoa harvest on record last year because of extreme weather. Last year's storms were 20% heavier and 10 times more likely due to climate change, according to the IPCC.    - and cocoa beans that become our Easter eggs have been really struggling."
        },
        {
            "published_date": "2025-04-17T11:29:45",
            "title": "Officials demand answers as crews work to restore power after another Puerto Rico blackout",
            "author": "Associated Press",
            "url": "https://www.whittierdailynews.com/2025/04/17/puerto-rico-blackout-2",
            "url_media": "https://www.whittierdailynews.com/wp-content/uploads/2025/04/Puerto_Rico_Blackout_09718_522dd1-1.jpg?w=1024&h=682",
            "country": "US",
            "language": "en",
            "summary": "Puerto Rico has had chronic outages due to hurricane damage and a lack of maintenance and investment in its power grid due to lack of investment in the power grid.      Â   in the U.S. territory is a US territory."
        },
        {
            "published_date": "2025-04-17T11:20:09",
            "title": "Illinois birds in crisis: Report shows major decline in local species",
            "author": "Justin Kaufmann",
            "url": "https://www.axios.com/local/chicago/2025/04/17/illinois-birds-crisis-species-sparrow-bobolink-cardinal",
            "url_media": "https://images.axios.com/NMZKQe2rG2zMWId2hnL-1JVKG_I=/0x266:5616x3425/1366x768/2025/04/16/1744822824830.jpg",
            "country": "US",
            "language": "en",
            "summary": "Birds that live in Illinois grasslands and wetlands are in serious decline, according to the North American Bird Conservation Initiative's 2025 State of the Birds report. Since 1970, nearly half of aridland birds and 43% of grassland birds across the U.S. have disappeared. There are signs of hope thanks to wetland protections, dabbling and diving duck populations have jumped 24% since 1970 and waterbirds are up 16%."
        },
        {
            "published_date": "2025-04-17T11:19:55",
            "title": "THIS IS THE GREATEST THREAT TO ALL LIFE ON EARTH — Dane Wigington – [your]NEWS",
            "author": "SGT Report",
            "url": "https://yournews.com/2025/04/17/3380652/this-is-the-greatest-threat-to-all-life-on-earth",
            "url_media": "https://cdn.yournews.com/wp-content/uploads/2025/04/1280_Dane.png",
            "country": "US",
            "language": "en",
            "summary": "Geoengineering Watch's Dane Wigington returns to SGT Report to discuss the single greatest threat to humanity and life on earth. They are spraying us to death with 'chemtrails' and new evidence indicates they are waging biological warfare from the skies. The future of humanity depends on the greatest uprising to stop it."
        },
        {
            "published_date": "2025-04-17T11:15:52",
            "title": "Study reveals surprising factor that increases risk of death during heat waves: 'We believe the risk is higher'",
            "author": "Kristen Lawrence",
            "url": "https://www.yahoo.com/news/study-reveals-surprising-factor-increases-111552721.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/x7aJsqEmHxytv4yGzUpAQA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/5df1eaf15b90062c67fbd92154d16faa",
            "country": "US",
            "language": "en",
            "summary": "New research from the University of Queensland in Australia shows that heat wave-related deaths are rising because of human-caused warming. Urban dwellers with low income, less education, diabetes, and limited access to healthcare are most vulnerable to heat-related death."
        },
        {
            "published_date": "2025-04-17T11:06:41",
            "title": "Climate First Bank Appoints Richard Prescott to Expand Presence in Volusia County",
            "author": "",
            "url": "https://apnews.com/press-release/access-newswire/richard-prescott-climate-change-rachel-kent-john-collins-9ad56768c4e1a5b7821a14655fbc40cb",
            "url_media": "https://dims.apnews.com/dims4/default/2148dcb/2147483647/strip/true/crop/1170x658+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fd0%2F0d7cacb737d79f6143db1d68c6ef%2Ffdeaacb46bd638661fd5ab91e6a49660",
            "country": "US",
            "language": "en",
            "summary": "Richard Prescott is the new First-VP, Commercial Banker at Climate First Bank. He has over 14 years of experience in commercial lending, including conventional mortgages and vacant land loans. He also has deep community ties in Volusia County and DeLand, Florida. He will help the bank grow in DeLand and Volusias County."
        },
        {
            "published_date": "2025-04-17T11:00:00",
            "title": "Sustainability 2025: Bending Without Breaking",
            "author": "Debra Fitzgerald",
            "url": "https://doorcountypulse.com/bending-without-breaking",
            "url_media": "https://doorcountypulse.com/wp-content/uploads/2025/04/Snow-Woods-RCP-2-1-scaled.jpg",
            "country": "US",
            "language": "en",
            "summary": "This Earth Day, Peninsula Pulse is marking Earth Day with its special Sustainability Issue. People are taking action to prepare for climate change and build resilience in Door County, Wisconsin. The first Earth Day was spearheaded by Wisconsin's own Senator Gaylord Nelson to raise environmental awareness."
        },
        {
            "published_date": "2025-04-17T10:59:00",
            "title": "Billions of cicadas set to buzz East Coast",
            "author": "News 12 Staff",
            "url": "https://bronx.news12.com/billions-of-cicadas-set-to-buzz-east-coast",
            "url_media": "https://images-cf.news12static.com/3kqcuzntcg31/4eU62ZqGC8QNKjsuZ5e7ml/72d18c856e519660fdf058e2f045f114/05d07a3e-d7b3-4a20-a9d6-bd7977274d4c.jpg?fit=thumb&w=600&h=340&q=80&fm=webp",
            "country": "US",
            "language": "en",
            "summary": "The second-largest cicada brood surfaces every 17 years. It will crawl out when soil temperatures hit 64 degrees, which is expected to happen in the next few days. The temperature should reach 64 degrees by then.   for cicadas to crawl out."
        },
        {
            "published_date": "2025-04-17T10:47:45",
            "title": "Hailstorm alert issued for Islamabad amid climate concerns",
            "author": "",
            "url": "https://dailytimes.com.pk/1288292/hailstorm-alert-issued-for-islamabad-amid-climate-concerns",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/04/17/Hailstorm-in-ISB-Feat.jpeg",
            "country": "PK",
            "language": "en",
            "summary": "The Pakistan Meteorological Department has warned of a potential hailstorm in Islamabad. On Wednesday, heavy rain and large hailstones shattered car windows and partially damaged the Faisal Mosque in the capital. Senator Sherry Rehman, who chairs the Senate Standing Committee on Climate Change, highlighted the rising frequency of climate-related disruptions in Asia."
        },
        {
            "published_date": "2025-04-17T10:47:02",
            "title": "America's retreat on foreign aid and climate is reshaping world order, Anthony Albanese says",
            "author": "Josh Butler",
            "url": "https://www.theguardian.com/australia-news/2025/apr/17/americas-retreat-on-foreign-aid-and-climate-is-reshaping-world-order-anthony-albanese-says",
            "url_media": "https://i.guim.co.uk/img/media/65aeb636fe1aabbc211a4adc22735bf668559baa/0_328_7881_4731/master/7881.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c4874c752d7cc8b8af82984d8bc43678",
            "country": "GB",
            "language": "en",
            "summary": "Albanese's government will go further on addressing gambling harms and violence against women if re-elected at the 3 May poll. He claims critics have 'weaponised' Labor's push for an Environmental Protection Agency. Most polls show Labor in an election-winning lead with 52 or 53% on a two-party basis."
        },
        {
            "published_date": "2025-04-17T10:46:49",
            "title": "This Common But Gross Habit Could Land You In Hospital",
            "author": "Huffington Post",
            "url": "https://article.wn.com/view/2025/04/17/This_Common_But_Gross_Habit_Could_Land_You_In_Hospital",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "With the warmer weather comes birdsong, blossoms and spots. Experts think increased sweating and sunscreens might lead to a build-up of oil and sebum in the skin, so don't squeeze your new facial \"friends\".    . "
        },
        {
            "published_date": "2025-04-17T10:30:38",
            "title": "Scientists issue warning over threats facing newly discovered creatures: 'Literally running out of space'",
            "author": "Cody Januszko",
            "url": "https://www.yahoo.com/news/scientists-issue-warning-over-threats-103038446.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/eeNHDntJ92InfjNPJKdSDA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/c1cd102b1ac55062f905b41fac4cdb93",
            "country": "US",
            "language": "en",
            "summary": "Two new species of Whirring Tree Frogs were recently discovered in Australia. They are native to Eastern Australia's moist, cool, upland environment. They show no evidence of adaptation to warming climates, so the journal Zootaxa issued an immediate conservation warning for the frogs. They live only within a 20-kilometer area in the Eungella Mountain Range of North Queensland and hundreds of kilometers away in a similarly elevated rainforest. The continued warming of the planet will damage these cool, moist environments and force the frogs into extinction."
        },
        {
            "published_date": "2025-04-17T10:04:30",
            "title": "Canada geese season is underway, experts offer tips on how to handle the aggressive species",
            "author": "Erica Van Buren",
            "url": "https://eu.augustachronicle.com/story/news/environment/2025/04/17/georgia-department-of-natural-resources-offer-tips-on-how-to-handle-aggressive-migratory-birds/83123630007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/04/16/NAUG/83123678007-photo-canada-goose.jpg?crop=1848,1387,x0,y193?width=320&height=240",
            "country": "US",
            "language": "en",
            "summary": "This time of year there are more Canada geese in Georgia because they are starting to establish nesting sites and getting ready to nest. They are a protected species under the Migratory Bird Treaty Act. The U.S. Fish and Wildlife Service has issued regulations that allow for additional control measures to help address human-goose conflicts."
        },
        {
            "published_date": "2025-04-17T10:02:46",
            "title": "Libya Weather Forecast, Thursday, April 17, 2025",
            "author": "Mohamed Ahmed",
            "url": "https://libyaobserver.ly/news/libya-weather-forecast-thursday-april-17-2025",
            "url_media": "https://libyaobserver.ly/sites/default/files/2023-07/weatherforcast.jpg",
            "country": "LY",
            "language": "en",
            "summary": "The National Center of Meteorology (NCM) issued its weather bulletin about expected weather conditions in Libya, Thursday, April 17, 2025. The weather will be stable and moderate on Friday across most parts of the country. The temperature ranges between (23-30°C) in the Green Mountain region and up to the far eastern coast. It will range between (32–35°C in the Gulf region and the Benghazi Plain."
        },
        {
            "published_date": "2025-04-17T09:57:00",
            "title": "Dutton's Climate Denial Endangers People, Nature",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/duttons-climate-denial-endangers-people-nature-1446110",
            "url_media": "https://assets.nationbuilder.com/auscon/pages/58897/meta_images/original/header_heron_is_coral.jpg?1744846109",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton's comments on climate change in last night's leaders' debate were deeply disturbing. Australian Conservation Foundation says the Coalition is out of touch on a major issue affecting voters' lives. ACF gives the Coalition a score of 1 out of 100 on climate and nature policies."
        },
        {
            "published_date": "2025-04-17T09:55:17",
            "title": "NDMA warns of searing heatwaves, wildfires, cyclones in summer forecast",
            "author": "Naveed Chaudhary",
            "url": "https://24newshd.tv/17-Apr-2025/ndma-warns-of-searing-heatwaves-wildfires-cyclones-in-summer-forecast",
            "url_media": "https://24newshd.tv/digital_images/large/2025-04-17/representational-image-1744883703-6963.jpg",
            "country": "TV",
            "language": "en",
            "summary": "National Disaster Management Authority (NDMA) has forecast extreme summer conditions, warning of intensifying heatwaves that could heighten the risk of wildfires in mountainous regions of Khyber Pakhtunkhwa, Balochistan, the Potohar region, Murree and nearby areas. The report indicates that the summer season will bring higher-than-normal temperatures and below-average rainfall."
        },
        {
            "published_date": "2025-04-17T09:50:00",
            "title": "Leichhardt Candidates Admit Climate Change Amid Reef Bleach",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/leichhardt-candidates-admit-climate-change-amid-1446452",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=pbs.twimg.com%2Fprofile_images%2F828447353271037952%2FTB5ynuvL_400x400.jpg",
            "country": "US",
            "language": "en",
            "summary": "Liberal and Labor candidates acknowledge human-induced climate change is harming the Great Barrier Reef at Leichhardt community forum. Reef Authority yesterday confirmed a sixth mass bleaching event in just nine years. The next Australian Government must rapidly cut climate pollution and commit to no new fossil fuel approvals."
        },
        {
            "published_date": "2025-04-17T09:49:45",
            "title": "Extreme marine heatwaves tripled over past 80 years: study",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250417/4ab159d3d6784ac188912cb8abb90d68/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming. Global warming is responsible for almost half of the occurrence of marine heatwaves, according to a new study. The study was published in the journal Proceedings of the National Academy of Sciences."
        },
        {
            "published_date": "2025-04-17T09:45:00",
            "title": "Dutton's Climate Denial Betrays Regional Communities",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/duttons-climate-denial-betrays-regional-1446095",
            "url_media": "https://greens.org.au/sites/default/files/styles/alt_box/public/2021-03/web_20-10-31%20Election%20Party-32_1.jpg?itok=1c7u0LLt",
            "country": "US",
            "language": "en",
            "summary": "The Greens say Peter Dutton's refusal to admit climate change is impacting rural and regional communities is a disgrace. Senator Peter Whish-Wilson says there is no bigger threat to Australian farmers than a future of climate breakdown. The science tells us that as emissions rise and the planet warms, extreme weather such as droughts, floods and biosecurity outbreaks will become more intense and dangerous."
        },
        {
            "published_date": "2025-04-17T09:35:17",
            "title": "The increasing burden on mental health",
            "author": "",
            "url": "https://www.ahmedabadmirror.com/from-heat-to-pain/81889422.html",
            "url_media": "https://media.ahmedabadmirror.com/am/uploads/mediaGallery/image/1744826344721.jpg-org",
            "country": "IN",
            "language": "en",
            "summary": "Rising temperatures could increase the burden of mental and behavioural disorders like schizophrenia and depression by almost 50 per cent by 2050, according to a new study by the University of Adelaide. High temperatures contributed to an annual loss of 8,458 disability-adjusted life years (DALYs) in Australia. Young people aged 15 to 44 are particularly affected, with most losses linked to living with poor mental health."
        },
        {
            "published_date": "2025-04-17T09:30:43",
            "title": "Commentary: With hurricane season looming, NOAA cuts make Florida less safe",
            "author": "Jon Paul J P Brooker",
            "url": "https://www.orlandosentinel.com/2025/04/17/commentary-with-hurricane-season-looming-noaa-cuts-make-florida-less-safe",
            "url_media": "https://www.orlandosentinel.com/wp-content/uploads/2023/11/Jon-Paul-J.P.-Brooker-e1744741864435.jpg?w=840&h=459",
            "country": "US",
            "language": "en",
            "summary": "There are less than two months until the start of the hurricane season. The Trump administration plans to cut NOAA's budget for weather and climate research by 25%. NOAA provides accurate information about approaching hurricanes' strength, direction, timing and potential impact. This past September, in preparation for Hurricane Helene, the St. Petersburg, Florida, family lost their car and nearly half of their house."
        },
        {
            "published_date": "2025-04-17T09:28:00",
            "title": "Dutton's Climate Denial Threatens People and Nature",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/duttons-climate-denial-threatens-people-and-1446081",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2017/11/news-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton's comments on climate change in last night's leaders' debate were disturbing. Australian Conservation Foundation says the Coalition is out of touch on a major issue affecting voters' lives. ACF's assessment of parties' and candidates' climate and nature policies gave the Coalition a score of 1 out of 100."
        },
        {
            "published_date": "2025-04-17T09:25:45",
            "title": "Australia opposition leader clarifies he believes in climate change after debate",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/04/17/Australia_opposition_leader_clarifies_he_believes_in_climate",
            "url_media": "https://i.ytimg.com/vi/md9-jG4RzXs/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton is facing outrage for his comments on climate change during an election debate. He said: \"I don't believe in global warming.\"       in an interview with The Guardian newspaper.  in which he was responding to a question about climate change."
        },
        {
            "published_date": "2025-04-17T09:05:46",
            "title": "Climate change takes its toll on Gulf of Maine shrimp: Irwin",
            "author": "Tom Irwin",
            "url": "https://www.seacoastonline.com/story/opinion/columns/2025/04/17/climate-change-takes-its-toll-on-gulf-of-maine-shrimp-irwin/83118974007",
            "url_media": "https://www.seacoastonline.com/gcdn/authoring/authoring-images/2025/01/22/NPOH/77873266007-tom-irwin.jpg?crop=1448,815,x0,y219&width=1448&height=815&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "The Atlantic Northern Shrimp fishery in New Hampshire and Maine has been closed down due to climate change. The shrimp fishery was a touchstone for the coastal communities and families in the two states. A 2012 heatwave may have pushed the population over the edge by creating conditions too warm for the shrimp."
        },
        {
            "published_date": "2025-04-17T09:01:42",
            "title": "Noah's Flood",
            "author": "Gerald Therrien",
            "url": "https://geraldtherrien.substack.com/p/noahs-flood",
            "url_media": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fgeraldtherrien.substack.com%2Ftwitter%2Fsubscribe-card.jpg%3Fv%3D1600911644%26version%3D9",
            "country": "US",
            "language": "en",
            "summary": "Noah's Flood is a book about the great flood of 5600 BC. William Ryan and Walter Pitman discuss the archeological and geological discoveries and the scientific inventions that made them possible. People from the Levant, Mesopotamia, Anatolia, southeastern Europe, Ukraine and southern Russia migrated to the Black Sea to escape the flood. The Mediterranean Sea rose 500 feet and flooded the Bosporus."
        },
        {
            "published_date": "2025-04-17T09:00:00",
            "title": "Huey Perry: An off-the-wall idea to solve Fourpole flooding",
            "author": "",
            "url": "https://www.herald-dispatch.com/opinion/huey-perry-an-off-the-wall-idea-to-solve-fourpole-flooding/article_9737023b-4e7e-470e-99ce-da0f02b5b031.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/herald-dispatch.com/content/tncms/assets/v3/editorial/4/88/488e3fe6-bbb5-11ef-ac02-4773cdfab433/67603131c23da.image.jpg?crop=1254%2C658%2C0%2C496&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Flooding in the Enslow area is getting worse as a result of climate change. Gilbert in Mingo County, West Virginia, has had two major floods in one month. The long, powerful streams of moisture are now reaching the East Coast and dumping heavy rainfall on areas like Huntington."
        },
        {
            "published_date": "2025-04-17T08:59:00",
            "title": "Mildura Gears Up For Conversations About 'BIG' Weather",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/mildura-gears-up-for-conversations-about-big-1446225",
            "url_media": "https://www.mildura.vic.gov.au/files/sharedassets/public/v/1/social-media-tile-3.png?dimension=pageimage&w=480",
            "country": "US",
            "language": "en",
            "summary": "Let's Talk About BIG Weather is an initiative, led by Make a Change Australia in partnership with Mildura Rural City Council, Mallee Catchment Management Authority and Mallee Family Care. It will include two community events in June, offering practical information and discussions on how people can make their homes, businesses and outdoor spaces more resilient."
        },
        {
            "published_date": "2025-04-17T08:58:46",
            "title": "Türkiye braces for one of hottest, driest summers: Expert",
            "author": "Hürriyet Daily News",
            "url": "https://article.wn.com/view/2025/04/17/Turkiye_braces_for_one_of_hottest_driest_summers_Expert",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change is intensifying and Türkiye is poised to be hit hard by the effects of climate change. It is affecting the lives of people all over the world, especially in Türkcey.    in particular in the country. "
        },
        {
            "published_date": "2025-04-17T08:47:42",
            "title": "Peter Dutton: Australia opposition leader clarifies he believes in climate change after debate",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/04/17/Peter_Dutton_Australia_opposition_leader_clarifies_he_believ",
            "url_media": "https://i.ytimg.com/vi/md9-jG4RzXs/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton is facing outrage for his comments on climate change during an election debate. He said: \"I don't believe in global warming.\"       in an interview with The Guardian newspaper.  in which he was responding to a question about climate change."
        },
        {
            "published_date": "2025-04-17T08:42:03",
            "title": "Europe becomes fastest-warming continent, endured hottest year in 2024",
            "author": "Sambad English Bureau",
            "url": "https://sambadenglish.com/punascha-pruthibi/europe-becomes-fastest-warming-continent-endured-hottest-year-in-2024-8971799",
            "url_media": "https://img-cdn.publive.online/fit-in/1200x675/sambad-english/media/media_files/2025/04/17/o6Z531vNMTsIkDVahUKr.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves, and unprecedented climate extremes. At least 335 people died and 413,000 were affected by extreme weather events last year. The proportion of electricity generation by renewables in Europe reached a record high in 2024."
        },
        {
            "published_date": "2025-04-17T08:40:00",
            "title": "Climate change threatens world's supply of blood, study warns",
            "author": "",
            "url": "https://www.straitstimes.com/world/climate-change-threatens-worlds-supply-of-blood-study-warns",
            "url_media": "https://cassette.sphdigital.com.sg/image/straitstimes/f35da2245eddda289df0b9cdb00b48b43e88d2c7907647711b6ef809a595e78a",
            "country": "SG",
            "language": "en",
            "summary": "Extreme weather events and natural disasters are disrupting medical professionals' efforts to collect, test, transport and store blood. Such events make it harder for potential blood donors to travel to donation locations and slow down the transport of blood products, which have a short shelf life and are sensitive to temperature variations. The study is the first globally to look at how climate change can affect each stage of the blood supply chain based on a review of international studies."
        },
        {
            "published_date": "2025-04-17T08:33:00",
            "title": "Climate Change Threatens Global Blood Supply",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/climate-change-threatens-global-blood-supply-1446044",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=cdn.pixabay.com%2Fphoto%2F2018%2F01%2F18%2F09%2F26%2Fhospital-3089884_960_720.jpg",
            "country": "US",
            "language": "en",
            "summary": "A new study published in The Lancet Planetary Health suggests a changing climate threatens the continuous availability of safe blood across the world. Health issues, the spread of infectious disease and extreme weather exacerbated by climate change will impact the ability of people to donate blood. The study emphasises the need to reduce reliance on traditional blood supply chains and have adaptable strategies that offer rapid responses to climate change."
        },
        {
            "published_date": "2025-04-17T08:13:07",
            "title": "Agriculture And Climate Change: What Is Still Possible In The Future?",
            "author": "",
            "url": "http://agriculture.einnews.com/article_detail/804098437/lkWEyJuJ4rovCmgH",
            "url_media": "https://vertassets.blob.core.windows.net/sites/favicons/fole-favicon.ico",
            "country": "UA",
            "language": "en",
            "summary": "Emma Knol is developing a tool that shows the impact of climate change on farmers at the business level. The Netherlands is already facing drought-related problems. The number of suitable locations for the current cultivation of crops will continuously shrink, and sometimes crop cultivation will need to be relocated. The future is being illuminated by looking at other countries and developing future scenarios."
        },
        {
            "published_date": "2025-04-17T08:07:56",
            "title": "Australian PM contender's run unravels over climate crisis question",
            "author": "Stuti Mishra",
            "url": "https://www.msn.com/en-us/news/world/australian-pm-contender-s-run-unravels-over-climate-crisis-question/ar-AA1D5w9V",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton has come under fire for his comments on the climate crisis during Tuesday's election debate. Mr Dutton is the main challenger to prime minister Anthony Albanese, leading the opposition Liberal-National Coalition. Mr Albanese said his reluctance to acknowledge the scientific consensus on climate change 'stunned' him. The Climate Council said its 'outrageous for a senior political leader to be so out of touch'"
        },
        {
            "published_date": "2025-04-17T08:00:00",
            "title": "Milankovitch Cycles and Climate Deniers",
            "author": "Barry Evans",
            "url": "https://www.northcoastjournal.com/life-outdoors/milankovitch-cycles-and-climate-deniers-32608249",
            "url_media": "https://media1.northcoastjournal.com/northcoast/imager/milankovitch-cycles-and-climate-deniers/u/slideshow/32608248/field_notes-01-b28c925365a5ec46.webp?cb=1744844873",
            "country": "US",
            "language": "en",
            "summary": "Some climate deniers deny that Earth is warming, despite 19 of the last 20 years being the hottest on record. Milutin Milankovitch (1879-1958) was a Serbian mathematician, astronomer and geophysicist who founded the discipline of planetary climatology in the 1920s. He identified three major variables, eccentricity, axial tilt and precession, which have affected Earth's climate over the long term."
        },
        {
            "published_date": "2025-04-17T07:30:40",
            "title": "Roundup: Europe, fastest-warming continent, endures hottest year in 2024",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/04/17/Roundup_Europe_fastestwarming_continent_endures_hottest_year",
            "url_media": "https://i.ytimg.com/vi/meNUiglbjoc/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves, and unprecedented climate extremes, according to a joint report released this week by the World Meteorological and World Weather Service.   Â   .   "
        },
        {
            "published_date": "2025-04-17T07:30:00",
            "title": "William Kim: NC Farm Act will help save region's dying soil",
            "author": "",
            "url": "https://www.reflector.com/opinion/editorial_columnists/william-kim-nc-farm-act-will-help-save-regions-dying-soil/article_0c56be7a-f38b-4372-a87d-4c979be62914.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/reflector.com/content/tncms/assets/v3/editorial/7/17/717aba74-0cfb-4dd1-bb98-b9a9dccdbeab/67fe876df061f.image.jpg?crop=301%2C301%2C0%2C98&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "It takes soil centuries to form a single inch of healthy topsoil and we are contributing to its degradation faster than ever before. It's hard to grow food without pesticides and other harmful agricultural practices. Eastern North Carolina communities are especially affected by this environmental problem because they depend more on an agriculture-based economy."
        },
        {
            "published_date": "2025-04-17T07:00:00",
            "title": "Major hurricane conference kicks off in New Orleans. Federal experts were missing.",
            "author": "JOSIE ABUGOV",
            "url": "https://www.virginislandsdailynews.com/news/major-hurricane-conference-kicks-off-in-new-orleans-federal-experts-were-missing/article_597557c5-77b3-4b73-8d5c-9b65977183c0.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/virginislandsdailynews.com/content/tncms/custom/image/95b63ab2-a8b4-11e5-8204-cfb6801a818b.jpg?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "The annual national conference on the threat of hurricanes kicked off in New Orleans early this week. It is taking place without the usual presence of experts from the federal government due to cost-saving measures put in place by President Donald Trump's administration. The conference is also taking place with the White House reportedly planning major cuts to the National Oceanic and Atmospheric Administration."
        },
        {
            "published_date": "2025-04-17T06:34:26",
            "title": "The Coalition needs a ‘wakeup call' in response to climate change answers: Anthony Albanese",
            "author": "",
            "url": "https://www.skynews.com.au/australia-news/politics/the-coalition-needs-a-wakeup-call-in-response-to-climate-change-answers-anthony-albanese/video/02330d6234c656078929ed49ccf51861",
            "url_media": "https://content.api.news/v3/images/bin/eb8c10512da79acfa17de6342274d2f0",
            "country": "AU",
            "language": "en",
            "summary": "Peter Dutton said he's not a scientist when asked about climate change at the debate on Wednesday evening. Prime Minister Anthony Albanese is 'stung' that someone running for PM in 2025 can't say that the science is clear that climate change is real and it's happening."
        },
        {
            "published_date": "2025-04-17T06:31:16",
            "title": "Liberia Prepares to Elevate Priorities of Marginalized Groups in its NDCs",
            "author": "",
            "url": "https://frontpageafricaonline.com/opinion/press-release/liberia-prepares-to-elevate-priorities-of-marginalized-groups-in-its-ndcs",
            "url_media": "https://frontpageafricaonline.com/wp-content/uploads/2025/04/Screenshot-2025-04-17-062905.jpg",
            "country": "LR",
            "language": "en",
            "summary": "The Government of Liberia is holding a National Dialogue on integrating the priorities of Youth, Children, Gender and People with Disabilities in Liberia's NDC 3.0 development process from April 17-19, 2025 in Ganta, Nimba County. Over 70% of Liberia's population is under the age of 35 and there are growing vulnerabilities due to climate impacts. The dialogue will feature panel discussions, technical sessions and working groups on youth advocacy, child-sensitive NDCs, women's leadership in climate resilience and the health impacts of climate change."
        },
        {
            "published_date": "2025-04-17T06:27:01",
            "title": "Peter Dutton insists he ‘believes in climate change' after refusing to say if impacts of global heating worsening",
            "author": "Dan Jervis-Bardy",
            "url": "https://www.theguardian.com/australia-news/2025/apr/17/peter-dutton-climate-change-global-heating-response-abc-debate-ntwnfb",
            "url_media": "https://i.guim.co.uk/img/media/ea382b2e109c5b41dd94b612858314624516b0cd/226_342_7304_4382/master/7304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5083b341c3c1a08c2d18a64545c75df1",
            "country": "GB",
            "language": "en",
            "summary": "Peter Dutton refused to state if the impacts of climate change were worsening in his home state of Queensland during Wednesday night's election leaders' debate. On Thursday, he said he 'believes in climate change and that's a reality'. The 2024 state of the climate report by Australia's science agency, Csiro, and the Bureau of Meteorology highlighted that changes to Australia's weather and climate were happening at an increased pace."
        },
        {
            "published_date": "2025-04-17T06:18:20",
            "title": "Baba Vanga's shocking predictions...Humans to start aging rapidly due to...",
            "author": "",
            "url": "https://www.india.com/viral/baba-vanga-shocking-predictions-humans-to-start-aging-rapidly-due-to-new-virus-7761224",
            "url_media": "https://static.india.com/wp-content/uploads/2025/04/Andorra.png",
            "country": "IN",
            "language": "en",
            "summary": "Baba Vanga's full name is Vangelia Pandeva Dimitrova. She is considered the Balkan Nostradamus of the West. Baba Vanga lost her eyesight in childhood, after which she gained the ability to see the future. Many of her predictions have proved to be true to a large extent."
        },
        {
            "published_date": "2025-04-17T06:16:06",
            "title": "The impact of atmospheric rivers on Antarctic ice sheet",
            "author": "Rishav Kothari",
            "url": "https://watchers.news/2025/04/17/the-impact-of-atmospheric-rivers-on-antarctic-ice-sheet",
            "url_media": "https://watchers.news/wp-content/uploads/2025/04/Antartica_AR_on_March_17_2022.webp",
            "country": "US",
            "language": "en",
            "summary": "Atmospheric rivers (ARs) are capable of transporting large volumes of water vapor and driven by strong low-level winds. They can cause extreme precipitation and flooding, especially when they stall over flood-prone watersheds. In the past, ARs have been linked to ice shelf collapse."
        },
        {
            "published_date": "2025-04-17T05:32:40",
            "title": "Peter Dutton's climate comments draw criticism from scientists, advocates and affected communities",
            "author": "climate reporter",
            "url": "https://www.abc.net.au/news/2025-04-17/dutton-debate-climate-change-policy/105186658",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/2fd4feb4b2d46387737475594b6d39a1?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=166&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Peter Dutton refused to say whether Australia is experiencing the worsening impacts of climate change. Extreme weather events are becoming more frequent and severe, and natural disasters like the 2022 Queensland floods have driven up insurance premiums. Professor Sarah Perkins-Kirkpatrick from the Australian National University is frustrated by Dutton's comments. Elly Baxter, a senior campaigner for the Climate Action Network Australia (CANA), is also frustrated."
        },
        {
            "published_date": "2025-04-17T05:32:00",
            "title": "Warming World May Slash Holiday Flight Passengers",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/warming-world-may-slash-holiday-flight-1445935",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1587955415524-bb264e518428%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "By the 2060s, some airports with shorter runways may need to reduce their maximum take-off weight by the equivalent of 10 passengers per flight during summer months. Hot summer days will get more common. Mediterranean tourist destinations will be most affected. Airlines might need to reschedule flights to cooler parts of the day."
        },
        {
            "published_date": "2025-04-17T05:31:05",
            "title": "Extreme marine heat waves tripled over past 80 years, study finds",
            "author": "Climate",
            "url": "https://news.cgtn.com/news/2025-04-17/Extreme-marine-heat-waves-tripled-over-past-80-years-study-finds-1CDJgv81SW4/p.html",
            "url_media": "https://news.cgtn.com/news/2025-04-17/Extreme-marine-heat-waves-tripled-over-past-80-years-study-finds-1CDJgv81SW4/img/6cd242635c104a74a3ad818bb1d031d5/6cd242635c104a74a3ad818bb1d031d5-750.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming. Global warming is responsible for almost half of the occurrence of marine heat waves. Rising global temperatures are making extreme ocean heat events last longer and become more intense."
        },
        {
            "published_date": "2025-04-17T05:23:30",
            "title": "Locals bunker down to be cut off as cyclone nears land",
            "author": "Savannah Meacham",
            "url": "https://www.theadvocate.com.au/story/8944919/locals-bunker-down-to-be-cut-off-as-cyclone-nears-land",
            "url_media": "https://www.theadvocate.com.au/images/transform/v1/crop/frm/silverstone-feed-data/844174b2-038e-42af-b806-b94a5fe9f973.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Herbie Stewart has lived through many cyclones in Western Australia's Dampier Peninsula, but it never gets easier being cut off for weeks. He's been cut off many times before. He lives through cyclones very well. He has lived with them for a long time."
        },
        {
            "published_date": "2025-04-17T05:23:30",
            "title": "Locals bunker down to be cut off as cyclone nears land",
            "author": "Savannah Meacham",
            "url": "https://www.theleader.com.au/story/8944919/locals-bunker-down-to-be-cut-off-as-cyclone-nears-land",
            "url_media": "https://www.theleader.com.au/images/transform/v1/crop/frm/silverstone-feed-data/844174b2-038e-42af-b806-b94a5fe9f973.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Herbie Stewart has lived through many cyclones in Western Australia's Dampier Peninsula, but it never gets easier being cut off for weeks. He's been cut off many times before. He lives through cyclones very well. He has lived with them for a long time."
        },
        {
            "published_date": "2025-04-17T05:23:30",
            "title": "Locals bunker down to be cut off as cyclone nears land",
            "author": "Savannah Meacham",
            "url": "https://www.bordermail.com.au/story/8944919/locals-bunker-down-to-be-cut-off-as-cyclone-nears-land",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/844174b2-038e-42af-b806-b94a5fe9f973.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Herbie Stewart has lived through many cyclones in Western Australia's Dampier Peninsula, but it never gets easier being cut off for weeks. He's been cut off many times before. He lives through cyclones very well. He has lived with them for a long time."
        },
        {
            "published_date": "2025-04-17T05:23:18",
            "title": "Climate Change Is Stressing the World's Blood Supplies",
            "author": "Rebecca Dzombak",
            "url": "https://news.knowledia.com/all/all/articles/climate-change-is-stressing-the-world-s-blood-supplies-b6b38b28471c9d6d0c724779653ae1317d4f946e",
            "url_media": "https://static01.nyt.com/images/2025/04/16/multimedia/16cli-blood-supply-01-wfhk/16cli-blood-supply-01-wfhk-videoSixteenByNineJumbo1600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Warming and extreme weather can slow blood donations, disrupt blood transport and risk the safety of transfusions, according to a new study published on Wednesday in The Lancet Planetary Health. Extreme weather events as a result of climate change can increase demand while also limiting supply, leading to blood shortages."
        },
        {
            "published_date": "2025-04-17T05:13:00",
            "title": "Short fiction: Five Stages of Hubris",
            "author": "Times",
            "url": "https://timesofmalta.com/article/short-fiction-five-stages-hubris.1108320",
            "url_media": "https://cdn-attachments.timesofmalta.com/c7f14ec840ac7c586578bf983ad83da7aca7a9fa-1744866910-80403d66-1200x630.jpg",
            "country": "MT",
            "language": "en",
            "summary": "Malta suffers from chronic overpopulation, collapsing infrastructure, short-sighted development policies, and climatic changes with increasingly more devastating effects on the local environment. The ultimate objective of a scientist is to develop practical, easily applicable solutions to problems. By unsubscribing, you acknowledge that your information will be transferred to Mailchimp."
        },
        {
            "published_date": "2025-04-17T05:00:36",
            "title": "John Stossel: Dispelling climate myths",
            "author": "The Daily Times",
            "url": "https://article.wn.com/view/2025/04/17/John_Stossel_Dispelling_climate_myths",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres hyped global warming risks and now he says, \"The era of global boiling has arrived\".    .   The UN Secretary-General didn't think his hyping the risks brought him enough attention, so now he's saying, "
        },
        {
            "published_date": "2025-04-17T05:00:00",
            "title": "Trump's approach to the climate crisis has done us one important favour",
            "author": "Mike Berners-Lee",
            "url": "https://www.msn.com/en-us/news/technology/trump-s-approach-to-the-climate-crisis-has-done-us-one-important-favour/ar-AA1D4MoC",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "After three decades of climate meetings, the carbon emissions curve is still rising year-on-year. Every year we are making the climate worse by a larger amount than the year before. The climate Cops have been perverted almost from the beginning by the cynical, well-funded and effective action of vested business interests. Trump's election shows that our climate response has been hopeless. The first step is to frame our response in a new way. We need to create an environment in which the price that is paid for being found to have deliberately misled the public is so high that it is not worth the risk of being caught."
        },
        {
            "published_date": "2025-04-17T04:55:26",
            "title": "Extreme marine heatwaves tripled over the past 80 years",
            "author": "Bernama",
            "url": "https://www.nst.com.my/world/world/2025/04/1203189/extreme-marine-heatwaves-tripled-over-past-80-years-study",
            "url_media": "https://assets.nst.com.my/images/articles/berheatw_1744865716.jpg",
            "country": "MY",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming. Global warming is responsible for almost half of the occurrence of marine heatwaves, according to a new study. The study was published in the journal Proceedings of the National Academy of Sciences."
        },
        {
            "published_date": "2025-04-17T04:48:09",
            "title": "Climate change: Facts about our warming planet",
            "author": "Stephanie Pappas",
            "url": "https://news.knowledia.com/all/all/articles/climate-change-facts-about-our-warming-planet-0bf46a1c8e6abc9862d5a99da630fe7753973d6e",
            "url_media": "https://cdn.mos.cms.futurecdn.net/LYcYs5Zgy2wt2aUrARwNd3.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Climate change is creating a warmer world with rising sea levels and more dangerous weather. The most dramatic changes can be seen in the Arctic, where sea ice is melting. Global sea ice levels hit a low in 2025, and scientists think we could see the first summer with no ice between 2040 and 2060."
        },
        {
            "published_date": "2025-04-17T04:39:11",
            "title": "Türkiye braces for one of hottest, driest summers: Expert",
            "author": "",
            "url": "https://www.hurriyetdailynews.com/turkiye-braces-for-one-of-hottest-driest-summers-expert-208148",
            "url_media": "https://image.hurimg.com/i/hurriyet/75/200x200/67ffff476462286b05002fb9.jpg",
            "country": "TK",
            "language": "en",
            "summary": "Türkiye is experiencing one of its hottest and driest summers due to climate change. Professor Dr. Şermin Tağıl warns of increasing drought, extreme heat and threats to agriculture and water supplies in the Mediterranean Basin. In mid-March, the country experienced unseasonably warm days resembling summer, with record-breaking temperatures recorded in 13 provinces across the country. In April, the typically warm month of April brought winter-like conditions, with sub-zero temperatures and snowfall."
        },
        {
            "published_date": "2025-04-17T04:36:32",
            "title": "Why the UAE is the place to look for answers to extreme weather",
            "author": "The National",
            "url": "https://article.wn.com/view/2025/04/17/Why_the_UAE_is_the_place_to_look_for_answers_to_extreme_weat",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": " climate change poses a threat to the planet.    for people harboured doubts about the threat climate change presents to the earth.  for more information visit: http://www.cnn.com/2013/01/20/climate-change-threatens-the-world/"
        },
        {
            "published_date": "2025-04-17T04:31:47",
            "title": "Why the gullible millions can't see through the global warming hoax",
            "author": "David Wright",
            "url": "https://news.knowledia.com/all/all/articles/why-the-gullible-millions-can-t-see-through-the-global-warming-hoax-7471c3fec3bd0b0588127d2dcce81283717160e7",
            "url_media": "https://www.conservativewoman.co.uk/wp-content/uploads/2019/08/sun.jpg",
            "country": "FR",
            "language": "en",
            "summary": "There are three main reasons why people buy into the man-made global warming hoax. The first reason is the complete absence of common sense. The second is ignorance and the third is political incorrectness. Dr Shane Fudge gives many examples of how the hoax is promoted."
        },
        {
            "published_date": "2025-04-17T04:30:09",
            "title": "The hidden force of history: How climate shaped civilizations",
            "author": "Tags",
            "url": "https://www.naturalnews.com/2025-04-17-hidden-force-of-history-climate-shaped-civilizations.html",
            "url_media": "https://www.naturalnews.com/wp-content/uploads/sites/91/2025/04/Climate-change-drought-land-and-water-in-lake-1.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Reid A. Bryson and Thomas J. Murray argue in their book \"Climates of Hunger\" that climate shifts have been a critical yet often overlooked factor in the rise and fall of civilizations. The authors integrate climatological data with historical records to reveal a pattern of climate-induced societal changes. The 1970s serve as a critical case study in the book."
        },
        {
            "published_date": "2025-04-17T04:27:30",
            "title": "Great Barrier Reef hit by sixth mass bleaching event in under a decade",
            "author": "Poppy Johnston",
            "url": "https://7news.com.au/news/great-barrier-reef-hit-by-sixth-mass-bleaching-event-in-under-a-decade-c-18404392",
            "url_media": "https://images.7news.com.au/publication/C-18404392/ad3fc232a158e3ec49bea19fc405de0f04aabd4a-16x9-x0y0w1280h720.png?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Extensive coral bleaching has been confirmed at Australia's Great Barrier Reef for the sixth time in less than a decade. The northern regions of the world's largest coral reef system have suffered bleaching due to prolonged exposure to elevated temperatures. The reef has further incurred damage from record rainfall in the northern and central regions. The worst heat stress was recorded from Cooktown to Cape York."
        },
        {
            "published_date": "2025-04-17T04:19:43",
            "title": "‘Massive blackout' leaves all of Puerto Rico without power",
            "author": "International New York Times",
            "url": "https://www.deccanherald.com/world/massive-blackout-leaves-all-of-puerto-rico-without-power-7-3497811",
            "url_media": "https://images.deccanherald.com/deccanherald%2F2025-04-17%2Fsqq5w9qp%2Ffile808qfk1ww8z14rpq6n36.jpg?rect=0%2C23%2C600%2C315&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "country": "IN",
            "language": "en",
            "summary": "Puerto Rico has suffered extensive power grid problems since Hurricane Maria devastated the island in 2017. The island has been without power since the hurricane.    for more than a year, according to the Puerto Rico Electric Power Authority (Peregrine). "
        },
        {
            "published_date": "2025-04-17T04:18:27",
            "title": "Climate change poses global risks to a safe blood supply",
            "author": "News Desk",
            "url": "https://exbulletin.com/world/health/3014700",
            "url_media": "https://i0.wp.com/d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Blood_pressure_-_kurhan_190c9e39c9604c7a8ce4b5999522f80a-620x480.jpg?resize=1000%2C600&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "New research published in Health on the Lancet Planet suggests that climate change threatens the availability of safe blood around the world. It is the first study to examine how changing climate affects each stage of the blood supply chain. It highlights the need to reduce reliance on traditional blood supply chains and has an adaptable strategy that provides rapid response to climate-related challenges."
        },
        {
            "published_date": "2025-04-17T04:15:00",
            "title": "Climate crisis drives up Pacific Ocean temperatures, study finds",
            "author": "Andrew Mathieson",
            "url": "https://nit.com.au/17-04-2025/17458/climate-crisis-causes-the-increasing-temperatures-of-the-pacific-ocean-study-finds",
            "url_media": "https://nit.com.au/img/featured/center/storage/2jNzi9j3aqWtATzqBkoqTaaGu9PpefOdvF9mVbYa.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Global warming has affected the Pacific Ocean more severely in recent times. The climate crisis is said to have tripled the duration of the heatwaves in oceans, activating storms further and destroying ecosystems, including Pacific coral reefs. Ocean heatwaves pose significant risks to society, with some individual events causing millions of dollars of losses."
        },
        {
            "published_date": "2025-04-17T04:03:07",
            "title": "Why Africa must rethink, rebuild",
            "author": "",
            "url": "https://www.monitor.co.ug/uganda/oped/commentary/why-africa-must-rethink-rebuild-5006058",
            "url_media": "https://www.monitor.co.ug/resource/blob/4912354/e63b06a18d052280f8a7edaddb2bd061/coment01pix-data.jpg",
            "country": "UG",
            "language": "en",
            "summary": "The current U.S. administration's imposition of tariffs ranging from 30 percent to 50 percent on imports from several African nations is causing serious consequences across the continent. The rollback includes deep cuts to the President's Emergency Plan for AIDS Relief (PEPFAR) and other critical health and development programs. The dissolution of USAID programs will severely weaken infectious disease surveillance and public health systems. The cuts are expected to push an additional 5.7 million Africans into extreme poverty within a year. African countries must rethink their economic strategies to mitigate the adverse effects of recent U.s. policy changes."
        },
        {
            "published_date": "2025-04-17T04:01:00",
            "title": "Deadly floods in DRC becoming more likely with climate change, say scientists",
            "author": "Nick Ferris",
            "url": "https://www.independent.co.uk/climate-change/drc-congo-africa-flooding-climate-b2734532.html",
            "url_media": "https://static.independent.co.uk/2025/04/16/16/19/SEI246695434.jpeg?trim=0,285,0,345&width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Floods in Democratic Republic of Congo have killed at least 72 people and injured 170 more in recent days. At least 5,000 people have been displaced and streets, homes, and public infrastructure have been submerged in Kinshasa, a sprawling megacity of nearly 17 million people. Global warming of 1.3°C has already occurred. Seven-day spells of heavy rain have on average become 9 to 19% more intense since 1960."
        },
        {
            "published_date": "2025-04-17T03:55:20",
            "title": "In Iraq, Orange Skies and Inescapable Dust",
            "author": "Kate Seamons",
            "url": "https://news.knowledia.com/all/all/articles/in-iraq-orange-skies-and-inescapable-dust-7fb924c9b37ec77d61e39209fea2d5b9b594b20b",
            "url_media": "https://img2-azrcdn.newser.com/image/1604805-17-20250416092217-iraq-orange-skies-inescapable-dust.jpeg",
            "country": "FR",
            "language": "en",
            "summary": "The UN considers Iraq the fifth-most vulnerable country to climate breakdown due to its heat, droughts, and sandstorms. The New York Times reports that this week's weather in Iraq has been very hot and dry, as well as very windy."
        },
        {
            "published_date": "2025-04-17T03:53:00",
            "title": "Extreme marine heatwaves tripled over past 80 years: study",
            "author": "Uniindia News Service",
            "url": "https://www.uniindia.com/news/world/extreme-marine-heatwaves-tripled-over-past-80-years-study/3441004.html",
            "url_media": "https://www.uniindia.com/cms/gall_content/2025/4/2025_4$largeimg17_Apr_2025_095358017.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming. Global warming is responsible for almost half of the occurrence of marine heatwaves. The study also found that rising global temperatures are making extreme ocean heat events last longer and become more intense."
        },
        {
            "published_date": "2025-04-17T03:44:14",
            "title": "Dutton says he believes in climate change",
            "author": "",
            "url": "https://www.watoday.com.au/politics/dutton-says-he-believes-in-climate-change-20250417-p5lskk.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/fd56857a2dc111458556ae46913b2c6f9bd661f2",
            "country": "AU",
            "language": "en",
            "summary": "Dutton believes in climate change. The feature is currently unavailable, but we're working to restore it. Please try to wait a bit longer for the feature to be available again.   .    - it's currently unavailable.  It's trying to be restored."
        },
        {
            "published_date": "2025-04-17T03:35:24",
            "title": "Europe had most widespread floods for more than a decade in 2024, scientists say",
            "author": "Reuters",
            "url": "https://www.thehindu.com/sci-tech/energy-and-environment/europe-had-most-widespread-floods-for-more-than-a-decade-in-2024-scientists-say/article69459304.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/9ed8s7/article69459306.ece/alternates/LANDSCAPE_1200/2025-03-29T163635Z_99703438_RC24NDA8KZ8P_RTRMADP_3_EUROPE-WEATHER-BOSNIA-FLOODS.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Flooding killed at least 335 people in Europe in 2024 and affected more than 410,000. Western Europe was hit hardest, with 2024 ranking among the region's ten wettest years in records going back to 1950. Southeastern Europe had its longest heat wave on record, Scandinavia's glaciers shrank at the highest rates on record and heat stress increased across the continent."
        },
        {
            "published_date": "2025-04-17T03:02:16",
            "title": "Bangladesh's future under threat, lives of 8000000 people in danger due to..., shocking report reveal BIG concern for Yunus govt",
            "author": "",
            "url": "https://www.india.com/news/world/bangladeshs-future-under-threat-lives-of-8000000-people-in-danger-due-to-devastating-cyclones-shocking-report-reveal-big-concern-for-yunus-govt-cyclones-and-monsoons-disasters-7760812",
            "url_media": "https://static.india.com/wp-content/uploads/2025/04/yunus.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bangladesh's coastline is one of the most vulnerable in the world, home to nearly 8 million people living in low-lying areas regularly battered by storms. Over the years, six major cyclones have each claimed more than 100,000 lives. Due to global warming, monsoons and cyclones might begin to strike at the same time."
        },
        {
            "published_date": "2025-04-17T03:00:00",
            "title": "Rain possible in Havasu this week amid ‘exceptional drought' in Mohave County",
            "author": "TAYLOR SCHWARTZ-OLSON",
            "url": "https://www.havasunews.com/news/rain-possible-in-havasu-this-week-amid-exceptional-drought-in-mohave-county/article_5ce1a46d-bce5-4823-90c5-557f9181e00a.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/havasunews.com/content/tncms/custom/image/71a305c0-66d2-11e5-8a1a-abf413f57a29.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "Mohave and La Paz Counties are experiencing drought. March was the 29th warmest of the 131 years recorded in Arizona. Rain might be in the short and long-term forecast for the region, but it's unlikely to be much in the near future."
        },
        {
            "published_date": "2025-04-17T02:40:49",
            "title": "Climate zealots are always wrong — but never admit it",
            "author": "John Stossel",
            "url": "https://nypost.com/2025/04/16/opinion/climate-zealots-are-always-wrong-but-never-admit-it",
            "url_media": "https://nypost.com/wp-content/uploads/sites/2/2025/04/climate-activists-attend-rally-end-39755026.jpg?quality=75&strip=all&w=1024",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres is hyping global warming. The media and environmental groups are pushing hysterical myths. The Arctic will soon be ice-free. Polar bears are not going extinct. Global food production has skyrocketed because of climate change. Environmental Defense Fund used a quarter-billion dollars from gullible donors to run ads about saving polar bears."
        },
        {
            "published_date": "2025-04-17T02:30:00",
            "title": "Scientists stunned by new images from beneath Antarctic ice: 'It's a bit like seeing the back of the moon'",
            "author": "Laurelle Stelle",
            "url": "https://www.msn.com/en-us/weather/topstories/scientists-stunned-by-new-images-from-beneath-antarctic-ice-it-s-a-bit-like-seeing-the-back-of-the-moon/ar-AA1D4jE4",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "For the first time, scientists have directly observed the melting underside of an Antarctic ice shelf. They sent an unmanned craft beneath the Dotson ice shelf to gather data about how it is melting in real time. It confirmed the theory that strong water currents are eroding the ice more quickly than passive melting can account for. It also produced baffling images that suggest our models of glacial melt are not yet capturing the full picture."
        },
        {
            "published_date": "2025-04-17T02:11:08",
            "title": "‘Hard to deny': Nevada is home to nation's 2 fastest-warming cities",
            "author": "Alan Halaly",
            "url": "https://www.reviewjournal.com/local/local-nevada/hard-to-deny-nevada-is-home-to-nations-2-fastest-warming-cities-3352605",
            "url_media": "https://www.reviewjournal.com/wp-content/uploads/2025/04/20368504_web1_Warming-Levels-Graph.jpg",
            "country": "US",
            "language": "en",
            "summary": "Reno and Las Vegas have warmed the most since 1970. Last year, heat contributed to 527 deaths in Southern Nevada recorded by the Clark County coroner's office. Las Vegas set a 28 percent reduction goal for greenhouse gas emissions. The city's 2050 master plan includes measures to hinder climate change and deal with the reality of it."
        },
        {
            "published_date": "2025-04-17T02:08:23",
            "title": "'Worse than Howard': PM attacks Dutton for climate call",
            "author": "",
            "url": "https://www.perthnow.com.au/politics/election/worse-than-howard-pm-attacks-dutton-for-climate-call-c-18403615",
            "url_media": "https://images.perthnow.com.au/publication/C-18403615/95b3bfec322b94211a7ec6198f43ffc0f812cb93-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Peter Dutton has been accused of taking the coalition backwards on climate change during the second leaders' debate on Wednesday night. Mr Dutton agreed there was an impact from climate change, but he did not say whether rising temperatures were making natural disasters worse. The Coalition is committed to the Paris Agreement and net zero emissions by 2050."
        },
        {
            "published_date": "2025-04-17T02:06:45",
            "title": "'Worse than Howard': PM attacks Dutton for climate call",
            "author": "Andrew Brown",
            "url": "https://www.examiner.com.au/story/8945240/worse-than-howard-pm-attacks-dutton-for-climate-call",
            "url_media": "https://www.examiner.com.au/images/transform/v1/crop/frm/silverstone-feed-data/004e0922-8581-4952-af44-a418914d63aa.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Climate change became a policy focus during the second leaders' debate on Wednesday night. Peter Dutton agreed there was an impact from climate change, but he did not say whether rising temperatures were making natural disasters worse. Prime Minister Tony Albanese said the science was clear on climate change and its impacts."
        },
        {
            "published_date": "2025-04-17T02:06:45",
            "title": "'Worse than Howard': PM attacks Dutton for climate call",
            "author": "Andrew Brown",
            "url": "https://www.newcastleherald.com.au/story/8945240/worse-than-howard-pm-attacks-dutton-for-climate-call",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/004e0922-8581-4952-af44-a418914d63aa.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Climate change became a policy focus during the second leaders' debate on Wednesday night. Peter Dutton agreed there was an impact from climate change, but he did not say whether rising temperatures were making natural disasters worse. Prime Minister Tony Albanese said the science was clear on climate change and its impacts."
        },
        {
            "published_date": "2025-04-17T01:27:20",
            "title": "VIDEO: WA's north braces for Tropical Cyclone Errol",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-04-17/was-north-braces-for-tropical-cyclone-errol/105187460",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/8d99cf05478e9be930909d7249cb0879?impolicy=wcms_watermark_news&cropH=576&cropW=1024&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Cyclone Errol intensifies to a category four system off the coast of Western Australia's Kimberley. Residents of the area are urged to prepare for wild weather as the cyclone intensifies. The storm is expected to last for a few days.  "
        },
        {
            "published_date": "2025-04-17T00:57:46",
            "title": "The key issues as Australia goes to the polls",
            "author": "",
            "url": "https://www.rnz.co.nz/national/programmes/middayreport/audio/2018983662/the-key-issues-as-australia-goes-to-the-polls",
            "url_media": "https://media.rnztools.nz/rnz/image/upload/s--ImISGBa8--/c_fill,f_auto,g_auto,h_300,q_auto,w_300/v1719960626/4KNMJ82_midday_report_external_cover_July_2024_jpg?_a=BACCd2AD",
            "country": "NZ",
            "language": "en",
            "summary": "The Australian federal election is on May 3rd. The main party leaders, Anthony Albanese and Peter Dutton, sparred off in a TV debate on the ABC on Wednesday evening. Political scientist Dominic O'Sullivan gives his assessment of the campaign so far."
        },
        {
            "published_date": "2025-04-17T00:55:56",
            "title": "New research predicts how climate change will put global blood supply at risk: what can you expect in Australia",
            "author": "News Desk",
            "url": "https://exbulletin.com/world/health/3014580",
            "url_media": "https://i0.wp.com/www.lifeblood.com.au/sites/default/files/2025-04/climate%20change_banner_1580x490px.jpg?resize=1000%2C600&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Climate change affects the health of blood donors around the world. The study was done by the Australian Red Cross Lifeline and Sunshine Coast University. It warns that future blood supply will be affected by weather phenomena such as fires and floods, changes in patterns of blood-borne diseases such as dengue fever, and changes in health issues related to climate change, such as blood pressure and 'climate anxiety'. The study recommends that governments and blood services can be prepared with key tools such as early warning systems, disease surveillance, donor eligibility in emergencies, flexible approaches, and hospital preparation."
        },
        {
            "published_date": "2025-04-17T00:53:22",
            "title": "Dutton worse than Howard on climate: PM",
            "author": "",
            "url": "https://www.watoday.com.au/politics/federal/dutton-worse-than-howard-on-climate-pm-20250417-p5lshp.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/60f64aafa2d3b2e281cf3093baf4bd39a8366544",
            "country": "AU",
            "language": "en",
            "summary": "Dutton is worse than Howard on climate, says PM. The feature is currently unavailable, but we're working to restore it. Please try again later, it will be available soon.   Â. Â   yesto ergo, "
        },
        {
            "published_date": "2025-04-17T00:53:22",
            "title": "Dutton worse than Howard on climate: PM",
            "author": "",
            "url": "https://www.smh.com.au/politics/federal/dutton-worse-than-howard-on-climate-pm-20250417-p5lshp.html",
            "url_media": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/60f64aafa2d3b2e281cf3093baf4bd39a8366544",
            "country": "AU",
            "language": "en",
            "summary": "Anthony Albanese says the Coalition has gone backwards on climate change since John Howard's time as PM. He accuses the Coalition of not changing its stance on the issue since Howard was in office.    for more information, go to: www.albanese.com."
        },
        {
            "published_date": "2025-04-17T00:48:47",
            "title": "Weather Insider: April 2025 Enso Update",
            "author": "Spencer Blum",
            "url": "https://kesq.com/weather/2025/04/16/weather-insider-april-2025-enso-update",
            "url_media": "https://kesq.b-cdn.net/2025/04/BAM-1440x810.jpg",
            "country": "US",
            "language": "en",
            "summary": "Since the end of 2024, sea surface temperatures in the equatorial Pacific Ocean have been cooler than usual. This is indicative of La Nina conditions. NOAA's Climate Prediction Center issued its final La Nina Advisory on April 10th. This means that we are slowly transitioning into the neutral phase of ENSO. Scientists expect neutral conditions to remain in place through the summer of 2025 and likely into the beginning of autumn."
        },
        {
            "published_date": "2025-04-17T00:45:00",
            "title": "Birding: Spring migration is an exciting time for bird watchers",
            "author": "ERIC MOORE",
            "url": "https://www.dcourier.com/features/birding-spring-migration-is-an-exciting-time-for-bird-watchers/article_20dfe128-ea24-45c7-9994-e95aecaec74d.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dcourier.com/content/tncms/assets/v3/editorial/4/df/4df9b42c-5a34-4b2e-931b-31099a2a50fb/680015b69a56c.image.jpg?crop=1200%2C630%2C0%2C48",
            "country": "US",
            "language": "en",
            "summary": "In the last week I have seen over 80 species of birds in the Prescott area. April is an exciting time for bird watchers as the migration starts to ramp up. Possibilities include chipping sparrow, Lincoln's sparrow and American goldfinch at feeders."
        },
        {
            "published_date": "2025-04-17T00:37:30",
            "title": "A Risk to Our Future",
            "author": "",
            "url": "https://www.nation.com.pk/17-Apr-2025/a-risk-to-our-future",
            "url_media": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Climate change is a serious problem affecting us all. The floods of 2022 devastated upper Punjab, Khyber Pakhtunkhwa, Sindh, and lower regions like Balochistan. Forests near coastlines are under threat. Everyone can contribute by using less plastic, turning off unnecessary lights, planting trees, and supporting sustainable practices. Community participation in environmental campaigns can help mitigate both man-made and natural risks."
        },
        {
            "published_date": "2025-04-17T00:33:26",
            "title": "'I'm not a scientist': Dutton responds to climate change question in ABC leaders' debate",
            "author": "",
            "url": "https://www.theguardian.com/australia-news/video/2025/apr/17/im-not-a-scientist-dutton-responds-to-climate-change-question-in-abc-leaders-debate-video-ntwnfb",
            "url_media": "https://i.guim.co.uk/img/media/db6759d7fe245a844051749eec6689222c5a9d2d/734_132_5005_3004/master/5005.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca38f80da5fdd3e9dfec4deb0048211b",
            "country": "GB",
            "language": "en",
            "summary": "Dutton accepts there is an impact of climate change and the real question is what Australia can do about it. Dutton is not a scientist and he doesn't know what can be done about it, but he accepts there's an impact and he accepts climate change is happening."
        },
        {
            "published_date": "2025-04-17T00:25:29",
            "title": "LIVE: Election campaign 2025 – Anthony Albanese faces another immigration problem as overseas arrivals exposed for using devious tactic to sneak into Australia",
            "author": "BRETT LACKEY",
            "url": "https://expressdigest.com/live-election-campaign-2025-anthony-albanese-faces-another-immigration-problem-as-overseas-arrivals-exposed-for-using-devious-tactic-to-sneak-into-australia",
            "url_media": "https://i.dailymail.co.uk/1s/2025/04/17/00/1744844646855_lc_galleryImage_Tertiary_students_at_the_.JPG",
            "country": "US",
            "language": "en",
            "summary": "Queensland University of Technology's retention rate for international students dropped to an unusual and historic low of 53.6%. In February this year a new monthly record of 197,000 international students arrived in the country. Anthony Albanese landed in Brisbane this morning following the second leaders debate on Wednesday night. Peter Dutton will kick off the day campaigning in the seat of Bonner in the city's east. Mr Dutton has held that seat since 2001."
        },
        {
            "published_date": "2025-04-17T00:11:25",
            "title": "Climate Change Is Stressing the World's Blood Supplies",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/04/17/Climate_Change_Is_Stressing_the_World_s_Blood_Supplies",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather disasters can curb blood donations while increasing demand, according to a new analysis by the U.S. Blood Donor's Association.   The number of extreme weather disasters is increasing as the planet warms.  It can also increase blood donations. "
        },
        {
            "published_date": "2025-04-17T00:06:25",
            "title": "Dutton brings back old-school climate denial in second leaders debate",
            "author": "Renew Economy",
            "url": "https://article.wn.com/view/2025/04/17/Dutton_brings_back_oldschool_climate_denial_in_second_leader",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Peter Dutton brings back a moment of old-school climate denial. Anthony Albanese doesn't really accept the science, as Peter Dutton points out. He's wrong, though. He doesn't accept the scientific consensus. He is not an expert in climate change."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Austria's harmful emissions fall below 70 million tonnes for first time",
            "author": "Urdu Point",
            "url": "https://article.wn.com/view/2025/04/17/Austria_s_harmful_emissions_fall_below_70_million_tonnes_for",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Austria's greenhouse gas emissions dropped by 6.5 percent in 2023 compared to the previous year, marking a significant environmental milestone, according to the latest official data from the Austrian government's website. The report is from UrduPoint, Pakistan Point News and WAM."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Study finds extreme marine heatwaves have tripled in last 80 years",
            "author": "",
            "url": "https://www.chennaionline.com/news/study-finds-extreme-marine-heatwaves-have-tripled-in-last-80-years",
            "url_media": "https://www.chennaionline.com/wp-content/uploads/2019/09/favicon.png",
            "country": "IN",
            "language": "en",
            "summary": "A new study shows that extreme heatwaves in the ocean are happening three times more often than they did 80 years ago because of climate change. Dr. Laura Thompson, the lead author of the study, warns that if humans continue to release large amounts of carbon into the atmosphere, marine heatwaves will keep getting worse."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Exhibition Announcement : Tala O Le Tau, Angela Tiatia & Yuki Kihara, Gus Fisher Gallery",
            "author": "",
            "url": "https://auckland.scoop.co.nz/2025/04/exhibition-announcement-tala-o-le-tau-angela-tiatia-yuki-kihara-gus-fisher-gallery",
            "url_media": "https://mc-store1.s3.amazonaws.com/media/nn/beta1-scoop-co-nz/posts/OrVisNWFtMpjTIvl.jpg",
            "country": "NZ",
            "language": "en",
            "summary": "Gus Fisher Gallery's upcoming exhibition Tala o le tau brings together new and significant bodies of work by Angela Tiatia, Yuki Kihara and women from Moata'a Aualuma Community. The Pacific is bearing the brunt of a climate crisis. By 2030, sea levels in Sāmoa are projected to rise between 5 and 15cm."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Scots seabird populations still falling but some species stabilising",
            "author": "AOL",
            "url": "https://article.wn.com/view/2025/04/17/Scots_seabird_populations_still_falling_but_some_species_sta",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scotland's seabirds are of international importance, but they face many pressures and threats. Food availability, climate change, fisheries, predation, and invasive species are all thought to be threats to seabird population in Scotland. NatureScot trends analyst Simon Foster says."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Climate Change Impacts Global Blood Supply, Australia Faces High Risk",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/04/17/Climate_Change_Impacts_Global_Blood_Supply_Australia_Faces_H",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is projected to severely impact global blood supplies. Australia is particularly at risk due to extreme weather events, increasing disease rates and shifting health rates.    .   in Menafn's report on climate change.  In the report, they discuss the impact of climate change on blood supplies in Australia."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "New Zealanders' Concern Over Impact Of Climate Change And Perceived Importance Of Climate Action Declining",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/04/17/new_zealanders_x2019_concern_over_impact_of_climate_change_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The proportion of New Zealanders who think that their country should do more to tackle climate change has decreased significantly. The proportion of people who think the country should be doing more is also decreasing.   iReport.com: What do you think? Share your thoughts."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "DRC artists 'Herds' walk the world to raise climate change awareness",
            "author": "France24",
            "url": "https://article.wn.com/view/2025/04/17/DRC_artists_Herds_walk_the_world_to_raise_climate_change_awa",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "A group of artists from the DRC, called the Herds, are embarking on a global journey starting in Kinshasa to raise awareness about the impact of climate change in Africa. Maria Cherfaoui wrote the report for this project.   "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Peter Dutton insists he ‘believes in climate change' after refusing to say if impacts of ...",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/17/Peter_Dutton_insists_he_believes_in_climate_change_after_ref",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The opposition leader believes in climate change during Wednesday's election debate. The opposition leader's comments were condemned by climate scientists, environmentalists, Labor and Greens. The election is being held on October 25. The results will be announced on the 25th of October. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Sea surface warming faster than expected",
            "author": "system",
            "url": "https://article.wn.com/view/2025/04/17/Sea_surface_warming_faster_than_expected",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Satellite observations show that sea-surface temperatures over the past four decades have been getting warmer at an accelerated pace, as satellite data shows.      Â   .   in the sea- surface is getting warmer by an accelerated rate. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Study links climate change to rising arsenic levels in paddy rice, increasing health risks",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/17/Study_links_climate_change_to_rising_arsenic_levels_in_paddy",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change may significantly impact arsenic levels in paddy rice, a staple food for millions across Asia, according to a new study from Columbia. It's a result of climate change, the study claims.   Â. Â   in the study."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Global Livestock Industry Exposed For Rampant Rainforest Destruction, Despite No-Deforestation Pledges",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/04/17/Global_Livestock_Industry_Exposed_For_Rampant_Rainforest_Des",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Greenpeace Aotearoa is critical of JBS and Fonterra's industrial livestock companies and their supply chains that devastate ecosystems and drive climate breakdowns.    .   \"Industrial livestock companies like JBS ... continue banking billions\" "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Europe, fastest-warming continent, endures hottest year in 2024",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/04/17/Europe_fastestwarming_continent_endures_hottest_year_in_2024",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Europe experienced its hottest year on record in 2024, marked by deadly floods, prolonged heatwaves and unprecedented climate extremes, according to a joint report released this week by the World Meteorological Organization (WMO) and the Copernicus Climate Change Service (C3S)."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Scientists invite Dutton to 'have a chat' after his evasive climate comments",
            "author": "system",
            "url": "https://article.wn.com/view/2025/04/17/Scientists_invite_Dutton_to_have_a_chat_after_his_evasive_cl",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Last night's leaders debate revealed a clear difference between how Labor and the Liberals view the role of climate change in more frequent and severe weather affecting Australia and how they view it in their respective parties.       .   i   in the debate."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Extreme Marine Heatwaves Tripled Over Past 80 Years: Study",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/04/17/Extreme_Marine_Heatwaves_Tripled_Over_Past_80_Years_Study_r",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The number of days each year that the world's oceans experience extreme surface heat has tripled over the past 80 years due to global warming, according to a new study.    i.e. because of climate change.  IANS.  i'"
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Canada geese season is underway, experts offer tips on how to handle the aggressive species",
            "author": "The Augusta Chronicle",
            "url": "https://article.wn.com/view/2025/04/17/Canada_geese_season_is_underway_experts_offer_tips_on_how_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Warmer weather and the ability to adapt to a variety of environments means more human encounters with Canada geese in Georgia, experts say, which is a resident population of the migratory game bird biologist Kara Nitschke says.    .   "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Open Fire Season Starts For Thames-Coromandel, Waikato Northern",
            "author": "Scoop",
            "url": "https://article.wn.com/view/2025/04/17/Open_Fire_Season_Starts_For_ThamesCoromandel_Waikato_Norther",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Waikato District Manager Daryl Trim says the summer temperatures have given way to cooler autumn conditions, so the fire risk has been lowered.    Daryl Trim is the district manager for the Waikato district, which includes the Waipatato."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Study Reveals Global Ocean Heatwaves Have Tripled in 80 Years Due to Global Warming",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/04/17/Study_Reveals_Global_Ocean_Heatwaves_Have_Tripled_in_80_Year",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The frequency of extreme surface heat days in the world's oceans has increased threefold over the last 80 years. Global warming is to blame for the increase, according to the study. In the past 80 years, extreme heat days have increased by three times. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Food waste is a major contributor to climate change. What are the solutions?",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/17/Food_waste_is_a_major_contributor_to_climate_change_What_are_2",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Emissions don't just come from the burning of fossil fuels such as coal, oil, and gas. Food waste can also be a source of greenhouse gas emissions. It's possible to send food waste to other places.    .   ,   and "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Australian scientists report sixth mass bleaching event on Great Barrier Reef",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/04/17/Australian_scientists_report_sixth_mass_bleaching_event_on_G",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Great Barrier Reef experienced a widespread coral bleaching event in the summer of 2016. It is the sixth mass coral bleachings event on the reef since 2016.      Â   in the report published on Wednesday night by Australian scientists. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Climate change poses growing threat to Australia's blood supply",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/04/17/Climate_change_poses_growing_threat_to_Australias_blood_supp_g",
            "url_media": "https://article.wn.com/view/2025/04/17/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change is set to significantly disrupt global blood supplies. Australia is particularly vulnerable to the effects of extreme weather, rising disease rates, and shifting donor health patterns. Extreme weather events disrupt the storage, safety, and transportation of blood. Blood has a short shelf life. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Climate change takes its toll on Gulf of Maine shrimp: Irwin",
            "author": "Seacoast Online",
            "url": "https://article.wn.com/view/2025/04/17/Climate_change_takes_its_toll_on_Gulf_of_Maine_shrimp_Irwin_y",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The loss of the centuries-old shrimp fishery in New York has a negative impact on the culture and sense of place, but it's less tangible than the climate change effects. The writer has great memories of going down to the wharf when a shrimp boat came in to fill her pot for an evening."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Will global warming impact your life? Results from poll break 28-year record",
            "author": "The Daily Gazette",
            "url": "https://article.wn.com/view/2025/04/17/Will_global_warming_impact_your_life_Results_from_poll_break",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A record-high share of Americans consider global warming to be a major concern, according to a new poll. 48% of respondents said it will pose a serious threat to them or their way according to the latest Gallup survey, and 48% said it's a serious concern."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Climate zealots are always wrong — but never own up to their nonsense",
            "author": "New York Post",
            "url": "https://article.wn.com/view/2025/04/17/Climate_zealots_are_always_wrong_but_never_own_up_to_their_n",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres hyped global warming risks and now he thinks the era of global boiling has arrived. The climate is warming and we can deal with that.       i.e. what is going to happen to the climate?"
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Taking the pulse: are the Swiss losing interest in climate change fight?",
            "author": "Swissinfo",
            "url": "https://article.wn.com/view/2025/04/17/Taking_the_pulse_are_the_Swiss_losing_interest_in_climate_ch",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Swiss turnout at last week's global climate strike protest was down from previous years. Around 6,000 people attended the protest across four cities. Fossil fuel emissions are showing no signs of peaking or abating. The oceans are rising and so are we."
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "10 countries facing the worst of climate change",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/04/17/10_countries_facing_the_worst_of_climate_change",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is no longer a threat, it is an urgent global reality. The change that was meant to happen later on is knocking on our doorstep. Countries with high exposure to natural disasters, fragile infrastructure and limited adaptive capacity are at risk of climate change. "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "Record-high share of Americans now consider global warming to be a major concern, poll reveals",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/17/Recordhigh_share_of_Americans_now_consider_global_warming_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In the latest Gallup survey, 48% of respondents said that global warming will pose a problem for the planet.      Â   in the Gallup survey. 48% said that it will be a problem.  In the latest poll, "
        },
        {
            "published_date": "2025-04-17T00:00:00",
            "title": "While We Are Debating Vocabulary, Climate Change Is Roaring Onward",
            "author": "John Sabo",
            "url": "https://www.forbes.com/sites/johnsabo/2025/04/17/while-we-are-debating-vocabulary-climate-change-is-roaring-onward",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/68010500bb54f7d48a1f1519/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "Flooding in the Tennessee-Ohio river valley is not an anomaly due to climate change. According to NOAA, natural disasters have accelerated in frequency and damage over the past four decades. Adaptation to intensifying extreme events needs coordination within states and among them. It also needs leadership at the federal level and innovative financial instruments from the private sector."
        }
    ]
}