{
    "status": "ok",
    "total_articles": 102,
    "articles": [
        {
            "published_date": "2025-04-26T23:30:00",
            "title": "Assessing temperature-related deaths in urban heat islands",
            "author": "The Hindu Bureau",
            "url": "https://www.thehindu.com/sci-tech/assessing-temperature-related-deaths-in-urban-heat-islands/article69491932.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/7orrhe/article69494803.ece/alternates/LANDSCAPE_1200/Cyprus_Heat_Wave_95910.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Cities with higher ambient temperatures than rural areas could reduce cold-related deaths in some global cities. Moscow, for example, saw a reduction in cold related deaths 11.5 times greater than those associated with heat. The authors suggest that cities must take a seasonal approach to mitigating the urban heat island effect."
        },
        {
            "published_date": "2025-04-26T23:07:39",
            "title": "Wildfires: UK burnt area for 2025 already beats annual record",
            "author": "Mark Poynting",
            "url": "https://www.bbc.com/news/articles/c0m9gm3jwljo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/d3a7/live/00f64ad0-21df-11f0-9060-674316cb3a1f.jpg",
            "country": "GB",
            "language": "en",
            "summary": "More than 29,200 hectares (292 sq km or 113 sq miles) has been burnt by wildfires in the UK so far this year. This is more than the previous high of 28,100 hectares for the whole year of 2019. The prolonged dry, sunny weather in March and early April created ideal conditions for widespread burning. More than 80 fires have been detected across the UK since the beginning of the year."
        },
        {
            "published_date": "2025-04-26T22:49:38",
            "title": "Summer vacations in Punjab schools to start from June 1",
            "author": "inp",
            "url": "https://dailytimes.com.pk/1292595/summer-vacations-in-punjab-schools-to-start-from-june-1",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2020/08/app-icon-192x192-1.png",
            "country": "PK",
            "language": "en",
            "summary": "Summer holidays in Punjab schools will start from June 1. School Education Secretary Khalid Nazir Wattoo indicated that the schedule could be revised if current heatwave continues to rise. The decision comes amid growing global concerns over climate change. Pakistan ranks among the countries most vulnerable to climate-related disasters."
        },
        {
            "published_date": "2025-04-26T22:44:17",
            "title": "Heatwave forces early summer break",
            "author": "Our Correspondent",
            "url": "https://tribune.com.pk/story/2542489/heatwave-forces-early-summer-break",
            "url_media": "https://i.tribune.com.pk/media/images/schoolchildren1745706558-0/schoolchildren1745706558-0.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Summer vacations in Punjab schools will start from June 1. The department decided to start the holidays earlier in light of the escalating heat. Climate change is threatening millions of lives in Pakistan. Pakistan was ranked the most vulnerable country to climate change in 2022, ahead of Belize and Italy."
        },
        {
            "published_date": "2025-04-26T22:43:00",
            "title": "Climate change threatens centuries-old cultural practices too, says IIT-M prof",
            "author": "",
            "url": "https://timesofindia.indiatimes.com/city/chennai/climate-change-threatens-centuries-old-cultural-practices-too-says-iit-m-prof/articleshow/120652701.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120652700,width-1070,height-580,imgsize-28556,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The traditional music of the koraga tribe from coastal Karnataka is fading due to climate change. The koragas' traditional instruments require specific types of wood, such as Indian kino and jackfruit trees, which are now harder to find due to deforestation and climate change, according to professor Deepak Paramashivan."
        },
        {
            "published_date": "2025-04-26T22:30:00",
            "title": "Rabbit plague looms amid calls for new biocontrols",
            "author": "John Kidman",
            "url": "https://www.bordermail.com.au/story/8951781/rabbit-plague-looms-amid-calls-for-new-biocontrols",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/73233319-6acf-4750-a412-42d2967ebae5.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "There are 200 million rabbits in Australia. They infested the continent a century ago and their numbers are again threatening to explode.    There were around 10 billion rabbits in the 1800s. There are now around 200 million of them on the continent. "
        },
        {
            "published_date": "2025-04-26T22:30:00",
            "title": "Rabbit plague looms amid calls for new biocontrols",
            "author": "John Kidman",
            "url": "https://www.illawarramercury.com.au/story/8951781/rabbit-plague-looms-amid-calls-for-new-biocontrols",
            "url_media": "https://www.illawarramercury.com.au/images/transform/v1/crop/frm/silverstone-feed-data/73233319-6acf-4750-a412-42d2967ebae5.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Rabbits number more than 200 million in Australia. Rabbit-Free Australia chair Craig Magnussen says there could be a rabbit plague in the years to come, if conditions continue to be good and there is no new virus on the horizon, as he says."
        },
        {
            "published_date": "2025-04-26T20:57:51",
            "title": "What is 'climate anxiety'? Emotional effects on humans are real, expert says",
            "author": "Eleri Mosier",
            "url": "https://www.yahoo.com/news/climate-anxiety-emotional-effects-humans-205751155.html",
            "url_media": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "country": "US",
            "language": "en",
            "summary": "Climate change can cause anxiety in humans, according to Rebecca Weston, psychotherapist and co-executive director of Climate Psychology Alliance of North America. Rachel Ramirez, a freelance journalist who covers climate, was born and raised in Saipan, the capital of the Northern Mariana Islands. Super Typhoon Yutu hit her island in 2018 and the trauma caused by it influences her journalism today."
        },
        {
            "published_date": "2025-04-26T20:51:00",
            "title": "Of The Sky's Pilgrims: Migration As A Blessing",
            "author": "Nilofer Afridi Qazi",
            "url": "https://thefridaytimes.com/27-Apr-2025/of-the-sky-s-pilgrims-migration-as-a-blessing",
            "url_media": "https://thefridaytimes.com/digital_images/large/2025-04-27/the-sky-s-silent-pilgrims-migration-as-a-blessing-1745700642-4452.jpg",
            "country": "PK",
            "language": "en",
            "summary": "A friend of mine brought a pair of mallard ducks for his hospital pond. The ducks had travelled from Siberia to Chashma Lake in Pakistan. The flight of migratory birds in the sky is both graceful and mesmerising. Migratory birds' navigation is an unsolved mystery more than a century old. Scientists and engineers are in awe at their cognitive decision-making, bird flocking, energy efficiency, planning and scheduling."
        },
        {
            "published_date": "2025-04-26T19:56:55",
            "title": "Lowest snow levels",
            "author": "editorial",
            "url": "https://tribune.com.pk/story/2542449/lowest-snow-levels",
            "url_media": "https://i.tribune.com.pk/media/images/Editorial-New11312243333323323333331332233233323231223331322333332333333221/Editorial-New11312243333323323333331332233233323231223331322333332333333221.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The Hindu Kush Himalaya (HKH) region has recorded its lowest snow levels in 23 years. The Indus River system, fed by glacial melt and snowpack from the HKH, sustains Pakistan's drinking water supply, hydropower generation and food security. Sindh, Balochistan and Punjab have been recently issued a drought alert by the Pakistan Met Department. Pakistan's lack of climate preparedness and political issues in water governance make the situation increasingly dangerous."
        },
        {
            "published_date": "2025-04-26T19:46:00",
            "title": "Earth's storage of water in soil, lakes and rivers is dwindling. And it's especially bad for farming",
            "author": "Melina Walling",
            "url": "https://www.myjournalcourier.com/news/article/storage-water-soil-lakes-rivers-dwindling-20247676.php",
            "url_media": "https://s.hdnux.com/photos/01/47/66/77/27226109/5/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "Earth's soil moisture dropped by over 2,000 gigatons in roughly the last 20 years. Global warming has significantly reduced the amount of water stored around the world. The shift of water from land to the ocean is particularly worrisome for farming. The increasing heat stress on plants means they need more water."
        },
        {
            "published_date": "2025-04-26T19:40:16",
            "title": "Concerns As Windstorm Wrecks Over 50 Houses In Nasarawa",
            "author": "Richard Ogunsile",
            "url": "https://www.naijanews.com/2025/04/26/concerns-as-windstorm-wrecks-over-50-houses-in-nasarawa",
            "url_media": "https://www.naijanews.com/wp-content/uploads/2024/08/Map-of-Nasarawa-State-Nigeria-1000x600.png",
            "country": "US",
            "language": "en",
            "summary": "A severe windstorm ravaged the Mahanga community in the Awe Local Government Area of Nasarawa State on Friday night, April 25, destroying at least 50 houses. Community leader James Arthur addressed reporters on Saturday in Lafia, the state capital. He asked the state governor, Abdullahi Sule, the local government chairman, and other officials to provide relief materials, shelter, and support to the community."
        },
        {
            "published_date": "2025-04-26T19:00:59",
            "title": "Ice Age Humans Were Experts at Wielding Fire, Study Finds",
            "author": "Russell McLendon",
            "url": "https://www.yahoo.com/news/ice-age-humans-were-experts-190059356.html",
            "url_media": "https://media.zenfs.com/en/sciencealert_160/307762d99428c579a6322036a3d00672",
            "country": "US",
            "language": "en",
            "summary": "The Last Glacial Maximum (LGM) lasted from 26,500 to 19,000 years ago. Three ancient fireplaces were found at Korman' 9, a site on the Dniester River in Ukraine. They were used for cooking, making tools, and for social gatherings."
        },
        {
            "published_date": "2025-04-26T19:00:02",
            "title": "Ex-MP's rare comeback bid in key marginal seat",
            "author": "Abe Maddison",
            "url": "https://www.canberratimes.com.au/story/8951755/ex-mps-rare-comeback-bid-in-key-marginal-seat",
            "url_media": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/5de633d0-9c6d-4d0d-a670-2abf4aa652ec.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The key issues for voters are climate change, energy transition, cost of living and housing. The Labor government has a lot of strategies that aim to address all three of those things, Ms Miller-Frost says.      Â  "
        },
        {
            "published_date": "2025-04-26T18:33:00",
            "title": "Climate graphic of the week: Sudden flips from hot to cold temperature come with climate change, says study",
            "author": "成为付费会员，阅读FT独家内容",
            "url": "https://ftchinese.com/interactive/203320/en",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Rapid temperature flips from heatwaves to cold have increased across the world due to climate change. Between 1961 and 2023, more than 60 per cent of the world experienced more frequent, intense and more rapid flips between extreme temperatures. The pattern was attributed in some part to the increased 'waviness' of the jet stream that encircles the planet and changes in evaporation."
        },
        {
            "published_date": "2025-04-26T18:33:00",
            "title": "Climate graphic of the week: Sudden flips from hot to cold temperature come with climate change, says study 一周气候图解：研究称气候变化导致气温骤然从高温转为低温",
            "author": "成为付费会员，阅读FT独家内容",
            "url": "https://ftchinese.com/interactive/203320/ce",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Rapid temperature flips from heatwaves to cold have increased across the world and are expected to rise as a result of climate change. This is putting stress on human health and ecosystems, according to the latest research. The current global warming rate is 95% according to a recent study."
        },
        {
            "published_date": "2025-04-26T18:11:31",
            "title": "B.C. climate news: Firefighting drones could change the way B.C. fights wildfires",
            "author": "Tiffany Crawford",
            "url": "https://vancouversun.com/news/bc-climate-change-news-to-april-27-25",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/01/2192352248.jpg",
            "country": "CA",
            "language": "en",
            "summary": "According to the UN's intergovernmental panel on climate change, human activities like burning fossil fuels and farming livestock are the main drivers of climate change. It warns the window to limit warming to 1.5 C above pre-industrial times is closing. The Earth is now about 1.3 C warmer than it was in the 1800s."
        },
        {
            "published_date": "2025-04-26T18:00:00",
            "title": "Kiwi, Kākā And A Human-Scale Sirocco: Leila Jeffreys At The Aotearoa Art Fair",
            "author": "Kim Knight",
            "url": "https://www.nzherald.co.nz/viva/culture/kiwi-kaka-and-a-human-scale-sirocco-leila-jeffreys-at-the-aotearoa-art-fair/Y3YZJVW5DZC4FCVELO6YHPQWNM",
            "url_media": "https://www.nzherald.co.nz/resizer/v2/V7SXTSGMPNC4PO2N6RL37GTIGI.jpg?auth=020803a1a5d1ef66c1b8d3469d7ac3e01c637496d1a783a68575d790ec87e848&width=1200&height=675&quality=70&focal=442%2C400&smart=false",
            "country": "NZ",
            "language": "en",
            "summary": "Leila Jeffreys is an Australian artist. She believes native birds are a window to humans' own wild ways. She thinks humans are distracted by their own thoughts and they are using birds to distract themselves.       .   \"We are in our heads."
        },
        {
            "published_date": "2025-04-26T17:56:54",
            "title": "How to break through climate apathy",
            "author": "b3LLsb33r",
            "url": "https://www.dailykos.com/story/2025/4/26/2318946/-How-to-break-through-climate-apathy",
            "url_media": "https://cdn.prod.dailykos.com/images/1426129/story_image/Frog_D.jpg?1745690131",
            "country": "US",
            "language": "en",
            "summary": "78% of Americans believe climate change is real and 54% believe it's human caused. Psychologists at UCLA and Princeton advise people to talk binary when discussing climate change. The length of winter on the Great Lakes is now nearly three weeks shorter than in 1995."
        },
        {
            "published_date": "2025-04-26T17:35:02",
            "title": "Spring wave of hot weather to be treat for nature lovers",
            "author": "Helen Briggs",
            "url": "https://news.knowledia.com/all/all/articles/spring-wave-of-hot-weather-to-be-treat-for-nature-lovers-0cb0e6be8a16ee2b2029838756c7be389b818f8d",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/11cc/live/cc6d3770-21f1-11f0-9d38-b324bdc69b32.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Spring's hot weather to be treat for nature lovers. The British Trust for Ornithology says a succession of milder winters and wetter springs are contributing to change in the natural world. The Met Office says a brief spell of warmth at the end of April isn't a bad thing for wildlife."
        },
        {
            "published_date": "2025-04-26T17:20:45",
            "title": "Federal cuts to NOAA could be an ‘incredible blow' for Chesapeake Bay, storm reporting",
            "author": "Daily Press",
            "url": "https://article.wn.com/view/2025/04/26/Federal_cuts_to_NOAA_could_be_an_incredible_blow_for_Chesape",
            "url_media": "https://article.wn.com/view/2025/04/26/[]",
            "country": "US",
            "language": "en",
            "summary": "NOAA's science is critical for restoring oyster reefs, managing commercially important fisheries like blue crabs and protecting homes and businesses from climate change. The cuts will negatively impact climate research, education and storm reporting as summer and hurricane season nears and NOAA's budget is being cut."
        },
        {
            "published_date": "2025-04-26T17:00:00",
            "title": "Claim: Climate Apathy is Outpacing the Climate Crisis",
            "author": "Eric Worrall",
            "url": "https://wattsupwiththat.com/2025/04/26/claim-climate-apathy-is-outpacing-the-climate-crisis",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2019/02/Boiling-Frog.jpg?fit=650%2C432&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "People Better Understand Climate Change When Shown Stark, Binary Data, According to a new study from UCLA and Princeton. Eric Worrall thinks the proposed approach to climate communication amounts to deliberate deception. He thinks people are unconcerned and apathetic about the changes they experienced."
        },
        {
            "published_date": "2025-04-26T16:01:00",
            "title": "Federal cuts to NOAA could be an ‘incredible blow' for Chesapeake Bay, storm reporting",
            "author": "Eliza Noe",
            "url": "https://www.yahoo.com/news/federal-cuts-noaa-could-incredible-160100211.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Y836X.WtPeKkSk73eyJyfQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/virginian_pilot_tribune_local_770/61d2df9eb5aef7a5dc0a20c5db2d62be",
            "country": "US",
            "language": "en",
            "summary": "Trump administration wants to cut NOAA's budget by 27% to $4.5 billion in fiscal year 2026. The proposed cuts would close the Cooperative Institute for Marine and Atmospheric Sciences and the Atlantic Oceanographic and Meteorological Laboratory and cut funding to the office of Oceanic and Atmospheric Research by nearly 75%. The budget for the National Marine Fisheries Service would be cut roughly 30%, from $1.1 billion to $789.3 million. Environmentalists on the Chesapeake Bay are worried about how cuts could affect its ecosystem and restoration. The American Meteorological Society warns that the upcoming cuts will negatively impact forecasters' ability to issue alerts and warnings for severe storms."
        },
        {
            "published_date": "2025-04-26T16:00:00",
            "title": "Good Birding: Flocks fly by on their way to the Arctic",
            "author": "Tony Greenfield",
            "url": "https://www.coastreporter.net/in-the-community/good-birding-flocks-fly-by-on-their-way-to-the-arctic-10563419",
            "url_media": "https://www.vmcdn.ca/f/files/coastreporter/images/columns/c-good-birding-_d.jpg;w=709;h=448;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "The goose migration peaked on the 19/20th with observers reporting thousands of birds overhead in multiple flocks. The whole population of western snow geese, numbering over 100,000 birds, nests on Wrangel Island in Siberia, so they still have a long way to go from here. The fifth goose species is brant, which is not commonly reported from the Sunshine Coast. The attraction of the Parksville area is the presence of extensive eel grass beds. On land, many of the summer breeding species have now arrived, with about 20 species still to appear."
        },
        {
            "published_date": "2025-04-26T15:30:45",
            "title": "Rising Multi-Year El Niño Events Shaped Holocene Climate",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/rising-multi-year-el-nino-events-shaped-holocene-climate",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Rising-Multi-Year-El-Nino-Events-Shaped-Holocene-Climate-1745681450.jpg",
            "country": "TR",
            "language": "en",
            "summary": "A new study has revealed a remarkable evolution in the behavior of the El Niño–Southern Oscillation (ENSO) over the past 7,000 years. It revealed an increased frequency of multi-year ENSO events throughout the Holocene epoch. The study used coral data from Kiritimati and Fanning Atolls, strategically located within or near the Niño 3.4 region."
        },
        {
            "published_date": "2025-04-26T15:21:32",
            "title": "5 ways we're making progress on climate change",
            "author": "Bryan Walsh",
            "url": "https://news.knowledia.com/all/all/articles/5-ways-we-re-making-progress-on-climate-change-6278a052c8a0f6acb99274ae2087b046d723db6f",
            "url_media": "https://platform.vox.com/wp-content/uploads/sites/2/2025/04/GettyImages-2164347000.jpg?quality=90&strip=all&crop=0,15.095986038394,100,69.808027923211",
            "country": "FR",
            "language": "en",
            "summary": "Vox's editor-in-chief says climate change is very real and its toll is worsening by the year. 2024 was the hottest year on record and the first year where the average global temperature was 1.5 degrees Celsius higher than it was in the pre-industrial era. "
        },
        {
            "published_date": "2025-04-26T14:58:33",
            "title": "Afghanistan's National Disaster Management Authority addresses climate change challenges",
            "author": "The Frontier Post",
            "url": "https://thefrontierpost.com/afghanistans-national-disaster-management-authority-addresses-climate-change-challenges",
            "url_media": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvdGhlZnJvbnRpZXJwb3N0LmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDRcL0lNRy0yMDI1MDQyNi1XQTAwMDMtNzgweDQ3MC0xLmpwZyIsInR4dCI6IkFmZ2hhbmlzdGFuXHUyMDE5cyBOYXRpb25hbCBEaXNhc3RlciBNYW5hZ2VtZW50IEF1dGhvcml0eSBhZGRyZXNzZXMgY2xpbWF0ZSBjaGFuZ2UgY2hhbGxlbmdlcyIsInRlbXBsYXRlIjoiaGlnaHdheSIsImJsb2dfaWQiOjEzNzU4MjM0M30.4CHGMWaKDyXqeaCVwlLWt6GgEhsURsvHp4rYXfIKPXgMQ",
            "country": "PK",
            "language": "en",
            "summary": "Mullah Nooruddin Turabi, the Head of Afghanistan National Disaster Management Authority (ANDMA), held a meeting with Ms. Khairiatu Watson, Climate Change Advisor at the UN Assistance Mission in Afghanistan (UNAMA), to discuss the pressing impacts of climate change on the country. Turabi stressed the importance of establishing effective preparedness measures to mitigate the risks associated with natural disasters."
        },
        {
            "published_date": "2025-04-26T14:50:00",
            "title": "Climate Change Myths Part 2: Wildfires, Drought, Rising Sea Level, and Coral Reefs",
            "author": "Freedomsphoenix Readerfour",
            "url": "https://www.FreedomsPhoenix.com/News/378227-2025-04-26-climate-change-myths-part-2-wildfires-drought-rising-sea-level.htm",
            "url_media": "https://www.freedomsphoenix.com/Uploads/Graphics/533-0426062736-images-13.jpg",
            "country": "US",
            "language": "en",
            "summary": "Linnea Lueken of the Heartland Institute explains the data that disproves the alarmists' claims about a worsening drought, worsening wildfires, catastrophic sea level rise and a dying Great Barrier Reef. You might be surprised by what's true and what's not."
        },
        {
            "published_date": "2025-04-26T14:43:06",
            "title": "Climate Change, Once a Big Issue, Fades From Canada's Election",
            "author": "Max Bearak",
            "url": "https://news.knowledia.com/all/all/articles/climate-change-once-a-big-issue-fades-from-canada-s-election-d687a9fd20b5f567f937bcfded0909c10200e8a5",
            "url_media": "https://static01.nyt.com/images/2025/04/25/multimedia/25cli-canada-election-01-fwqg/25cli-canada-election-01-fwqg-videoSixteenByNineJumbo1600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Canada is warming at twice the rate of the rest of the world. There are record-smashing wildfires across several provinces. Canadians go to the polls on Monday. The Arctic icecap is melting and there's a record-breaking wildfire season in Canada. "
        },
        {
            "published_date": "2025-04-26T14:41:33",
            "title": "Rising Southern Ocean Heat Boosts US, East Asia Rain",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/rising-southern-ocean-heat-boosts-us-east-asia-rain",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Rising-Southern-Ocean-Heat-Boosts-US-East-Asia-Rain-1745678497.jpg",
            "country": "TR",
            "language": "en",
            "summary": "In Nature Geoscience, scientists have unveiled a complex teleconnection linking delayed warming in the Southern Ocean to intensified precipitation patterns over some of the world's most climatically vulnerable regions, including East Asia, the western United States, and the southeastern United States. The findings have far-reaching implications for understanding climate variability and improving regional climate projections."
        },
        {
            "published_date": "2025-04-26T14:36:33",
            "title": "⚡Mercury Soars to 42.1 Deg C in Delhi, Highest in 3 Years",
            "author": "",
            "url": "https://www.latestly.com/quickly/agency-news/mercury-soars-to-42-1-deg-c-in-delhi-highest-in-3-years-6811021.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/04/delhi-weather.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Delhi recorded its highest maximum temperature in the last three years on Saturday. The mercury reached 42.1 degrees Celsius.       for the whole of the day in Delhi and it was 7 degrees in the rest of the country. for the entire week."
        },
        {
            "published_date": "2025-04-26T14:20:53",
            "title": "Coastal Land Use Impacts on Ghana's Ecosystem Restoration",
            "author": "Department",
            "url": "https://scienmag.com/coastal-land-use-impacts-on-ghanas-ecosystem-restoration",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Coastal-Land-Use-Impacts-on-Ghanas-Ecosystem-Restoration-1745677257.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The study was conducted in the Greater Amanzule wetlands landscape in the coastal zone of Southwest Ghana. The study area covers 60,000 hectares and is known for its rich and diverse but critical marine and coastal habitats and biodiversity. It is located in the only coastal area in Ghana that hosts intact peat swamp forests. The fishing industry in the study region has declined due to overfishing and the region's population is growing. Traditional arable land uses are being displaced in favor of mining and illegal mining operations. Food crop farming is undertaken at the subsistence level and rubber and palm plantation development is dominated by land owners."
        },
        {
            "published_date": "2025-04-26T13:53:46",
            "title": "Living Hell?",
            "author": "Hot Air",
            "url": "https://article.wn.com/view/2025/04/26/Living_Hell",
            "url_media": "https://article.wn.com/view/2025/04/26/[]",
            "country": "US",
            "language": "en",
            "summary": "\"Climate change will make earth a living hell\" claims popular astrophysicist Neil DeGrasse Tyson. I don't believe him. The media say all Arctic ice will soon melt away and Polar bears are dying off. Global warming causes food.    "
        },
        {
            "published_date": "2025-04-26T13:32:34",
            "title": "Kenya's Coastal Fisheries Boost Sustainable Development Goals",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/kenyas-coastal-fisheries-boost-sustainable-development-goals",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Kenyas-Coastal-Fisheries-Boost-Sustainable-Development-Goals-1745674357.jpg",
            "country": "TR",
            "language": "en",
            "summary": "Coastal small-scale fisheries (SSFs) play a pivotal but often underappreciated role in supporting economic stability, food security, and social wellbeing across developing nations. SSFs encompass an array of fishing practices, from handline angling and basket trapping to shrimp and small pelagic fisheries. Unlike industrial fisheries, SSFs rely on traditional methods and small boats. They are characterized by a complex sociocultural fabric involving fishers, traders, processors, and community members, many of whom are women and youth."
        },
        {
            "published_date": "2025-04-26T13:00:00",
            "title": "Climate Change Myths Part 2: Wildfires, Drought, Rising Sea Level, and Coral Reefs",
            "author": "Charles Rotter",
            "url": "https://wattsupwiththat.com/2025/04/26/climate-change-myths-part-2-wildfires-drought-rising-sea-level-and-coral-reefs",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/04/stossel-luekin-part-2.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "John Stossel is debunking climate change myths. Heartland Institute research fellow Linnea Lueken studies extreme weather. The last 50 years have been wetter than average in the US, but there was a drought in the 1930s. The early 1980s were the lowest recorded wildfire years in US wildfire history. Sea level rise is occurring, but it's been slow."
        },
        {
            "published_date": "2025-04-26T12:37:07",
            "title": "Earth Is Approaching Dangerous, Irreversible Climate Tipping Points, Scientists Warn",
            "author": "Jennifer Gray",
            "url": "https://www.yahoo.com/news/earth-approaching-dangerous-irreversible-climate-123707803.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/mLV6Om8NxuINLDQgCu1YQA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_weather_channel_articles_180/81a94dd806efdb5a71aab2f31a132c42",
            "country": "US",
            "language": "en",
            "summary": "There are several climate tipping points that can trigger dramatic environmental shifts that cannot be reversed. These tipping points include the collapse of the Greenland Ice Sheet, dieback of rainforests and rapid thawing of permafrost. The closer we get to these tipping points, the harder it will be to reverse their effects. If we drastically cut emissions we can cut the chances of triggering a tipping point by half."
        },
        {
            "published_date": "2025-04-26T12:33:00",
            "title": "Spin cycle: Why Earth's rotational speed is changing",
            "author": "Madhusree Ghosh",
            "url": "https://www.hindustantimes.com/lifestyle/art-culture/spin-cycle-why-earth-s-rotational-speed-is-changing-101745658227513.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/04/26/1600x900/At-capacity--China-s-Three-Gorges-Dam-holds-back-1_1745658222674.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Earth's rotational speed is changing. The Three Gorges Dam across the Yangtze River in China is one of the most powerful hydroelectric dams in the world. It is estimated that the dam has increased the length of a day by 0.06 microseconds. The melting of ice sheets at the poles and extraction of groundwater are also changing Earth's rotation."
        },
        {
            "published_date": "2025-04-26T12:32:00",
            "title": "Where is the love? See why couples are unexpectedly breaking up, in the world of birds",
            "author": "",
            "url": "https://www.hindustantimes.com/lifestyle/art-culture/where-is-the-love-see-why-couples-are-unexpectedly-breaking-up-in-the-world-of-birds-101745658175208.html",
            "url_media": "https://www.hindustantimes.com/ht-img/img/2025/04/26/1600x900/On-Australia-s-Phillip-Island--fertility-rates-are_1745658167830.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Climate change is intensifying conflict between humans and animals that mate for life. On Australia's Phillip Island, fertility rates are down and separation rates within the world's largest colony of penguins are shooting up. In the Falkland Islands, albatross pairs are torn apart by longer foraging trips. India's sarus cranes are forming trios to raise their chicks. Seychelles warbler couples are breaking up due to extreme weather."
        },
        {
            "published_date": "2025-04-26T12:30:00",
            "title": "5 ways we're making progress on climate change",
            "author": "Bryan Walsh",
            "url": "https://www.vox.com/future-perfect/410553/climate-change-clean-energy-carbon-emissions-renewable-energy-progress",
            "url_media": "https://platform.vox.com/wp-content/uploads/sites/2/2025/04/GettyImages-2164347000.jpg?quality=90&strip=all&crop=0%2C15.095986038394%2C100%2C69.808027923211&w=1200",
            "country": "US",
            "language": "en",
            "summary": "In honor of Earth Week, Batteries are replacing coal in the US, wind and solar produced more electricity than coal for an entire calendar year in 2024. The worst-case scenario for climate change is looking less likely. The energy economy is transitioning and the market is moving forward."
        },
        {
            "published_date": "2025-04-26T12:20:00",
            "title": "Global climate and birth rates",
            "author": "David Lindeman",
            "url": "https://miamivalleytoday.com/global-climate-and-birth-rates",
            "url_media": "https://miamivalleytoday.com/wp-content/uploads/2023/03/transparent.png",
            "country": "US",
            "language": "en",
            "summary": "David Lindeman's college biology professor warned of a new ice age in the 1970s. Now scientists are saying we may enter a mini-ice age as early as 2030. In Japan, public officials are close to a panic over the falling birth rate. President Trump is considering a $5,000 tax bonus for families with new children."
        },
        {
            "published_date": "2025-04-26T11:07:07",
            "title": "An unfathomable near-miss",
            "author": "Pat Flynn",
            "url": "https://clareherald.com/news/weather/storm-eowyn-an-unfathomable-near-miss",
            "url_media": "https://clareherald.com/wp-content/uploads/2024/10/Storm-Waves-Pollock-Holes-Kilkee-1.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Storm Éowyn generated the highest storm surges ever recorded at key locations on Ireland's western seaboard. The highest gust recorded was 184 km/h, with the highest 10-minute wind speed reaching 142 km/hr at Mace Head Atmospheric Research Station in County Galway. The timing of the tides during storm landfall meant little to no flooding impacts. Climate change will drive more extreme rainfall and generate more intense flooding."
        },
        {
            "published_date": "2025-04-26T11:07:07",
            "title": "Power of Storm Éowyn and unfathomable near-miss",
            "author": "Pat Flynn",
            "url": "https://clareherald.com/news/weather/power-of-storm-eowyn-and-unfathomable-near-miss",
            "url_media": "https://clareherald.com/wp-content/uploads/2024/10/Storm-Waves-Pollock-Holes-Kilkee-1.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Storm Éowyn generated the highest storm surges ever recorded at key locations on Ireland's western seaboard. The highest gust recorded was 184 km/h, with the highest 10-minute wind speed reaching 142 km/hr at Mace Head Atmospheric Research Station in County Galway. The timing of the tides during storm landfall meant little to no flooding impacts. Climate change is driving more extreme rainfall and generate more intense flooding."
        },
        {
            "published_date": "2025-04-26T11:04:49",
            "title": "Punjab announces summer holidays from June 1, may start earlier if heat persists",
            "author": "",
            "url": "https://dailytimes.com.pk/1292518/punjab-announces-summer-holidays-from-june-1-may-start-earlier-if-heat-persists",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/04/26/punjab-announces-7-day-holiday-for-schools-due-to-heatwave-1716192602-8396.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Summer holidays in schools in Punjab will start from June 1, 2025. However, the date may change if temperatures rise further. Schools have been asked to follow safety measures until holidays begin. The Provincial Disaster Management Authority has directed all schools to set up first-aid counters."
        },
        {
            "published_date": "2025-04-26T10:45:40",
            "title": "New study uncovers jaw-dropping costs of crisis facing cities around the globe: 'Direct and indirect economic consequences'",
            "author": "Timothy McGill",
            "url": "https://www.yahoo.com/news/study-uncovers-jaw-dropping-costs-104540909.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/yUYNrh2H6onAFyeZVfeMeg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/3c8d59fff88322bfcc6412f89cafbc29",
            "country": "US",
            "language": "en",
            "summary": "The future costs that coastal cities will incur from rising sea levels as the planet overheats could exceed $3 trillion by the end of this century. The research team from the Netherlands and Italy analyzed the possible economic impacts of a high-emissions scenario in 271 regions worldwide. It estimated 872 billion euros in combined economic losses for the UK and EU alone by 2100."
        },
        {
            "published_date": "2025-04-26T10:25:32",
            "title": "Where is the love? See why couples are unexpectedly breaking up, in the world of birds",
            "author": "Hindustan Times",
            "url": "https://article.wn.com/view/2025/04/26/Where_is_the_love_See_why_couples_are_unexpectedly_breaking_",
            "url_media": "https://i.ytimg.com/vi/QtFNIZV_RO8/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "On Australia's Phillip Island, fertility rates are down and separation rates within the world's largest colony of penguins are shooting up. The factors may sound familiar: \"You're a bad parent\" and \"Fertility is down, separation rates are up\". "
        },
        {
            "published_date": "2025-04-26T10:23:40",
            "title": "Climate change serious threat, survival challenge for Pakistan: FinMin",
            "author": "Web Desk Staff",
            "url": "https://pakobserver.net/climate-change-serious-threat-survival-challenge-for-pakistan-finmin",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/04/climate-change-serious-threat-survival-challenge-for-pakistan-finmin-pakobserver-679168.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Muhammad Aurangzeb spoke at a high-level dialogue on the 'Fund for Responding to Loss and Damage (FRLD)' in Washington. The purpose of the FRLD is to assist developing countries in coping with environmental changes including extreme weather events and slow-onset disasters. Pakistan is one of the leading advocates for the establishment of the Fund."
        },
        {
            "published_date": "2025-04-26T10:18:12",
            "title": "Rainstorm destroys over 50 houses in Nasarawa",
            "author": "Abel Daniel",
            "url": "https://www.vanguardngr.com/2025/04/rainstorm-destroys-over-50-houses-in-nasarawa",
            "url_media": "https://cdn.vanguardngr.com/wp-content/uploads/2025/04/Nasarawa-rainfall-havoc.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Residents of Mahanga community in Awe Local Government Area of Nasarawa State have cried out to Governor Abdullahi Sule for help after the havoc caused by rainstorm on Friday night. According to the leader of the group, over 50 houses were affected by the heavy windstorm, with the roofs removed while others collapsed."
        },
        {
            "published_date": "2025-04-26T10:00:09",
            "title": "Scientists flag disturbing trends emerging among large mammals: 'Animals are increasingly compelled ...'",
            "author": "Robert Crow",
            "url": "https://www.yahoo.com/news/scientists-flag-disturbing-trends-emerging-100009282.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/OnlyfcUfAIyhUrjyubZsAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_cool_down_737/d9957bf2917c7e423960b21d1ddbc580",
            "country": "US",
            "language": "en",
            "summary": "The changing climate has affected the migration patterns of Caspian red deer, wild goats, brown bears, and wild boars in Central Alborz Protected Area in Iran. The average summer temperature rose by 4.5 degrees Fahrenheit over the last 20 years. The authors of the study urged the government to protect the area."
        },
        {
            "published_date": "2025-04-26T09:15:44",
            "title": "How spring weather impacts bird migration, nesting: What's happening this month",
            "author": "Hans Kunze",
            "url": "https://www.stargazette.com/story/sports/outdoors/2025/04/26/how-spring-weather-impacts-bird-migration-nesting-column/83195341007",
            "url_media": "https://www.stargazette.com/gcdn/authoring/authoring-images/2025/04/21/NEVR/83195532007-rufouscrownedsparrow-4182025.jpg?crop=1999,1126,x0,y57&width=1999&height=1126&format=pjpg&auto=webp",
            "country": "US",
            "language": "en",
            "summary": "April's cold weather has delayed bird migration and sightings. Many bird species return in April, including sparrows, swallows, and thrushes. May will bring a \"tidal wave\" of migrating birds, including warblers, orioles, and hummingbirds. Waterfowl migration is in full swing. Bald Eagles and Great-horned Owls have been nesting since February."
        },
        {
            "published_date": "2025-04-26T09:09:40",
            "title": "Is South Africa's economy prepared for repetitive weather shocks?",
            "author": "e NCA",
            "url": "https://www.enca.com/videos/discussion-south-africas-economy-prepared-repetitive-weather-shocks",
            "url_media": "https://www.enca.com/sites/default/files/styles/large/public/2025-04/WhatsApp%20Image%202025-04-23%20at%2011.50.46.jpeg.webp?itok=ddTy6TxU",
            "country": "ZA",
            "language": "en",
            "summary": "Conversations around climate change are cooling off. The world is warming at a faster than expected rate. The effects are plain to see, with extreme weather events becoming the norm in the world.       .   ,   and  "
        },
        {
            "published_date": "2025-04-26T09:00:00",
            "title": "Climate Change Weekly # 541 — Earth Is Greening: Thank Climate Change",
            "author": "Guest Blogger",
            "url": "https://wattsupwiththat.com/2025/04/26/climate-change-weekly-541-earth-is-greening-thank-climate-change",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/04/earth-in-hands-123rf.webp?fit=1024%2C512&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "In 2020, the Earth's vegetation coverage and mass reached its highest level since the early 2000s. The increase in CO2 levels and better moisture conditions are responsible for the greening of the Earth. Under President Trump, the U.S. Defense Department and the branches of the military it manages are shutting down their costly, inane climate change efforts."
        },
        {
            "published_date": "2025-04-26T08:41:31",
            "title": "Specialists Task Govt On Climate Change",
            "author": "Latestnigeriannews",
            "url": "https://www.latestnigeriannews.com/p/4283774/specialists-task-govt-on-climate-change.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Governments at all levels urged to do more in checking actions that worsen climate change. Climate change enthusiasts made the appeal in Yola on Friday. They said the effects of climate change are already evident and efforts to halt the phenomenon need to be intensified. The specialists articulated their opinions during a TV show."
        },
        {
            "published_date": "2025-04-26T08:37:00",
            "title": "Summer vacations announced for schools in Punjab",
            "author": "Web Desk",
            "url": "https://www.nation.com.pk/26-Apr-2025/summer-vacations-announced-for-schools-in-punjab",
            "url_media": "https://www.nation.com.pk/digital_images/large/2025-04-26/summer-vacations-announced-for-schools-1745656653-4282.jpeg",
            "country": "PK",
            "language": "en",
            "summary": "Summer vacations for schools in Punjab will begin on June 1, 2025. The schedule may be revised if temperatures rise earlier than expected. The announcement comes a day after the Pakistan Meteorological Department issued a heatwave alert, warning of a high-pressure weather system expected to raise daytime temperatures from April 26 to April 30."
        },
        {
            "published_date": "2025-04-26T08:14:40",
            "title": "A grim signal: Atmospheric CO2 soared in 2024",
            "author": "Inside Climate News",
            "url": "https://news.knowledia.com/all/all/articles/a-grim-signal-atmospheric-co2-soared-in-2024-4d1d336a878d884a5ca9a8180df31b000feac213",
            "url_media": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1143676875-1152x648.jpg",
            "country": "FR",
            "language": "en",
            "summary": "There is a record annual jump in the global mean concentration of carbon dioxide in the atmosphere measured in 2024. The concentration has been increasing since human civilizations started burning coal and oil in the mid-1800s. Last year, the increase measured by the National Oceanic and Atmospheric Administration's Global Monitoring Laboratory was 3.75 ppm."
        },
        {
            "published_date": "2025-04-26T07:56:51",
            "title": "Summer vacations announced for schools",
            "author": "Web Desk",
            "url": "https://arynews.tv/summer-vacations-announced-for-schools-in-punjab-26-april-2025",
            "url_media": "https://arynews.tv/wp-content/uploads/2024/03/Schools-closed-balochistan-showers.jpg",
            "country": "TV",
            "language": "en",
            "summary": "Summer vacations for schools in Punjab will start on June 1, 2025. The schedule could be adjusted if temperatures rise further. Pakistan Meteorological Department issues a heatwave alert, forecasting soaring temperatures across the country from April 26-30 due to the arrival of a high-pressure system in the upper atmosphere."
        },
        {
            "published_date": "2025-04-26T07:18:37",
            "title": "Extra aerial shark patrols for Australian coastline",
            "author": "Samantha Lock",
            "url": "https://www.theadvocate.com.au/story/8951664/extra-aerial-shark-patrols-for-australian-coastline",
            "url_media": "https://www.theadvocate.com.au/images/transform/v1/crop/frm/silverstone-feed-data/8974b604-d240-4754-aac2-d864b7008b24.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Aerial patrols of Australia's coastline will be extended due to increased shark sightings at popular beaches and warmer weather, and there will be more people on the lookout for them.    i.e. for people who have seen sharks on the beaches. "
        },
        {
            "published_date": "2025-04-26T07:18:37",
            "title": "Extra aerial shark patrols for Australian coastline",
            "author": "Samantha Lock",
            "url": "https://www.bordermail.com.au/story/8951664/extra-aerial-shark-patrols-for-australian-coastline",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/8974b604-d240-4754-aac2-d864b7008b24.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Aerial patrols of Australia's coastline will be extended due to increased shark sightings at popular beaches and warmer weather, and there will be more people on the lookout for them.    i.e. for people who have seen sharks on the beaches. "
        },
        {
            "published_date": "2025-04-26T07:00:00",
            "title": "Charlotte County growing at an exponential rate",
            "author": "",
            "url": "https://www.yoursun.com/charlotte/news/charlotte-county-growing-at-an-exponential-rate/article_b2f37e87-edad-49c1-a146-274a074cab09.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/yoursun.com/content/tncms/assets/v3/editorial/e/b5/eb5398cd-5773-4801-a996-222d96ad86ef/680bdd252dfcb.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Charlotte County is projected to increase its population by 33,000 in the next five years. Most residents live in the Port Charlotte mid-county region. There has been a rapid growth in the last five years and most of the population has come from Port Charlotte."
        },
        {
            "published_date": "2025-04-26T06:45:38",
            "title": "Punjab announce schedule for summer vacations 2025 for schools",
            "author": "Our Correspondent",
            "url": "https://pakobserver.net/punjab-announce-schedule-for-summer-vacations-2025-for-schools",
            "url_media": "https://pakobserver.net/wp-content/uploads/2025/04/early-summer-holidays-suggested-for-schools-across-punjab-due-to-heatwave-intensity-pakobserver-675247.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The School Education Department of Punjab has announced early summer vacation for schools, starting from June 1, 2025. The secretary of School Education, Khalid Nazir Wattoo, informed the media that if the weather intensifies further, the current schedule may be reconsidered and holidays could be started a week earlier."
        },
        {
            "published_date": "2025-04-26T06:32:00",
            "title": "Warmer planet makes social mobility harder",
            "author": "Mindfield",
            "url": "https://timesofindia.indiatimes.com/world/mind-field/warmer-planet-makes-social-mobility-harder/articleshow/120635877.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120635897,width-1070,height-580,imgsize-1030801,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "By the end of this century, sea levels will be a foot higher than in 2000. The rich are getting richer, but the poor have stagnated in a hot and sweaty place. Worker productivity in India declined 2-4% for every degree Celsius rise in temperature above the comfortable level. In New York, students' performance fell by 3-4 points on days when the temperature exceeded 32.2°C."
        },
        {
            "published_date": "2025-04-26T06:00:00",
            "title": "Local, national experts warn of declining bird populations",
            "author": "",
            "url": "https://www.telegraphherald.com/news/tri-state/article_de550aaf-075e-4a8a-8e8b-e1cef6d28e20.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/telegraphherald.com/content/tncms/assets/v3/editorial/b/ed/bed8b8b5-daaa-5ced-afc2-282cd8e83a0d/680c2a46a8ed2.image.jpg?crop=307%2C307%2C153%2C137&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "A national report found a significant decrease in the nation's migratory bird populations. Conservationists say the decline is also happening in the tri-state area. The world's birds face numerous headwinds, including the spread of avian flu, invasive species and habitat loss."
        },
        {
            "published_date": "2025-04-26T05:35:47",
            "title": "Geoengineering experiments to dim sunlight may soon begin in the fight against climate change",
            "author": "Daniel Sims",
            "url": "https://news.knowledia.com/all/all/articles/geoengineering-experiments-to-dim-sunlight-may-soon-begin-in-the-fight-6d6d2acee0e07e52e6a08bb40eec7311bdd9da65",
            "url_media": "https://www.techspot.com/images2/news/bigimage/2023/12/2023-12-11-image-10.jpg",
            "country": "FR",
            "language": "en",
            "summary": "ARIA will spend $66.5 million on small-scale outdoor experiments to explore the effects of spreading aerosols into clouds. Many consider the field a dangerous distraction in the fight against global warming. Several proposals have theorized that aerosols might brighten clouds and cool the planet."
        },
        {
            "published_date": "2025-04-26T05:11:15",
            "title": "Scientists have a radical plan to cool Earth—Dim the Sun",
            "author": "",
            "url": "https://www.newsbytesapp.com/news/science/uk-scientists-plan-solar-geoengineering-experiments-to-tackle-climate-change/story",
            "url_media": "https://i.cdn.newsbytesapp.com/images/l7220250426104050.jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Despite the risks, real-world data indicates these geoengineering strategies could work, according to an atmospheric scientist at the University of Exeter. Critics warn these methods could lead to a \"termination shock,\" where the planet rapidly heats up again once aerosol release ceases."
        },
        {
            "published_date": "2025-04-26T05:01:37",
            "title": "Brussels, my love? As the planet heats up, is political momentum cooling down?",
            "author": "",
            "url": "https://uk.news.yahoo.com/brussels-love-planet-heats-political-050137347.html",
            "url_media": "https://media.zenfs.com/en/video.euronews.com/3ba0f5391d2e565a2b7aa21ab2b11435",
            "country": "US",
            "language": "en",
            "summary": "Climate scientists are freaking out about record-breaking temperatures, according to euronews.       in this edition, we hear how climate scientists are concerned about the rise in temperatures.  in the edition, they hear how they are worried about it. "
        },
        {
            "published_date": "2025-04-26T04:59:23",
            "title": "Green Party candidate focuses on Great Lakes",
            "author": "Sonal Gupta",
            "url": "https://news.knowledia.com/all/all/articles/green-party-candidate-focuses-on-great-lakes-1b8c0fc84da38ed7cbf3b80a4ce92f9c81ce6b67",
            "url_media": "https://www.nationalobserver.com/sites/default/files/img/2025/04/21/natasha_akiwenzie.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Natasha Akiwenzie and her husband used to sell Georgian Bay fish at local markets, but they had to stop because of declining lake whitefish populations and climate change. They co-founded Bagidi'waad Alliance, a non-profit focused on climate research, education and land and water stewardship in the Lake Huron-Georgian Bay area."
        },
        {
            "published_date": "2025-04-26T04:50:00",
            "title": "Is soaring temperature in Dhaka becoming a new normal?",
            "author": "UNB",
            "url": "https://www.tbsnews.net/bangladesh/environment/soaring-temperature-dhaka-becoming-new-normal-1126091",
            "url_media": "https://www.tbsnews.net/sites/default/files/styles/social_share/public/images/2019/12/03/earth_temperature_rise_climate_change.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Temperatures in Bangladesh are rising due to climate change. The average temperature in Dhaka has risen by over 3°C in the past 7–8 years. Mohakhali has seen a 7.5°C rise in average temperature since 2007. Climate change is affecting Bangladesh's natural ecosystems, agriculture, livelihoods, and economy."
        },
        {
            "published_date": "2025-04-26T04:50:00",
            "title": "Tropical Ice Cores Unlock Earth's Climate Secrets",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/tropical-ice-cores-unlock-earths-climate-secrets-1450146",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1615309661755-816dcd80bcd3%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D750%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "There is a temperature discrepancy between the data from ice cores from Greenland, Antarctica and tropical mountains and climate models of the Holocene, a geologic era that began about 11,700 years ago. If solved, it could help scientists make more accurate predictions about the planet's future."
        },
        {
            "published_date": "2025-04-26T04:19:18",
            "title": "Australia and Italy see largest spikes in antisemitism, new report finds",
            "author": "",
            "url": "https://www.ynetnews.com/article/by00urcfylx",
            "url_media": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/12/09/HJdFNeNE1x/HJdFNeNE1x_0_85_3000_1689_0_large.jpg",
            "country": "IL",
            "language": "en",
            "summary": "Australia and Italy experienced the largest spikes in antisemitism, according to a report released last week by Tel Aviv University's Center for the Study of Contemporary European Jewry and the Irwin Cotler Institute for Democracy, Human Rights and Justice. Australia experienced a threefold increase in incidents from 2022 to 2024, while Italy saw a twofold increase."
        },
        {
            "published_date": "2025-04-26T04:10:22",
            "title": "Is it still worth getting a home battery in Australia if I can't install solar panels on my roof?",
            "author": "Peter Mares",
            "url": "https://news.knowledia.com/all/all/articles/is-it-still-worth-getting-a-home-battery-in-australia-if-i-can-t-install-befea67d670acc0fdfba8d452c5a27b401b1f41f",
            "url_media": "https://i.guim.co.uk/img/media/43a0de62308bc992df37de74438a8527b108587f/0_235_7050_4230/master/7050.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6182a090f1174bd00e70050fc8efe41c",
            "country": "FR",
            "language": "en",
            "summary": "Change by degrees offers life hacks and sustainable living tips each Saturday to help reduce your household's carbon footprint. Got a question or tip for reducing household emissions? Email us at changebydegrees@gmail.com.    .   \"Change by Degrees\""
        },
        {
            "published_date": "2025-04-26T04:01:09",
            "title": "Tiny golden-crowned kinglets can last the winter if they keep eating even tinier insects fast enough",
            "author": "Jeanine Farley",
            "url": "https://www.cambridgeday.com/2025/04/26/tiny-golden-crowned-kinglets-can-last-the-winter-if-they-keep-eating-even-tinier-insects-fast-enough",
            "url_media": "https://cambridgedaymediafiles.s3.amazonaws.com/public_html/wp-content/uploads/2025/04/25214259/042625fi-Wild-Things.jpg",
            "country": "US",
            "language": "en",
            "summary": "Golden-crowned kinglets are tiny, tiny birds, almost as small as hummingbirds. They have a yellow stripe on the top of the head and a red strip inside the yellow stripe. They are carnivores and eat minute insects and their eggs. They can survive winter nights that are 40 degrees below zero."
        },
        {
            "published_date": "2025-04-26T03:45:38",
            "title": "New technologies are helping to regrow Arctic sea ice",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/new-technologies-are-helping-to-regrow-arctic-sea-ice-0f25bff21c37903874dfb4c78892797a6ef19cb3",
            "url_media": "https://cdn.mos.cms.futurecdn.net/pMbyk73eboqWAgS6zeS22S.jpg",
            "country": "FR",
            "language": "en",
            "summary": "NASA is helping fly drones in the Arctic. Here's what that means for sea ice and sea level change. 3 years ago.   Now NASA is helping flying drones in Arctic. Now it's helping to monitor sea ice in that area.  Now it is monitoring sea ice. "
        },
        {
            "published_date": "2025-04-26T03:30:00",
            "title": "North Carolina couple receives new home after losing almost everything to Hurricane Helene",
            "author": "Kevin Kennedy",
            "url": "https://www.wfmynews2.com/article/news/local/outreach/call-for-action/hurricane-helene-north-carolina-couple-receives-new-home-lost-everything/83-1124e4f5-672f-494f-977a-c6b211f7c3a5",
            "url_media": "https://media.wfmynews2.com/assets/WFMY/images/bebb4918-5180-4745-8fd5-91a9033d988a/20250426T021726/bebb4918-5180-4745-8fd5-91a9033d988a_1140x641.jpg",
            "country": "US",
            "language": "en",
            "summary": "Brian and Melissa Greene's home was destroyed during Hurricane Helene. God's Pit Crew volunteers from across the country helped them to build a new home. The project is part of the ministry's broader mission to construct 25 homes for families displaced by Helene in Western North Carolina."
        },
        {
            "published_date": "2025-04-26T03:00:00",
            "title": "East Africa's blue economy under threat as temperatures surge",
            "author": "Pauline Ongaji",
            "url": "https://nation.africa/kenya/health/east-africa-s-blue-economy-under-threat-as-temperatures-surge-5016836",
            "url_media": "https://nation.africa/resource/image/4911492/landscape_ratio3x2/1200/800/f389b47b2664e6e8328407e22b7008c8/GF/indian-ocean.jpg",
            "country": "KE",
            "language": "en",
            "summary": "Zanzibar, like much of East Africa, is experiencing a rise in extreme heat due to climate change. Coastal waters have seen a rise of nearly 7°C since 1990, with sea temperatures climbing from 31°C in 1990 to a stifling 38°C by 2020. Seaweed production has been affected by rising sea temperatures. Seagrass beds in Kenya are disappearing."
        },
        {
            "published_date": "2025-04-26T02:52:18",
            "title": "Hurricane Helene Recovery Efforts in Western North Carolina",
            "author": "",
            "url": "https://www.newsbreak.com/trending-story/hurricane-helene-recovery-efforts-in-western-north-carolina-680c4a62d36e2877ec4019fa",
            "url_media": "https://static.newsbreak.com/static/share-logo.png",
            "country": "PH",
            "language": "en",
            "summary": "The Carolina Hurricanes have announced a $150,000 grant to Mitchell County Recreation for repairs stemming from Hurricane Helene. Team representatives joined local officials at Wade Tipton Field for a formal check presentation to show their support for storm recovery efforts in Western North Carolina."
        },
        {
            "published_date": "2025-04-26T02:51:23",
            "title": "84% of the world's coral reefs hit by worst bleaching event on record",
            "author": "The Associated Press",
            "url": "https://news.knowledia.com/all/all/articles/84-of-the-world-s-coral-reefs-hit-by-worst-bleaching-event-on-record-a3f6dc089de4f01deac6294736bd00772c16c8c1",
            "url_media": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-04/250423-bleached-coral-reef-ocean-vl-1004a-b54074.jpg",
            "country": "FR",
            "language": "en",
            "summary": "It's the fourth global bleaching event since 1998. It's not clear when the current crisis, which began in 2023, will end. Last year was Earth's hottest year on record. Corals are key to seafood production, tourism and protecting the environment."
        },
        {
            "published_date": "2025-04-26T02:27:09",
            "title": "Okaloosa County invites residents to Vulnerability Assessment Project meeting",
            "author": "Summer Poole",
            "url": "https://www.yahoo.com/news/okaloosa-county-invites-residents-vulnerability-022709081.html",
            "url_media": "https://media.zenfs.com/en/wkrg_articles_233/c4ec4f7784f8e1142fae09b26a14b62a",
            "country": "US",
            "language": "en",
            "summary": "The Okaloosa Board of County Commissioners and Jacobs Engineering are holding a second public meeting on April 30 for the Vulnerability Assessment Project. The meeting will take place from 5:30 to 7 p.m. at Warriors Hall in Crestview. The project is aimed at 'safeguarding the unincorporated areas' against environmental risks."
        },
        {
            "published_date": "2025-04-26T01:59:00",
            "title": "Vietnam's Mekong Delta loses hundreds of hectares annually to coastal erosion",
            "author": "Minh Duy",
            "url": "https://news.tuoitre.vn/vietnams-mekong-delta-loses-hundreds-of-hectares-annually-to-coastal-erosion-103250425145647094.htm",
            "url_media": "https://cdn2.tuoitre.vn/zoom/600_315/471584752817336320/2025/4/25/rung-phong-ho-bac-lieu-1745487259752990807027-17455669223432122151025-100-0-1440-2560-crop-1745566998184566705788.jpg",
            "country": "VN",
            "language": "en",
            "summary": "The Southern Institute of Water Resources Planning (SIWRP) hosted a climate resilience workshop in Can Tho on Thursday. The workshop reviewed the current status of coastal protection and discussed nature-based solutions to strengthen climate adaptation. Do Duc Dung, SIWRP's chief, reported that coastal erosion and mangrove degradation have become increasingly severe."
        },
        {
            "published_date": "2025-04-26T00:01:00",
            "title": "Climate finance and new Fund for Responding to Loss and Damage",
            "author": "",
            "url": "https://www.ft.lk/opinion/Climate-finance-and-new-Fund-for-Responding-to-Loss-and-Damage/14-775849",
            "url_media": "https://bmkltsly13vb.compat.objectstorage.ap-mumbai-1.oraclecloud.com/cdn.ft.lk/assets/uploads/image_33cded4502.jpg",
            "country": "LK",
            "language": "en",
            "summary": "The Fund for Responding to Loss and Damage was established in 2022 and 2023 and is in the process of full operationalisation. It aims to support developing countries in developing and implementing effective responses to climate-induced loss and damage. A total of $ 765 million has been pledged to the fund for this purpose. The board of the fund met in Barbados for the first time in 2025. It decided on the strategy and rules for the delivery of funding during the start-up phase until the end of 2026."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Susan Atkinson: Challenges Montana ranchers face due to hotter, drier conditions",
            "author": "Susan Atkinson Guest columnist",
            "url": "https://bozemandailychronicle.com/opinions/guest_columnists/susan-atkinson-challenges-montana-ranchers-face-due-to-hotter-drier-conditions/article_c6acbc39-fd74-44af-a1c7-cd20b87d586c.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/bozemandailychronicle.com/content/tncms/custom/image/2ffee154-edef-11e4-a572-ab4a61dde6eb.png?resize=600%2C315",
            "country": "US",
            "language": "en",
            "summary": "Ranchers in Montana are aware of the challenges posed by climate change. The state has experienced a long-term trend toward warmer and drier conditions, particularly during the summer months. Longer fire seasons, increased fire danger, and more frequent droughts are expected in the coming century. Long-term sustainability will require coordinated climate resilience strategies."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "STOSSEL: Living hell? I don't believe it",
            "author": "",
            "url": "https://www.standard.net/opinion/national-commentary/2025/apr/26/stossel-living-hell-i-dont-believe-it",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.standard.net/images/2021/09/16125347/Stossel_John.jpg",
            "country": "US",
            "language": "en",
            "summary": "There are four myths about climate change. The last 50 years have generally been wetter than average, so there's been no increase in drought. The real cause of wildfires is land management. Sea level rise is occurring, but it's been slow and people can adapt to it."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "G20: Agriculture Dept warns of impact of inadequate responses to climate change",
            "author": "Primedia",
            "url": "https://www.ewn.co.za/2025/04/26/g20-agriculture-dept-warns-of-impact-of-inadequate-responses-to-climate-change",
            "url_media": "https://media-cache.primedia-service.com/media/0aflhrll/pexels-pixabay-60013.jpg?width=1200&height=630",
            "country": "ZA",
            "language": "en",
            "summary": "Delegates from all 20 of the bloc's member states met for a three-day meeting in Durban this week. The agricultural working group discussed policy priorities, including plans to strengthen trade and to address shortcomings in the agriculture industry. Disruptive weather has caused extensive damage and loss of life in parts of South Africa."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "'Trump won't save us': Australians' radical shift on US relations",
            "author": "system",
            "url": "https://article.wn.com/view/2025/04/26/Trump_wont_save_us_Australians_radical_shift_on_US_relations",
            "url_media": "https://i.ytimg.com/vi/vy3rncs8DsY/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Most Australians believe the U.S. can no longer be relied on for security in a fundamental change of worldview, research for Q+A shows. The research is based on interviews with more than 1,000 people from Australia and New Zealand, and it's based on their personal opinions. "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Data show Earth continues to get hotter",
            "author": "The Danville News",
            "url": "https://article.wn.com/view/2025/04/26/Data_show_Earth_continues_to_get_hotter_c",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "2024 was the warmest year on record according to six different international datasets. The last 10 years, from 2015 to 2024, are the 10 hottest in recorded history, which dates back to the mid-19th century, according to the World Meteorological Organization."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Why Australia's most prominent climate change deniers have stopped talking about the climate",
            "author": "AOL",
            "url": "https://article.wn.com/view/2025/04/26/Why_Australia_s_most_prominent_climate_change_deniers_have_s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The only regular meeting of Australia's Saltbush Club takes place most Thursday evenings at a golf club in Five Dock, in Sydney's inner west. The group's founding members include Gina Rinehart, the former Queensland premier Campbell Newman and the Energy Realists of Australia."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Climate change threatens centuries-old cultural practices too, says IIT-M prof",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/04/26/Climate_change_threatens_centuriesold_cultural_practices_too_5",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The traditional music of the koraga community from coastal Karnataka is fading due to climate change. Reduced rainfall, rising temperature, and shoreline erosion deeply affected the community's traditional music, says professor from the department of humanities and social sciences, IIT Madras."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "During migration season, turn off your lights to help birds fly safe",
            "author": "The Journal Durango",
            "url": "https://article.wn.com/view/2025/04/26/During_migration_season_turn_off_your_lights_to_help_birds_f",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The next few weeks mark the peak of bird migration season. Hundreds of millions of birds migrate across the continent at night. Scientists are calling on the public to be more aware of the phenomenon.    for help in monitoring the birds. for help. "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Politicians talk about Arctic sovereignty. But as a northern voter, I feel abandoned by Ottawa",
            "author": "CBC",
            "url": "https://article.wn.com/view/2025/04/26/Politicians_talk_about_Arctic_sovereignty_But_as_a_northern_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Damien Haogak sees the impact of climate change, rising costs of living and the lack of education on the lives of people in the U.S. and around the world. He believes it will get worse in the future. He is concerned about climate change and rising cost of living."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "First Introduced To Australia In 1788, This Invasive Species Now Kills Over A Million Birds ...",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/04/26/First_Introduced_To_Australia_In_1788_This_Invasive_Species_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Feral and domestic cats have been reshaping Australia's biodiversity for decades at a staggering cost. Island extinctions and nationwide losses have been caused by feral and domestic cat population growth and decline.    i.e. island extinctions, nationwide losses and habitat loss."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Letter: The climate crisis is urgent and demands our action and attention",
            "author": "Grand Forks Herald",
            "url": "https://article.wn.com/view/2025/04/26/Letter_The_climate_crisis_is_urgent_and_demands_our_action_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "To the editor, hundreds of millions of Americans and the entire planetary population are on a collision course with the planetary reality of catastrophic climate change. The reality of our human-caused climate crisis is not abstract and is poised to impact us.    \"The whole planet is at risk\" "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Pay attention when experts use scary words",
            "author": "The Danville News",
            "url": "https://article.wn.com/view/2025/04/26/Pay_attention_when_experts_use_scary_words",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "To wrap up CNHI's enterprise reporting on climate change and its impact on the weather, agriculture, personal health and other parts of our daily lives, I spent a lot of time diving through tons of data about climate trends. Read about ocean temperatures and melting ice caps."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Nature Trail: Moss growth in lawns a continuous challenge",
            "author": "Irish Independent",
            "url": "https://article.wn.com/view/2025/04/26/Nature_Trail_Moss_growth_in_lawns_a_continuous_challenge",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is resulting in warmer air. Warm air can hold more moisture than colder air, so global warming means increased moisture in the air, which is good for climate change. It's also good for water storage in the atmosphere, because it holds more water."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "A living hell?",
            "author": "John Stossel",
            "url": "https://www.miningjournal.net/opinion/2025/04/a-living-hell",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.miningjournal.net/images/2025/04/25122907/Stossel-John-563x840.jpg",
            "country": "US",
            "language": "en",
            "summary": "There are four myths about climate change. The last 50 years have generally been wetter than average, so there's been no increase in drought. The real cause of wildfires is land management. Sea level rise is occurring, but it's been slow and people can adapt to it."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Mid-Ohio Valley Climate Corner: What's food got to do with it?",
            "author": "Linda Eve Seth",
            "url": "https://www.newsandsentinel.com/opinion/local-columns/2025/04/mid-ohio-valley-climate-corner-whats-food-got-to-do-with-it",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.newsandsentinel.com/images/2024/11/18191718/Image-MOV-Climate-Corner-1100x653.jpg",
            "country": "US",
            "language": "en",
            "summary": "Reducing meat and dairy production is responsible for 30% of all global greenhouse gas emissions. Americans consume an average of 200 pounds of meat per person per year. A vegan or plant-based diet can grow 10,000 times as many calories on one acre of land as growing an animal. If the world were to end all meat production and transition to a plant- based food system over the next 15 years, it would prevent enough greenhouse gases to cancel out all other economic sectors for the next 30 to 50 years."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "The climate crisis is now",
            "author": "Hassan Baig",
            "url": "https://www.thenews.com.pk/print/1305227-the-climate-crisis-is-now",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-04-26/1305227_011357_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "There was a hailstorm in Islamabad and surrounding areas recently. Pakistan is one of the most climate-vulnerable countries in the world. The last calendar year, 2024, was the hottest year in recorded history. The international community needs to take climate change seriously in order to effectively manage and mitigate its impact."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Warmer planet makes social mobility harder",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/04/26/Warmer_planet_makes_social_mobility_harder",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "By the end of this century, sea levels will be a foot higher than in 2000. The average person is 31 years old today, and given that global life expectancy is 73.5 years, they may be dead by 2068. Keynes said, \"The long run is a misleading guide to current affairs\"."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Pacific island states urge rich countries to expedite plans to cut emissions",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/26/Pacific_island_states_urge_rich_countries_to_expedite_plans__a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Time is running out to submit national plans well before Cop30 to avoid 1.5C temperature rise, as time runs out to avoid the Cop30 deadline. Developed countries need to submit plans before the deadline to avoid Cop30, which is on June 30th."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Spring's hot weather to be treat for nature lovers",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/04/26/Springs_hot_weather_to_be_treat_for_nature_lovers",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A spell of hot weather will give a boost to nature as migratory birds return and butterflies emerge, as they will be attracted to the sun.       .   \"Hot weather\" is good for birds, butterflies and insects. "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Spring wave of hot weather to be treat for nature lovers",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/04/26/Spring_wave_of_hot_weather_to_be_treat_for_nature_lovers",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A spell of hot weather will give a boost to nature as migratory birds return and butterflies emerge, as they will be attracted to the sun.       .   \"Hot weather\" is good for birds, butterflies and insects. "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Don't forget that climate change threats still exist",
            "author": "Lewiston Sun Journal",
            "url": "https://article.wn.com/view/2025/04/26/don_8217t_forget_that_climate_change_threats_still_exist_let",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "April is Earth Month. Mainers should remember that climate change is a cause of global warming, as well as many other things, such as deforestation and deforestation in the state, and the effects of climate change on Mainers' environment.   . "
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Australia and Italy see largest spikes in antisemitism, new report finds",
            "author": "Virtual Jerusalem",
            "url": "https://article.wn.com/view/2025/04/26/Australia_and_Italy_see_largest_spikes_in_antisemitism_new_r",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "According to Tel Aviv University report, Australia experienced a threefold increase in antisemitic incidents from 2022 to 2024, while Italy saw a twofold increase.       .   in the last decade in Australia, Italy and Israel saw a rise in incidents."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Thermal drones used in Wiltshire to track down rare birds",
            "author": "BBC News",
            "url": "https://article.wn.com/view/2025/04/26/Thermal_drones_used_in_Wiltshire_to_track_down_rare_birds",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Thermal drones are being used to search more than 160,000 acres (250 square miles) looking for nesting great bustard birds. Since 1998, hundreds of the turkey-like birds have been re-introduced onto Salisbury Plain in Wiltshire by the Great Bustard Group."
        },
        {
            "published_date": "2025-04-26T00:00:00",
            "title": "Golden chain saw fells longtime NOAA marine biologist in Galveston",
            "author": "The Galveston Daily News",
            "url": "https://article.wn.com/view/2025/04/26/Golden_chain_saw_fells_longtime_NOAA_marine_biologist_in_Gal",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "NOAA's mission to predict changes in climate, weather, oceans and coasts is threatened by sharp staffing and budget cuts, insiders say.    - NOAA's mission is to conserve and manage coastal and marine ecosystems and fisheries.  - It's also to protect and manage the environment."
        }
    ]
}