{
    "status": "ok",
    "total_articles": 147,
    "articles": [
        {
            "published_date": "2025-04-16T23:50:25",
            "title": "Potential NOAA cuts could jeopardize weather reporting that's crucial for boaters and hunters",
            "author": "Knba",
            "url": "https://alaskapublic.org/news/alaska-desk/2025-04-16/potential-noaa-cuts-could-jeopardize-weather-reporting-thats-crucial-for-boaters-and-hunters",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/0dc2064/2147483647/strip/true/crop/1440x756+0+102/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa7%2F20%2Ff864d4dd4bd7a7119fed8ed4c454%2Fbuoys-edited.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration is considering slashing more than a quarter of the National Oceanic and Atmospheric Administration's budget in 2026. The cuts would be especially deep for NOAA's fisheries services and research operations. Alaska Ocean Observing System provides boaters, fishermen and subsistence hunters with information about things like waves, currents and water temperatures."
        },
        {
            "published_date": "2025-04-16T23:42:00",
            "title": "Through Climate Diplomacy, Nepal Sounds the Alarm on the Himalayas",
            "author": "",
            "url": "https://thediplomat.com/2025/04/through-climate-diplomacy-nepal-sounds-the-alarm-on-the-himalayas",
            "url_media": "https://thediplomat.com/wp-content/uploads/2023/06/sizes/td-story-s-2/thediplomat_2023-06-21-142523.jpg",
            "country": "JP",
            "language": "en",
            "summary": "Nepal revives the prestigious Sagarmatha Sambad, also known as the 'Everest Dialogue,' now set for May 16-18,2025. The platform is intended to address climate change, climate justice, and their associated impacts. Nepal is located in the Hindu Kush Himalayan (HKH) region, home to eight of the world's highest peaks including Mount Everest, the tallest mountain on Earth. Nepal contributes just 0.027 percent of global greenhouse gas emissions, but it is on the frontline of climate impacts."
        },
        {
            "published_date": "2025-04-16T23:34:52",
            "title": "Climate Change Threatens Global Rice Supply",
            "author": "archyde",
            "url": "https://www.archyde.com/climate-change-threatens-global-rice-supply",
            "url_media": "https://insideclimatenews.org/wp-content/uploads/2020/10/GeorginaGustin-300x300.jpg",
            "country": "US",
            "language": "en",
            "summary": "A new study shows that climate change is increasing the levels of inorganic arsenic in rice grains. Arsenic is a carcinogen and a major health risk for people who eat rice. The study focused on Asia, but the implications for the U.S. are clear. Many Americans eat rice regularly."
        },
        {
            "published_date": "2025-04-16T23:18:01",
            "title": "Research Reveals Climate Change Drives Up Arsenic Levels in Paddy Rice,",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/research-reveals-climate-change-drives-up-arsenic-levels-in-paddy-rice-heightening-health-risks",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/04/Research-Reveals-Climate-Change-Drives-Up-Arsenic-Levels-in-Paddy-Rice-Heightening-Health-Risks-1744845485.jpg",
            "country": "TR",
            "language": "en",
            "summary": "A new study from Columbia University's Mailman School of Public Health finds a link between climate change and increased inorganic arsenic levels in paddy rice grains by the mid-21st century. Inorganic arsenic is a well-documented toxin known to induce serious chronic illnesses, including multiple cancers, cardiovascular diseases, and metabolic disorders. Populations in southern China, Southeast Asia, and South Asia already consume rice containing significant arsenic levels. The projected climate-driven increases threaten to exacerbate this public health challenge."
        },
        {
            "published_date": "2025-04-16T23:13:00",
            "title": "Nonprofit aims to conserve bird habitats in metro Detroit",
            "author": "Jack Filbrandt",
            "url": "https://wdet.org/2025/04/16/nonprofit-aims-to-conserve-bird-habitats-in-metro-detroit",
            "url_media": "https://wdet.org/wp-content/uploads/2025/04/Detroit-Bird-Alliance-e1744906161811.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Global warming and climate change poses a significant threat to two-thirds of North American bird species. Ava Landgraf is the conservation and research coordinator for the Detroit Bird Alliance, a nonprofit working to protect birds and their habitats in southeast Michigan. She joined The Metro to discuss the important role birds play in our environment."
        },
        {
            "published_date": "2025-04-16T23:05:07",
            "title": "LIVE: Election campaign 2025 - Anthony Albanese faces another immigration problem as overseas arrivals exposed for using devious tactic to sneak into Australia",
            "author": "BRETT LACKEY",
            "url": "https://www.dailymail.co.uk/news/article-14620115/australia-election-2025-live-updates-albanese-dutton.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/04/16/23/97366273-0-image-a-8_1744843582162.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Queensland University of Technology says nearly half of its foreign students dropped out of their studies in their first year. The retention rate for international students dropped to an unusual and historic low of 53.6%. In February this year a new monthly record of 197,000 international students arrived in the country."
        },
        {
            "published_date": "2025-04-16T23:03:00",
            "title": "The fundamental factors to watch in grain pricing as northern crop heats up",
            "author": "",
            "url": "https://www.farmonline.com.au/story/8944941/fundamental-weather-issues-starting-to-emerge-in-northern-crops",
            "url_media": "https://www.farmonline.com.au/images/transform/v1/crop/frm/5Q2j7ezUfQBfUJsaqK3gfB/2f732d3d-498b-49bc-9f4b-0a15f77c713d.JPG/r0_425_6000_3575_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The northern hemisphere crop is coming out of dormancy and into the critical part of the growing season. Australian cash prices are starting to lift slightly on the back of weather concerns, which is also starting to have an impact on the market.   . "
        },
        {
            "published_date": "2025-04-16T22:34:00",
            "title": "National Hurricane Center discusses how to prepare for the 2025 season",
            "author": "Jacqueline Thomas",
            "url": "https://www.wmur.com/article/national-hurricane-center-2025-season-prep-041625/64506497",
            "url_media": "https://kubrick.htvapps.com/vidthumb/a04a72fb-3eb1-4566-ad97-b742f215d59a/c147a52a-816d-4645-ae36-ae553f109de1.jpg?crop=0.787xw:0.786xh;0.114xw,0&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "National Hurricane Center deputy director Jamie Rhome discusses how to prepare for the 2025 hurricane season and the technology they plan to use to assess storm risks and impacts in the future. The technology will be based on the latest advances in data analysis technology.    "
        },
        {
            "published_date": "2025-04-16T22:33:12",
            "title": "Will global warming impact your life? Results from poll break 28-year record",
            "author": "Brendan Rascius",
            "url": "https://www.eagletribune.com/region/will-global-warming-impact-your-life-results-from-poll-break-28-year-record/article_1b01b71c-3b71-5e8e-9704-8ae4b6ba7675.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/eagletribune.com/content/tncms/custom/image/ae213140-df8c-11e7-b06d-b798580d75a5.jpg?resize=600%2C333",
            "country": "US",
            "language": "en",
            "summary": "A new poll shows 48% of Americans consider global warming a serious threat to their way of life. It's the highest share since the survey was conducted in 1997.      Â   .   in the latest Gallup survey, 48% said global warming will pose a 'serious threat' during their lifetime. "
        },
        {
            "published_date": "2025-04-16T22:20:55",
            "title": "Cyclone intensifies as it heads towards the coast",
            "author": "Savannah Meacham",
            "url": "https://www.mandurahmail.com.au/story/8944919/cyclone-intensifies-as-it-heads-towards-the-coast",
            "url_media": "https://www.mandurahmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/e25cf234-b6e1-49f9-aa54-fea7fe2b1592.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "It will take days for Errol to reach the coast and no significant wind or rain is forecast on Thursday, but communities may start to feel the effects in the coming days.   Â. Â   y. y. Y. "
        },
        {
            "published_date": "2025-04-16T22:05:00",
            "title": "Pollen watch: What will the allergy season be like this year?",
            "author": "Jennifer Thuncher",
            "url": "https://www.vancouverisawesome.com/weatherhood-local/pollen-watch-what-will-the-allergy-season-be-like-this-year-10534683",
            "url_media": "https://www.vmcdn.ca/f/files/squamishchief/images/environment/aerobiology-research-laboratories.jpeg;w=1200;h=800;mode=crop",
            "country": "CA",
            "language": "en",
            "summary": "Birch and poplar pollen levels are going to peak, cedar and alder levels dropping, according to Aerobiology Research Laboratories data. The arrival of warmer weather on the west coast is triggering a rise in highly allergenic pollen types such as birch, poplar and oak. The company is developing an app that will provide users with pollen forecasts and allow them to log medication and symptoms."
        },
        {
            "published_date": "2025-04-16T21:58:02",
            "title": "Glaciers in Sweden and Norway are melting faster, experts warn",
            "author": "Chitty",
            "url": "https://www.euronews.com/green/2025/04/16/glaciers-in-sweden-and-norway-are-melting-faster-experts-warn",
            "url_media": "https://static.euronews.com/articles/stories/09/20/92/56/1200x675_cmsv2_4c6194f0-fbf3-5f02-9db1-d2a4d14f91f4-9209256.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Glaciers in Sweden and Norway have been melting at an alarming rate due to climate change. Experts warn that if the trend continues, many of these glaciers could vanish entirely within the coming decades. The IPCC has warned that if we continue to warm the planet at this rate, four out of five glaciers in Sweden will have shrunk significantly or melted completely by the year 2100."
        },
        {
            "published_date": "2025-04-16T21:27:28",
            "title": "How will global warming impact your life? Results from poll break 28-year record",
            "author": "Brendan Rascius",
            "url": "https://www.miamiherald.com/news/nation-world/national/article304378246.html",
            "url_media": "https://www.miamiherald.com/news/nation-world/national/rmik9f/picture304376701/alternates/LANDSCAPE_1140/markus-spiske-JnT4Mjq5n_E-unsplash.jpg",
            "country": "US",
            "language": "en",
            "summary": "48% of Americans consider global warming to be a major concern, according to the latest Gallup survey. This is a 4-point increase from 2024, when 44% of poll respondents called global warming a serious threat. A majority of respondents, 63%, said the effects of global warming have already begun, outpacing the previous all-time high of 62%. However, 51% don't believe global warming will constitute a major threat in their lifetime, the lowest share on record."
        },
        {
            "published_date": "2025-04-16T20:57:09",
            "title": "Billie Eilish and Support+Feed announce ‘Overheated' 2025 climate events in London and Berlin",
            "author": "NME",
            "url": "https://article.wn.com/view/2025/04/16/billie_eilish_and_support_feed_announce_8216overheated_8217_",
            "url_media": "https://i.ytimg.com/vi/IR4gQ0yE6r0/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Billie Eilish has announced another set of her Overheated climate action events in London and Berlin. The events will take place at the venues and include climate activists, musicians, designers and other leading voices filled with discussion, community building and resources to help tackle the climate crisis."
        },
        {
            "published_date": "2025-04-16T20:50:54",
            "title": "Wildfire threat rises, burn ban now in effect",
            "author": "Al Everson",
            "url": "https://beacononlinenews.com/2025/04/16/wildfire-threat-rises-burn-ban-now-in-effect",
            "url_media": "https://beacononlinenews.com/wp-content/uploads/2025/04/Depositphotos_10550334_S-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "The recent period of mostly rainless days, low humidity and brisk winds has prompted authorities in Volusia County and the City of Deltona to ban outdoor burning. The burn bans are now in effect in the unincorporated parts of the county, Lake Helen and Oak Hill, and inside the city. The tinderbox conditions may last for several days, as no significant rainfall is in the offing."
        },
        {
            "published_date": "2025-04-16T20:39:37",
            "title": "Flood Mitigation: Tinubu Approves N15b",
            "author": "Ayobamiji Komolafe",
            "url": "https://newtelegraphng.com/flood-mitigation-tinubu-approves-n15b",
            "url_media": "https://newtelegraphng.com/wp-content/uploads/2025/01/Bola_Tinubu_portrait.jpg",
            "country": "NG",
            "language": "en",
            "summary": "President Bola Ahmed Tinubu has approved the sum of N15 billion to prevent floods in 30 states. Vice President Kashim Shettima made the disclosure at the Validation Workshop for the Anticipatory Action Framework for Nigeria ahead of the rainy season. 15 million Nigerians remain at high risk of flooding this season."
        },
        {
            "published_date": "2025-04-16T20:34:00",
            "title": "Climate Myths",
            "author": "John Stossel",
            "url": "https://pjmedia.com/john-stossel/2025/04/16/climate-myths-n4938945",
            "url_media": "https://media.townhall.com/cdn/hodl/2018/247/cf727a67-a2aa-44c2-930f-04a21951970d.jpg",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres is hyping global warming. Heartland Institute fellow Linnea Lueken is annoyed by the media and politicians pushing hysterical myths about climate change. Al Gore said in 2009 that the Arctic will be completely ice-free within 5 to 7 years, but it's been 16 years. Polar bear populations have increased."
        },
        {
            "published_date": "2025-04-16T20:00:00",
            "title": "What's biting: Promising weather and post-swell bites for the long weekend",
            "author": "Columnist Kate Shelton",
            "url": "https://www.macleayargus.com.au/story/8944100/long-weekend-fishing-promises-on-the-macleay-and-hastings",
            "url_media": "https://www.macleayargus.com.au/images/transform/v1/crop/frm/203448486/81a70a87-a2f7-4706-b6f3-0866639d9fb2.JPG/r0_40_590_350_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "The recent easterly swell presented challenging bar conditions for both locals and visiting anglers in Macleay region of Australia.   .     \"The last few days have been challenging for local and visiting fishermen in the MacLeay region."
        },
        {
            "published_date": "2025-04-16T20:00:00",
            "title": "Robert Sulnick: Donald Trump's Climate Policies Portend Disaster for Santa Barbara",
            "author": "Robert Sulnick",
            "url": "https://www.noozhawk.com/robert-sulnick-donald-trumps-climate-policies-portend-disaster-for-santa-barbara",
            "url_media": "https://i0.wp.com/www.noozhawk.com/wp-content/uploads/2022/12/social-fallback.png?fit=1200%2C630&quality=80&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Trump's tariffs will raise prices for Central Coast consumers. Measles has returned to California and 21 other states. Trump declared an 'energy emergency' on his first day in office. He wants to open up more than 1 million acres of public land in Santa Barbara, San Luis Obispo, Ventura and Tulare counties to fossil fuel extraction. The Community Environmental Council has been working on a project to improve access to electric vehicles and other clean energy technologies for almost two years. Now, that project faces a $2.5 million funding deficit."
        },
        {
            "published_date": "2025-04-16T19:46:53",
            "title": "GOB Moves to Address Ongoing Erosion on Placencia Peninsula",
            "author": "hipolito",
            "url": "https://edition.channel5belize.com/gob-moves-to-address-ongoing-erosion-on-placencia-peninsula",
            "url_media": "https://edition.channel5belize.com/wp-content/uploads/2025/04/2-Grid-View119.jpg",
            "country": "BZ",
            "language": "en",
            "summary": "Ministers of Sustainable Development, Climate Change and Solid Waste Management, Natural Resources, Petroleum & Mining, and Infrastructure Development and Housing met this week to discuss the coastal erosion in Placencia Peninsula. The government is committed to identifying and addressing both natural and human-induced factors contributing to the degradation of the coastline."
        },
        {
            "published_date": "2025-04-16T19:40:21",
            "title": "Climate Myths",
            "author": "John",
            "url": "https://www.sgtreport.com/2025/04/climate-myths",
            "url_media": "https://media.townhall.com/cdn/hodl/2023/159/c6b080a4-a68f-43a1-928e-cfd7556de1f3-1052x615.jpg",
            "country": "US",
            "language": "en",
            "summary": "John Stossel is annoyed by politicians, activists and media pushing hysterical myths about global warming. Al Gore said in 2009 that the Arctic ice cap could be completely ice-free within 5 to 7 years. In fact, 16 years have passed and the ice cap has plenty of ice even in summer."
        },
        {
            "published_date": "2025-04-16T19:27:07",
            "title": "‘Thirstwaves' are the new climate threat. What are they?",
            "author": "Mark Collins",
            "url": "https://www.news4jax.com/weather/2025/04/16/thirstwaves-are-the-new-climate-threat-what-are-they",
            "url_media": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/G4WKBXS3U5HLPNBOJH25OEJ6VA.jpg?_a=DATAdtccZAA0",
            "country": "US",
            "language": "en",
            "summary": "A new study looked at 40 years of data across U.S. farmland and found that these 'thirstwaves' are getting more intense, more frequent, and lasting longer. The chances of not having one have dropped by 4% per decade. The High Plains, like Kansas and Oklahoma, are seeing some of the strongest thirstwaves. Parts of the South and West Coast are seeing more events per season."
        },
        {
            "published_date": "2025-04-16T19:16:45",
            "title": "‘Whole ecosystems decimated' by huge rise in UK wildfires",
            "author": "Nadeem Badshah",
            "url": "https://www.theguardian.com/uk-news/2025/apr/16/whole-ecosystems-decimated-by-huge-rise-in-uk-wildfires",
            "url_media": "https://i.guim.co.uk/img/media/7447f3c50839159a8bf8757e39ae22ca246b351c/0_0_3796_2278/master/3796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=83353331f4d6cdd8e0822ed8d4db0ecf",
            "country": "GB",
            "language": "en",
            "summary": "It was one of the worst wildfire seasons on record in the UK. Abergwesyn Common in Powys, Wales, was consumed by a 1,600-hectare (3,950-acre) fire, 400 times larger than Cardiff's Principality Stadium. The common is a breeding habitat for the area's last known population of golden plovers. In Northern Ireland, recent fires on the Mourne Mountains have scorched land used by an array of wildlife including small heath butterflies, rove beetles, skylarks and peregrine falcons."
        },
        {
            "published_date": "2025-04-16T19:12:46",
            "title": "BC Wildfire Service expecting warmer-than-normal spring temperatures",
            "author": "Charlie Carey",
            "url": "https://vancouver.citynews.ca/2025/04/16/bc-spring-forecast-wildfire-service",
            "url_media": "https://vancouver.citynews.ca/wp-content/blogs.dir/sites/9/2024/07/28/Slocan-Lake-Fire-Wildfire-Complex-BC-Wildfire-Service-3-1024x576.png",
            "country": "CA",
            "language": "en",
            "summary": "B.C. is set to see warmer-than-normal temperatures for the next few months. There is a chance for more precipitation than normal for coastal and central B.C.'s in April, May, and June. The northeast of the province remains an area of concern due to drought conditions."
        },
        {
            "published_date": "2025-04-16T19:09:14",
            "title": "Battling climate change: How smallholder farmers in KwaZulu-Natal are adapting to survive",
            "author": "Naledi Sikhakhane",
            "url": "https://www.dailymaverick.co.za/article/2025-04-16-battling-climate-change-how-smallholder-farmers-in-kwazulu-natal-are-adapting-to-survive",
            "url_media": "https://i0.wp.com/www.dailymaverick.co.za/wp-content/uploads/2025/04/nongo19-scaled.jpg?fit=1280%2C765&quality=89&ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "40,5% of people in KwaZulu-natal live below the poverty line, R796 per person per month (R27 a day). The province accounts for the highest rural poverty at 29%. Smallholder farmers in Zululand say farming is their last line of defence against hunger. They blame climate change for the frequent illness of livestock and whole harvests being wiped out. The Climate Champions project assists 25 to 30 households in different villages throughout northern KZN."
        },
        {
            "published_date": "2025-04-16T19:06:45",
            "title": "Birds show personality through song: Australian study",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250416/2143896a71d34ec0ae114a9e9ea3167f/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Singing in some small birds reflects their personality and plays a critical role in mating and territory defense, according to Flinders University study. The study looked at how two traits, exploration and aggressiveness, affect the songs of the wild superb fairy-wrens."
        },
        {
            "published_date": "2025-04-16T18:52:28",
            "title": "BOM Easter weather forecast brings cyclone, big swells and temperature whiplash",
            "author": "weather reporter",
            "url": "https://www.abc.net.au/news/2025-04-17/easter-weather-forecast-australia/105178016",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/b8a89e1f585375b5975cb21620d3344b?impolicy=wcms_watermark_news&cropH=909&cropW=1616&xPos=0&yPos=86&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Australia's weather will be nice for the Easter long weekend. It will be warm for most of south-eastern Australia, before a cool change sets in from Sunday. Ex-tropical cyclone Tam will whip up waves of up to 5 metres for the New South Wales and southern Queensland coast from Thursday to Saturday. Cyclone Errol has formed over the north-west of WA."
        },
        {
            "published_date": "2025-04-16T18:46:44",
            "title": "Karachi prepares for potential heatwave starting Sunday",
            "author": "Rabia Ghouri",
            "url": "https://24newshd.tv/16-Apr-2025/karachi-prepares-for-potential-heatwave-starting-sunday",
            "url_media": "https://24newshd.tv/digital_images/large/2025-04-16/karachi-prepares-for-potential-heatwave-starting-sunday-1744829180-2562.jpg",
            "country": "TV",
            "language": "en",
            "summary": "Temperatures continue to rise across Pakistan's southern Sindh province. The highest temperature on Tuesday was recorded in Nawabshah at a scorching 47°C, while Larkana and Jacobabad also saw the mercury rise to 46°C. The potential heatwave is expected to grip Karachi starting Sunday and last until Wednesday or Thursday next week. Local authorities have begun setting up relief stalls across various districts of the city."
        },
        {
            "published_date": "2025-04-16T18:39:18",
            "title": "Under the Blazing Sky: A Growing Crisis of Climate and Survival",
            "author": "",
            "url": "https://statetimes.in/under-the-blazing-sky-a-growing-crisis-of-climate-and-survival",
            "url_media": "https://statetimes.in/wp-content/uploads/2023/04/No-heatwave-conditions-over-most-of-India.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In 2024, parts of the country reported temperatures soaring past 52°C, surpassing previous records. Over 700 deaths and 48,000 people came with the complications of heat stroke and heat-related cases were reported between March to June 2024. The report screams the deep cracks in public health systems, urban planning, and environmental policies."
        },
        {
            "published_date": "2025-04-16T18:29:32",
            "title": "Playing politics with disaster recovery",
            "author": "Sun Sentinel Editorial Board",
            "url": "https://www.sun-sentinel.com/2025/04/16/playing-politics-with-disaster-recovery-editorial",
            "url_media": "https://www.sun-sentinel.com/wp-content/uploads/2024/06/tfl-l-edgewood-flooding-ftl-0613-02.jpg?w=1024&h=684",
            "country": "US",
            "language": "en",
            "summary": "FEMA's Building Resilient Infrastructure and Communities program, known as BRIC, would have elevated roads in Jacksonville, built a hurricane safe room for first responders in Key West and hardened the system of canal infrastructure that makes life possible in South Florida. Even the state Division of Emergency Management, under the direction of Gov. Ron DeSantis, has to return $37 million in federal BRIC money."
        },
        {
            "published_date": "2025-04-16T17:56:05",
            "title": "Palm Beach County Collaborates with Municipalities to Address Climate",
            "author": "Source",
            "url": "https://hoodline.com/2025/04/palm-beach-county-collaborates-with-municipalities-to-address-climate-risks-through-community-workshops",
            "url_media": "https://img.hoodline.com/2025/4/palm-beach-county-collaborates-with-municipalities-to-address-climate-risks-through-community-workshops-3.webp",
            "country": "US",
            "language": "en",
            "summary": "Palm Beach County is teaming up with local municipalities for a series of community workshops focused on tackling the impending threats of flooding and sea level rise. The workshops aim to discuss the progress of Flood and Sea Level Rise Risk Assessments. The county hopes to leverage these insights to secure infrastructure implementation grants from the Resilient Florida Grant Program."
        },
        {
            "published_date": "2025-04-16T17:48:58",
            "title": "Check Environmental degradation!",
            "author": "Northlines",
            "url": "https://thenorthlines.com/check-environmental-degradation",
            "url_media": "",
            "country": "IN",
            "language": "en",
            "summary": "Jammu and Kashmir witnessed its driest year in over five decades in 2024. The aftershocks of that environmental crisis are continuing to be felt in 2025. This prolonged dry spell has had serious repercussions on agriculture, horticulture, and allied sectors. Communities across the Union Territory are struggling to adapt to this new and harsh reality. Environmental issues transcend political boundaries and in the case of J&K, the solution lies in a collective and coordinated approach that includes stakeholders from across the region."
        },
        {
            "published_date": "2025-04-16T17:40:00",
            "title": "Türkiye left without fruit harvest",
            "author": "Maria Petrova",
            "url": "https://en.vestikavkaza.ru/material/174728",
            "url_media": "https://en.vestikavkaza.ru/upload2/2025-04-16/174481610667ffc7ea8140d3.15620379.webp",
            "country": "RU",
            "language": "en",
            "summary": "Severe frosts destroyed the main fruit crops of Türkiye in early April. Almost the entire harvest of apricots, peaches, nectarines and apples was destroyed. The frosts also had a strong impact on the main crops of hazelnuts and walnuts."
        },
        {
            "published_date": "2025-04-16T17:38:13",
            "title": "Apologies and 'lies' fly in second leaders' debate",
            "author": "",
            "url": "https://thewest.com.au/politics/election/apologies-and-lies-fly-in-second-leaders-debate-c-18399985",
            "url_media": "https://images.thewest.com.au/publication/C-18399985/450e6cbc890385e895303273d3e5a8aa5e8abd37-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T17:37:02",
            "title": "Pakistan issues advisory on Congo virus and heatstroke risks",
            "author": "News Desk",
            "url": "https://www.pakistantoday.com.pk/2025/04/16/pakistan-issues-advisory-on-congo-virus-and-heatstroke-risks",
            "url_media": "https://www.pakistantoday.com.pk/wp-content/uploads/2022/06/congo-pak.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's National Institute of Health issues public health advisories on Crimean-Congo Haemorrhagic Fever (CCHF) and heatstroke. NIH reports 61 CCHF cases in 2024, prompting calls for preventive measures. Heatwave advisory issued by the Pakistan Meteorological Department forecasts unusually high temperatures across much of Sindh province through April 18."
        },
        {
            "published_date": "2025-04-16T17:35:07",
            "title": "Lions out to protect streak against 'confident' Magpies",
            "author": "",
            "url": "https://thewest.com.au/sport/afl/lions-out-to-protect-streak-against-confident-magpies-c-18399933",
            "url_media": "https://images.thewest.com.au/publication/C-18399933/799f98da80304bb8993a8258ff9bf2e0c564e48d-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T17:10:08",
            "title": "Devastating Hailstorm Hits Pakistan: A Climate Wake-Up Call",
            "author": "Islamabad",
            "url": "https://www.devdiscourse.com/article/science-environment/3348783-devastating-hailstorm-hits-pakistan-a-climate-wake-up-call",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/25_03_2025_14_15_17_042465.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "A powerful hailstorm hit Islamabad and parts of Khyber Pakhtunkhwa, Pakistan. The storm caused flash floods in several low-lying areas. Emergency teams worked hard to clear roads and assess the damage. Climate change and its role in the extreme weather event have been highlighted."
        },
        {
            "published_date": "2025-04-16T17:05:58",
            "title": "Women vendors weathering the storm",
            "author": "Akangjungla",
            "url": "https://morungexpress.com/women-vendors-weathering-the-storm",
            "url_media": "https://morungexpress.com/uploads/2025/04/14703702_1744822998_EDITORIAL.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Akangjungla is concerned about the plight of street vendors in Nagaland. The impact of climate change on street vendors is undeniable. The lack of effective policy implementation aggravates their struggles. The Town Vending Committees (TVCs), which represent vendors' interests, remain largely inactive. The Act adopted by the state in 2019 is not effective."
        },
        {
            "published_date": "2025-04-16T16:52:06",
            "title": "NYTimes Falsely Claims Climate Change Will Trigger ‘Global Economic Disaster'",
            "author": "Anthony Watts",
            "url": "https://climatechangedispatch.com/nytimes-falsely-claims-climate-change-will-trigger-global-economic-disaster",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/04/nytimes-headline.jpg",
            "country": "US",
            "language": "en",
            "summary": "David Gelles wrote an article in the New York Times 'Climate Change Could Become a Global Economic Disaster'. The article is based on a faulty analysis of climate change and a flawed understanding of economics and history. There is no impending famine due to climate change, only misleading headlines crafted to push policy agendas."
        },
        {
            "published_date": "2025-04-16T16:30:00",
            "title": "Research promises more precise predictions",
            "author": "Sam Henderson",
            "url": "https://www.odt.co.nz/the-star/research-promises-more-precise-predictions",
            "url_media": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2025/04/star17iceflow1.jpg?itok=ASo1NhPA",
            "country": "NZ",
            "language": "en",
            "summary": "Study by the University of Otago promises more accurate predictions about how glaciers and ice sheets move. Past models underestimated the complexity of ice deformation, resulting in less reliable forecasts. The research was supported by the Royal Society Te Apārangi Marsden Fund and Antarctica New Zealand."
        },
        {
            "published_date": "2025-04-16T16:19:59",
            "title": "The climate crisis explained: Impacts on Indianapolis and pathways forward",
            "author": "Indianapolis Recorder",
            "url": "https://article.wn.com/view/2025/04/16/The_climate_crisis_explained_Impacts_on_Indianapolis_and_pat",
            "url_media": "https://article.wn.com/view/2025/04/16/[]",
            "country": "US",
            "language": "en",
            "summary": "In Martindale-Brightwood, the summer days are longer and the storms are fiercer. The community is grappling with challenges due to a changing climate. There are rising heat waves and flash floods in the area. The weather is getting hotter and more intense."
        },
        {
            "published_date": "2025-04-16T15:56:48",
            "title": "The Sun Didn't Change—We Did: How Humans Dimmed and Brightened the Earth",
            "author": "Studyfinds Staff",
            "url": "https://studyfinds.org/sunlight-dimming-air-pollution",
            "url_media": "https://studyfinds.org/wp-content/uploads/2025/04/Pollution-scaled.jpg",
            "country": "US",
            "language": "en",
            "summary": "After decades of 'global dimming' caused by pollution, surface sunlight levels are now rebounding in parts of the world. Tiny particles from industrial and vehicle emissions scatter sunlight, reducing how much reaches the ground. As countries like China reduce air pollution, sunshine levels are rising again. Changes in sunlight affect everything from crop yields to temperature trends and solar energy production."
        },
        {
            "published_date": "2025-04-16T15:50:35",
            "title": "Illegal construction in Chennai's Muttukadu coast: Stop-work order issued",
            "author": "Geetha Srimathi",
            "url": "https://www.thehindu.com/news/cities/chennai/illegal-construction-in-muttukadu-coast-stop-work-order-issued/article69457034.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/420u1k/article69460236.ece/alternates/LANDSCAPE_1200/1693_14_4_2025_20_32_4_2_DSC_3955.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Chengalpattu district administration has issued a stop-work order for illegal constructions undertaken along the Muttukadu coast. The structures were being built on poromboke land and in areas classified as 'No Development Zone' under the Coastal Regulation Zone (CRZ) Notification, 2019. The buildings must be demolished or restored to their original condition within 15 days."
        },
        {
            "published_date": "2025-04-16T15:50:35",
            "title": "District authorities issue stop-work order to unauthorised construction in Muttukadu",
            "author": "Geetha Srimathi",
            "url": "https://www.thehindu.com/news/cities/chennai/district-authorities-issue-stop-work-order-to-unauthorised-construction-in-muttukadu/article69457034.ece",
            "url_media": "https://th-i.thgim.com/public/incoming/x7k70f/article69457622.ece/alternates/LANDSCAPE_1200/1693_14_4_2025_20_32_6_5_DSC_3994.JPG",
            "country": "IN",
            "language": "en",
            "summary": "Chengalpattu district administration has issued a stop-work order for illegal constructions undertaken along the Muttukadu coast. The structures were being built on poromboke land and in areas classified as 'No Development Zone' under the Coastal Regulation Zone (CRZ) Notification, 2019. The buildings must be demolished or restored to their original condition within 15 days."
        },
        {
            "published_date": "2025-04-16T15:26:05",
            "title": "Lungs of the Earth struggle amid drought, fires and warming",
            "author": "The Washington Post",
            "url": "https://www.iol.co.za/saturday-star/news/lungs-of-the-earth-struggle-amid-drought-fires-and-warming-effe2f9c-4dd8-4ccb-ad8d-de7c411cb716",
            "url_media": "https://image-prod.iol.co.za/resize/650x366/An-illegally-deforested-area-is-seen-on-a-highway-in-the-city-of-Humaita-Amazonas-Brazil-Since-2015-with-the-promises-of-paving-the-highway-the-pressure-for-deforestation-and-land-grabbing-has-grown?source=https://iol-prod.appspot.com/image/c80ec294f893ce7a8e37ce28cbd543ee0cfedf44/3000&operation=CROP&offset=0x156&resize=3000x1688",
            "country": "ZA",
            "language": "en",
            "summary": "The amount of carbon dioxide in the atmosphere grew at the fastest rate in recorded history last year. The concentration of CO2 increased by 3.75 parts per million in 2024, 27 percent larger than the previous record increase, in 2015. The land and oceans have historically taken up about half of the greenhouse gases people emit."
        },
        {
            "published_date": "2025-04-16T15:23:20",
            "title": "Record-high share of US adults see global warming as ‘serous threat' to themselves: Gallup",
            "author": "Sarah Fortinsky",
            "url": "https://www.yahoo.com/news/record-high-share-us-adults-152320005.html",
            "url_media": "https://media.zenfs.com/en/the_hill_articles_341/fbd31170ca331a4172446a758fea0db2",
            "country": "US",
            "language": "en",
            "summary": "A record-high share of U.S. adults say they think global warming will pose a serious threat to them in their lifetime, according to a Gallup poll released Wednesday. A majority of Americans don't expect global warming to pose serious threats to them or their way of life. Americans today are more likely than ever to say the effects of global warming have already begun."
        },
        {
            "published_date": "2025-04-16T15:21:40",
            "title": "Hordes of Tourists Are Trashing Antarctica",
            "author": "Joe Wilkins",
            "url": "https://www.yahoo.com/news/hordes-tourists-trashing-antarctica-152140495.html",
            "url_media": "https://media.zenfs.com/en/futurism_981/a6ec3cdf738e357d903bf9f4fc344d3a",
            "country": "US",
            "language": "en",
            "summary": "A growing tourist industry is turning Antarctica into a resort colony. The majority of tourists depart for the Southern Continent via cruise ship out of Ushuaia, Argentina, dubbed the \"end of the world.\" The number of Antarctic visitors has increased by nearly 215 percent since the 2014-2015 season. Each tourist emits nearly five tons of CO2 emissions per trip."
        },
        {
            "published_date": "2025-04-16T15:20:49",
            "title": "Green isn't always good — especially in Antarctica",
            "author": "",
            "url": "https://www.nbclosangeles.com/news/national-international/green-isnt-always-good-especially-in-antarctica/3680319",
            "url_media": "https://media.nbclosangeles.com/2025/04/39027705490-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "country": "US",
            "language": "en",
            "summary": "The coldest parts of the planet act as giant mirrors, reflecting the sun's energy back to space. What happens when algae and pollution cover snow and ice? National climate reporter Chase Cain explains the ripple effects from Antarctica.       . "
        },
        {
            "published_date": "2025-04-16T15:16:50",
            "title": "Spotify users report service outages",
            "author": "",
            "url": "https://thewest.com.au/technology/spotify-users-report-service-outages-c-18399273",
            "url_media": "https://images.thewest.com.au/publication/C-18399273/2336153ba723a10b8af9b8f19746ed07630477ee-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T15:10:23",
            "title": "North-East states discuss climate adaptation strategies in Dimapur",
            "author": "",
            "url": "https://morungexpress.com/north-east-states-discuss-climate-adaptation-strategies-in-dimapur",
            "url_media": "https://morungexpress.com/uploads/2025/04/72614522_1744815965_IMG_1095 copy.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Regional workshop on India's forthcoming National Adaptation Plan concluded in Dimapur on Tuesday. It brought together representatives from eight northeastern states, technical experts, and development partners to discuss climate change adaptation strategies. States participating included Arunachal Pradesh, Assam, Manipur, Meghalaya, Mizoram, Nagaland, Sikkim and Tripura."
        },
        {
            "published_date": "2025-04-16T14:54:51",
            "title": "40 Years of Flying Into Danger to Save Lives",
            "author": "The Epoch Times",
            "url": "https://article.wn.com/view/2025/04/16/40_Years_of_Flying_Into_Danger_to_Save_Lives",
            "url_media": "https://i.ytimg.com/vi/md9-jG4RzXs/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Marcus Grey is an Australian Mission Aviation Fellowship (MAF) pilot. He has spent the past four decades flying to some of the most remote areas in Australia and the Pacific. He doesn't have a typical day at the office, but he's always busy."
        },
        {
            "published_date": "2025-04-16T14:52:59",
            "title": "Town Of Narragansett: Working Waterfronts Resilience Workshop Scheduled For Residents Worried About Flooding",
            "author": "Jimmy Bentley",
            "url": "https://patch.com/rhode-island/narragansett/town-narragansett-working-waterfronts-resilience-workshop-scheduled",
            "url_media": "https://patch.com/img/cdn/assets/article/ai-article/government/municipal_government.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Town of Narragansett is offering a workshop on climate resilience around the Port of Galilee. Food and a participation stipend are included in the workshop. Sign up for the Patch newsletter and alerts to stay up-to-date on the latest news."
        },
        {
            "published_date": "2025-04-16T14:49:52",
            "title": "Cook Islands welcomes global mandatory climate provision in maritime transport",
            "author": "Cook Islands News",
            "url": "https://article.wn.com/view/2025/04/16/Cook_Islands_welcomes_global_mandatory_climate_provision_in_",
            "url_media": "https://article.wn.com/view/2025/04/16/[]",
            "country": "US",
            "language": "en",
            "summary": "This is the first-ever global mandatory climate provision in maritime transport is embraced by the Cook Islands, given the sustained and increasing impacts of climate change on the Pacific region. For the first time, a global multilateral agreement on climate change is not about winners or losers."
        },
        {
            "published_date": "2025-04-16T14:40:24",
            "title": "The climate crisis explained: Impacts on Indianapolis and pathways forward",
            "author": "Hanna Rauworth",
            "url": "https://indianapolisrecorder.com/climate-change-explainer",
            "url_media": "https://indianapolisrecorder.com/wp-content/uploads/2025/04/GettyImages-2186636724.jpg",
            "country": "US",
            "language": "en",
            "summary": "According to the Environmental Resilience Institute at Indiana University, average annual temperatures will increase by 5 to 6 degrees Fahrenheit by 2050. The number of days per year with temperatures above 95°F in Southern Indiana could rise from the average of seven to as many as 51 days by mid-century. Warmer air can hold more moisture, leading to heavier rainfall and flash floods. Flooding and water quality are a concern for low-income neighborhoods."
        },
        {
            "published_date": "2025-04-16T14:17:58",
            "title": "Haywood farmers talk Hurricane Helene recovery, continuing loss of farmland",
            "author": "Cory Vaillancourt",
            "url": "https://smokymountainnews.com/news/item/39410-haywood-farmers-talk-hurricane-helene-recovery-continuing-loss-of-farmland",
            "url_media": "https://smokymountainnews.s3.amazonaws.com/media/k2/items/cache/d63b6de4b7ed63f226f4f5f83b8a39c5_L.jpg?javer=2504161208",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Helene devastated North Carolina's agriculture industry last year. The industry is worth $100 billion and employs 10% of the state's workforce. 80% of prime farmland in Haywood County, North Carolina has already been lost. The General Assembly's Helene relief bill, passed last month, included $311 million for agricultural and aquacultural producers who suffered verifiable losses in disaster-affected counties in 2024."
        },
        {
            "published_date": "2025-04-16T14:00:00",
            "title": "Scitech promised $100m for major transformation under Labor",
            "author": "",
            "url": "https://thewest.com.au/politics/federal-politics/scitech-promised-100m-for-major-transformation-under-labor-c-18396623",
            "url_media": "https://images.thewest.com.au/publication/C-18396623/37f7757de35d7962b3321e58f6bd5a1a6f89a388-16x9-x0y107w2048h1152.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T13:57:22",
            "title": "Here's Why Planners Turned Down Major Island Housing Development",
            "author": "Rufus Pickles",
            "url": "https://www.iwradio.co.uk/news-post/here-s-why-planners-turned-down-major-island-housing-development",
            "url_media": "https://static.wixstatic.com/media/d5b2d7_dd2172c5fbbd42e3b8a2b0fe61c63ab4~mv2.jpg/v1/fill/w_962,h_581,al_c,q_85/d5b2d7_dd2172c5fbbd42e3b8a2b0fe61c63ab4~mv2.jpg",
            "country": "GB",
            "language": "en",
            "summary": "'The development would result in the loss of an important gap within an area where the farmland forms an important green lung between developed areas and the coast. The loss of this gap would harm the visual amenity of the landscape character of the area.   "
        },
        {
            "published_date": "2025-04-16T13:55:00",
            "title": "You Won't Believe Who The Climate Change Nut Jobs Are Targeting Now...",
            "author": "Tyler Durden",
            "url": "https://www.zerohedge.com/political/you-wont-believe-who-climate-change-nut-jobs-are-targeting-now",
            "url_media": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-04/green-hair.jpg?itok=I7-5IiyI",
            "country": "BG",
            "language": "en",
            "summary": "Mother Jones wrote that dogs have 'extensive and multifarious' environmental impacts, disturbing wildlife, polluting waterways and contributing to carbon emissions. The review, published in the journal Pacific Conservation Biology, highlighted the impacts of the world's 'commonest large carnivore' in killing and disturbing native wildlife, particularly shore birds. Attacks by unrestrained dogs on penguins in Tasmania may contribute to colony collapse. Bobcats and deer are less active when dogs are around."
        },
        {
            "published_date": "2025-04-16T13:52:52",
            "title": "Virginia's Rappahannock River among nation's top 10 'endangered' waterways: Here's why",
            "author": "Bill Atkinson",
            "url": "https://eu.progress-index.com/story/news/2025/04/16/virginia-river-nation-most-endangered-american-rivers/83085943007",
            "url_media": "https://www.gannett-cdn.com/authoring/videos/accuweather/thumbnails/83026422007.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Rappahannock River, Virginia's third largest river, is listed as the sixth most endangered river in the U.S. by American Rivers. Declining groundwater levels and lack of comprehensive water supply planning are cited as primary threats. Extreme weather patterns and drought conditions have reduced the river's eastward flow for extended periods of time. The solution is for Virginia and the local governments on its shores to develop a unified strategy to manage resources."
        },
        {
            "published_date": "2025-04-16T13:50:26",
            "title": "How Miami is dealing with the clash of climate change and the economy",
            "author": "With Ai Summarization",
            "url": "https://www.miamiherald.com/news/local/article304339431.html",
            "url_media": "https://www.miamiherald.com/latest-news/5z1gb5/picture293615249/alternates/LANDSCAPE_1140/7D6A5747.png",
            "country": "US",
            "language": "en",
            "summary": "Rising seas and extreme weather are increasing costs for farmers, restaurateurs and cities. Clam farming in Cedar Key struggles to rebound from consecutive climate-induced disasters. Without fixes, Key Biscayne roads could be underwater every day by 2070. Florida is a leader in prescribed burns to keep neighborhoods safe from runaway blazes."
        },
        {
            "published_date": "2025-04-16T13:46:29",
            "title": "KZN disaster management teams remain on high alert as heavy rain pummels province",
            "author": "Primedia",
            "url": "https://www.ewn.co.za/kzn-disaster-management-teams-remain-on-high-alert-as-heavy-rain-pummels-province",
            "url_media": "https://media-cache.primedia-service.com/media/aa3dbkyv/kzn-flooding-march.jpg?width=1200&height=630",
            "country": "ZA",
            "language": "en",
            "summary": "Heavy rains continue to pummel KwaZulu-Natal. A Level 5 weather warning for significant rainfall accumulation is in effect for the districts of eThekwini, iLembe, uMgungundlovu, Ugu, and Harry Gwala."
        },
        {
            "published_date": "2025-04-16T13:45:30",
            "title": "Caribbean urged to overhaul storm plans",
            "author": "Shamar Blunt",
            "url": "https://barbadostoday.bb/2025/04/16/caribbean-urged-to-overhaul-storm-plans",
            "url_media": "https://barbadostoday.bb/wp-content/uploads/2025/04/UNDP-Resident-Representative-for-Barbados-and-the-Eastern-Caribbean-Limya-Eltayeb-scaled-e1744784059277.jpg",
            "country": "BB",
            "language": "en",
            "summary": "Caribbean nations must rethink their hurricane preparedness as storms grow more powerful and arrive earlier, the United Nations has warned. Limya Eltayeb issued the call during Monday's launch of a US$2.93 million ($5.96 million) coastal fisheries resilience project. The initiative aims to help rebuild the island's fishing industry, which was severely affected by Hurricane Beryl in 2024. University of Colorado predicts above-average hurricane activity for the 2025 season. Forecasts project 17 named storms, with nine expected to reach major hurricane status – category 3 or higher."
        },
        {
            "published_date": "2025-04-16T13:13:07",
            "title": "Climate Facts: 90% of Lake Chad volume lost in last 60 years, says UNEP",
            "author": "Janefrances Chibundu",
            "url": "https://www.thecable.ng/climate-facts-90-of-lake-chad-volume-lost-in-last-60-years-says-unep",
            "url_media": "https://www.thecable.ng/wp-content/uploads/2021/06/Lake-Chad.jpg",
            "country": "NG",
            "language": "en",
            "summary": "The Lake Chad has lost more than 90 percent of its volume since the 1960s. IEA says solar energy capacity has doubled in the last three years. Lightning strikes are projected to increase by approximately 12 percent for every 1°C rise in global temperature. The melting of glaciers reduces pressure on earth's crust."
        },
        {
            "published_date": "2025-04-16T13:00:45",
            "title": "Oceans vs cities: France's beaches are shrinking",
            "author": "Aurore Cloé DUPUIS",
            "url": "https://www.france24.com/en/tv-shows/down-to-earth/20250416-oceans-vs-cities-france-s-beaches-are-shrinking",
            "url_media": "https://s.france24.com/media/display/e021237a-1aae-11f0-ad60-005056bf30b7/w:1280/p:16x9/EN_20250411_125149_125703_CS.jpg",
            "country": "FR",
            "language": "en",
            "summary": "40 percent of the world's population live in coastal areas. Climate change is speeding up coastal erosion. Lacanau, in southwestern France, is considering moving inland by 2100. FRANCE 24's Aurore Cloé Dupuis, Alexandra Renard, John Walsh and Carlotta Poirier report."
        },
        {
            "published_date": "2025-04-16T12:55:10",
            "title": "Weather Alert: KZN residents warned of possible snowfall",
            "author": "Somila Tiwani",
            "url": "https://www.thesouthafrican.com/news/weather-alert-kzn-residents-warned-of-possible-snowfall",
            "url_media": "https://www.thesouthafrican.com/wp-content/uploads/2025/04/pexels-jill-wellington-1638660-259583_11zon-e1744804196299.jpg.optimal.jpg",
            "country": "ZA",
            "language": "en",
            "summary": "According to forecasts from the South African Weather Service, KwaZulu-Natal residents are being warned of possible snowfall and heavy rains this Easter weekend (18 – 21 April). Authorities are urging caution, especially in high-risk areas. Road Traffic Inspectorate will closely monitor traffic and may organise road closures. More than 10 motor grader drivers will be stationed along key routes to remove snow before it builds up on the road."
        },
        {
            "published_date": "2025-04-16T12:45:00",
            "title": "Can the World Really Unite Around Climate—Or Is It Just Talk?",
            "author": "Atta Ur Rehman",
            "url": "https://www.msn.com/en-us/news/world/can-the-world-really-unite-around-climate-or-is-it-just-talk/ss-AA1D2A6u",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Every nation, every leader and every person rallies together to fight the greatest crisis of our time, climate change. Some say we're on the brink of achieving something historic, others argue it's all just grand speeches and empty promises. This is a question that touches every weather enthusiast and every citizen who cares about our planet's future."
        },
        {
            "published_date": "2025-04-16T12:39:35",
            "title": "Chittering crash: Women and two children rushed to Joondalup Health Campus",
            "author": "",
            "url": "https://thewest.com.au/news/wa/chittering-crash-women-and-two-children-rushed-to-joondalup-health-campus-c-18397896",
            "url_media": "https://images.thewest.com.au/publication/C-18397896/7046ebf0d4d0d7651380b6fb419b34726cc7b556-16x9-x0y343w4000h2250.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T12:31:37",
            "title": "2025 Mazda CX-90 G50e Azami review",
            "author": "",
            "url": "https://thewest.com.au/lifestyle/motoring/2025-mazda-cx-90-g50e-azami-review-c-18398387",
            "url_media": "https://images.thewest.com.au/publication/C-18398387/f431c36fbcf5d4c881c7c463b7afc969cd085249-16x9-x0y0w3009h1693.png?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "From Australia's most wanted to Britain's most feared, here's what it's really like to be wanted in Australia and in Britain.    .      i   in the UK,  in this case, \"most feared\". "
        },
        {
            "published_date": "2025-04-16T12:26:07",
            "title": "Climate Change Myths Part 1: Polar Bears, Arctic Ice, And Food Shortages",
            "author": "John Stossel",
            "url": "https://climatechangedispatch.com/climate-change-myths-part-1-polar-bears-arctic-ice-and-food-shortages",
            "url_media": "https://climatechangedispatch.com/wp-content/uploads/2025/04/stossel-climate-myths-fb.jpg",
            "country": "US",
            "language": "en",
            "summary": "The facts disprove the climate change fanatics' catastrophic claims. In this video and the next, we will debunk 7 myths about climate change. First up: melting ice, polar bear extinction, and climate change famines. Next up: the Arctic will soon be ice-free and cities underwater."
        },
        {
            "published_date": "2025-04-16T12:19:43",
            "title": "GMF: Transition to low-carbon maritime poses both challenges and opportunities",
            "author": "SAFETY4SEA",
            "url": "https://article.wn.com/view/2025/04/16/GMF_Transition_to_lowcarbon_maritime_poses_both_challenges_a",
            "url_media": "https://i.ytimg.com/vi/PiriMwcRlyQ/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Jesse Fahnestock is Director of Decarbonisation at the Global Maritime Forum (GMF). He stresses the importance of ensuring that the green transition \"what good looks like\" is achieved.       in an exclusive interview to SAFETY4SEA."
        },
        {
            "published_date": "2025-04-16T12:14:34",
            "title": "Why Peter Dutton would trash the Paris climate agreement",
            "author": "",
            "url": "https://www.thenewdaily.com.au/news/politics/australian-politics/2025/04/16/coalition-paris-climate-trash",
            "url_media": "https://wp.thenewdaily.com.au/wp-content/uploads/2025/04/1744762320-edm-PeterDuttonCoalNuclearEnergyClimate.jpg?resize=1200%2C630",
            "country": "AU",
            "language": "en",
            "summary": "The Coalition is flip-flopping on whether it would keep Australia in the Paris climate agreement or not. Thom Woodroofe is a senior international fellow with the Smart Energy Council. He was a diplomatic adviser in the negotiations of the Paris agreement. He believes the Coalition's policies are out of step with it and undermine the agreement."
        },
        {
            "published_date": "2025-04-16T12:00:36",
            "title": "Direct Air Capture: a CO₂ Needle in a Haystack",
            "author": "Tuco's Child",
            "url": "https://tucoschild.substack.com/p/direct-air-capture-a-co-needle-in",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F68215f22-e7af-42c3-978f-d2782e2acb69_680x481.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Gene of GreenNuke and Gedanken are discussing the negligible role of CO₂ on global warming. They are also discussing the role of the sun, moon, earth orbit, volcanoes, tectonic shifts, or water in the ocean/atmosphere/land/ice caps."
        },
        {
            "published_date": "2025-04-16T11:41:06",
            "title": "Heatwave Ignites Crime Surge In Madhya Pradesh; Expert Cites Disruption In 'Happy Hormone' Levels",
            "author": "ETV Bharat",
            "url": "https://etvbharat.com/en/!bharat/heatwave-ignites-crime-surge-in-madhya-pradesh-expert-cites-disruption-in-happy-hormone-levels-enn25041602030",
            "url_media": "https://etvbharatimages.akamaized.net/etvbharat/prod-images/16-04-2025/1200-675-23971566-thumbnail-16x9-heat-aspera.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Madhya Pradesh is witnessing 25 percent rise in crime cases in summers as compared to winter months. Gwalior in Chambal valley accounts for 20 percent of the total cases. Psychiatrist Dr. Kamlesh Udaniya attributed the rise to the disturbance in human hormone levels due to rising temperature."
        },
        {
            "published_date": "2025-04-16T11:33:41",
            "title": "Deportation Fight Escalates, and America's New Meth Crisis",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/04/16/Deportation_Fight_Escalates_and_America_s_New_Meth_Crisis",
            "url_media": "https://article.wn.com/view/2025/04/16/[]",
            "country": "US",
            "language": "en",
            "summary": "\"The Great Moose Migration\" is published by Simon & Schuster. It's also available in English and in German. It is published in English with a German edition. It has a different title, \"The Great Moose Migration\". It's available in German and in English. "
        },
        {
            "published_date": "2025-04-16T11:28:08",
            "title": "Study warns of dramatic Austrian glacier melt",
            "author": "",
            "url": "https://www.omanobserver.om/article/1169157/features/lifestyle/study-warns-of-dramatic-austrian-glacier-melt",
            "url_media": "https://www.omanobserver.om/omanobserver/uploads/images/2025/04/16/thumbs/600x600/2982839.jpg",
            "country": "OM",
            "language": "en",
            "summary": "Glaciers in Austria could disappear in the foreseeable future due to climate change. Five glaciers disappeared in the Ötztal and Stubaitalregions between 2006 and 2017. Global temperature increase would have to be limited to 1.5 degrees Celsius in order to save even a small part of the ice masses."
        },
        {
            "published_date": "2025-04-16T11:10:24",
            "title": "VIDEO: 'I'm not a scientist': Dutton and Albanese go head-to-head on climate",
            "author": "",
            "url": "https://www.abc.net.au/news/2025-04-16/%E2%80%9Ci%E2%80%99m-not-a-scientist%E2%80%9D:-dutton-and-albanese-go-head/105185672",
            "url_media": "https://live-production.wcms.abc-cdn.net.au/d7b914e0806d24928af5fa205402aef3?impolicy=wcms_watermark_news&cropH=576&cropW=1024&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "country": "AU",
            "language": "en",
            "summary": "Albanese says extreme weather will cost the environment and the economy. Dutton avoids saying that climate change is worsening.       in Albanese's opinion.  in Dutton's opinion,  in the opinion of Albanese, the climate is getting worse."
        },
        {
            "published_date": "2025-04-16T10:56:35",
            "title": "UV Index and humidex, Canadian-made",
            "author": "Susanna McLeod",
            "url": "https://www.intelligencer.ca/opinion/uv-index-and-humidex-canadian-made",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2025/04/0417-ki-mcleod-col.ki_.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The climate is changing and the sun's rays are getting stronger. People of all ages are vulnerable to heat waves and are at risk of heat-related illness and death. High humidity increases the intensity and risks of heatwaves. The UV Index was invented in 1992 to warn about the dangers of overexposure to the sun."
        },
        {
            "published_date": "2025-04-16T10:56:35",
            "title": "UV Index and humidex, Canadian-made",
            "author": "Susanna McLeod",
            "url": "https://www.thewhig.com/opinion/uv-index-and-humidex-canadian-made",
            "url_media": "https://smartcdn.gprod.postmedia.digital/nexus/wp-content/uploads/2025/04/0417-ki-mcleod-col.ki_.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The climate is changing, leading to unpredictable weather patterns. The sun's rays have altered, causing havoc with lives and livelihoods. Earth's protective ozone layer has not fully recovered from damage, in part due to manmade chemicals. The UV Index was invented by Environment and Climate Change Canada scientists in 1992 in response to concerns over the thinning middle ozone layer."
        },
        {
            "published_date": "2025-04-16T10:51:23",
            "title": "Pakistan issues health warning on CCHF and heatstroke risks",
            "author": "",
            "url": "https://dailytimes.com.pk/1287895/pakistan-issues-health-warning-on-cchf-and-heatstroke-risks",
            "url_media": "https://dailytimes.com.pk/assets/uploads/2025/04/16/cango-favor-balkh.jpeg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's National Institute of Health has released advisories about Crimean-Congo Haemorrhagic Fever (CCHF) and increased heatstroke risks. CCHF is a serious viral disease caused by the Nairovirus. It spreads to humans mainly through infected ticks found on livestock. In 2024, Pakistan reported 61 cases of the disease."
        },
        {
            "published_date": "2025-04-16T10:45:29",
            "title": "Experts raise concerns after observing unprecedented change in species: 'It shouldn't be here'",
            "author": "Yei Ling Ma",
            "url": "https://www.yahoo.com/news/experts-raise-concerns-observing-unprecedented-104529102.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/V0BD.pIIOvLmpfUWuUYNig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Nzc-/https://media.zenfs.com/en/the_cool_down_737/459be6d07afa61f58bfa622109bca931",
            "country": "US",
            "language": "en",
            "summary": "Rising global temperatures have contributed to unpredictable weather events, but wildlife is doing its best to adapt to the changing climate. Songbirds that used to migrate to warmer climates during winter have been spotted in Maine year-round, as the state experiences shorter and milder winters. Red-bellied woodpeckers and Carolina wrens are also common in Maine."
        },
        {
            "published_date": "2025-04-16T10:21:25",
            "title": "Letter: You can't defeat mother nature",
            "author": "Letters to the Editor",
            "url": "https://www.chicoer.com/2025/04/16/letter-you-cant-defeat-mother-nature",
            "url_media": "https://www.chicoer.com/wp-content/uploads/2018/05/chico-site-icon-1.png",
            "country": "US",
            "language": "en",
            "summary": "Earth's wobble, known as axial procession, takes approximately 26,000 years to complete a full rotation. It influences the amount of solar radiation received regionally, causing fluctuations in temperature. California wildfires used to burn up to 4 million acres a year, but now they burn 11 million acres in a single year. Easing into cleaner energy would be more beneficial than slamming the door on 'big oil'."
        },
        {
            "published_date": "2025-04-16T10:16:38",
            "title": "Earthquake strikes under Indian Ocean far off Australian coast",
            "author": "Arab Times",
            "url": "https://article.wn.com/view/2025/04/16/Earthquake_strikes_under_Indian_Ocean_far_off_Australian_coa_v",
            "url_media": "https://article.wn.com/view/2025/04/16/[]",
            "country": "US",
            "language": "en",
            "summary": "There was a 6.6-magnitude earthquake in Melbourne, Australia on April 16th. It was caused by a 6-meter-high earthquake.    - AP. It hit at 6:06 pm local time (10:06 PM)."
        },
        {
            "published_date": "2025-04-16T10:00:36",
            "title": "What a record spike in planet-warming gases says about the health of the Earth",
            "author": "Sarah Kaplan",
            "url": "https://www.washingtonpost.com/climate-environment/2025/04/16/what-record-spike-planet-warming-gases-says-about-health-earth",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CKWWSVGECPNXKAE2VVPCEGM2DA.JPG&w=1440",
            "country": "US",
            "language": "en",
            "summary": "The concentration of carbon dioxide in the atmosphere increased by 3.75 parts per million in 2024. The increase is 27 percent larger than the previous record increase, in 2015. The land and oceans have historically taken up about half of the greenhouse gases people emit. Without these places that absorb CO2, the global temperature rise would be twice the current level."
        },
        {
            "published_date": "2025-04-16T10:00:07",
            "title": "The great Mississippi tops list of most endangered rivers amid fears over Trump rollbacks",
            "author": "Nina Lakhani",
            "url": "https://www.theguardian.com/us-news/2025/apr/16/most-endangered-rivers-list-trump",
            "url_media": "https://i.guim.co.uk/img/media/c86e689372aebe4ef1c5b29b3d8197d490794b83/0_191_5762_3459/master/5762.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3da0b4b119d4f925027a2e76764ec45b",
            "country": "GB",
            "language": "en",
            "summary": "According to the new report, the list is as follows: Trump administration's sweeping cuts to the federal climate agency, the full-throthic for America's endangered rivers, threatening the food, water and livelihoods of millions of people, according to American Rivers' annual most-endangered rivers list, and the southern Appalachia's rivers."
        },
        {
            "published_date": "2025-04-16T09:27:00",
            "title": "Unexpected effects of heat on the body revealed",
            "author": "Oksana Yusifova",
            "url": "https://baku.ws/en/this-is-interesting/unexpected-effects-of-heat-on-the-body-revealed",
            "url_media": "https://baku.ws/storage/photos/uploads/thumbs/aspect/0Pdhrh9jJPAtj9m1QmGXCHdh25gOa7qBXGXI2XjX.webp",
            "country": "RU",
            "language": "en",
            "summary": "Without climate change, the burden of mental and behavioral disorders in Australia could increase by almost 49 percent by mid-century. Even under a moderate warming scenario, there will be an increase in the prevalence of mental disorders by 11 percent already in the 2030s and by 27.5 percent by the 2050s."
        },
        {
            "published_date": "2025-04-16T09:18:39",
            "title": "The Latest Fearmongering Words: ‘Climate Whiplash'",
            "author": "Principia Scientific",
            "url": "https://article.wn.com/view/2025/04/16/the_latest_fearmongering_words_8216climate_whiplash_8217",
            "url_media": "https://article.wn.com/view/2025/04/16/[]",
            "country": "US",
            "language": "en",
            "summary": "Global warming is just a bunch of different stuff happening in different places, as it always has, and it's always going to get worse. It's always been that way. It always has been.    .   i   in the past. "
        },
        {
            "published_date": "2025-04-16T09:00:00",
            "title": "Where does gentrification most threaten SC farm land? A new Furman University map has the answers",
            "author": "Courier",
            "url": "https://www.postandcourier.com/greenville/news/furman-university-sc-farm-gentrification-property-values-study/article_ceaefda7-6f58-4d76-8ffb-4853a94469d6.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/a/dc/adcfbf81-8817-47fb-95cc-b6bd50f48ff8/676989b638783.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "South Carolina's rural farm land is threatened by intense gentrification pressures, according to a new mapping tool from Furman University. Urban growth is driving up property values and market pressure on farms. The research underscores a troubling national trend showing farmland continues to decline across the country. South Carolina legislators are trying to address the state's land loss problem."
        },
        {
            "published_date": "2025-04-16T09:00:00",
            "title": "Proposed NOAA budget cuts would end climate research. ‘Huge impacts' are expected for SC.",
            "author": "File/Janet Morgan/Staff",
            "url": "https://www.postandcourier.com/rising-waters/trump-administratino-noaa-budget-cuts-south-carolina/article_24b2782a-ebec-4b93-904d-f42783300f15.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/1/33/1335466d-54d8-41d3-9af0-d10675ea4f63/66b3cb9f09422.image.jpg?crop=1939%2C1018%2C0%2C25&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration wants to cut NOAA's budget by 27 percent. The proposed budget also cuts climate research and coastal programs. Scientists say the cuts will have an outsized impact on coastal states such as South Carolina. The Department of Commerce secretary has until April 15 to appeal the proposal."
        },
        {
            "published_date": "2025-04-16T08:56:41",
            "title": "New Zealand's Major Cities Are Sinking",
            "author": "Laurie Winkless",
            "url": "https://www.forbes.com/sites/lauriewinkless/2025/04/16/new-zealands-major-cities-are-sinking",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/67ff6b9b70edb6891593ac72/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "Global sea level has risen about 21-24 cm since 1880. 10 cm of that rise has happened in the past 30 years. Sea levels are rising at a rate of 4.5 mm/year. 1 billion people live within 10 km of a coastline, and 12.5% of the world's population live near a coastline. Human activity is exacerbating the risk of sea-level rise. In New Zealand, shorelines are subsiding or sinking, which means rising seas will affect coastal areas sooner."
        },
        {
            "published_date": "2025-04-16T08:51:16",
            "title": "Africa Hit by Extreme Weather - More Floods, Landslides to Come",
            "author": "",
            "url": "https://allafrica.com/view/group/main/main/id/00092487.html",
            "url_media": "https://cdn.allafrica.com/download/pic/main/main/csiid/00651874:344811c6d76dcd32dfceaf05bb8a93ec:arc614x376:w1200.jpg",
            "country": "ZA",
            "language": "en",
            "summary": "Flooding has caused widespread devastation in several parts of Africa. Millions have been impacted and thousands of lives have been lost. Severe flooding caused by heavy rains in the Democratic Republic of the Congo displaced nearly 10,000 people. Key crops like cassava, maize, and peanuts have been wiped out. In Rwanda, at least four people lost their lives and over 70 hectares of crops were damaged as heavy rains triggered floods and landslides across the country."
        },
        {
            "published_date": "2025-04-16T08:33:54",
            "title": "Record-High 48% Call Global Warming a Serious Threat",
            "author": "Gallup",
            "url": "https://news.gallup.com/poll/659387/record-high-call-global-warming-serious-threat.aspx",
            "url_media": "https://imagekit.gallup.com/fusion/tr:emd_soc_meta_og/POLL/93d1d90b-a005-4f1a-95b3-6eba93cdf67c.jpg",
            "country": "US",
            "language": "en",
            "summary": "A record-high 48% of U.S. adults anticipate that global warming will pose a serious threat to their way of life. The percentage of Americans who believe the effects of global warming have already begun, now 63%, is up from 59% in 2024. There has been no change in the amount that Americans report worrying about global warming or climate change."
        },
        {
            "published_date": "2025-04-16T08:07:13",
            "title": "Commentary: The vegan butterfly effect",
            "author": "Rebecca Libauskas",
            "url": "https://www.kansascity.com/opinion/us-viewpoints/article304333511.html",
            "url_media": "https://www.mcclatchy-wires.com/incoming/5h3b72/picture304333346/alternates/LANDSCAPE_1140/7bf23cda-39c2-4335-9947-54263519451c",
            "country": "US",
            "language": "en",
            "summary": "The number of butterflies in the U.S. has declined by around 22% since 2000. Raising and killing animals for food destroys the forests, grasslands and wetlands that animals like butterflies need to survive. Animal agriculture uses 80% of global farmland but provides only 17% of the world's calories. A shift to vegan eating could free 240 million acres of farmland and provide critical habitat for butterflies."
        },
        {
            "published_date": "2025-04-16T08:00:00",
            "title": "Commentary: The vegan butterfly effect",
            "author": "Dreamstime/Dreamstime/TNS",
            "url": "https://www.dailygazette.com/tribune/commentary-the-vegan-butterfly-effect/article_682390f5-6c54-5158-ae70-19f5a719cf52.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/b/f5/bf5bdc8b-edf2-5a0b-94b1-4ee40bc97ea7/67ff696b58aee.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The number of butterflies in the U.S. has declined by around 22% since 2000, according to a new study published in the journal Science. The dwindling number is evident in every part of the country and across many species. Javascript is required for you to be able to read premium content."
        },
        {
            "published_date": "2025-04-16T07:58:01",
            "title": "Australia's next government may be Great Barrier Reef's last chance after sixth mass bleaching, conservationist says",
            "author": "Graham Readfearn",
            "url": "https://www.theguardian.com/environment/2025/apr/16/australias-next-government-may-be-great-barrier-reefs-last-chance-after-sixth-mass-bleaching-conservationist-says",
            "url_media": "https://i.guim.co.uk/img/media/d3310fd4a2ea718003270e4cb11f14d747ab0882/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d69ce159e263b40cfc97b215aa71292",
            "country": "GB",
            "language": "en",
            "summary": "The Great Barrier Reef was hit by a sixth widespread coral bleaching event since 2016 this summer. It's the second time the world's biggest coral reef has seen the phenomenon strike in back-to-back years. Last week Labor pledged an extra $10m for reef education projects. Last year's bleaching was the most widespread on record."
        },
        {
            "published_date": "2025-04-16T07:54:57",
            "title": "Sixth mass bleaching event strikes reef since 2016",
            "author": "",
            "url": "https://www.perthnow.com.au/news/environment/sixth-mass-bleaching-event-strikes-reef-since-2016-c-18395918",
            "url_media": "https://images.perthnow.com.au/publication/C-18395918/f2231259192ad571f660bd546dc258fb168534f8-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Extensive coral bleaching has been confirmed at Australia's Great Barrier Reef for the sixth time in less than a decade. It marks a second consecutive year of mass bleaching at the World Heritage-listed site. The reef has also incurred damage from record rainfall in the northern and central regions. The worst heat stress was recorded from Cooktown to Cape York."
        },
        {
            "published_date": "2025-04-16T07:54:37",
            "title": "Sixth mass bleaching event strikes reef since 2016",
            "author": "Poppy Johnston",
            "url": "https://thewest.com.au/news/environment/sixth-mass-bleaching-event-strikes-reef-since-2016-c-18395906",
            "url_media": "https://images.thewest.com.au/publication/C-18395906/f2231259192ad571f660bd546dc258fb168534f8-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Extensive coral bleaching has been confirmed at Australia's Great Barrier Reef for the sixth time in less than a decade. It marks a second consecutive year of mass bleaching at the World Heritage-listed site. The reef has also incurred damage from record rainfall in the northern and central regions. The worst heat stress was recorded from Cooktown to Cape York."
        },
        {
            "published_date": "2025-04-16T07:52:36",
            "title": "Sixth mass bleaching event strikes reef since 2016",
            "author": "Poppy Johnston",
            "url": "https://www.bordermail.com.au/story/8944766/sixth-mass-bleaching-event-strikes-reef-since-2016",
            "url_media": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/0e7750de-e9a2-4d48-9c24-d86c490d6b94.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Extensive coral bleaching confirmed at Australia's Great Barrier Reef for the sixth time in less than a decade. Warming oceans and severe floods wreak havoc on the reef due to climate change and sea level rise.       \"Extensive bleaching\" has been confirmed. "
        },
        {
            "published_date": "2025-04-16T07:52:36",
            "title": "Sixth mass bleaching event strikes reef since 2016",
            "author": "Poppy Johnston",
            "url": "https://www.newcastleherald.com.au/story/8944766/sixth-mass-bleaching-event-strikes-reef-since-2016",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/0e7750de-e9a2-4d48-9c24-d86c490d6b94.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Extensive coral bleaching has been confirmed at Australia's Great Barrier Reef for the sixth time in less than a decade. The northern regions of the world's largest coral reef system have suffered bleaching due to prolonged exposure to elevated temperatures. It's the second consecutive year of mass bleaching at the World Heritage-listed site. The reef has further incurred damage from record rainfall in the northern and central regions. The worst heat stress was recorded from Cooktown to Cape York."
        },
        {
            "published_date": "2025-04-16T07:00:00",
            "title": "Climate Myths, by John Stossel",
            "author": "",
            "url": "https://www.creators.com/read/john-stossel/04/25/climate-myths-2ab55",
            "url_media": "https://cdn.creators.com/350/391852/c0c8ad81597dd57d0215dd78a72ab8f7e311a937.jpg",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres is hyping global warming risks. Heartland Institute fellow Linnea Lueken says it's not happening at the catastrophic pace that the media claims. Al Gore said in 2009 that the Arctic ice cap could be completely ice-free within 5 to 7 years. The ice cap has plenty of ice even in summer. Polar bear populations have increased. Environmental Defense Fund collected almost a quarter of a billion dollars from gullible donors."
        },
        {
            "published_date": "2025-04-16T07:00:00",
            "title": "Donations to Trócaire Box appeal will help families affected by extreme weather events",
            "author": "Sponsored",
            "url": "https://www.irishexaminer.com/sponsored/arid-41610670.html",
            "url_media": "https://www.irishexaminer.com/cms_media/module_img/9152/4576072_306_seoimageog_Miriam_2bat_2bthe_2bschool_2b_2_2b_1_1_.jpg",
            "country": "IE",
            "language": "en",
            "summary": "Ilma, Julio, and their four children in La Paz, Guatemala are struggling with the devastating impact of climate change. Trócaire is working to help them adapt to the changes the climate crisis has wrought for their way of living and prevent the cycle of generational poverty."
        },
        {
            "published_date": "2025-04-16T06:57:21",
            "title": "🌱 Fear No Art Festival returns to Grayslake",
            "author": "Patch AM Team",
            "url": "https://patch.com/illinois/grayslake/fear-no-art-festival-returns-grayslake-nodx-20250416",
            "url_media": "https://patch.com/img/cdn20/assets/layout/amPlaceholder_2.jpg",
            "country": "US",
            "language": "en",
            "summary": "Fear No Art Festival returns to the College of Lake County in Grayslake on April 25-26. Spring Singing! (and ringing!) is on Wednesday April 16 at Prairie Circle Unitarian Universalist Congregation at 1561 Jones Point Rd.  "
        },
        {
            "published_date": "2025-04-16T06:38:00",
            "title": "Earlier Migration Signals Deeper Trouble For Tiny Birds",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/earlier-migration-signals-deeper-trouble-for-1445610",
            "url_media": "https://www.ualberta.ca/en/folio/media-library/2025/04/250416-least-flycatcher-migration-teaser-16x9-1600.jpg",
            "country": "US",
            "language": "en",
            "summary": "The least flycatcher's migration to Central America has moved ahead by an average of 14 days in the last 32 years, according to a new University of Alberta study. The species has already seen a 53 per cent drop in its numbers over the last 50 years due to pesticide use and changing habitat. It is a priority species according to the Bird Conservation Region Strategy."
        },
        {
            "published_date": "2025-04-16T06:11:31",
            "title": "Climate change costing Africa $15bn annuallyAfDB president",
            "author": "Daily Trust",
            "url": "https://www.latestnigeriannews.com/p/4261297/climate-change-costing-africa-15bn-annually-afdb-president.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Africa loses between $7-15 billion a year due to climate change. This figure will rise to $50 billion by 2050. Africa is witnessing the largest carbon emissions in the world, according to AfDB President Dr Akinwumi Adesina. "
        },
        {
            "published_date": "2025-04-16T06:08:00",
            "title": "OSCE Workshop in Chisinau Boosts Energy Resilience",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/osce-workshop-in-chisinau-boosts-energy-1445599",
            "url_media": "https://www.osce.org/files/imagecache/10_large_gallery/f/images/hires/b/f/450643.jpg?1587645567",
            "country": "US",
            "language": "en",
            "summary": "The OSCE held a workshop on 14 and 15 April in Chisinau, Moldova: \"Building Energy System Resilience Against Extreme Weather and Evolving Conditions in Moldova and Ukraine: Modelling and its Applications for Energy Planning\". It is the first in a series of regional trainings under the project \" Mitigating Climate Change Threats to the Energy Sector in the OSCE Region\" set to continue throughout 2025 and 2026."
        },
        {
            "published_date": "2025-04-16T05:31:22",
            "title": "Scorching streets: Understanding urban heat islands in Bengaluru's market areas",
            "author": "Sabarinath D",
            "url": "https://citizenmatters.in/scorching-streets-understanding-urban-heat-islands-in-bengalurus-market-areas",
            "url_media": "https://images-citizenmatters.sgp1.digitaloceanspaces.com/wp-content/uploads-new/2025/04/heat-jam-krmarket-Federico-Bierti-bengaluru-APR2025.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Urban heat island (UHI) is caused by human activities, concretisation, and lack of vegetation in urban areas. Urbanisation in Bengaluru has increased from 37.4% to 93.3% in the last 20 years. UHI has long-lasting effects on economic and social vulnerabilities."
        },
        {
            "published_date": "2025-04-16T05:28:27",
            "title": "Lesotho: Global Climate Crisis Escalates to Alarming New Levels",
            "author": "Seithati Mot Oeneng",
            "url": "https://allafrica.com/stories/202504160038.html",
            "url_media": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
            "country": "ZA",
            "language": "en",
            "summary": "The World Meteorological Organization reports that 2024 was the warmest year on record globally. Carbon dioxide concentrations are at their highest levels in 800,000 years. The past ten years have been among the warmests on record. The UN Secretary-General António Guterres believes limiting temperature rise to 1.5 degrees Celsius is achievable."
        },
        {
            "published_date": "2025-04-16T05:25:52",
            "title": "GEOENGINEERING-ANOTHER ONE OF THEIR MANY DEPOPULATION AGENDAS...",
            "author": "Alicia Lutz-Rolow",
            "url": "https://alicialutzrolow.substack.com/p/geoengineering-another-one-of-their",
            "url_media": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b2141ad-1a9b-43e5-90ac-45b2d34635a9_1100x611.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Geoengineering Watch's Dane Wigington returns to SGT Report to discuss the single greatest threat to humanity and life on earth. They are spraying us to death with \"chemtrails\" and new evidence indicates they are waging biological warfare from the skies."
        },
        {
            "published_date": "2025-04-16T05:22:05",
            "title": "Wondering about winter",
            "author": "David Phillips",
            "url": "https://www.spectator.com.au/2025/04/wondering-about-winter",
            "url_media": "https://www.spectator.com.au/wp-content/uploads/2025/04/GettyImages-515404104.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Flat White is in Adelaide enjoying the warm Autumn sunshine under a deep blue sky. The maximum temperature is 10 degrees warmer than usual. The drought is one of the worst on record. He wonders when the cold wet winter weather will arrive. He also wonders about getting the seasonal vaccines for Covid and influenza. "
        },
        {
            "published_date": "2025-04-16T05:21:36",
            "title": "Experts warn of space junk crashing to earth, says a concern for earth, human",
            "author": "Class",
            "url": "https://dailytrust.com/experts-warn-of-space-junk-crashing-to-earth-says-a-concern-for-earth-human",
            "url_media": "https://dailytrust.com/wp-content/uploads/2022/06/cropped-Daily-Trust-Icon-03-32x32.png",
            "country": "NG",
            "language": "en",
            "summary": "Experts warn that at least three old satellites or rocket bodies fall back to Earth every day and the number of objects returning from space is set to increase. Over 46,000 space debris fragments more than 4 inches wide now clutter Earth's orbit. Satellites are mostly made of aluminum, which produces aluminum oxide when burned. Aluminium oxide can accelerate ozone depletion and contribute to thermal changes in the upper atmosphere."
        },
        {
            "published_date": "2025-04-16T05:13:00",
            "title": "Great Barrier Reef Faces 6th Mass Bleaching: Urgent Action",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/great-barrier-reef-faces-6th-mass-bleaching-1445567",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=pbs.twimg.com%2Fprofile_images%2F828447353271037952%2FTB5ynuvL_400x400.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Great Barrier Reef has suffered its 6th mass bleaching event in the last 9 years. It's only the second time in history that two mass bleaches occurred in consecutive summers. The next Australian Government must cut climate pollution, commit to no new fossil fuel approvals and implement an emergency response plan for reefs affected by bleaching, cyclones and floods."
        },
        {
            "published_date": "2025-04-16T05:02:00",
            "title": "Great Barrier Reef Hit by Major Coral Bleaching Event",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/great-barrier-reef-hit-by-major-coral-bleaching-1445398",
            "url_media": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Great Barrier Reef has suffered widespread coral bleaching for the second year in a row due to prolonged exposure to higher-than-average water temperatures. It's the sixth time the Reef has experienced widespread bleaching in less than a decade. World Wide Fund for Nature-Australia Head of Oceans Richard Leck said it's distressing news. WWF calls on the next government to do everything it can to protect the reef."
        },
        {
            "published_date": "2025-04-16T03:13:49",
            "title": "FAO, WFP report 2025: Acute food insecurity to worsen in some countries",
            "author": "Joseph Prosper",
            "url": "https://www.ippmedia.com/the-guardian/features/read/fao-wfp-report-2025-acute-food-insecurity-to-worsen-in-some-countries-2025-04-15-173944",
            "url_media": "https://www.ippmedia.com/images/favicon_ippmedia.png",
            "country": "TZ",
            "language": "en",
            "summary": "Tanzania is not mentioned in a new global report which projects worsening food insecurity in some countries across the world. Rain-fed agriculture is facing problems due to unreliable rainfall. This results in acute food insecurity which hikes food prices and increases poverty levels. Kenya, Lesotho, Namibia and the Niger have been added to the hunger hotspots list. Burkina Faso, Ethiopia, Malawi, Somalia, Zambia and Zimbabwe remain 'hunger hotspots'."
        },
        {
            "published_date": "2025-04-16T01:54:25",
            "title": "White House eyes major cuts to NOAA ahead of hurricane season",
            "author": "Evyn Moon",
            "url": "https://www.yahoo.com/news/white-house-eyes-major-cuts-015425486.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/cBy0cKOyfl1qEv1JTpIezA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/wtvt_fox_local_articles_521/dd2cf0f9f0d0e2f19101488f0b72646b",
            "country": "US",
            "language": "en",
            "summary": "The Trump Administration is considering cutting NOAA's budget by $1.6 billion or 27%. Scientists and environmental advocates are concerned about the potential impact on climate, weather and ocean research. Florida Gov. Ron DeSantis has said it will not affect the state's ability to respond to storms."
        },
        {
            "published_date": "2025-04-16T01:31:00",
            "title": "Not all birds nest alike",
            "author": "JC AMBERLYN",
            "url": "https://www.kdminer.com/features/nature-notes-not-all-birds-nest-alike/article_6abb105d-0f4f-4c7e-9cf3-f4d8455fe56d.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/kdminer.com/content/tncms/assets/v3/editorial/3/b0/3b0d38ea-407f-49f6-a9c9-bd8d6e3239ca/67ff08c77774d.image.jpg?crop=1600%2C840%2C0%2C192&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Every year birds build their nests with sticks, grass, down and other odds and ends, lay eggs and raise their broods, abandon the structure as young fledge and the nests eventually deteriorate and slowly fall apart to wind and weather. Sometimes birds build several nests, never even using all of them, while others can hardly be said to have built much of a nest at all. Doves are the worst of the lot for that."
        },
        {
            "published_date": "2025-04-16T01:25:53",
            "title": "Glofs slowly turning Swat's alpine Utror, Gabral valleys into ‘zones of despair'",
            "author": "Fazal Khaliq",
            "url": "https://www.dawn.com/news/1904450/glofs-slowly-turning-swats-alpine-utror-gabral-valleys-into-zones-of-despair",
            "url_media": "https://i.dawn.com/large/2025/04/67fecedca35bf.jpg",
            "country": "PK",
            "language": "en",
            "summary": "As climate change intensifies, people in upper Swat are being forced to leave their ancestral homes and leave behind a fading cultural legacy due to recurring glacial lake outburst floods (Glofs) caused by melting glaciers. Since 2010, recurring Glofs have washed away agricultural terraces, apple orchards, and crucial bridges in Utror and Gabral in the alpine valleys of Swat. With no arable land remaining, displaced families have migrated to urban centres in Punjab such as Rawalpindi and to the plains of Khyber Pakhtunkhwa."
        },
        {
            "published_date": "2025-04-16T01:19:00",
            "title": "Trump administration cuts to NOAA threaten whale rescue efforts in Monterey",
            "author": "Joyce Kim",
            "url": "https://www.ksbw.com/article/trump-cuts-noaa-whale-rescue-monterey-california/64493896",
            "url_media": "https://kubrick.htvapps.com/vidthumb/696c4ade-69ab-42a6-8413-0b803318bc43/4689494a-a2c2-4373-9ec5-59aa9d00cba6.jpg?crop=0.766xw:0.766xh;0.0683xw,0&resize=1200:*",
            "country": "US",
            "language": "en",
            "summary": "Trump administration's budget cuts to the National Oceanic Atmospheric Administration (NOAA) are delaying plans to prevent whales from getting tangled in Dungeness crab fishing gear. Last year, 36 whales were found tangled in fishing gear in West Coast waters, the highest number off the U.S. coast since 2018. The cuts to NOAA mean less oversight and fewer safety rules for fishing."
        },
        {
            "published_date": "2025-04-16T01:00:00",
            "title": "Woman's warning to anyone thinking of moving to Australia after 'nightmare'",
            "author": "Lucy Marshall",
            "url": "https://www.mirror.co.uk/travel/australia-new-zealand/womans-warning-anyone-thinking-moving-35058910",
            "url_media": "https://i2-prod.mirror.co.uk/article35058908.ece/ALTERNATES/s1200/0_I-moved-from-UK-to-Australia-its-beautiful-but-no-one-warned-me-about-a-huge-problem.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Faye, from the UK, has been living and working in a remote area of Western Australia. She has to wear a face net everywhere she goes due to the persistent flies that swarm around her face. Faye is issuing a warning to other potential travellers about the flies."
        },
        {
            "published_date": "2025-04-16T00:58:51",
            "title": "Albanese under ‘firestorm' after reports of Russian military request to Indonesia",
            "author": "",
            "url": "https://www.skynews.com.au/australia-news/politics/albanese-under-firestorm-after-reports-of-russian-military-request-to-indonesia/video/7e52021d527b5140d9964f8455052baf",
            "url_media": "https://content.api.news/v3/images/bin/f1ee87398104860b1e0a4d1627865d4d",
            "country": "AU",
            "language": "en",
            "summary": "Mike Pezzullo has discussed reports on Russia seeking to have a military base in Indonesia. Indonesia has assured Australia it will not allow Russian planes to operate an air base on its soil. Mr Pezzello thinks the government handled the matter well. He is concerned about the pattern."
        },
        {
            "published_date": "2025-04-16T00:28:00",
            "title": "With La Niña gone, India likely to witness hotter-than-usual summer & warmer post-monsoon season, say experts",
            "author": "Neha Madaan",
            "url": "https://timesofindia.indiatimes.com/city/pune/with-la-nia-gone-india-likely-to-witness-hotter-than-usual-summer-warmer-post-monsoon-season-say-experts/articleshow/120322086.cms",
            "url_media": "https://static.toiimg.com/thumb/msid-120322083,width-1070,height-580,imgsize-154932,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The neutral ENSO (El Niño–Southern Oscillation) has entered a neutral phase. This means neither La Niña nor El Niño is active. The neutral phase is also likely contributing to a dry winter in India this year. This season is likely to have more heatwaves and maybe some heavy pre-monsoon rain."
        },
        {
            "published_date": "2025-04-16T00:23:45",
            "title": "Southern Africa urges science-based climate solutions as threats intensify",
            "author": "Xinhua",
            "url": "https://english.news.cn/20250416/f8a825ca389841978fb9cdb3a8b96b18/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "The increasing impacts of climate change across southern Africa make science-based and adaptive solutions necessary. Namibia declared a State of Emergency last year due to drought, floods, crop failures and water shortages. The country is leveraging research supported by SASSCAL, a regional initiative backed by Angola, Botswana, South Africa, Zambia, and Germany."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Wisconsin and Great Lakes Research Would Be Hurt By Federal NOAA Cuts",
            "author": "Danielle Kaeding",
            "url": "https://urbanmilwaukee.com/2025/04/16/wisconsin-and-great-lakes-research-would-be-hurt-by-federal-noaa-cuts",
            "url_media": "https://urbanmilwaukee.com/wp-content/uploads/2025/04/gle-water-lakesuperior-tributaries-plumes-satellite-18june2018-1024x748.jpg",
            "country": "US",
            "language": "en",
            "summary": "NOAA's Office of Oceanic and Atmospheric Research would be dissolved under the proposed budget. The cuts would affect the Cooperative Institute for Meteorological Satellite Studies housed within the Space Science and Engineering Center at the University of Wisconsin-Madison. Wisconsin Sea Grant supports conservation of Great Lakes resources and communities through research, education and outreach."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Climate Change Myths Part 1: Polar Bears, Arctic Ice, and Food Shortages",
            "author": "John Stossel",
            "url": "https://newsbusters.org/blogs/nb/john-stossel/2025/04/16/climate-change-myths-part-1-polar-bears-arctic-ice-and-food",
            "url_media": "https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-04/John%20Stossel_0.JPG?itok=9HlV8WKa",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres hyped global warming risks. Heartland Institute fellow Linnea Lueken says it's not happening at the catastrophic pace that they claim. Al Gore said the Arctic could be completely ice-free within 5 to 7 years, but it's been 16 years. Polar bear populations have increased."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Gentrification threatens SC farm land. A Furman University map shows locations most at risk.",
            "author": "Courier",
            "url": "https://www.postandcourier.com/aikenstandard/greenville/news/furman-university-sc-farm-gentrification-property-values-study/article_ceaefda7-6f58-4d76-8ffb-4853a94469d6.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/a/dc/adcfbf81-8817-47fb-95cc-b6bd50f48ff8/676989b638783.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "South Carolina's agricultural land is being threatened by gentrification. Urban growth is driving up property values and market pressure on farms. New mapping tool from Furman University's Shi Institute for Sustainable Communities shows gentrification pressures threaten farms around Charleston, Greenville, Columbia and Myrtle Beach. The team wants to share this tool with agriculture extensions and farmers."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Africa's growing cities are pushing birdlife to the brink (commentary)",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/04/16/Africa_s_growing_cities_are_pushing_birdlife_to_the_brink_co",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As urbanization reshapes global landscapes, ecological balance is increasingly at risk, especially in Africa. Rapid development and expanding human settlements pose a serious threat to birds and biodiversity and weakening ecological resilience. These drivers are often without proper environmental considerations, posing a serious risk to birds, biodiversity and biodiversity."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Number of UK homes overheating soars to 80% in a decade, study finds",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/16/Number_of_UK_homes_overheating_soars_to_80_in_a_decade_study",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Researchers say urgent action is needed to inform people about the risks of heatwave temperatures and adapt homes in the event of such a heatwave.    -   for people to be aware of the risks, adapt homes and take action to prevent heatstroke."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "How updating climate baselines influences detection of extreme events in China",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/16/How_updating_climate_baselines_influences_detection_of_extre",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Extreme weather and climate events have significant effects on people's lives and livelihoods, especially during heat waves and heavy rainfall.   Â     “Climate events” such as heat waves, heavy rainfall and extreme weather events have a significant effect on people."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "John Stossel: Climate myths",
            "author": "The Daily Independent",
            "url": "https://article.wn.com/view/2025/04/16/John_Stossel_Climate_myths",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres hyped global warming risks and now he says, \"The era of global boiling has arrived\".    .   The UN Secretary-General didn't think his hyping the risks brought him enough attention, so now he's saying, "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Elevator to extinction (cartoon)",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/04/16/Elevator_to_extinction_cartoon",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Climate change is pushing montane species upslope in a bid to escape warming temperatures, which is a problem for montane ecosystems.   Â. Â   y  y   in the future, the situation will get worse. "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "What a record spike in planet-warming gases says about the health of the Earth",
            "author": "The Washington Post",
            "url": "https://article.wn.com/view/2025/04/16/What_a_record_spike_in_planetwarming_gases_says_about_the_he",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The concentration of carbon dioxide in the atmosphere rose last year at the fastest rate on record. Scientists are worried that more and more carbon is coming from natural sources, as more is being emitted from the Earth's natural sources.   .    "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Plastic-eating seabird chicks show signs of organ failure and cognitive decline",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/04/16/Plasticeating_seabird_chicks_show_signs_of_organ_failure_and",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Jack Auty studied how inflammation in the human body drives diseases at the Tasmanian School of Medicine. Five years ago, he saw many dead sable shearwater (Ardenna carneipes) chicks washed up ashore with their guts full of plastics. Jack Auty believes we are exposing all wildlife to plastic, toxins, and pollution."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Holiday flights could carry fewer passengers as world warms",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/04/16/Holiday_flights_could_carry_fewer_passengers_as_world_warms",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Rising temperatures due to climate change may be the reason for the rise in global average temperatures, according to the IPCC.      Â   for the change in temperature due to the climate change is due to increase in the number of degrees Celsius."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Climate Myths",
            "author": "Belgrade News",
            "url": "https://article.wn.com/view/2025/04/16/Climate_Myths_c",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Antonio Guterres hyped global warming risks and now he says, \"The era of global boiling has arrived\".    .   The UN Secretary-General didn't think his hyping the risks brought him enough attention, so now he's saying, "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Record-high share of US adults see global warming as 'serous threat' to themselves: Gallup",
            "author": "The Hill",
            "url": "https://article.wn.com/view/2025/04/16/Recordhigh_share_of_US_adults_see_global_warming_as_serous_t",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A record-high share of U.S. adults think global warming will pose a serious threat to them in their lifetime, according to a Gallup poll released Wednesday. In the survey, conducted in early March, 48 percent of respondents say they think 'global warming will poses a serious threats to you or your way of life'."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Report: Atlantic, Cape May Counties in Flooding Bullseye By 2050",
            "author": "Steve Ettman",
            "url": "https://wpgtalkradio.com/ixp/397/p/report-atlantic-cape-may-counties-in-flooding-bullseye-by-2050",
            "url_media": "https://townsquare.media/site/397/files/2025/04/attachment-steves-sandy-pics-3.jpg?w=1200&q=75&format=natural",
            "country": "US",
            "language": "en",
            "summary": "By 2050, a 3.2 ft. coastal flood is expected to occur every year in Atlantic County, NJ, if we continue on our current pollution pathway. Florida, New York, and New Jersey have the highest numbers of people and homes at risk. 61% of New Jersey's coastal wetlands may be at risk of being lost because of sea-level rise."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Change for climate",
            "author": "Farhan Bokhari",
            "url": "https://www.thenews.com.pk/print/1301732-change-for-climate",
            "url_media": "https://www.thenews.com.pk/assets/uploads/akhbar/2025-04-16/1301732_015615_updates.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan is facing the consequences of climate change and Pakistan's population growth. The ruling structure's order of priorities leaves a gap between grassroots realities and developmental needs. Pakistan's main cash crop, the wheat crop, is at the centre of Pakistan's farm economy. The government withdrew an earlier offer which promised farmers to purchase stocks of wheat at Rs3900 per maund (40 kgs)."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "The great Mississippi tops list of most endangered rivers amid fears over Trump rollbacks",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/04/16/The_great_Mississippi_tops_list_of_most_endangered_rivers_am_b",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cuts to disaster agency and deregulation of fossil fuels, plus rise of water-guzzling datacentres highlighted in new report by World Resources Institute (WRI). WRI also highlights rise of data centres and their water usage. WRI's report is titled \"The Future of the World's Resources Institute\"."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "The importance of monitoring, evaluation and learning in the Just Transition",
            "author": "Independent online",
            "url": "https://article.wn.com/view/2025/04/16/The_importance_of_monitoring_evaluation_and_learning_in_the_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "With rising global temperatures, many countries have committed to reducing greenhouse gas emissions. This is being done to limit temperature increases and reach net zero emissions by mid-century. If a transition to a low-carbon economy is successful, it will be beneficial for the whole world."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Amount of sunlight at Earth's surface shows long-term shifts tied to pollution",
            "author": "Space Daily",
            "url": "https://article.wn.com/view/2025/04/16/Amount_of_sunlight_at_Earths_surface_shows_longterm_shifts_t",
            "url_media": "https://i.ytimg.com/vi/hDI8LjLc9F8/0.jpg",
            "country": "US",
            "language": "en",
            "summary": "Sydney, Australia (SPX) Apr 10, 2025. Sunrise is constant, but the intensity of sunlight that reaches Earth's surface is not. A new perspective is needed to see the sunrise in this new way.    \"A new perspective\" is a new perspective. "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Cyclone Tam lashes upper North Island, Auckland Harbour Bridge braces for impact",
            "author": "The Economic Times",
            "url": "https://article.wn.com/view/2025/04/16/Cyclone_Tam_lashes_upper_North_Island_Auckland_Harbour_Bridg_7",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tropical Cyclone Tam's approach threatens New Zealand's upper North Island with severe winds and rain. There are warnings for the area. It's expected to rain heavily.       in New Zealand’s North Island. It is expected to be windy and rainy."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Record-High 48% Call Global Warming a Serious Threat",
            "author": "Gallup",
            "url": "https://article.wn.com/view/2025/04/16/RecordHigh_48_Call_Global_Warming_a_Serious_Threat",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A record-high 48% of U.S. adults anticipate that global warming will pose a serious threat to themselves or their way of life, up from 44% a year ago. The current reading is two percentage points above the prior high in 2023."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Proposed NOAA budget cuts would end climate research. ‘Huge impacts' are expected for SC.",
            "author": "The Post",
            "url": "https://article.wn.com/view/2025/04/16/Proposed_NOAA_budget_cuts_would_end_climate_research_Huge_im",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Trump Administration wants to make significant cuts to the National Oceanic and Atmospheric Administration's budget and fire hundreds more scientists. Coastal states like South Carolina have a lot to lose as a result of the proposed changes.   Â   .   "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Australians' favorite foods come at high environmental cost: report",
            "author": "China.dot.org",
            "url": "https://article.wn.com/view/2025/04/16/Australians_favorite_foods_come_at_high_environmental_cost_r_g",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Aussies' love for red meat, chocolate and coffee generates high levels of greenhouse gas emissions in packaged food supply, according to the report published on Wednesday by the George.       in the report.  In the report, the report says that the products often generate the highest rates of greenhouse gas emissions. "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Could Global Climate Action Be Derailed By Trump's Tariffs?",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/04/16/Could_Global_Climate_Action_Be_Derailed_By_Trumps_Tariffs",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration's series of escalating trade tariffs have the potential to derail global efforts to combat climate change. President Donald Trump's tariffs are a threat to the global effort to fight climate change, according to Mefern's report.      "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Drought may have sped the demise of Rapa Nui sculpture culture",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/04/16/Drought_may_have_sped_the_demise_of_Rapa_Nui_sculpture_cultu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " low precipitation in the 1500s may have reduced time spent building statues among Rapa Nui people. However, not all archaeologists agree on the theory.       .   \"http://www.nasa.gov.uk/news/features/topical-scores/topics/topography-stories/stories/top stories/top-stories.html\"."
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Honeymoon Island renourishes dunes ahead of hurricane season",
            "author": "Tampa Bay Times",
            "url": "https://article.wn.com/view/2025/04/16/Honeymoon_Island_renourishes_dunes_ahead_of_hurricane_season",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Last year, Hurricane Helene caused major damage to some dunes at Honeymoon Island State Park. Other dunes were completely destroyed. Signs mark an area where sea oat plants grow along a dune restoration area Monday at the state park in Dunedin. "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "New Zealand's Major Cities Are Sinking",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/04/16/New_Zealands_Major_Cities_Are_Sinking",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In NZ, land subsidence is accelerating the problem of sea-level rise. It is putting infrastructure at risk in coastal cities like Auckland and Christchurch.    iReport.com will let you know if you have any coastal cities that might be at risk. "
        },
        {
            "published_date": "2025-04-16T00:00:00",
            "title": "Piracy Incidents Spike Nearly 35% in Q1 Drive by Singapore Strait",
            "author": "The Maritime Executive",
            "url": "https://article.wn.com/view/2025/04/16/Piracy_Incidents_Spike_Nearly_35_in_Q1_Drive_by_Singapore_St",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "ICC International Maritime Bureau issues quarterly report on global piracy. Report warns of a rise in global piracy and armed robbery incidents driven by a spike in attacks in the Singapore Straits. Southeast Asia and the regions around the Singapore Strait has become the global hotspot."
        }
    ]
}