{
    "status": "ok",
    "total_articles": 100,
    "articles": [
        {
            "published_date": "2025-06-28T23:46:58",
            "title": "1900 Scientists Say 'Climate Change Not Caused By CO2' – The Real Environment Movement...",
            "author": "Mark Keenan",
            "url": "https://www.FreedomsPhoenix.com/News/381065-2025-06-28-.htm",
            "url_media": "https://www.freedomsphoenix.com/Uploads/Graphics/533-0628164856-images-20.jpg",
            "country": "US",
            "language": "en",
            "summary": "Millions of people are concerned about climate change and believe there is a climate emergency. Many scientists dispute the UN-promoted man-made climate change theory. Almost 2,000 of the world's leading climate scientists and professionals in over 30 countries have signed a declaration that there is no climate emergency and refuted the UN claims."
        },
        {
            "published_date": "2025-06-28T22:05:01",
            "title": "Column: To tackle sea level rise, Hampton Roads needs NOAA",
            "author": "John Dos Passos Coggin",
            "url": "https://www.pilotonline.com/2025/06/28/column-to-tackle-sea-level-rise-hampton-roads-needs-noaa",
            "url_media": "https://www.pilotonline.com/wp-content/uploads/2025/02/Trump_NOAA_Chief_82744.jpg?w=1024&h=682",
            "country": "US",
            "language": "en",
            "summary": "Naval Station Norfolk is home to the U.S. Atlantic Fleet and supports 75 ships and 134 aircraft including five of the Navy's 12 aircraft carriers. Sea level has risen 18 inches in the past century and is on track to rise another foot or more in the next 30 years. President Trump proposes to cut NOAA's fiscal year 2026 budget by 25%, severing a lifeline of weather and climate data and services for Hampton Roads. Congress is considering the Trump-endorsed 'big, beautiful' budget bill."
        },
        {
            "published_date": "2025-06-28T21:35:26",
            "title": "Climate brunt on Asia",
            "author": "editorial",
            "url": "https://tribune.com.pk/story/2553165/climate-brunt-on-asia",
            "url_media": "https://i.tribune.com.pk/media/images/Editorial-New11312243333323323333331332233233323231223331322333332333333221/Editorial-New11312243333323323333331332233233323231223331322333332333333221.jpg",
            "country": "PK",
            "language": "en",
            "summary": "According to the World Meteorological Organization, Asia is warming nearly twice as fast as the rest of the world. In terms of immediate damage, this means Asia is at almost double the risk of extreme temperatures, glacial melts, urban flooding, wildfires and tornadoes. In the longer run, this translates to a devastation of 42% of world economies via droughts, displacements and food insecurity. Climate change instigates chaotic and extreme weather events."
        },
        {
            "published_date": "2025-06-28T21:00:00",
            "title": "Half of Tuvalu applies for Australia's new climate visa",
            "author": "Max Bearak",
            "url": "https://www.staradvertiser.com/2025/06/28/breaking-news/half-of-tuvalu-applies-for-australias-new-climate-visa",
            "url_media": "https://www.staradvertiser.com/wp-content/uploads/2023/02/Star-Advertiser-thumbnail-image.jpg",
            "country": "US",
            "language": "en",
            "summary": "As sea levels rise, Australia is offering a special 'climate visa' to Tuvalu citizens. The visa lottery opened last week and nearly half of the population has applied. The Polynesian island nation of atolls and sandbars is losing land to rising seas. It's home to 10,000 people scattered across nine small coral islands that add up to less than 10 square miles. It would take around 40 years for all of the citizens to relocate to Australia."
        },
        {
            "published_date": "2025-06-28T20:38:26",
            "title": "Europe bakes in summer's first heatwave as continent warms",
            "author": "Marco Bertorello",
            "url": "https://www.mtdemocrat.com/news/national/europe-bakes-in-summers-first-heatwave-as-continent-warms/article_7f1d310f-d25c-5d11-865a-6ec301340e3e.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/mtdemocrat.com/content/tncms/assets/v3/editorial/4/e4/4e423919-0a58-52e4-b75c-061520be17cd/685fdcdfc5ad8.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Southern Europeans are bracing themselves for their first heatwave of the northern hemisphere summer. Scientists warn that climate change is heating up the world with disastrous consequences for the environment. Europe's ever-hotter and increasingly common blistering summer heatwaves are a direct result of that warming."
        },
        {
            "published_date": "2025-06-28T20:15:14",
            "title": "Pakistan: Karachi faces risk of urban flooding due to rains",
            "author": "ANI",
            "url": "https://www.tribuneindia.com/news/karachi/pakistan-karachi-faces-risk-of-urban-flooding-due-to-rains",
            "url_media": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTlkMGJkYzUwLTU0NWMtMTFmMC05YTI3LWZiZmNhMjFkMmNiMC5qcGc=",
            "country": "IN",
            "language": "en",
            "summary": "Monsoon rains are continuing in Karachi for the third consecutive day. Several low-lying areas in Karachi experienced water accumulation. Pakistan's weather department forecast intermittent rain for Karachi on Sunday, with the possibility of moderate to isolated heavy falls in some areas. For Monday, the Met Office predicts cloudy conditions across the city with chances of light rain or drizzle."
        },
        {
            "published_date": "2025-06-28T19:53:22",
            "title": "Photos: Record temperatures hit Europe in first summer heatwave of 2025",
            "author": "Gulf News",
            "url": "https://article.wn.com/view/2025/06/28/Photos_Record_temperatures_hit_Europe_in_first_summer_heatwa",
            "url_media": "https://article.wn.com/view/2025/06/28/[]",
            "country": "US",
            "language": "en",
            "summary": "Europe is bracing itself for the first major heatwave of the northern hemisphere summer. Climate change continues to push temperatures higher across the world's fastest-warming continent. Rome hits 37°C as tourists seek shade in the heat.    in Rome. "
        },
        {
            "published_date": "2025-06-28T19:39:14",
            "title": "Ground broken for construction of climate change centre at University of Belize",
            "author": "",
            "url": "https://www.jamaicaobserver.com/2025/06/28/ground-broke-climate-change-centre-university-belize",
            "url_media": "https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/06/IMG_3911-768x512-1.jpeg",
            "country": "JM",
            "language": "en",
            "summary": "Caribbean Community Climate Change Centre (CCCCC) officially broke ground this week to construct its new headquarters at the University of Belize's Belmopan Campus. The groundbreaking ceremony was attended by key regional leaders, including, Caricom Deputy Secretary General Armstrong Alexis, Prime Minister John Briceño, Saint Lucia's PM, Philip Pierre, and Ministers from Barbados, St Lucia, Dominica, and Grenada. It is the 20th anniversary of the CCCCC."
        },
        {
            "published_date": "2025-06-28T19:30:00",
            "title": "Shortest Day Looms As Earth Spins Faster Than Ever",
            "author": "R. J. Manuel",
            "url": "https://www.msn.com/en-gb/money/technology/shortest-day-looms-as-earth-spins-faster-than-ever/ar-AA1HBzYl",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Since 2020, Earth's rotation has been slightly faster than usual. July 19, 2020, was the shortest day ever, taking 1.47 milliseconds less than 86,400 seconds. On July 5, 2022, Earth beat its record by 1.66 milliseconds. The next potential record-breaking days could be July 9, July 22, or August 5 of this year."
        },
        {
            "published_date": "2025-06-28T19:21:37",
            "title": "Southern Europe Hit by First Heatwave of the Year",
            "author": "Sita Planasari",
            "url": "https://en.tempo.co/read/2022418/southern-europe-hit-by-first-heatwave-of-the-year",
            "url_media": "https://statik.tempo.co/data/2023/07/21/id_1221526/1221526_720.jpg?rand=6",
            "country": "ID",
            "language": "en",
            "summary": "Southern Europeans are experiencing the first heatwave of the northern hemisphere summer. Marseille ordered public swimming pools to be made free to help residents cope with the Mediterranean heat. Two-thirds of Portugal will be on high alert on Sunday, June 29, 2025, for extreme heat. Forest fires with temperatures of 42 degrees Celsius are expected in the capital Lisbon. Sicily has ordered a ban on working outdoors during the hottest hours of the day."
        },
        {
            "published_date": "2025-06-28T19:00:52",
            "title": "We're entering Donald Trump's post truth era",
            "author": "Robert Harrington",
            "url": "https://www.palmerreport.com/analysis/were-entering-donald-trumps-post-truth-era/61138",
            "url_media": "https://www.palmerreport.com/wp-content/uploads/2019/08/donald-trump.jpg",
            "country": "US",
            "language": "en",
            "summary": "Palmer Report readers are helping him relaunch the website. Donate to help him. He is concerned that people don't care about climate change despite the fact that it is inescapably obvious. He uses the term 'post-truth era' to refer to the internet and fake news. "
        },
        {
            "published_date": "2025-06-28T18:35:48",
            "title": "Europe bakes in summer's first heatwave as continent warms",
            "author": "AFP",
            "url": "https://www.thedailystar.net/news/world/europe/news/europe-bakes-summers-first-heatwave-continent-warms-3927976",
            "url_media": "https://www.thedailystar.net/sites/all/themes/sloth/favicon.ico",
            "country": "BD",
            "language": "en",
            "summary": "Temperatures are set to rise to 37 degrees Celsius (99 degrees Fahrenheit) in Rome on Saturday. Marseille's public swimming pools will be free of charge to help residents beat the Mediterranean heat. Two-thirds of Portugal will be on high alert on Sunday for extreme heat and forest fires."
        },
        {
            "published_date": "2025-06-28T17:56:25",
            "title": "Monsoon Fury in Himachal Pradesh: Lives Lost, Infrastructure Ravaged",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/headlines/3485730-monsoon-fury-in-himachal-pradesh-lives-lost-infrastructure-ravaged",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_06_2025_23_26_16_8441421.jpg?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The monsoon season has turned deadly in Himachal Pradesh, resulting in the loss of 34 human lives and extensive damage estimated at Rs 7,119.27 lakh. Kangra district reported the highest fatalities with 12 deaths due to flash floods, landslides, and electrocution. Other districts including Chamba, Bilaspur, Una, Kullu, Mandi, and Shimla reported casualties."
        },
        {
            "published_date": "2025-06-28T17:53:44",
            "title": "Global Warming and Wars: Escalating Threats to Life on Earth",
            "author": "",
            "url": "https://www.pakistantoday.com.pk/2025/06/28/global-warming-and-wars-escalating-threats-to-life-on-earth",
            "url_media": "https://www.pakistantoday.com.pk/wp-content/uploads/2025/06/Alpha-24.jpg",
            "country": "PK",
            "language": "en",
            "summary": "In 2024, average global temperatures were 1.6°C higher than pre-industrial levels. Global CO2 emissions are projected to be entirely consumed within the next three years. Global warming and socio-geopolitical conflicts have become dangerously intertwined. War and climate change are fueling global instability."
        },
        {
            "published_date": "2025-06-28T17:51:13",
            "title": "1992 Scientists declare, \"There is no climate emergency\"",
            "author": "Meryl Nass",
            "url": "https://merylnass.substack.com/p/1992-scientists-declare-there-is",
            "url_media": "https://substackcdn.com/image/fetch/$s_!EK94!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6025f7ad-23eb-492e-bb68-bface0918667_517x732.jpeg",
            "country": "US",
            "language": "en",
            "summary": "The World Climate Declaration is signed by over 1900 scientists and professionals. It is an urgent message on climate change. There is no climate emergency and there is no cause for panic and alarm. The aim of global policy should be prosperity for all by providing reliable and affordable energy at all times."
        },
        {
            "published_date": "2025-06-28T17:37:11",
            "title": "B.C. climate news: Western Canada glaciers melting twice as fast as in previous decade",
            "author": "Tiffany Crawford",
            "url": "https://vancouversun.com/news/climate-change-news-to-june-29-2025",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/06/cp174655323_296177065.jpg",
            "country": "CA",
            "language": "en",
            "summary": "Western Canada glaciers are melting twice as fast as in previous decade. Intensifying heat dome over parts of Eastern Canada fuelling unpredictable weather in the West. Human activities like burning fossil fuels and farming livestock are the main drivers of climate change. Past 10 years are the 10 warmest on record. Earth is 1.3 C warmer than it was in the 1800s."
        },
        {
            "published_date": "2025-06-28T17:37:11",
            "title": "B.C. climate news: Western Canada glaciers melting twice as fast as in previous decade",
            "author": "Tiffany Crawford",
            "url": "https://ottawacitizen.com/news/climate-change-news-to-june-29-2025",
            "url_media": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/06/cp174655323_296177065.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The UN's intergovernmental panel on climate change has warned for decades that wildfires and severe weather would become more frequent and intense because of climate change. The Earth is now about 1.3 C warmer than it was in the 1800s. The past 10 years (2015-2024) are the 10 warmest on record."
        },
        {
            "published_date": "2025-06-28T17:17:13",
            "title": "A Government Playing Politics with Lives",
            "author": "James Stanislaus",
            "url": "https://thevoiceslu.com/2025/06/shame-a-government-playing-politics-with-lives",
            "url_media": "https://thevoiceslu.com/wp-content/uploads/2024/04/Saint-Lucia-Prepares-for-2024-Hurricane-Season.jpg",
            "country": "LC",
            "language": "en",
            "summary": "Piaye and Roblot in Choiseul-Saltibus and Bexon in Castries South East remain locked out of their newly constructed community centres. The centres were constructed under the Saint Lucia Disaster Vulnerability Reduction Project (DVRP), a World Bank-supported initiative launched in 2014 to reduce the country's vulnerability to natural hazards and climate change. Saint Lucia faces a 48% chance of hurricane impact this season, with meteorological authorities warning of above-average storm activity."
        },
        {
            "published_date": "2025-06-28T17:09:22",
            "title": "New Campaign in Opposition to South Coast Marine Conservation Area",
            "author": "Beth Fagan",
            "url": "https://vocm.com/2025/06/28/273383",
            "url_media": "https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2019/09/newfoundland-aquaculture-industry-association-.jpg",
            "country": "CA",
            "language": "en",
            "summary": "The Newfoundland Aquaculture Industry Association has launched a new campaign against a proposed National Marine Conservation Area along the province's south coast. The association is calling on Premier John Hogan, MHAs, and local MPs to voice their concerns to Ottawa about the impacts of the creation of the conservation area."
        },
        {
            "published_date": "2025-06-28T17:00:00",
            "title": "Climate Oscillations 4: The Length of Day (LOD)",
            "author": "Andy",
            "url": "https://wattsupwiththat.com/2025/06/28/climate-oscillations-4-the-length-of-day-lod",
            "url_media": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2025/06/Figure-4-3.png?fit=929%2C525&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Andy May ranked 14 climate oscillations in Table 1 by their regression statistics against the HadCRUT5 global surface mean temperature. AMO is number one, the Western Hemisphere Warm Pool Area is #2, and the Northern Hemisphere sea ice area is #3. The fourth in importance is the Length of Day or 'LOD.' Longer periods of acceleration in Earth's rotation speed correspond to years of increasing zonal (east-west) circulation and global warming. Longer deceleration indicate less zonal acceleration and periods of cooling."
        },
        {
            "published_date": "2025-06-28T16:29:24",
            "title": "Europe swelters in historic heatwave",
            "author": "bne Intelli News",
            "url": "https://www.intellinews.com/europe-swelters-in-historic-heatwave-388341",
            "url_media": "https://d39raawggeifpx.cloudfront.net/styles/16_9_desktop/s3/articleimages/Screenshot_2025-06-28_at_16.13.53_Cropped.png",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will exceed 40°C across Spain and parts of France. The maximum mean summer temperatures for West Central Europe are now higher than France was from 1961-1990. Hospitals in Rome, Athens and Madrid have reported a spike in heat-related emergencies. A row has broken out between Hungary and Ukraine over Kyiv's right to join the EU."
        },
        {
            "published_date": "2025-06-28T15:47:13",
            "title": "Ground broken for construction of climate change centre at University of Belize - Jamaica Observer",
            "author": "Jamaica Observer",
            "url": "https://article.wn.com/view/2025/06/28/Ground_broken_for_construction_of_climate_change_centre_at_U",
            "url_media": "https://article.wn.com/view/2025/06/28/[]",
            "country": "US",
            "language": "en",
            "summary": "Caribbean Community Climate Change Centre broke ground this week to construct its new headquarters at the University of Belize (UB) Belmopan Campus. It is a significant step for the organisation.   for the climate change fight in Belize.  For confidential support call the Samaritans on 08457 90 90 90."
        },
        {
            "published_date": "2025-06-28T15:26:32",
            "title": "Kerala's Torrential Downpour Prompts Mass Evacuations",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3485565-keralas-torrential-downpour-prompts-mass-evacuations",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_04_2025_11_57_22_8913729.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Kerala has been battered by heavy rains, prompting a significant rise in river levels and the evacuation of people from low-lying and riverside areas. The India Meteorological Department has issued an orange alert for seven districts in the state. The IMD also noted a developing low-pressure area over Saurashtra-Kutch and adjacent northeast Arabian Sea."
        },
        {
            "published_date": "2025-06-28T15:25:44",
            "title": "Fight To Save Climate Is Falling Apart",
            "author": "Douglas McIntyre",
            "url": "https://www.msn.com/en-us/weather/topstories/fight-to-save-climate-is-falling-apart/ar-AA1HB9Ga",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Some of the world's largest nations have cut their plans to help save the environment. The US remains at the top of the list. President Trump signed an executive order that will lead to America's withdrawal from the Paris Agreement. He has sharply limited the building of offshore wind farms and will likely cut tax credits for residential solar installations and EVs. He also made it easier for oil companies to drill new wells."
        },
        {
            "published_date": "2025-06-28T15:00:42",
            "title": "Siobhan Connally's Ittybits & Pieces: Adaptation",
            "author": "Siobhan Connally",
            "url": "https://www.troyrecord.com/2025/06/28/siobhan-connallys-ittybits-pieces-adaptation",
            "url_media": "https://www.troyrecord.com/wp-content/uploads/2025/03/Siobhan_Connallys_Ittybits__Pieces_Swing_me_1-1.jpg?w=1024&h=1820",
            "country": "US",
            "language": "en",
            "summary": "This week, I seem to have tipped into the realm of extreme this week. I always wear layers. There's the issue of sun protection and temperature mitigation. It's not rocket science, but it can be a bit of a juggling act especially when the temperatures can change by twenty degrees."
        },
        {
            "published_date": "2025-06-28T15:00:00",
            "title": "How to keep warm in cold weather",
            "author": "Njeru Lennox",
            "url": "https://www.the-star.co.ke/news/infographics/2025-06-28-how-to-keep-warm-in-cold-weather",
            "url_media": "https://cdn.radioafrica.digital/image/2025/06/d8fb86e2-17c6-41b7-ae26-88c40d0fc719.jpeg?1751137940604",
            "country": "KE",
            "language": "en",
            "summary": "To stay warm in cold weather, layer your clothing. Drink warm fluids and eat regularly to maintain energy levels and body heat. Stay active to boost circulation but avoid sweating. Use blankets, hot water bottles, space heaters, and block drafts with door stoppers or heavy curtains indoors."
        },
        {
            "published_date": "2025-06-28T14:22:12",
            "title": "Danish IcyAlert Project Predicts Ice-Free Arctic Summers by 2030s",
            "author": "IANS",
            "url": "https://www.newkerala.com/news/o/danish-led-research-initiative-forecast-ice-free-arctic-summers-425",
            "url_media": "https://www.newkerala.com/apple-touch-icon.png",
            "country": "IN",
            "language": "en",
            "summary": "A new Danish-led research initiative, IcyAlert, has been launched with the goal of developing an advanced forecasting system capable of predicting when the Arctic will experience ice-free summers. The project, led by the Danish Meteorological Institute, is scheduled to run through 2031. The first forecasts are expected to be released by 2028."
        },
        {
            "published_date": "2025-06-28T14:00:09",
            "title": "1900 Scientists Say ‘Climate Change Not Caused By CO2' – The Real Environment Movement Was Hijacked",
            "author": "from",
            "url": "https://www.sgtreport.com/2025/06/1900-scientists-say-climate-change-not-caused-by-co2-the-real-environment-movement-was-hijacked",
            "url_media": "https://th.bing.com/th/id/R.77099893542b9e6b13f686a267662b88?rik=ArhpSJJzK8B2cw&pid=ImgRaw&r=0",
            "country": "US",
            "language": "en",
            "summary": "Millions of people are concerned about climate change and believe there is a climate emergency. Almost 2,000 of the world's leading climate scientists and professionals in over 30 countries have signed a declaration that there is no climate emergency and refuted the UN claims in relation to man-made climate change."
        },
        {
            "published_date": "2025-06-28T13:35:03",
            "title": "Europe scorched by summer's 1st heatwave as continent warms",
            "author": "Daily Sabah",
            "url": "https://article.wn.com/view/2025/06/28/Europe_scorched_by_summer_s_1st_heatwave_as_continent_warms",
            "url_media": "https://article.wn.com/view/2025/06/28/[]",
            "country": "US",
            "language": "en",
            "summary": "Europe is experiencing the first heatwave of the northerly season. Climate change is driving the world's fastest-warming continent further into the red zone, and Europe is feeling the effects of it now. The heatwave is expected to last for a few days."
        },
        {
            "published_date": "2025-06-28T13:04:21",
            "title": "The top towns Aussies are fleeing to in droves and the surprising group that's leaving the big cities for a lifestyle change",
            "author": "STEPHEN JOHNSON",
            "url": "https://www.dailymail.co.uk/news/article-14848433/The-towns-Aussies-fleeing-droves-surprising-group-thats-leaving-big-cities-lifestyle-change.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/06/27/04/99771841-0-image-m-11_1750996649369.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Aussies fleeing the housing affordability crisis in Sydney and Melbourne are choosing to settle in more affordable regional centres. Geelong received the largest share of migration from another part of Australia with a generous 9.3%. The Fraser Coast - which includes Hervey Bay - was the second most popular place to move to, getting 3.3% of relocators."
        },
        {
            "published_date": "2025-06-28T13:02:07",
            "title": "Southern Europe roasts as first heatwave of the summer scorches continent",
            "author": "",
            "url": "https://www.aljazeera.com/news/2025/6/28/southern-europe-roasts-as-first-heatwave-of-the-summer-scorches-continent",
            "url_media": "https://www.aljazeera.com/wp-content/uploads/2025/06/2025-06-27T115958Z_865081363_RC2WAFA0XHLJ_RTRMADP_3_EUROPE-WEATHER-GREECE-1751113254.jpg?resize=1920%2C1440",
            "country": "QA",
            "language": "en",
            "summary": "Europe is bracing itself for the first heatwave of the Northern Hemisphere summer. Temperatures are expected to rise to 37 degrees Celsius (99 degrees Fahrenheit) in Rome on Saturday. Two-thirds of Portugal will be on high alert on Sunday for extreme heat and forest fires with 42C (108F) expected in Lisbon. Sicily has ordered a ban on outdoor work in the hottest hours of the day and trade unions are campaigning to extend it to other parts of the country."
        },
        {
            "published_date": "2025-06-28T13:02:07",
            "title": "Southern Europe roasts as first heatwave of the summer scorches continent",
            "author": "",
            "url": "https://saudi.shafaqna.com/EN/AL/1759024",
            "url_media": "https://saudi.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Temperatures hit 40C in Southern Europe. There are fears of wildfires and health risks due to the heatwave.       in southern Europe. It's the first heatwave of the summer scorches the continent and there are concerns about health risks. "
        },
        {
            "published_date": "2025-06-28T13:00:45",
            "title": "Europe Heatwave: Tourist Dead, Wildfires Rage",
            "author": "Alexandra Hartman",
            "url": "https://www.archyde.com/europe-heatwave-tourist-dead-wildfires-rage",
            "url_media": "https://i0.wp.com/wpln.org/wp-content/uploads/sites/7/2025/06/Nashville-More-Hot-Summer-Days.jpg?resize=350%2C200&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "Europe is experiencing a severe heat wave caused by a persistent high-pressure system trapping hot air. One tourist died and roads in Italy are melting due to the extreme heat. Wildfires are also raging in some areas, exacerbated by the dry conditions and intense heat. Long-term solutions addressing climate change are crucial to mitigating the underlying causes of these extreme weather events."
        },
        {
            "published_date": "2025-06-28T12:43:25",
            "title": "The erosion of the coasts",
            "author": "Chrystalla Hadjidemetriou",
            "url": "https://in-cyprus.philenews.com/opinion/the-erosion-of-the-coasts",
            "url_media": "https://in-cyprus.philenews.com/wp-content/uploads/2025/06/kourion-1.png",
            "country": "CY",
            "language": "en",
            "summary": "40% of the coastline in Cyprus's free areas has already been eroded, with the phenomenon potentially increasing. Private operators and municipal authorities move in with bulldozers, flattening the natural landscape to create space for sunbeds. Some scientists propose installing submerged breakwaters that would allow water movement."
        },
        {
            "published_date": "2025-06-28T12:02:00",
            "title": "World-Famous Paleontologist Kenneth Lacovara Will Speak at Sarasota Climate Conference",
            "author": "",
            "url": "https://www.sarasotamagazine.com/arts-and-entertainment/2025/06/climate-change-conference-sarasota-2025",
            "url_media": "https://res.cloudinary.com/sarasota-magazine/image/upload/c_crop,h_874,w_1312,x_25,y_51/c_limit,dpr_auto,f_auto,fl_lossy,q_80,w_1200/Kenneth_J._Lacovara_with_Dreadnoughtus_femur_tezlxt.jpg",
            "country": "US",
            "language": "en",
            "summary": "The Climate Forecast Conference will take place on Thursday, Nov. 13, at the University of South Florida Sarasota-Manatee. The conference will focus on climate change and biodiversity loss. Dr. Kenneth Lacovara, a dinosaur paleontologist from New Jersey, will be the first speaker of the day."
        },
        {
            "published_date": "2025-06-28T12:00:00",
            "title": "Sections of New Orleans floodwalls are sinking faster than sea levels are rising, study finds",
            "author": "ALEX LUBBEN",
            "url": "https://www.nola.com/news/environment/new-orleans-flood-walls-sinking-faster-than-seas/article_78743827-e52c-49e5-82e2-fad15efed2a0.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/nola.com/content/tncms/assets/v3/editorial/1/7a/17afad75-8425-503a-b0d6-76a1e175a1d8/5d26911bc276b.image.jpg?crop=1762%2C925%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Some parts of New Orleans' $15 billion hurricane protection system are sinking faster than sea levels are rising due to climate change. The system was designed and built after Hurricane Katrina in 2005. The highest rates of elevation loss are taking place near the floodwalls built adjacent to Louis Armstrong International Airport in Kenner and along the earthen levees in New Orleans East and St. Bernard Parish. The West Bank authority funded a lift program from 2016 to 2019 prior to the Army Corps' armoring of the West Bank levees."
        },
        {
            "published_date": "2025-06-28T11:58:00",
            "title": "The world's biggest desert that's nearly twice the size of the Sahara",
            "author": "Kris Boratyn",
            "url": "https://www.express.co.uk/news/world/2074511/worlds-biggest-desert-twice-the-size-of-sahara",
            "url_media": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6258109.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Antarctica is home to the world's largest desert, the Antarctic Polar Desert, which is almost twice the size of the Sahara. It is also home to one of the driest places on the planet, the McMurdo Dry Valleys. 98% of the continent is permanently covered by ice. The average thickness of the Antarctic ice sheet is 1.9 km."
        },
        {
            "published_date": "2025-06-28T11:57:24",
            "title": "Intl. Day of Tropics highlights climate, geography, and urbanization challenges",
            "author": "",
            "url": "https://www.tehrantimes.com/news/515022/Intl-Day-of-Tropics-highlights-climate-geography-and-urbanization",
            "url_media": "https://media.tehrantimes.com/d/t/2025/06/28/4/5574007.jpg?ts=1751111747072",
            "country": "IR",
            "language": "en",
            "summary": "There are many different types of places in the world. There is a difference between a place's climate, geography, and urbanization, and its cultural and linguistic richness. There are also differences between the place's weather, climate, and other factors, and between the places' natural resources and their cultural resources."
        },
        {
            "published_date": "2025-06-28T11:36:01",
            "title": "Europe bakes in summer's first heatwave as continent warms",
            "author": "Marco Bertorello",
            "url": "https://www.derbyinformer.com/news/national/europe-bakes-in-summers-first-heatwave-as-continent-warms/article_ddc11b42-7949-5f56-b27f-00d5f7a310bb.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/derbyinformer.com/content/tncms/assets/v3/editorial/1/fd/1fd5167e-b270-5ed2-ad12-8e3fc7c6f1bd/685fdcc9eed38.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Southern Europeans are bracing themselves for the first heatwave of the northern hemisphere summer. Climate change is pushing temperatures on the world's fastest-warming continent into the red zone.       .   in the Northern Hemisphere Summer is getting hotter. "
        },
        {
            "published_date": "2025-06-28T11:33:32",
            "title": "Erbil river at risk of drying up",
            "author": "",
            "url": "https://www.rudaw.net/english/kurdistan/28062025",
            "url_media": "https://www.rudaw.net/s3/rudaw.net/ContentFiles/880859Image1.jpg?mode=crop&quality=70&rand=1&scale=both&w=752&h=472&version=7794176",
            "country": "IQ",
            "language": "en",
            "summary": "Water levels in Balakian River in northeastern Erbil province have dramatically dropped due to drought and climate change. The loss of water has had a direct impact on aquatic life and birds. The region's agricultural sector has also suffered major losses. Farmers in the Balakayati area on the Iranian border are worried about the future of their crops. Soran administration has intensified efforts to confront the drought."
        },
        {
            "published_date": "2025-06-28T11:30:12",
            "title": "Researchers warn of catastrophic consequences from rapidly intensifying threat: 'As a species, we have never confronted anything like this'",
            "author": "Kim La Capria",
            "url": "https://www.yahoo.com/news/researchers-warn-catastrophic-consequences-rapidly-113012683.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Cyx3M2mGVbf1wdhFXVjyoA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/65d8f638783bf6edaf647d002f6d9f6b",
            "country": "US",
            "language": "en",
            "summary": "According to a study published in Nature, every 1°C (1.8°F) increase in average global temperatures will result in a worldwide reduction in food production equivalent to 120 fewer calories per person, per day. Food is a great equalizer, something all humans require to survive. Farmers have long been warning about the impacts of unpredictable weather and temperatures on crop yields."
        },
        {
            "published_date": "2025-06-28T11:00:36",
            "title": "Opinion: Max Boykoff: What will we say in 2030?",
            "author": "Max Boykoff",
            "url": "https://www.dailycamera.com/2025/06/28/opinion-max-boykoff-what-will-we-say-2030-climate-change",
            "url_media": "https://www.dailycamera.com/wp-content/uploads/2025/02/Climate_Emissions_Plans_92755.jpg?w=1024&h=683",
            "country": "US",
            "language": "en",
            "summary": "In 2000, Dr. Angela Y. Davis gave a lecture in Boulder, where she asked people to think about their responsibility for the world in 2030. In the intervening decades, the 2030 threshold emerged in several key initiatives for positive action in the face of worsening environmental conditions. "
        },
        {
            "published_date": "2025-06-28T11:00:28",
            "title": "How hot is the pavement? During heat wave it can burn dogs' feet and yours",
            "author": "Susan Miers Smith",
            "url": "https://www.readingeagle.com/2025/06/28/how-hot-is-the-pavement-during-heat-wave-it-can-burn-dogs-feet-and-yours",
            "url_media": "https://www.readingeagle.com/wp-content/uploads/2025/06/HowHotPavementWebstock.jpg?w=1024&h=556",
            "country": "US",
            "language": "en",
            "summary": "The recent heat wave has been stifling. If the air temperature is over 85 degrees, it's too hot to walk your dog on asphalt. Pavement can become incredibly hot and cause discomfort, blisters and burn a dog's paw pads. The Calculator Academy has an online pavement temperature calculator."
        },
        {
            "published_date": "2025-06-28T11:00:00",
            "title": "More heatwaves are coming. Trump will make them even worse.",
            "author": "Mark Gongloff",
            "url": "https://www.houstonchronicle.com/opinion/outlook/article/summer-heat-wave-trump-weather-climate-change-20397475.php",
            "url_media": "https://s.hdnux.com/photos/01/52/73/14/28029718/5/rawImage.jpg",
            "country": "US",
            "language": "en",
            "summary": "There is a heat dome covering half of the U.S. this week. More than 91 million people from Iowa to New York face the highest level of alert, 'extreme heat,' with heat indexes in the triple digits. It's only been a year since the 'heat blob' that tormented 150 million Americans. The average summer minimum temperatures rose by 3 degrees Fahrenheit, on average, in 230 US locations studied by Climate Central."
        },
        {
            "published_date": "2025-06-28T11:00:00",
            "title": "Letter: Trump taking US backwards",
            "author": "",
            "url": "https://www.rockymounttelegram.com/opinion/letters/letter-trump-taking-us-backwards/article_36035a1a-d5a8-421d-a525-e67cb0f209b5.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/rockymounttelegram.com/content/tncms/assets/v3/editorial/0/ac/0ac46d76-c6f4-11ef-a421-17eab18d51b5/67730edca4faa.image.png?crop=1586%2C833%2C0%2C236&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The U.S. promotes oil, gas and coal industries with loosening regulations and dropping incentives for alternative energy. There are already dangerous heat advisories at the beginning of summer, and it's likely there will be more to come with more fossil fuel development."
        },
        {
            "published_date": "2025-06-28T10:02:19",
            "title": "Spain's Summer Heat: Weather Agency Debunks Hot Myth",
            "author": "James Carter",
            "url": "https://www.archyde.com/spains-summer-heat-weather-agency-debunks-hot-myth",
            "url_media": "https://assets.thelocal.com/cdn-cgi/rs:fit:1200/quality:75/plain/https://apiwp.thelocal.com/wp-content/uploads/2025/06/watermarks-logo-AFP__20240809__36D69NZ__v1__MidRes__SpainClimateWeatherHeat.jpg@webp",
            "country": "US",
            "language": "en",
            "summary": "There were more than 100 heat-related deaths in Spain during the first three weeks of June. Almería, for example, broke its highest maximum and minimum temperature records for June. This June's average temperature is predicted to be 30C. Human activities are the main cause of climate change."
        },
        {
            "published_date": "2025-06-28T10:00:00",
            "title": "Heat dome passes, but climate-fueled waves aren't going anywhere",
            "author": "Rachel Frazin",
            "url": "https://thehill.com/policy/energy-environment/5374333-heat-dome-climate-change-heat-waves-global-warming",
            "url_media": "https://thehill.com/wp-content/uploads/sites/2/2025/06/ClimateChange_Frazin_AP_CharlesKrupa.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "The Eastern U.S. sweltered under a heat dome in recent days, with some cities surpassing 100 degrees Fahrenheit. Megan Kirchmeier-Young, a research scientist at Environment and Climate Change Canada, said that as the planet warms up, extreme heat events become more likely. The world's average global temperature has risen 1.36 degrees Celsius, or about 2.4 degrees Fahrenheit, when compared to preindustrial times."
        },
        {
            "published_date": "2025-06-28T10:00:00",
            "title": "Climate change is driving a rise in tick-borne diseases. Here's what to know.",
            "author": "Acs Wms Rm",
            "url": "https://www.thestar.com/news/ontario/climate-change-is-driving-a-rise-in-tick-borne-diseases-heres-what-to-know/article_e01c9110-4b31-5597-808d-f6f85267ccaf.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/9/92/9927d9d3-a9de-5ce8-a416-e24959a4bcbc/685fbe5305479.image.jpg?crop=1485%2C780%2C0%2C150&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "Warming climate is driving a rise in Lyme disease and introduction of lesser-known tick-borne diseases in Canada, public health specialists say. 'Climate change in Canada is happening at a much more accelerated rate than in the rest of the world,' says Heather Coatsworth, chief of field studies at the National Microbiology Laboratory in Winnipeg."
        },
        {
            "published_date": "2025-06-28T09:01:09",
            "title": "Symptoms of climate change such as extreme heat can impact insect activity",
            "author": "Erica Van Buren",
            "url": "https://news.yahoo.com/symptoms-climate-change-extreme-heat-090109111.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/RMM8XY4SzBvHjtNuN6J17g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the-augusta-chronicle/aa516be5b659dbe7cb499c539a1bbce7",
            "country": "US",
            "language": "en",
            "summary": "Climate change is affecting gnats, black flies, blow flies, mosquitoes and other insects. Insects need humidity and warm temperatures to grow faster. Homeowners need to be diligent about eliminating standing water and prevent mosquitoes from getting inside their homes.    Erica Van Buren is a reporter for The Augusta Chronicle USA."
        },
        {
            "published_date": "2025-06-28T08:45:00",
            "title": "Experts issue warning on how heat waves are impacting spread of diseases: '[It's] a lot more complicated than I would have thought'",
            "author": "Tina Deines",
            "url": "https://www.msn.com/en-us/health/other/experts-issue-warning-on-how-heat-waves-are-impacting-spread-of-diseases-it-s-a-lot-more-complicated-than-i-would-have-thought/ar-AA1HA3er",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "A study from Trinity College Dublin simulated the effects of heat waves on disease dynamics between water fleas and their parasite Ordospora colligata. The study found that heat waves can dramatically alter a parasite's numbers and disease-spreading capabilities. However, starting at the highest temperature resulted in 13.5-fold decrease in parasites."
        },
        {
            "published_date": "2025-06-28T08:00:00",
            "title": "CARICOM Secretary-General lauds work of CCCCC on milestone anniversary",
            "author": "A Hover",
            "url": "https://antiguaobserver.com/caricom-secretary-general-lauds-work-of-ccccc-on-milestone-anniversary",
            "url_media": "https://antiguaobserver.com/wp-content/uploads/2025/06/front-5-caricom.jpg",
            "country": "AG",
            "language": "en",
            "summary": "Caribbean Community Climate Change Centre (CCCCC) celebrated its 20th anniversary on 25 June 2025 with a banquet and awards ceremony. Dr Carla Barnett, CARICOM Secretary-General, congratulated the CCCCC on the occasion. She said it is at the forefront of the Caribbean's climate resilience movement, working withgovernments, communities, international and regional partners."
        },
        {
            "published_date": "2025-06-28T07:50:35",
            "title": "Warming twice as fast, Asia faces a looming environmental catastrophe",
            "author": "The Assam Tribune",
            "url": "https://assamtribune.com/opinion/warming-twice-as-fast-asia-faces-a-looming-environmental-catastrophe-1582747",
            "url_media": "https://assamtribune.com/h-upload/2024/10/27/1663213-climate-cahnge.jpg",
            "country": "IN",
            "language": "en",
            "summary": "The latest UN report on global warming and climate change contains bad news for Asia. The continent is experiencing warming at nearly double the global rate. There are record-breaking concentrations of the world's three primary greenhouse gases reaching unprecedented levels in 2023. In recent years, there have been heatwaves, heavy rains, and typhoons in Asia. Glaciers in the central Himalayas and Central Asia's Tian Shan region are shrinking rapidly."
        },
        {
            "published_date": "2025-06-28T07:30:36",
            "title": "France bans smoking in beaches, in parks and bus shelters",
            "author": "Afp Afp",
            "url": "https://www.griffindailynews.com/news/national/france-bans-smoking-in-beaches-in-parks-and-bus-shelters/article_d23a769f-6fcc-5274-9655-653c234c6192.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/griffindailynews.com/content/tncms/assets/v3/editorial/e/11/e11d2558-3c14-5e0d-9674-22b7810d323c/685fa4d1b3bae.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "There will be mixed clouds and sun this morning with scattered thunderstorms developing this afternoon. High 88F. Winds light and variable. Chance of rain 50%..TonightSome clouds. A stray shower or thunderstorm is possible in the evening. Low 68F."
        },
        {
            "published_date": "2025-06-28T07:03:03",
            "title": "Flash floods devastate farmlands and homes across several Afghan provinces",
            "author": "Ariana News",
            "url": "https://www.ariananews.af/flash-floods-devastate-farmlands-and-homes-across-several-afghan-provinces",
            "url_media": "https://www.ariananews.af/wp-content/uploads/2025/06/Logar.jpg",
            "country": "AF",
            "language": "en",
            "summary": "Heavy rainfall and flash floods have caused significant financial damage in several provinces across Afghanistan. The provinces of Maidan Wardak, Logar, Khost, and Paktia have been among the hardest hit by the recent floods. Thousands of acres of agricultural land, hundreds of residential houses, power infrastructure, and public roads have been destroyed in Logar province."
        },
        {
            "published_date": "2025-06-28T06:30:16",
            "title": "‘Positive cascades could help accelerate change': social tipping points expert on fixing climate crisis",
            "author": "Jonathan Watts",
            "url": "https://www.theguardian.com/environment/ng-interactive/2025/jun/28/tipping-points-social-expert-on-fixing-climate-crisis",
            "url_media": "https://i.guim.co.uk/img/media/95af8208650437e8c14eb89bf0160a4a0526eae5/0_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5f1f3f5b01d5a00ff300780f6e94d807",
            "country": "GB",
            "language": "en",
            "summary": "Timothy Lenton is a professor of climate change and Earth system science at the University of Exeter. He started working on tipping points in the 1990s and is one of the first scientists in the world to study this form of planetary risk. On 30 June, he will host a global conference on the topic."
        },
        {
            "published_date": "2025-06-28T05:47:36",
            "title": "Syria's wheat war: drought fuels food crisis for 16 million",
            "author": "Sharjah 24",
            "url": "https://sharjah24.ae/en/Articles/2025/06/28/kmr2",
            "url_media": "https://sharjah24.ae/-/media/Sharjah24/Articles/2025/June-2025/28/Syrias-wheat-war-drought-fuels-food-crisis-for-16-million.jpg?20250628111306",
            "country": "AE",
            "language": "en",
            "summary": "Before the civil war, Syria was self-sufficient in wheat, producing an average of 4.1 million tonnes annually. The conflict has crippled production and devastated the economy. Around 16.3 million people are at risk of food insecurity in Syria this year. The weather has impacted 2.5 million hectares of wheat-growing land."
        },
        {
            "published_date": "2025-06-28T05:05:00",
            "title": "Singapore to assess climate threats to Pulau Tekong, Southern Islands and more in sea level rise study by 2026",
            "author": "Malay Mail",
            "url": "https://malaysia.news.yahoo.com/singapore-assess-climate-threats-pulau-050500184.html",
            "url_media": "https://media.zenfs.com/en/mmail.com.my/7f747b457077868348df0b646767ce4d",
            "country": "US",
            "language": "en",
            "summary": "Singapore will launch a study by 2026 to assess the risks of rising sea levels on selected offshore islands and explore suitable coastal protection strategies. Eight islands were selected based on a preliminary assessment of their vulnerability: Pulau Tekong, the Southern Islands (St John's and Lazarus), Kusu Island, Sisters' Islands (Pulau Subar Darat, Pulau Bukom and Pulau Hantu), Pulau Pawai, and Senang. Other islands will be assessed as part of broader development or planning initiatives by respective agencies."
        },
        {
            "published_date": "2025-06-28T04:15:37",
            "title": "Russian city of Vladivostok records highest temperature in 55 years",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/06/28/Russian_city_of_Vladivostok_records_highest_temperature_in_5",
            "url_media": "https://article.wn.com/view/2025/06/28/[]",
            "country": "US",
            "language": "en",
            "summary": "The Russian Far Eastern city of Vladivostok recorded its highest temperature in 55 years on Friday. The temperature reached 31.4 degrees Celsius, local meteorological authorities said.       in Xinhua news agency.  in China, the temperature reached 30 degrees Celsius. "
        },
        {
            "published_date": "2025-06-28T04:00:14",
            "title": "Countries should keep their statehood if land disappears under sea, experts say",
            "author": "Isabella Kaminski",
            "url": "https://www.theguardian.com/environment/2025/jun/28/countries-should-keep-their-statehood-if-land-disappears-under-sea-ilc-report",
            "url_media": "https://i.guim.co.uk/img/media/0cb06e1e7cb715fde0b92974f2794c22e1e3a8a9/436_0_1440_1152/master/1440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fbad770ccf7a20508aebb6e226c40ec1",
            "country": "GB",
            "language": "en",
            "summary": "The International Law Commission's report examined what existing law means for continued statehood and access to key resources if sea levels continue to rise due to climate breakdown. It concluded that nothing prevents nations from maintaining their maritime boundaries even if the land on which they are drawn changes or disappears. The Pacific island nation of Tuvalu has been particularly vocal in its concerns about rising sea levels. Australia was the first country to recognise the permanence of the boundaries of the island."
        },
        {
            "published_date": "2025-06-28T03:52:05",
            "title": "China Strengthens Economic Safeguards Amid Rising Flood Threats",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3484906-china-strengthens-economic-safeguards-amid-rising-flood-threats",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/26_06_2025_08_27_38_1863335.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "In response to increasing extreme weather events, China has enhanced its economic safeguards for populations impacted by flood-control schemes. The new compensation rules have been instituted after the 2023 summer saw unprecedented levels of rainfall in regions like Hebei. Nearly a million people were forced to relocate as authorities diverted floodwaters to protect key urban areas like Beijing."
        },
        {
            "published_date": "2025-06-28T03:41:32",
            "title": "Role of youth stressed to tackle climate challenges",
            "author": "Our Correspondent",
            "url": "https://tribune.com.pk/story/2553111/role-of-youth-stressed-to-tackle-climate-challenges",
            "url_media": "https://i.tribune.com.pk/media/images/img_04521651313274-2/img_04521651313274-2.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The four-day Youth Leadership for Climate Change workshop in Thatta started on June 24. It brought together young climate leaders to address climate adaptation and environmental sustainability actions. The event was organised by Sindh Community Foundation (SCF) under the Pakistan Youth Leadership Initiative (PYLI) and supported by the British Council Pakistan."
        },
        {
            "published_date": "2025-06-28T03:06:58",
            "title": "Natural changes are only part of Alaska's climate change story",
            "author": "News Feed Editor",
            "url": "https://rocketnews.com/2025/06/natural-changes-are-only-part-of-alaskas-climate-change-story-anchorage-daily-news-2",
            "url_media": "https://rocketnews.com/wp-content/uploads/2022/03/cropped-RocketNews-icon-logo-32x32.png",
            "country": "US",
            "language": "en",
            "summary": "Natural changes are only part of Alaska's climate change story, according to the Anchorage Daily News. The article is an adaptation of an article from the article \"Alaska's Climate Change\" by John Sutter, published in \"Anchorage Daily News\". "
        },
        {
            "published_date": "2025-06-28T03:05:44",
            "title": "Leland planning board backs ordinance changes regarding flood zone development",
            "author": "Conor Doherty",
            "url": "https://www.wwaytv3.com/leland-planning-board-backs-ordinance-changes-regarding-flood-zone-development",
            "url_media": "https://www.wwaytv3.com/content/uploads/2024/10/l/z/stoneycreekweb.png",
            "country": "US",
            "language": "en",
            "summary": "The Leland planning board has approved changes to the town's ordinances regarding developments in flood zones. Several areas in town were affected by flooding from Potential Tropical Cyclone 8 and Hurricane Florence. The council will vote on the ordinance changes on July 17th. The changes limit the density in areas that are considered flood zones and increase the freeboard requirement."
        },
        {
            "published_date": "2025-06-28T02:35:00",
            "title": "1900 Scientists Say 'Climate Change Not Caused By CO2' – The Real Environment Movement Was Hijacked",
            "author": "Tyler Durden",
            "url": "https://www.zerohedge.com/geopolitical/1900-scientists-say-climate-change-not-caused-co2-real-environment-movement-was",
            "url_media": "https://cms.zerohedge.com/s3/files/styles/16_9_max_700/public/2025-06/2025-06-27_11-12-33.jpg?h=521503c2&itok=hY8Zjqqo",
            "country": "BG",
            "language": "en",
            "summary": "Mark Keenan is a former scientist at the Department of Energy and Climate Change, UK Government and a former staff member at United Nations Environment. Keenan has written a book titled 'Climate CO2 Hoax – How Bankers Hijacked the Environment Movement' and co-signed the CLINTEL World Climate Declaration."
        },
        {
            "published_date": "2025-06-28T01:36:00",
            "title": "BUSHFIRES NT MESSAGE: PLANNED BURN ADVICE 28 June",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/bushfires-nt-message-planned-burn-advice-28-june-1486793",
            "url_media": "https://treasury.nt.gov.au/__data/assets/image/0011/807509/Parliament-House.jpg",
            "country": "US",
            "language": "en",
            "summary": "A planned burn is currently underway in Berry Springs, Cox peninsula Road/Doris Road, BERRY SPRINGS. Firefighters are managing the burn. Smoke from the fire may affect visibility and the firefighting crews may be working close to the roadside. "
        },
        {
            "published_date": "2025-06-28T01:30:18",
            "title": "Counting the carbon footprint of Israel's war on Gaza as Asia's climate crisis becomes more severe",
            "author": "Bibek Bhattacharya",
            "url": "https://www.livemint.com/newsletters/climate-change-israel-gaza-war-asia-heat-11750775995704.html",
            "url_media": "https://www.livemint.com/lm-img/img/2025/06/24/1600x900/Israel_Gaza_war_1750777100676_1750777140288.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bibek Bhattacharya and Sayantan Bera send a weekly newsletter titled \"Climate Change & You\". They discuss the link between war and climate change. Israel's relentless bombing of Gaza since October 2023 has killed over 55,000 Palestinians. WMO released a report on Monday titled \"The State Of The Climate in Asia 2024\". Asia is warming faster than the global average. 70% of Americans support global climate policy to tackle the climate crisis."
        },
        {
            "published_date": "2025-06-28T01:05:49",
            "title": "Earth trapping heat has doubled in 20 years",
            "author": "Steven Sherwood",
            "url": "https://www.thehansindia.com/hans/opinion/news-analysis/earth-trapping-heat-has-doubled-in-20-years-983328",
            "url_media": "https://assets.thehansindia.com/h-upload/2025/06/28/1563277-climate.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Earth's energy budget has more than doubled over the last 20 years. The Earth's climate change might well accelerate in the coming years. New research suggests changes in clouds is a big factor. The area covered by highly reflective white clouds has shrunk, while the area of jumbled, less reflective clouds has grown."
        },
        {
            "published_date": "2025-06-28T01:00:00",
            "title": "Climate-friendly habits",
            "author": "Nida Ashfaq",
            "url": "https://www.thenews.com.pk/print/1325137-climate-friendly-habits",
            "url_media": "https://www.thenews.com.pk/assets/front/img/no-img-fb.jpg",
            "country": "PK",
            "language": "en",
            "summary": "In our daily lives, we are witnessing the effects of climate change without even realising it. Unusually long heatwaves, unexpected rainfall patterns and worsening air quality are no longer rare events. Signs point directly to the environmental imbalance caused by global warming, deforestation, pollution and unchecked urbanisation. Today, more than ever, we need to reflect on our role and make simple but meaningful changes."
        },
        {
            "published_date": "2025-06-28T00:59:04",
            "title": "A Wake Up Call",
            "author": "Aamir Zulfiqar Khan",
            "url": "https://www.nation.com.pk/28-Jun-2025/a-wake-up-call",
            "url_media": "https://www.nation.com.pk/uploads/facebook_post_images/2025-06-28/facebook_post_image_1751072344.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Pakistan's average annual temperature has risen by about 0.5 to 0.7°C per decade since the 1960s, whereas globally, the average increase has been 0.1°C. The intensity and frequency of heatwaves have surged, with record-breaking temperatures without rain for weeks on end. Pakistan's CO2 emissions per capita have increased from 0.34 metric tonnes in 1974 to 1.05 tonnes in 2022. The industrial sector, transport and electricity generation are the largest contributors to CO2 in Pakistan, according to Climate Transparency. Pakistan produced less than 1% of global greenhouse gas emissions. According to Germanwatch, Pakistan ranked No.1 most affected by climate change in"
        },
        {
            "published_date": "2025-06-28T00:49:06",
            "title": "A Special ‘Climate' Visa? People in Tuvalu Are Applying Fast.",
            "author": "",
            "url": "https://dnyuz.com/2025/06/27/a-special-climate-visa-people-in-tuvalu-are-applying-fast",
            "url_media": "https://dnyuz.com/wp-content/uploads/2025/06/1751071743_A-Special-‘Climate-Visa-People-in-Tuvalu-Are-Applying-Fast.jpg",
            "country": "US",
            "language": "en",
            "summary": "As sea levels rise, Australia is offering a special 'climate visa' to citizens of Tuvalu, a Polynesian island nation of atolls and sandbars where waters are eating away at the land. The visa lottery opened last week and nearly half of the population has already applied. The country has been losing land to rising seas and further losses could make it one of the first countries to become uninhabitable because of climate change. It would take around 40 years for all of the citizens to relocate to Australia."
        },
        {
            "published_date": "2025-06-28T00:38:00",
            "title": "Planned Burn Alert: Cox Peninsula Rd, Berry Springs",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/planned-burn-alert-cox-peninsula-rd-berry-1486786",
            "url_media": "https://treasury.nt.gov.au/__data/assets/image/0011/807509/Parliament-House.jpg",
            "country": "US",
            "language": "en",
            "summary": "A planned burn is currently underway in Berry Springs. Firefighters are managing the burn but visibility may be affected. Smoke from the fire may affect visibility. Active fire may occur close to the roadside. Firefighting crews may be working close to roadways at the moment."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "China reports more frequent extreme weather events",
            "author": "",
            "url": "http://global.chinadaily.com.cn/a/202506/28/WS685fa333a31000e9a57391f4.html",
            "url_media": "http://img2.chinadaily.com.cn/images/202506/28/685fa333a31000e98c7cd9d7.jpeg",
            "country": "CN",
            "language": "en",
            "summary": "China is vulnerable to global climate change, experiencing more frequent and intense extreme weather events. China has been warming at a faster rate than the global average since the 1990s. Global average surface temperature reached its highest level in 2024 since meteorological records began in 1850."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Prolonged drought heightens sexual violence risk for young women in vulnerable regions: study",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250628/52764bd3de8f41dea11d7667bc8c5bcb/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Droughts are linked to a significant increase in sexual violence against adolescent girls and young women in low- and middle-income countries. The study examined data from over 35,000 females aged 13 to 24 in 14 countries in Central and South America, sub-Saharan Africa, Southeast Asia, and Eastern Europe. Extreme drought increased the risk of sexual violence by 21 percent."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Danish-led research initiative to forecast ice-free Arctic summers",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250628/7d1873df89e649b1a6013f8f1f76e761/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "A Danish-led research initiative, IcyAlert, has been launched with the goal of developing an advanced forecasting system capable of predicting when the Arctic will experience ice-free summers. The project, scheduled to run through 2031, seeks to provide early warnings about the timing and global consequences of an Arctic sea ice loss."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Russian city of Vladivostok records highest temperature in 55 years",
            "author": "Source: Xinhua",
            "url": "https://english.news.cn/20250628/870f1374842e4d0587d80b5079b688ec/c.html",
            "url_media": "",
            "country": "CN",
            "language": "en",
            "summary": "Vladivostok recorded its highest temperature in 55 years on Friday at 31.4 degrees Celsius. The previous record for this date was set in 1970 at 30 degrees Celsius, but Friday's temperature surpassed that mark by 1.4 degree Celsius. A Pacific anticyclone ridge was driving an exceptionally warm and dry air mass."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "A Special ‘Climate' Visa? People in Tuvalu Are Applying Fast.",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/06/28/A_Special_Climate_Visa_People_in_Tuvalu_Are_Applying_Fast",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Nearly half the citizens of the Pacific Island nation have already applied in a lottery for Australian visas. There is an existential threat from global warming and sea-level rise, according to the Pacific island nation's president.       .   in Australia."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Countries should keep their statehood if land disappears under sea, experts say",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/06/28/Countries_should_keep_their_statehood_if_land_disappears_und_g",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Long-awaited ILC report examines what should happen to vulnerable countries as sea levels rise due to sea level rise.    iLC report is titled \"What should be done to protect vulnerable countries' as sea level rises?\"  ILC's report is due soon. "
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Prolonged drought heightens sexual violence risk for young women in vulnerable regions: study",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/06/28/Prolonged_drought_heightens_sexual_violence_risk_for_young_w",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Droughts are linked to a significant increase in sexual violence against adolescent girls and young women in low- and middle-income countries. The study was led by researchers from the Perth-based Curtin University in Australia and was published in the International Journal of Agricultural Economics."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Temps heating up this weekend with some relief by Monday in Northern California",
            "author": "Lodi News Sentinel",
            "url": "https://article.wn.com/view/2025/06/28/Temps_heating_up_this_weekend_with_some_relief_by_Monday_in_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dirk Verdoorn looks at where the greatest temperature rise will happen and how long it will last in Northern California. He looks at the weather forecast from KCRA 3 Weather Meteorologist Dirk Verdoorner.    for the Northern California area and the rest of the state."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Saving birds and helping humanity",
            "author": "Bonnie Jean Feldkamp",
            "url": "https://www.thealpenanews.com/opinion/2025/06/saving-birds-and-helping-humanity",
            "url_media": "https://ogden_images.s3.amazonaws.com/www.thealpenanews.com/images/2025/06/12182332/Bonnie-Feldkamp.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Bonnie Jean Feldkamp is concerned about the decline of bird populations. The Cerulean Warbler Birdscape is a collaboration of 15 different agencies across two continents. It's a new conservation program focusing on the Ceruleans Warbler in Brown County, Indiana, which has declined by 70% since 1970."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Week of sweltering US heat – is this the new normal in a warming world?",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/06/28/Week_of_sweltering_US_heat_is_this_the_new_normal_in_a_warmi_q",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " is set to become more common as planet continues to heat up and get more extreme in the coming years.    in the United States and in the rest of the world and its eastern seabed and its north and its interior and its south and its east coast and its northern and its center and its centre and its land and its surface and its middle and its coast and centre and state and its peninsula and its state and state."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe Braces for First Major Heatwave of Summer Amid Rising Climate Concerns",
            "author": "Khaleej Mag",
            "url": "https://article.wn.com/view/2025/06/28/Europe_Braces_for_First_Major_Heatwave_of_Summer_Amid_Rising",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Millions are sweltering under Europe's first major heatwave of the northern hemisphere summer. In Italy, thermometers are set to soar to 37°C (99°F) in Rome. Climate experts warn that record-breaking temperatures are becoming the new normal due to climate change."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe 'bakes' in summer's first heatwave as continent warms",
            "author": "LBC International",
            "url": "https://article.wn.com/view/2025/06/28/Europe_bakes_in_summers_first_heatwave_as_continent_warms_3v",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are set to rise to 37 degrees Celsius (99 degrees Fahrenheit) in Rome on Saturday. It's the first heatwave of the northern hemisphere summer. Climate change is pushing temperatures on the world's fastest-warming continent increasingly into the red. "
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Southern Europe roasts as first heatwave of the summer scorches continent",
            "author": "Al Jazeera",
            "url": "https://article.wn.com/view/2025/06/28/Southern_Europe_roasts_as_first_heatwave_of_the_summer_scorc",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Europe is bracing itself for the first heatwave of the Northern Hemisphere summer. The temperature is expected to reach 37 degrees Celsius in Rome on Saturday. The Eternal tries not to think about it, but he drinks a lot of water and never stays still to avoid sunstroke."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe swelters in summer's first heatwave as continent warms",
            "author": "France24",
            "url": "https://article.wn.com/view/2025/06/28/Europe_swelters_in_summers_first_heatwave_as_continent_warms",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Southern Europeans are bracing themselves for the first heatwave of the northern hemisphere summer. Climate change is pushing the thermometers on the world's thermometers, according to the UNFCCC report.      Â   in the report."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Heat dome passes, but climate-fueled waves aren't going anywhere",
            "author": "The Hill",
            "url": "https://article.wn.com/view/2025/06/28/Heat_dome_passes_but_climatefueled_waves_arent_going_anywher",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Eastern U.S. sweltered under a heat dome in recent days, with some cities surpassing 100 degrees Fahrenheit. Roads in Delaware, Wisconsin and Missouri buckled. Global warming means more days when we exceed temperature thresholds, so heat extremes are becoming hotter and occurring more often."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe scorched by 40°C heatwaves as wildfires erupt across multiple countries",
            "author": "Saudi Gazette",
            "url": "https://article.wn.com/view/2025/06/28/Europe_scorched_by_40_C_heatwaves_as_wildfires_erupt_across_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Heatwaves sweeping across Europe have pushed temperatures above 40°C in several countries, sparking wildfires and prompting emergency warnings. In Spain there are increasingly dry and windy conditions. In Madrid, the heatwave has already caused wildfires. In the UK, the weather has been hot and dry."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Migratory bird hunters advised to get permits, stamps when buying hunting license",
            "author": "The Citizens' Voice",
            "url": "https://article.wn.com/view/2025/06/28/Migratory_bird_hunters_advised_to_get_permits_stamps_when_bu_d",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The MGBL is required to hunt waterfowl, doves, woodcock, brant, coots, gallinules, rails and snipe. The Atlantic Population Zone allows the Atlantic Flyway to closely manage harvest for migratory Canada geese."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Sections of New Orleans floodwalls are sinking faster than sea levels are rising, study finds",
            "author": "The Advocate",
            "url": "https://article.wn.com/view/2025/06/28/Sections_of_New_Orleans_floodwalls_are_sinking_faster_than_s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Parts of New Orleans' $15 billion hurricane protection system are sinking faster than sea levels are rising, according to scientists. The discovery is unsettling for New Orleans residents and the city's taxpayers.      Â   .   y  "
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Stampede in Soho: puppet animals on an epic trek bring wonder and warning to London streets",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/06/28/Stampede_in_Soho_puppet_animals_on_an_epic_trek_bring_wonder",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Public art project The Herds is passing through capital on 20,000km journey from Congo Basin to Arctic Circle. It is inspiring climate action in the capital and beyond. The project is called \"The Herds\" and it is a public art project.  "
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Nepal's hydropower a climate change solution",
            "author": "China Daily",
            "url": "https://article.wn.com/view/2025/06/28/Nepals_hydropower_a_climate_change_solution",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The eastern United States is experiencing its first round of extreme high temperatures this year, with record-breaking highs in many areas on June 23 and 24 affecting over a hundred million Americans. This week, the high temperatures in the eastern U.S. are expected to remain high."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Symptoms of climate change such as extreme heat can impact insect activity",
            "author": "The Augusta Chronicle",
            "url": "https://article.wn.com/view/2025/06/28/Symptoms_of_climate_change_such_as_extreme_heat_can_impact_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Rising temperatures in Augusta are affecting gnat and other insect activity. One thing that's going to help them is staying warm at night. Wednesday night I don't know if gnats will be able to stay warm. Elmer Gray, entomologist, at the University of Georgia, says it's possible."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "New Study Finds Women And Young People Hit Hardest By Climate Anxiety",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/06/28/New_Study_Finds_Women_And_Young_People_Hit_Hardest_By_Climat",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The reality of climate anxiety is no longer up for debate. It's backed by academic research. But what are we doing about it? What are we going to do about it, and how do we act on it?    i.e. what do we do about climate anxiety?"
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Is It True Earth Used To Take 420 Days To Orbit The Sun?",
            "author": "IFL Science",
            "url": "https://article.wn.com/view/2025/06/28/Is_It_True_Earth_Used_To_Take_420_Days_To_Orbit_The_Sun",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Earth used to have 420 days a year instead of 365. The Earth's orbit was shorter, so more days could be fitted in during the time it took the planet to orbit the Sun. However, the year has had a lot of other numbers of days at different times, so it's not the same thing."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "New Zealand fossils reveal deep roots of Australian magpie lineage",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/06/28/New_Zealand_fossils_reveal_deep_roots_of_Australian_magpie_l",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A newly discovered fossil shows that ancestors of the Australian magpie lived in New Zealand 19 million years ago. The magpie was introduced from Australia in the 1860s to control pasture pests. It has become one of New Zealand's most controversial birds due to this."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Study: Four Climate Fallacies Driving Costly Green Schemes And Fake Fixes",
            "author": "Principia Scientific",
            "url": "https://article.wn.com/view/2025/06/28/Study_Four_Climate_Fallacies_Driving_Costly_Green_Schemes_An",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Within the Western tradition, most people would agree that challenges such as those posed by man-made climate change are best addressed with pure reason. Risks would be avoided by taking the necessary steps to prevent them from happening in the first place, according to the author."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe swelters in summer's first heatwave as climate change intensifies",
            "author": "France24",
            "url": "https://article.wn.com/view/2025/06/28/Europe_swelters_in_summers_first_heatwave_as_climate_change_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Southern Europe experienced its first heatwave of the season on Saturday. Climate change continues to drive the weather in the region, as it does in the rest of the world.       in the world's climate change report says. in the report, it says."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Farmers battling climate change and drought in Akatsi South",
            "author": "Modern Ghana",
            "url": "https://article.wn.com/view/2025/06/28/Farmers_battling_climate_change_and_drought_in_Akatsi_South",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In Akatsi South, in Volta Region, climate change has destroyed the land.       .   in the past, there was a lot of greenery in the area. Now, the land is covered by a lot more trees."
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Half of Tuvalu applies for Australia's new climate visa",
            "author": "Star Advertiser",
            "url": "https://article.wn.com/view/2025/06/28/Half_of_Tuvalu_applies_for_Australia_s_new_climate_visa",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As sea levels rise, Australia will offer a special, first-of-its-kind 'climate visa' to Tuvalu's citizens. The Polynesian island nation has atolls and sandbars where waters are eating away at the land.  "
        },
        {
            "published_date": "2025-06-28T00:00:00",
            "title": "Europe bakes in summer's first heatwave as continent warms",
            "author": "Marco BERTORELLO",
            "url": "https://starlocalmedia.com/news/national/europe-bakes-in-summers-first-heatwave-as-continent-warms/article_7b953b90-4332-5625-b982-18cd314e1c9d.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/starlocalmedia.com/content/tncms/assets/v3/editorial/f/3e/f3e632e7-b672-5d20-8449-aa2232c2da0b/685fdd3ddd987.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Temperatures are set to rise to 37 degrees Celsius (99 degrees Fahrenheit) in Rome on Saturday. The Eternal City's tourists and Catholic pilgrims will go to the city's 2,500 public fountains for refreshment. It's the first heatwave of the northern hemisphere summer."
        }
    ]
}