{
    "status": "ok",
    "total_articles": 171,
    "articles": [
        {
            "published_date": "2025-08-19T23:57:22",
            "title": "U of I Professor Analyzes Disasters and Presents Insights on Hurricane Katrina",
            "author": "Internewscast",
            "url": "https://internewscast.com/local-news/u-of-i-professor-analyzes-disasters-and-presents-insights-on-hurricane-katrina",
            "url_media": "https://internewscast.com/wp-content/uploads/2025/08/U-of-I-professor-studies-disasters-shares-Hurricane-Katrina-findings.jpg",
            "country": "NG",
            "language": "en",
            "summary": "It's been two decades since Hurricane Katrina destroyed New Orleans and killed over 1,800 people. Professor Tatyana Deryugina from the University of Illinois studied the hurricane's impact on people's lives and economic situations. She found that people lived longer and earned more money as a result of the hurricane. She warned that we are not better prepared to handle natural disasters today than 20 years ago."
        },
        {
            "published_date": "2025-08-19T23:29:17",
            "title": "U of I professor studies disasters, shares Hurricane Katrina findings",
            "author": "Brandon Merano",
            "url": "https://www.wcia.com/news/education/u-of-i-professor-studies-disasters-shares-hurricane-katrina-findings",
            "url_media": "https://www.wcia.com/wp-content/uploads/sites/44/2025/08/snapshot-2025-08-19T170603.817.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "It's been 20 years since Hurricane Katrina devastated communities in the Southeastern United States. University of Illinois professor Tatyana Deryugina has been researching the impact the hurricane had on our lives and economies. She found that people are resilient and they lived longer and earned more money as a result of the hurricane. She warned that we are not better prepared to handle natural disasters today than 20 years ago."
        },
        {
            "published_date": "2025-08-19T22:57:06",
            "title": "WEATHER (6:00 PM, 19 August): Scattered showers overnight, two tropical waves being monitored",
            "author": "",
            "url": "https://dominicanewsonline.com/news/homepage/homepage-carousel/weather-600-pm-19-august-scattered-showers-overnight-two-tropical-waves-being-monitored",
            "url_media": "https://dominicanewsonline.com/news/wp-content/uploads/2023/10/Weather-Monday-Phillipe.jpeg",
            "country": "DO",
            "language": "en",
            "summary": "Moisture and instability is trailing a weak tropical wave. There will be scattered showers across Dominica during the early half of the overnight period. Drier conditions are expected afterwards, as a high pressure system builds and a Saharan dust plume moves into the area. People with respiratory sensitivities should exercise caution. Two tropical waves are being monitored in the Tropical Atlantic. The nearest one has a medium chance of development within 7 days and is expected to be near the Lesser Antilles by Thursday into Friday."
        },
        {
            "published_date": "2025-08-19T22:48:07",
            "title": "Salamatu-WOFAN on climate change: Turning adversity into prosperity",
            "author": "Prof. M. K. Othman",
            "url": "https://blueprint.ng/salamatu-wofan-on-climate-change-turning-adversity-into-prosperity",
            "url_media": "https://blueprint.ng/wp-content/uploads/2025/08/IMG-20210112-WA0005-9-2.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria's climate change threatens to undo development gains and exacerbate existing vulnerabilities. WOFAN organized a high-level, one-day multi-stakeholder meeting to discuss 'Climate-Smart Agriculture and Carbon Opportunities to Build Resilient, Sustainable Small Farming in Nigeria'"
        },
        {
            "published_date": "2025-08-19T22:42:00",
            "title": "Why Europe will soon be collecting Australian travellers' biometric data",
            "author": "Sarah Falson",
            "url": "https://www.bunburymail.com.au/story/9044698/what-australians-need-to-know-about-europes-entryexit-system",
            "url_media": "https://www.bunburymail.com.au/images/transform/v1/crop/frm/172575538/bc0a7439-c411-467c-9ca8-00a600dfc0d3.jpg/r0_475_4668_2926_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Border control procedures are changing for Australians travelling to Europe from October 2025. Sign up for our newsletter to stay up to date. Read our Privacy Policy.    .   iReport this article to a free account or signup to continue reading or continue with Google or Apple. "
        },
        {
            "published_date": "2025-08-19T22:00:08",
            "title": "B.C. resort destroyed by 2023 Okanagan wildfire sues over insurance ‘gaps'",
            "author": "The Canadian Press",
            "url": "https://www.therecord.com/news/canada/b-c-resort-destroyed-by-2023-okanagan-wildfire-sues-over-insurance-gaps/article_7371bb1d-1715-59ea-86c8-63461255cd65.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/therecord.com/content/tncms/assets/v3/editorial/2/d5/2d58cbe6-d779-5de3-9078-d6308bf7bafb/68a4f66d9383a.image.jpg?crop=1594%2C837%2C0%2C121&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "The McDougall Creek wildfire burns on the mountainside above lakefront homes in West Kelowna, B.C., on Friday, August 18, 2023. The Canadian flag is flying at half-staff. The website's domain is therecord.com."
        },
        {
            "published_date": "2025-08-19T21:50:16",
            "title": "Melting on The Arctic's Svalbard Islands Shows the Climate Future Is Now",
            "author": "Bob Berwyn",
            "url": "https://insideclimatenews.org/news/19082025/arctic-svalbard-record-ice-melt",
            "url_media": "https://insideclimatenews.org/wp-content/uploads/2025/08/GettyImages-2160933151-1024x683.jpg",
            "country": "US",
            "language": "en",
            "summary": "The amount of ice that melted on Svalbard, the archipelago north of Norway in the Barents Sea, made the region one of the most significant contributors to global sea level rise last year. The study shows how what seems like a once-in-a-1,000-year event will become normal in the future."
        },
        {
            "published_date": "2025-08-19T21:43:59",
            "title": "Hurricane Erin moves closer to US as evacuations begin in North Carolina",
            "author": "",
            "url": "https://www.skynews.com.au/world-news/united-states/hurricane-erin-moves-closer-to-us-as-evacuations-begin-in-north-carolina/video/9c349a62803edad354409c7e87c2d0b9",
            "url_media": "https://content.api.news/v3/images/bin/9461853e489ed73ac33e3dddfa2364eb",
            "country": "AU",
            "language": "en",
            "summary": "Hurricane Erin is predicted to affect parts of the Outer Banks of North Carolina. Some people are facing mandatory evacuations. There is a high risk of rip currents up the Atlantic Seaboard, with parts of Maryland expected to see eleven-foot waves. "
        },
        {
            "published_date": "2025-08-19T21:30:32",
            "title": "Environmental impacts following a hurricane (1)",
            "author": "",
            "url": "https://eu.augustachronicle.com/videos/news/environment/2025/08/19/environmental-impacts-following-a-hurricane-1/85730718007",
            "url_media": "https://www.gannett-cdn.com/authoring/authoring-images/2025/08/13/NAUG/85646060007-naug-extreme-weather-emergency-tour-0813202508-kg.JPG?crop=5830%2C3280%2Cx0%2Cy303&quality=10",
            "country": "US",
            "language": "en",
            "summary": "Hurricanes can release hazardous materials from sewage treatment plants and agricultural runoff, contaminating water, soil, and air, according to the World Health Organisation (WHO). WHO warns of the risk of the release of hazardous materials during hurricanes, especially during tropical cyclones."
        },
        {
            "published_date": "2025-08-19T21:29:00",
            "title": "Hurricane Erin intensifies, threatens U.S. East Coast, disrupts ports",
            "author": "",
            "url": "https://www.nationalfisherman.com/national-international/hurricane-erin-intensifies-threatens-u-s-east-coast-disrupts-ports",
            "url_media": "https://s3.divcom.com/www.nationalfisherman.com/images/Erin.jpeg.medium.800x800.jpg",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin has strengthened to a Category 4 storm with sustained winds of 130 mph. Erin is expected to produce life-threatening surf and rip currents along the Bahamas, much of the east coast of the U.S., Bermuda, and Atlantic Canada during the next several days. In North Carolina, officials ordered evacuations for Dare and Hyde counties, including Ocracoke and Hatteras islands, because of ocean overwash and potential road closures along N.C. Highway 12. The Coast Guard has set Port Condition YANKEE and Port Condition FOUR at select locations, signaling imminent gale-force winds."
        },
        {
            "published_date": "2025-08-19T21:27:39",
            "title": "Once a Source of Life and Renewal, Monsoon Brings Death to Pakistan",
            "author": "New York Times",
            "url": "https://article.wn.com/view/2025/08/19/Once_a_Source_of_Life_and_Renewal_Monsoon_Brings_Death_to_Pa_z",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change has brought a catastrophic new normal to Pakistan. Villages have been swept away and Pakistan's largest city has been hit by monsoon floods due to the climate change.       in Pakistan's biggest city, Karachi, has been badly hit by the floods."
        },
        {
            "published_date": "2025-08-19T20:32:36",
            "title": "AccuWeather: More humid, showers around tomorrow",
            "author": "Adam Joseph",
            "url": "https://6abc.com/videoClip/17588837",
            "url_media": "https://cdn.abcotvs.com/dip/images/17588836_081925-wpvi-accuweather-forecast-4pm-vid.jpg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will remain below average this week. There is a high risk of rip currents and seas becoming rougher over the next two days, with a risk of rough seas and high temperatures in the next few days. The weather is expected to stay below average."
        },
        {
            "published_date": "2025-08-19T20:10:06",
            "title": "Smoke-filled summers likely to become the new norm in Michigan",
            "author": "Wkar Public Media",
            "url": "https://www.wkar.org/wkar-news/2025-08-19/smoke-filled-summers-likely-to-become-the-new-norm-in-michigan",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/2a76e6b/2147483647/strip/true/crop/5272x2768+0+590/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fce%2Faf%2Fee98753a4c7e85229158f893c09e%2F20250810-dronework5-dsc-3.jpg",
            "country": "US",
            "language": "en",
            "summary": "This year has been Canada's second largest year for wildfires. The first largest year will be in 2023. The climate is getting warmer and drier and wildfires are increasing in frequency, size and intensity. The remote location of the Canadian fires makes it hard to control them. This year, the Michigan Department of Environment, Great Lakes and Energy issued 27 air advisories and 4 air quality alerts."
        },
        {
            "published_date": "2025-08-19T19:59:10",
            "title": "Storm warnings issued as hurricane Erin moves north",
            "author": "Stacy Liberatore",
            "url": "https://www.msn.com/en-ie/weather/topstories/storm-warnings-issued-as-hurricane-erin-moves-north/ss-AA1KPbOg",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin has intensified and is bringing dangerous conditions to the US East Coast. Storm Surge Warning is in effect for the North Carolina coastline from Cape Lookout to Duck. Tropical Storm Warnings are in effect from Beaufort Inlet to Duck, with conditions expected within the next 36 hours."
        },
        {
            "published_date": "2025-08-19T19:05:31",
            "title": "Climate Change is Coming for Your Bananas",
            "author": "Who What Why",
            "url": "https://article.wn.com/view/2025/08/19/Climate_Change_is_Coming_for_Your_Bananas",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Climate change is coming for bananas, because of climate change. Bananas are an affordable and nutritious supermarket staple for consumers around the world, but that could soon change, as climate change is contributing to a rise in global warming.    Maria.  Maria's book is called \"Climate Change is Coming for Bananas\"."
        },
        {
            "published_date": "2025-08-19T19:01:12",
            "title": "Ex-Miami NOAA scientist warns of seafood, storm risks from federal cuts",
            "author": "Holden Earl Harris",
            "url": "https://www.miamiherald.com/opinion/op-ed/article311758033.html",
            "url_media": "https://www.miamiherald.com/public/latest-news/5zm7f1/picture311625576/alternates/LANDSCAPE_1140/Chantal_still.png",
            "country": "US",
            "language": "en",
            "summary": "Proposed 2026 budget for NOAA includes significant cuts, mainly targeting research and climate-related programs. Holden Earl Harris was a research fishery biologist with NOAA's Southeast Fisheries Science Center in Miami. He was fired along with 880 new employees in February. He sells frozen chocolate bananas on the beach in Jacksonville Beach."
        },
        {
            "published_date": "2025-08-19T18:57:36",
            "title": "AFRIWOCC announces 2025 conference, promises bold climate solutions",
            "author": "",
            "url": "https://www.myjoyonline.com/afriwocc-announces-2025-conference-promises-bold-climate-solutions",
            "url_media": "https://www.myjoyonline.com/wp-content/uploads/2025/08/IMG_6001-1024x683.jpeg",
            "country": "GH",
            "language": "en",
            "summary": "Africa's leading platform for youth and women in climate leadership, the Africa Women and Children Conference (AFRIWOCC), will return for its second edition on October 6-7, 2025, at the Labadi Beach Hotel in Accra. The conference is expected to convene over 500 delegates from government institutions, civil society, climate organisations, academic institutions, development partners, and grassroots movements from across the African continent and the diaspora. It will focus on youth-led climate action, women's leadership, and inclusive policy development."
        },
        {
            "published_date": "2025-08-19T18:53:29",
            "title": "BSC Pioneers Early Warning System to Forecast Dengue Outbreaks in the",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/bsc-pioneers-early-warning-system-to-forecast-dengue-outbreaks-in-the-caribbean-months-ahead",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/08/BSC-Pioneers-Early-Warning-System-to-Forecast-Dengue-Outbreaks-in-the-Caribbean-Months-Ahead-1755629612.jpg",
            "country": "TR",
            "language": "en",
            "summary": "A new model predicts dengue outbreaks up to three months in advance. It is based on the interplay of climatic variables and epidemiological data. The model's validation phase, examining data spanning from 2012 to 2022, demonstrated remarkable predictive accuracy, successfully identifying 81% of observed outbreaks."
        },
        {
            "published_date": "2025-08-19T18:45:28",
            "title": "Scientists Believe Greenland May Be Hiding A Secret Lake Under The Ice",
            "author": "BGR",
            "url": "https://article.wn.com/view/2025/08/19/Scientists_Believe_Greenland_May_Be_Hiding_A_Secret_Lake_Und",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "A lake in Greenland has been making bigger changes than expected due to climate change. The lake was previously unknown and was not expected to be so active.       in the midst of climate change, few places are more dynamic than Greenland, but a lake in it is making big changes."
        },
        {
            "published_date": "2025-08-19T18:42:06",
            "title": "Global Threats: Perspectives and Concerns from the International Community",
            "author": "Daniel Foster",
            "url": "https://www.archyde.com/global-threats-perspectives-and-concerns-from-the-international-community",
            "url_media": "https://www.pewresearch.org/wp-content/uploads/sites/20/2025/08/PG_25.08.19_GlobalThreats_featured@2x.png?w=1200&h=628&crop=1",
            "country": "US",
            "language": "en",
            "summary": "According to 2025 Pew Research Center study, the spread of false information online is the top threat in Germany, the Netherlands, Poland, Sweden, the UK, the U.S., and South Korea. 70% of those surveyed view the condition of the global economy as a major threat in Greece and Australia. Concerns about climate change and spread of infectious diseases have decreased."
        },
        {
            "published_date": "2025-08-19T18:38:30",
            "title": "Forecasters Warn of 100-Foot Waves as Hurricane Erin Brushes the East Coast",
            "author": "Gizmodo",
            "url": "https://article.wn.com/view/2025/08/19/Forecasters_Warn_of_100Foot_Waves_as_Hurricane_Erin_Brushes_",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "The first hurricane of the 2025 Atlantic season is poised to bring life-threatening impacts to much of the East Coast. It is unlikely to make landfall, but it is still a threat to life and property.      Â   i  "
        },
        {
            "published_date": "2025-08-19T18:32:44",
            "title": "Life-threatening storm warnings issued as Hurricane Erin moves toward US East Coast",
            "author": "STACY LIBERATORE",
            "url": "https://www.dailymail.co.uk/sciencetech/article-15015279/storm-warnings-issued-Hurricane-Erin-East-Coast-north-carolina.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/08/19/19/101367381-0-image-a-32_1755628344630.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Erin has intensified and is bringing dangerous conditions to the US East Coast. Storm Surge Warning is in effect for the North Carolina coastline from Cape Lookout to Duck. Life-threatening surf and rip currents are expected along beaches from the Bahamas to the Mid-Atlantic. Erin is expected to accelerate as it moves northeast into the mid-latitude westerlies by Thursday."
        },
        {
            "published_date": "2025-08-19T18:20:00",
            "title": "Hunger declines globally, but rises in Africa and western Asia",
            "author": "AGATHA NGOTHO",
            "url": "https://www.the-star.co.ke/news/star-farmer/2025-08-19-hunger-declines-globally-but-rises-in-africa-and-western-asia-says-un-report",
            "url_media": "https://cdn.radioafrica.digital/image/2025/08/cffcd387-d5bc-4abc-b3e6-2ac542ff2a2d.jpeg?1755628610887",
            "country": "KE",
            "language": "en",
            "summary": "An estimated 8.2% of the global population experienced hunger in 2024, down from 8.5% in 2023 and 8.7% in 2022. However, progress was not consistent across the globe, as hunger continued to rise in most subregions of Africa and western Asia. The proportion of the population facing hunger in Africa surpassed 20% in 2024 and 512 million people could bechronically undernourished by 2030."
        },
        {
            "published_date": "2025-08-19T18:11:30",
            "title": "How the Filipino accountant can help save the planet",
            "author": "The Manila Times",
            "url": "https://article.wn.com/view/2025/08/19/How_the_Filipino_accountant_can_help_save_the_planet",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "The effects of climate change are a yearly reality for Filipinos. The National Disaster Risk Reduction and Management Council estimates that between 2014 and 2024, climate change will affect Filipinos yearly between 2014-2024.       .   \"It has become a fundamental fact that climate change is no longer a distant threat\""
        },
        {
            "published_date": "2025-08-19T18:11:08",
            "title": "Nature-based solution to address climate change",
            "author": "Anniversary Issue-I",
            "url": "https://thefinancialexpress.com.bd/views/nature-based-solution-to-address-climate-change",
            "url_media": "https://tfe-bd.sgp1.cdn.digitaloceanspaces.com/posts/112531/img-3530.jpeg",
            "country": "BD",
            "language": "en",
            "summary": "Nature-based solutions (NbS) are actions to protect, sustainably manage and restore natural and modified ecosystems to address societal challenges effectively and adaptively. NbS involves protecting our natural ecosystems such as forests peatlands, wetlands, grasslands, fisheries, timberlands and marine habitats through locally led projects that support communities. The Kudalichora Canal, Moulvibazar, Bangladesh is an example of NBS that addresses urban challenges of climate change."
        },
        {
            "published_date": "2025-08-19T18:06:54",
            "title": "8 Facts About What Would Happen If We Poured All of Earths Water on the Sun",
            "author": "Filip",
            "url": "https://www.msn.com/en-us/weather/topstories/8-facts-about-what-would-happen-if-we-poured-all-of-earths-water-on-the-sun/ar-AA1KOFen",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Earth's surface is 71 percent water, totaling roughly 1.3 billion cubic kilometers or 332 million cubic miles. Even a small fraction of this volume is almost unimaginable to transport, let alone the entire planet's supply. Reaching the Sun is a logistical nightmare that requires far more energy than sending spacecraft to Mars. The real culprit for our overheating planet is human activity and carbon emissions."
        },
        {
            "published_date": "2025-08-19T18:05:13",
            "title": "Chatham County Seeks Public Input on Regional Hazard Mitigation Plan for Cape Fear Area",
            "author": "Desmond Larkin",
            "url": "https://hoodline.com/2025/08/chatham-county-seeks-public-input-on-regional-hazard-mitigation-plan-for-cape-fear-area",
            "url_media": "https://img.hoodline.com/2025/8/chatham-county-seeks-public-input-on-regional-hazard-mitigation-plan-for-cape-fear-area-1.webp",
            "country": "US",
            "language": "en",
            "summary": "Chatham County Emergency Management is calling on the public to weigh in on their Regional Hazard Mitigation Plan, which focuses on the Cape Fear area. The plan is updated every five years to identify vulnerabilities and mitigate risks. The deadline for the survey is on October 3."
        },
        {
            "published_date": "2025-08-19T18:04:54",
            "title": "Climate crisis affects nursing",
            "author": "",
            "url": "https://www.fbcnews.com.fj/news/climate-crisis-affects-nursing",
            "url_media": "https://www.fbcnews.com.fj/wp-content/uploads/2025/06/Nurses.png",
            "country": "FJ",
            "language": "en",
            "summary": "Climate change is affecting the work of nurses in Fiji and the Pacific. Rising temperatures are causing significant physical and mental health challenges. Nurses face great challenges in providing support during natural disasters. In the coming years, they will hold more workshops to prepare healthcare workers to provide services and work effectively in any conditions."
        },
        {
            "published_date": "2025-08-19T18:00:00",
            "title": "The berries come early. Sign of  a good summer or coming climate disaster?",
            "author": "Vicky Allan",
            "url": "http://agriculture.einnews.com/article_detail/841384379/pcitCh5jp6tpiKNM",
            "url_media": "https://www.heraldscotland.com/resources/images/19852586.jpg?type=og-image",
            "country": "UA",
            "language": "en",
            "summary": "This year's harvest in Scotland is coming in two weeks earlier than usual. The UK imports 40% of its food from other countries. Pakistan is the UK's second biggest supplier of rice. The World Food Programme warned that millions of people in southern Africa are at risk of hunger."
        },
        {
            "published_date": "2025-08-19T18:00:00",
            "title": "Climate change as a human rights concern",
            "author": "Jeba Mobashwira",
            "url": "https://www.thedailystar.net/law-our-rights/news/climate-change-human-rights-concern-3966496",
            "url_media": "https://tds-images.thedailystar.net/sites/default/files/styles/social_share/public/images/2025/08/20/environmental-rights.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Climate change is a human rights issue. It threatens the rights to life, health, food, water, housing, and a dignified standard of living. The 2007 Male Declaration recognised climate change as an immediate threat to human rights. The Preamble to the Paris Agreement 2015 urges nations to respect their obligations on human rights and gender equality when taking action to address climate change."
        },
        {
            "published_date": "2025-08-19T18:00:00",
            "title": "Gendered effects of environmental crises",
            "author": "",
            "url": "https://www.thedailystar.net/law-our-rights/news/gendered-effects-environmental-crises-3966486",
            "url_media": "https://tds-images.thedailystar.net/sites/default/files/styles/social_share/public/images/2025/08/20/law-letter.jpg",
            "country": "BD",
            "language": "en",
            "summary": "Climate change intensifies gender-based human rights violations in Bangladesh's coastal districts. Cyclone Amphan increased Gender Based Violence (GBV) by 65% in the affected areas. There is an urgent need for a legal framework that is gender responsive. Disaster-prone areas must have access to gender-responsive healthcare, including trained professionals, reproductive and mental health assistance, and menstrual hygiene. Law should focus on all kinds of abuse, harassment, trafficking, and forced marriage in displacement contexts."
        },
        {
            "published_date": "2025-08-19T17:56:20",
            "title": "4. Global climate change as a threat",
            "author": "Jacob Poushter",
            "url": "https://www.pewresearch.org/global/2025/08/19/global-climate-change-as-a-threat",
            "url_media": "https://www.pewresearch.org/wp-content/uploads/sites/20/2025/08/PG_25.08.19_GlobalThreats_featured@2x.png?w=1200&h=628&crop=1",
            "country": "US",
            "language": "en",
            "summary": "A median of 67% of adults across 25 nations say global climate change is a major threat to their country. Since 2022, the share of people who view climate change as major threat has decreased in many high-income countries surveyed. Liberals are more than four times more likely than conservatives in the U.S. to see climate change major threat. People who support right-wing populist parties are less likely to say it's a threat than people who don't."
        },
        {
            "published_date": "2025-08-19T17:38:53",
            "title": "Hurricane Erin update: Forecast sees huge storm moving closer to U.S.",
            "author": "Bill Chappell",
            "url": "https://www.newsbreak.com/news/4183736480804-hurricane-erin-update-forecast-sees-huge-storm-moving-closer-to-u-s",
            "url_media": "https://img.particlenews.com/img/id/4PmKKR_13vd8LjK00",
            "country": "PH",
            "language": "en",
            "summary": "Hurricane Erin is moving closer to the Eastern seaboard. Evacuation orders and states of emergency have been issued in two North Carolina counties. Great Dog Rescue New England wants to adopt Nolan, Nina, and Noah Nuzzle, who were born in foster care to their mother, Nayla Nuzzle."
        },
        {
            "published_date": "2025-08-19T17:34:59",
            "title": "International climate study reports all-time record temps for 2024",
            "author": "Ted Buehner",
            "url": "https://www.everettpost.com/local-news/international-climate-study-reports-all-time-record-temps-for-2024",
            "url_media": "https://www.everettpost.com/wp-content/uploads/2025/08/louis-maniquet-71QXQUSC_Do-unsplash-e1755624797537.jpg",
            "country": "US",
            "language": "en",
            "summary": "The American Meteorological Society released the 35th annual State of the Climate report. The report highlights the warming planet, both on land and at sea. The last 10 years (2015-2024) were the 10 warmest years on record. North America, including the United States, was the warmest in its 115-year record."
        },
        {
            "published_date": "2025-08-19T17:22:18",
            "title": "Climate Change Drives Shifts in Finnish Moth Communities: Northern Declines",
            "author": "SCIENMAG",
            "url": "https://scienmag.com/climate-change-drives-shifts-in-finnish-moth-communities-northern-declines-and-southern-expansions",
            "url_media": "https://scienmag.com/wp-content/uploads/2025/08/Climate-Change-Drives-Shifts-in-Finnish-Moth-Communities-Northern-Declines-and-Southern-Expansions-1755624141.jpg",
            "country": "TR",
            "language": "en",
            "summary": "The warming climate is instigating profound shifts in moth communities throughout Finland. Scientists at the University of Helsinki studied how these nocturnal insects are responding to the steady increase in average temperatures. They found that moth communities in Finland are increasingly dominated by warm-adapted species. In contrast, in southern Finland, most resident species persist even as new species colonize the region."
        },
        {
            "published_date": "2025-08-19T17:18:31",
            "title": "Eyewitness News at 12:30pm - August 19, 2025",
            "author": "",
            "url": "https://abc11.com/videoClip/17587526",
            "url_media": "https://cdn.abcotvs.com/dip/images/11483052_011822wtvd1230pmthumbimg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin threatens dangerous surf for much of the East Coast due to Erin's hurricane force winds and heavy rains. It's expected to make landfall on Friday.      Â   in New Jersey. Â \"Erin\" is a Category 4 hurricane."
        },
        {
            "published_date": "2025-08-19T17:07:38",
            "title": "Hurricane Erin sparks massive waves and evacuations in North Carolina's Outer Banks",
            "author": "Marina Dunbar",
            "url": "https://news.yahoo.com/articles/hurricane-erin-sparks-massive-waves-170738502.html",
            "url_media": "https://media.zenfs.com/en/the_guardian_765/c0456fff8396b9babe9bf5b26c359cc1",
            "country": "US",
            "language": "en",
            "summary": "Erin is a category 2 hurricane with 110 mph winds. It is moving north-west at 7 mph and is 665 miles south of Bermuda and 720 miles south-south-east of Cape Hatteras, North Carolina. North Carolina's Outer Banks ordered to evacuate due to the storm."
        },
        {
            "published_date": "2025-08-19T17:07:38",
            "title": "Hurricane Erin sparks major waves and evacuations in North Carolina's Outer Banks",
            "author": "Marina Dunbar",
            "url": "https://news.yahoo.com/news/articles/hurricane-erin-sparks-massive-waves-170738502.html",
            "url_media": "https://media.zenfs.com/en/the_guardian_765/c0456fff8396b9babe9bf5b26c359cc1",
            "country": "US",
            "language": "en",
            "summary": "Erin is a category 2 hurricane with 110 mph winds. It is moving north-west at 7 mph and is producing huge swells. Evacuation orders were issued for Hatteras and Ocracoke islands in North Carolina's Outer Banks due to the threat of flooding. Erin is not expected to hit the mainland."
        },
        {
            "published_date": "2025-08-19T17:07:38",
            "title": "Hurricane Erin sparks huge waves and evacuations in North Carolina's Outer Banks",
            "author": "Marina Dunbar",
            "url": "https://amp.theguardian.com/us-news/2025/aug/19/hurricane-erin",
            "url_media": "https://i.guim.co.uk/img/media/6f854d333329835a60927e3cf77b037bc659ce93/584_0_2916_2333/master/2916.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=70f95cebdbd5384c3c96c47518b76498",
            "country": "GB",
            "language": "en",
            "summary": "Erin is a category 2 hurricane with 110 mph winds. It is moving north-west at 7 mph and is producing huge swells. North Carolina's Outer Banks have been warned of coastal flooding. Hatteras and Ocracoke islands were ordered to evacuate."
        },
        {
            "published_date": "2025-08-19T16:58:14",
            "title": "Editorial: Climate change not to blame for Canada's wildfires",
            "author": "",
            "url": "https://www.ctinsider.com/waterbury/opinion/article/canada-wildfires-climate-change-20824181.php",
            "url_media": "https://s.hdnux.com/photos/01/54/14/44/28363050/6/rawImage.jpg",
            "country": "PA",
            "language": "en",
            "summary": "The Canadian wildfires are burning north of the border, fouling the air from North Dakota to New England. Republicans from affected states blame Canada for the problem. Jennifer Francis, a climate scientist at the Woodwell Climate Research Center in Cape Cod, Massachusetts, says the United States is to blame for the increased fires."
        },
        {
            "published_date": "2025-08-19T16:54:24",
            "title": "North Pacific waters are acidifying more rapidly below the surface, research reveals",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/08/19/North_Pacific_waters_are_acidifying_more_rapidly_below_the_s",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide in the atmosphere enters the ocean at the surface and has been increasing the acidity of Pacific waters since the 1990s.    Carbon Dioxide is increasing the pH of the Pacific Ocean. It also increases the levels of CO2 in the ocean. "
        },
        {
            "published_date": "2025-08-19T16:53:41",
            "title": "Weather forces delays, cancellations",
            "author": "",
            "url": "https://www.capegazette.com/article/weather-forces-delays-cancellations/295129",
            "url_media": "https://www.capegazette.com/sites/capegazette/files/2025/08/field/image/AdobeStock_102038486.jpeg",
            "country": "US",
            "language": "en",
            "summary": "Cape Community Day, set for 4 to 7 p.m. Wednesday, Aug. 20, at Jefferson Apartments in Lewes, has been canceled due to bad weather. To report a delay or cancellation, email newsroom@capegazette.com."
        },
        {
            "published_date": "2025-08-19T16:50:47",
            "title": "Eyewitness News at Noon - August 19, 2025",
            "author": "",
            "url": "https://abc11.com/videoClip/17587310",
            "url_media": "https://cdn.abcotvs.com/dip/images/11483048_011822wtvd12pmthumbimg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin threatens dangerous surf for much of the East Coast due to Erin's hurricane force winds and heavy rains. It's expected to make landfall on Friday.      Â   in New Jersey. Â \"Erin\" is a Category 4 hurricane."
        },
        {
            "published_date": "2025-08-19T16:45:51",
            "title": "AccuWeather: Unseasonably cool and cloudy today",
            "author": "Payton Domschke",
            "url": "https://6abc.com/videoClip/17587269",
            "url_media": "https://cdn.abcotvs.com/dip/images/17587267_081925-wpvi-accuweather-forecast-noon-vid.jpg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will remain below average this week. There is a high risk of rip currents and seas becoming rougher over the next two days, with a risk of rough seas and high temperatures in the next few days. The weather is expected to stay below average."
        },
        {
            "published_date": "2025-08-19T16:41:25",
            "title": "Hurricane Erin Threatens Atlantic Shipping Routes with Massive 16-Meter Waves",
            "author": "g Captain",
            "url": "https://article.wn.com/view/2025/08/19/Hurricane_Erin_Threatens_Atlantic_Shipping_Routes_with_Massi",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Erin is generating dangerous sea conditions across the western Atlantic. The storm is moving between the U.S. East Coast and Bermuda. The forecasted wave heights reach extreme levels and seas reach up to 14.5 meters in some parts of the Atlantic. "
        },
        {
            "published_date": "2025-08-19T16:31:00",
            "title": "How the Filipino accountant can help save the planet",
            "author": "Eba May Desabelle-Tibubos",
            "url": "https://www.manilatimes.net/2025/08/20/business/top-business/how-the-filipino-accountant-can-help-save-the-planet/2170368",
            "url_media": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
            "country": "PH",
            "language": "en",
            "summary": "The effects of climate change are a yearly reality for Filipinos. The National Disaster Risk Reduction and Management Council estimates that between 2014 and 2024, typhoons caused annual direct economic losses of P20 billion to P60 billion. Accountants possess a practical set of skills that support climate action through data, accountability and strategy. Professional organizations are integrating sustainability into their conferences and training programs."
        },
        {
            "published_date": "2025-08-19T16:17:26",
            "title": "Fire-safe landscaping is moving from niche to necessity for gardens in 2025",
            "author": "Hibbing Daily Tribune",
            "url": "https://article.wn.com/view/2025/08/19/Firesafe_landscaping_is_moving_from_niche_to_necessity_for_g_3b",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Rising temperatures and record-setting wildfire activity are changing Americans' thinking about the future of the country. The U.S. is seeing a change in the way people think about their future.    .   i   for confidential support call 1-800-273-8255."
        },
        {
            "published_date": "2025-08-19T16:12:18",
            "title": "Debate New Climate Report, Don't Silence It",
            "author": "Veronique de Rugy",
            "url": "https://www.newsmax.com/veroniquederugy/epa-deniers-warming/2025/08/19/id/1223096",
            "url_media": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=3d28a073-6768-4abf-9bde-15bd838d45a0&SiteName=Newsmax",
            "country": "US",
            "language": "en",
            "summary": "A new report from the Department of Energy concludes that the climate is changing and humans contribute to it, but it's not necessarily the impending catastrophe we've been warned about. The report's authors also find that the planet's warming is unlikely to cause as much economic damage as commonly claimed."
        },
        {
            "published_date": "2025-08-19T16:03:16",
            "title": "What makes Rochester a ‘Climate Haven'?",
            "author": "Reagan Hillman",
            "url": "https://www.rochesterfirst.com/weather/what-makes-rochester-a-climate-haven",
            "url_media": "https://www.rochesterfirst.com/wp-content/uploads/sites/66/2019/11/RochesterSkyLine_111319.jpg?w=1280",
            "country": "US",
            "language": "en",
            "summary": "Rochester is being considered a potential 'climate haven' due to its location on Lake Ontario. People from across the US have relocated to Rochester in recent years. Rochester is a non-coastal city, located several hours away from the ocean. Ontario provides abundant fresh water, protecting the region from droughts and wildfire risks."
        },
        {
            "published_date": "2025-08-19T15:59:00",
            "title": "Vancouver Island wildfire evacuees to hear soon when they can go home",
            "author": "Ashley Joannou",
            "url": "https://www.thestar.com/news/canada/british-columbia/vancouver-island-wildfire-evacuees-to-hear-soon-when-they-can-go-home/article_43a94b96-e483-53ed-b0b1-a258246a62db.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/b/2d/b2d528e2-5a4a-4763-9637-f0681b9482a8/68a4bf3a7def8.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "A burned section of forest from the Mount Underwood wildfire is seen in this handout photo, southwest of Port Alberni, B.C., on Monday, Aug. 18, 2025. SDV flag wire: true flag sponsored: false article_type: pubinfo.section: cms.custom.site_domain: thestar.com sWebsitePrimaryPublication: publications/toronto_star bHasMigratedAvatar: false firstAuthor.avatar : false."
        },
        {
            "published_date": "2025-08-19T15:56:26",
            "title": "City Encourages Property Owners to Keep Moving Forward After Hurricane Helene (City of Douglas, GA)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/08/19/City_Encourages_Property_Owners_to_Keep_Moving_Forward_After",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "The one-year anniversary of Hurricane Helene's devastating impact on Douglas and Coffee County is approaching. The city is intensifying its focus on the progress of long-term recovery efforts for community restoration for the one year anniversary of Helene. The project is called Community Restoration Initiative."
        },
        {
            "published_date": "2025-08-19T15:55:29",
            "title": "Letter: Too darn hot?",
            "author": "Letter Writer",
            "url": "https://www.concordmonitor.com/2025/08/19/letter-too-darn-hot",
            "url_media": "https://www.concordmonitor.com/wp-content/uploads/2025/08/cropped-CMapp-32x32.jpg",
            "country": "US",
            "language": "en",
            "summary": "It's hot. Erin went from Cat 1 to Cat 5 hurricane in 24 hours. The cause is the CO2 that comes from burning fuels that contain carbon. The solution is to burn less carbon. GOP-run state government should stop subsidizing fossil fuels and dump the politicians who vote that way."
        },
        {
            "published_date": "2025-08-19T15:55:00",
            "title": "Marine geophysicist to lecture on greenhouse, icehouse Earth",
            "author": "Courtesy",
            "url": "https://www.mdislander.com/announcements/community/marine-geophysicist-to-lecture-on-greenhouse-icehouse-earth/article_c606a55e-d5ca-4aa0-bdd3-9465ce41f56a.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/mdislander.com/content/tncms/assets/v3/editorial/8/a4/8a495793-b338-499e-9c9d-018232dc8d07/689f2a7c0cf3c.image.jpg?crop=1247%2C655%2C0%2C504&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Mike Coffin, Ph.D., will give a lecture at the Northeast Harbor Library on Wednesday, August 27 at 5:30 p.m. The lecture will be titled \"Greenhouse & Icehouse Worlds.\" Earth's climate has fluctuated between Greenhouse and Icehouse Earth."
        },
        {
            "published_date": "2025-08-19T15:39:00",
            "title": "Human emissions driving Colorado River ‘megadrought,' CU Boulder research finds",
            "author": "Frank Witowski",
            "url": "https://www.montrosepress.com/news/human-emissions-driving-colorado-river-megadrought-cu-boulder-research-finds/article_ee8cb53a-2407-413d-976d-315d8cd27c39.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/montrosepress.com/content/tncms/assets/v3/editorial/2/3f/23f96d7f-5209-4891-b740-b3d800809d77/68a49b3f89b26.image.png?crop=1783%2C936%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The current drought in the Colorado River Basin is the worst in at least 1,200 years. The current dry spell is being driven by human activity 'more intensely and more directly than previously understood', according to a new study published last week in the journal Nature."
        },
        {
            "published_date": "2025-08-19T15:38:23",
            "title": "Eyewitness News at 10am - August 19, 2025",
            "author": "",
            "url": "https://abc11.com/videoClip/17586830",
            "url_media": "https://cdn.abcotvs.net/abcotv/assets/news/wtvd/images/logos/default_1280x720.jpg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin threatens dangerous surf for much of the East Coast due to Erin's hurricane force winds and heavy rains. It's expected to make landfall on Friday.      Â   in New Jersey. Â \"Erin\" is a Category 4 hurricane."
        },
        {
            "published_date": "2025-08-19T15:24:56",
            "title": "A recent heatwave in Spain has resulted in over 1,100 deaths",
            "author": "Mehr News Agency",
            "url": "https://en.mehrnews.com/news/235570/A-recent-heatwave-in-Spain-has-resulted-in-over-1-100-deaths",
            "url_media": "https://media.mehrnews.com/d/2025/08/19/4/5644407.jpg?ts=1755617013555",
            "country": "IR",
            "language": "en",
            "summary": "There were 1,149 excess deaths in Spain from August 3-18 that could be attributed to the scorching temperatures. There was a 57 percent increase over the same period last year. Climate experts say global warming is driving longer, more intense, and more frequent heat waves around the world."
        },
        {
            "published_date": "2025-08-19T15:11:11",
            "title": "More than 1,100 deaths linked to Spain's heatwave",
            "author": "",
            "url": "https://www.straitstimes.com/world/europe/more-than-1100-deaths-linked-to-spains-heatwave",
            "url_media": "https://cassette.sphdigital.com.sg/image/straitstimes/b4de5ad83111be092a47916463c36b08459269f89a5a04bf8f2ddc4d429b73fa",
            "country": "SG",
            "language": "en",
            "summary": "1,149 excess deaths in Spain from Aug 3-18 could be attributed to the scorching temperatures. For July, Carlos III institute had attributed 1,060 excess deaths to intense heat, a 57% increase over the same period in 2024. Climate experts say global warming is driving longer, more intense, and more frequent heatwaves around the world."
        },
        {
            "published_date": "2025-08-19T14:45:00",
            "title": "Why climate change mitigation is every Kenyan's obligation",
            "author": "",
            "url": "https://www.businessdailyafrica.com/bd/opinion-analysis/columnists/why-climate-change-mitigation-is-every-kenyan-s-obligation-5160388",
            "url_media": "https://www.businessdailyafrica.com/resource/image/5160400/landscape_ratio3x2/1200/800/9f0094a145bdc808e92bf80c242917f8/kN/tree-planting.jpg",
            "country": "KE",
            "language": "en",
            "summary": "The International Court of Justice (ICJ) issued a landmark Advisory Court Opinion on the binding obligations of State Parties and legal consequences for violating these obligations. For the first time, the opinion laid out the groundbreaking framework to deal with climate change issues. It legally binds the national and county government in ASALs to support climate change mitigation measures."
        },
        {
            "published_date": "2025-08-19T14:45:00",
            "title": "Your letters: Climate change and forest management practices lead to out-of-control wildfires, writer says",
            "author": "Amy Kimmes",
            "url": "https://wausaupilotandreview.com/2025/08/19/your-letters-climate-change-and-forest-management-practices-lead-to-out-of-control-wildfires-writer-says",
            "url_media": "https://wausaupilotandreview.com/wp-content/uploads/2018/03/Letter-to-the-Editor.jpg",
            "country": "US",
            "language": "en",
            "summary": "Wisconsin representatives Tom Tiffany and Glenn Grothman sent a letter to the Canadian government, accusing them of poor forest management practices and out-of-control wildfires. The letter does not mention climate change. In 2019, 174 medical and public health groups declared that climate change is one of the greatest threats to health America has ever faced."
        },
        {
            "published_date": "2025-08-19T14:08:31",
            "title": "Italy Melting Glacier",
            "author": "Easy Wealthy",
            "url": "https://n.news.naver.com/mnews/article/077/0006720349",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/08/19/PAP20250819116801009_P2_20250819140831733.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Italy Melting Glacier is melting near Sondrio, northern Italy. The photo must be used within 14 days from transmission and cannot be shared without a license and without copying and pasting the information within the text.    The photo can only be used to illustrate news reports or comment on facts."
        },
        {
            "published_date": "2025-08-19T13:53:36",
            "title": "Hatteras Island schools will be closed Wednesday and Thursday",
            "author": "Joy Crist",
            "url": "https://islandfreepress.org/outer-banks-news/hatteras-island-schools-will-be-closed-wednesday-and-thursday",
            "url_media": "https://islandfreepress.org/wp-content/uploads/2025/02/Untitled-1-1-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Cape Hatteras Secondary and Cape Hatters Elementary schools will be closed on Wednesday and Thursday due to the expected impacts from Hurricane Erin. Storm assessments will be made on Thursday afternoon to determine schedules for reopening those schools. Dare County announced the closure of County offices on Hatters Island beginning today."
        },
        {
            "published_date": "2025-08-19T13:44:00",
            "title": "British butterfly species facing extinction",
            "author": "Telegraph Reporters",
            "url": "https://www.telegraph.co.uk/news/2025/08/19/british-butterfly-species-facing-extinction",
            "url_media": "https://www.telegraph.co.uk/content/dam/briefs/2025/08/19/TELEMMGLPICT000436124703_17556087213910_trans_NvBQzQNjv4BqFZ2mKB99NyfWHs4BvtAqLh_k7ZsagzP-7JFb_VvIr2o.jpeg?impolicy=OG-Standard",
            "country": "GB",
            "language": "en",
            "summary": "Butterfly numbers have plunged by nearly a fifth in the past 50 years, official figures show. The population of the heath fritillary has fallen by 89% since 1976. The abundance across all species has declined 18% in the UK and 19% in England. Experts blame the destruction of butterfly habitats."
        },
        {
            "published_date": "2025-08-19T13:32:15",
            "title": "Peabody pulls out of $3.8bn Anglo American coal deal",
            "author": "Financial Times",
            "url": "https://article.wn.com/view/2025/08/19/Peabody_pulls_out_of_38bn_Anglo_American_coal_deal",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Withdrawal triggered by ongoing closure of a major mine in Australia deals blow to Anglo's restructuring drive in the UK. Anglo's plans to restructure are complicated by the closure of the mine. Anglo is trying to find a solution to its problems in Australia."
        },
        {
            "published_date": "2025-08-19T13:25:00",
            "title": "Italy's Ventina glacier has melted so much geologists now can only monitor it remotely",
            "author": "Silvia Stellacci",
            "url": "https://www.journalgazette.net/news/world/italys-ventina-glacier-has-melted-so-much-geologists-now-can-only-monitor-it-remotely/article_b8d6c66a-a5ef-5d5c-a88b-caa3b3a2e781.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/journalgazette.net/content/tncms/assets/v3/editorial/f/ca/fcaa085b-860b-55f4-8b97-87bc5de76119/68a47e59e8394.image.jpg?crop=1339%2C703%2C8%2C211&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has melted due to climate change. Geologists can no longer measure it the way they have for the past 130 years. Now they can only monitor it remotely.       in Italy's Ventina glacier."
        },
        {
            "published_date": "2025-08-19T13:04:09",
            "title": "Resident of East Sussex village calls for work to be redone after road surface keeps ‘peeling and melting' in hot weather",
            "author": "Mid Sussex Times",
            "url": "https://www.sussexexpress.co.uk/news/transport/resident-of-east-sussex-village-calls-for-work-to-be-redone-after-road-surface-keeps-peeling-and-melting-in-hot-weather-5278967",
            "url_media": "https://www.sussexexpress.co.uk/webimg/b25lY21zOmVkOWJiYmRiLTIyOTQtNDY2NC1hZGM1LTA2Njk4ZjRlMWM4ODo2MTlkOWE0YS05MWQzLTRkNDEtOWIzMi1kYWY1N2Q5ZWMyYjU=.jpg?width=640&auto=webp&quality=75&crop=3:2,smart&trim=",
            "country": "GB",
            "language": "en",
            "summary": "Alan Harwood, 58, of Chandler's Mead, is frustrated with the 'peeling and melting' surface of their road. It started after the road was resurfaced during the June heatwave. Alan called East Sussex Highways several times about the resurfacing but was told they were satisfied with it. Hamsey councillor told Alan that East Sussex County Council would steam clean his driveway, but Alan doesn't think it's a good idea as the road is still melting."
        },
        {
            "published_date": "2025-08-19T12:59:00",
            "title": "Israel, Australia trade blows over visa row",
            "author": "Hürriyet Daily News",
            "url": "https://article.wn.com/view/2025/08/19/Israel_Australia_trade_blows_over_visa_row",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Tensions between Israel and Australia escalated further on Aug. 31st. Israel and Australian relations deteriorated further on August 31st, according to Israel's ambassador to Australia, Michael O'Neill.    i.a.p.s. Israel-Australia relations have been tense for some time."
        },
        {
            "published_date": "2025-08-19T12:44:14",
            "title": "Australia chides Israel after diplomats",
            "author": "Hong Kong Standard",
            "url": "https://article.wn.com/view/2025/08/19/Australia_chides_Israel_after_diplomats",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Australia is a country of people living in the Middle East. It is mainly populated by people from Australia. It has a population of about 1.5 billion people. It's a nation of people. Its main territory is called Australia. Its population is mainly consists of people from that country. "
        },
        {
            "published_date": "2025-08-19T12:40:31",
            "title": "November 2020 is worlds hottest November everEU Climate Service",
            "author": "Premium Times",
            "url": "https://www.latestnigeriannews.com/p/21737/mok-foundation-reaches-84-schools-in-3-months-ed.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "Carlo Buontempo, the Director of the EU Climate Service, said the records are consistent with the long-term warming trend of the global climate. The post November 2020 is the world's hottest November ever, according to the EU climate service. "
        },
        {
            "published_date": "2025-08-19T12:33:45",
            "title": "The world's longest marine heat wave upended ocean life across the Pacific",
            "author": "Joseph Prosper",
            "url": "https://www.ippmedia.com/the-guardian/features/read/the-worlds-longest-marine-heat-wave-upended-ocean-life-across-the-pacific-2025-08-19-152735",
            "url_media": "https://www.ippmedia.com/images/favicon_ippmedia.png",
            "country": "TZ",
            "language": "en",
            "summary": "It's been a decade since the longest ocean warming event ever recorded. This unprecedented heat wave stretched thousands of kilometres over North America's western coastal waters. It affected everything from the smallest plankton to the largest marine mammals. It also affected coastal habitats, including kelp forests and seagrass beds. The review highlights how we are unprepared to respond to these challenges."
        },
        {
            "published_date": "2025-08-19T12:30:00",
            "title": "Why the Evidence for Climate Change Is Impossible to Ignore",
            "author": "Barrie Davenport",
            "url": "https://www.msn.com/en-us/weather/topstories/why-the-evidence-for-climate-change-is-impossible-to-ignore/ss-AA1KNSQF",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "2024 was declared the hottest year on record, capping off a decade of broken climate records. Every thermometer, satellite, ice core, and ocean buoy on Earth is telling the same story: our planet is changing at an unprecedented pace. The evidence isn't subtle anymore, it's screaming at us from every corner of the globe."
        },
        {
            "published_date": "2025-08-19T12:09:00",
            "title": "Hurricane Erin getting weaker and bigger",
            "author": "Mike Modrick",
            "url": "https://www.mysuncoast.com:443/2025/08/19/hurricane-erin-getting-weaker-bigger",
            "url_media": "https://gray-wwsb-prod.gtv-cdn.com/resizer/v2/S5LPZW4EDFAONLIJ2MFBNSFPDM.jpg?auth=531192401cec3b77550bc075db48a10e99e0488d99263d1839ee3f7171544109&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin is gaining size and losing strength over the western Atlantic. The Category 2 hurricane was located about 665 miles southwest of Bermuda and 720 miles south-southeast of Cape Hatteras, North Carolina this morning. Erin is expected to turn northward on Wednesday before shifting northeast by Thursday and stay offshore."
        },
        {
            "published_date": "2025-08-19T12:00:00",
            "title": "Editorial cartoon for Tuesday, Aug. 19, 2025",
            "author": "",
            "url": "https://www.duluthnewstribune.com/opinion/cartoons/editorial-cartoon-for-tuesday-aug-19-2025",
            "url_media": "https://cdn.forumcomm.com/dims4/default/13a602d/2147483647/strip/true/crop/1200x800+0+0/resize/1599x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Ffb%2F26%2Fcd2f9a3642deb98135aab7c6121c%2F081925-op-dnt-dailytoon-jpg.jpg",
            "country": "US",
            "language": "en",
            "summary": "The data that is used regularly for forecasting will no longer be available during the peak hurricane season from mid-August to mid-September. The website's customer support team can be contacted at 1-833-248-7801 if you feel the message is in error."
        },
        {
            "published_date": "2025-08-19T11:49:54",
            "title": "UK on track to have one of its warmest summers on record",
            "author": "Daniel Clark Content Editor",
            "url": "https://www.somersetlive.co.uk/news/somerset-news/uk-track-one-warmest-summers-10436469",
            "url_media": "https://i2-prod.devonlive.com/incoming/article10436488.ece/ALTERNATES/s1200/0_Summer-weather-July-11th-2025.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The mean temperature in the UK from 1 June to 17 August currently sits at 16.2°C, which is 1.6°C above the long-term meteorological average. June and July were both well above average and even outside of heatwaves, temperatures have remained on the warmer side. Four heatwaves have taken place so far this summer but none of them pushed the UK's highest temperature of the year to particularly elevated levels."
        },
        {
            "published_date": "2025-08-19T11:36:04",
            "title": "Butterflies in long term decline across England and UK, official figures show",
            "author": "Emily Beament",
            "url": "https://uk.news.yahoo.com/butterflies-long-term-decline-across-113604440.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/sWzikPvuov.KdneMsI39Zg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/pa_viral_news_uk_120/ad62c1d95f2852708b4a0a388240cdcd",
            "country": "US",
            "language": "en",
            "summary": "Butterfly numbers have declined 18% in the UK and 19% in England since the 1970s. Species that need specific habitats such as flower-rich grassland, heathland and woodland clearings have seen declines of more than a third. Heath fritillary has seen the most severe declines since 1976 with an 89% drop in abundance."
        },
        {
            "published_date": "2025-08-19T11:31:00",
            "title": "Clearing debris after a storm is big business. For some communities, it's also a burden.",
            "author": "Grist",
            "url": "https://article.wn.com/view/2025/08/19/Clearing_debris_after_a_storm_is_big_business_For_some_commu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Margie Huggins has spent her retirement tending her parents' farm in Transylvania County, in the heart of the Blue Ridge Mountains of North Carolina. She's intensified her work since Hurricane Helene tore through the region almost. There was 12 feet of water in some of the pastures."
        },
        {
            "published_date": "2025-08-19T11:07:05",
            "title": "Pakistan among most climate-hit countries: Senate chairman",
            "author": "Dawn",
            "url": "https://article.wn.com/view/2025/08/19/Pakistan_among_most_climatehit_countries_Senate_chairman",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Pakistan contributes less than one percent to global emissions. Pakistan is among the most climate-affected countries, facing floods. Chairman Senate Syed Yusuf Raza Gilani has said that climate change is an urgent reality. Pakistan and Ethiopia are having a Green Dialogue."
        },
        {
            "published_date": "2025-08-19T11:00:42",
            "title": "The strange divide in how Americans experience summer temperatures",
            "author": "Chris Mooney",
            "url": "https://www.newsbreak.com/cnn-510076/4183067423853-the-strange-divide-in-how-americans-experience-summer-temperatures",
            "url_media": "https://img.particlenews.com/img/id/2GT117_13uxfd3j00",
            "country": "PH",
            "language": "en",
            "summary": "Average temperatures elide a complex reality: The country's experience of hotter summers is fractured along geographic lines. Chris Mooney is a verified publisher with 3.0 million followers on Twitter. He has written a book about climate change and its effects on the United States."
        },
        {
            "published_date": "2025-08-19T11:00:00",
            "title": "Public Invited to Sept. 10 Discussion About Hurricane Katrina's Effect 20 Years Later on Houston and Nation",
            "author": "",
            "url": "https://www.motherjones.com/press-releases/discussion-hurricane-katrina-20-years-later",
            "url_media": "https://www.motherjones.com/wp-content/uploads/2022/11/mj-tagline_2000x1124.jpg?w=1200&h=630&crop=1",
            "country": "US",
            "language": "en",
            "summary": "The public is invited to a discussion on Wednesday, Sept. 10 at 7 p.m. CT about Hurricane Katrina's effect on Houston and the nation 20 years later. Speakers include former CNN anchor Soledad O'Brien, former Houston Mayor Bill White, and Hip Hop Caucus CEO the Reverend Lennox Yearwood Jr. The suggested donation is $5 per person, but no one will be turned away if they're unable to pay."
        },
        {
            "published_date": "2025-08-19T10:58:00",
            "title": "African Heat Waves Intensify Over 40 Years, UIC Finds",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/african-heat-waves-intensify-over-40-years-uic-1517519",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1517048676732-d65bc937f952%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Heat waves in Africa are hotter, longer and more frequent today than 40 years ago, mainly due to increased greenhouse gas and black carbon emissions from burning fossil fuels. In April 2024, temperatures in the West African city of Kayes exceeded 119 degrees Fahrenheit. Heat waves harm ecosystems, reduce agricultural productivity and strain energy systems. Infants, older adults and those with health conditions are especially susceptible to heat-related illness."
        },
        {
            "published_date": "2025-08-19T10:39:17",
            "title": "ABC ‘pumps out' climate change scares aimed at children",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/andrew-bolt/abc-pumps-out-climate-change-scares-aimed-at-children/video/7ba24c8f566763b5d14bb5300ad5fd3e",
            "url_media": "https://content.api.news/v3/images/bin/5999bfe561f631a29186f9c1ade99933",
            "country": "AU",
            "language": "en",
            "summary": "Sky News host Andrew Bolt slams the ABC for 'pumping out' climate change scares aimed at children. 'Doom, doom, doom and spreading terror,' Mr Bolt said.    .   i   in the video that follows is a transcript of the video."
        },
        {
            "published_date": "2025-08-19T10:38:38",
            "title": "‘Brainwashing them': Documentary pushes climate propaganda in schools",
            "author": "",
            "url": "https://www.skynews.com.au/opinion/andrew-bolt/brainwashing-them-documentary-pushes-climate-propaganda-in-schools/video/8671e84033b760aee3ab67867c60e181",
            "url_media": "https://content.api.news/v3/images/bin/82ee5e852fc7c6613c2e1c2f00346268",
            "country": "AU",
            "language": "en",
            "summary": "Cool.org.org claims it has got teachers to use its green propaganda to teach 2.5 million school children every year. Mr Bolt claims Cool.org is brainwashing children to be hostile to coal and gas and convinced the world is doomed unless we get rid of them."
        },
        {
            "published_date": "2025-08-19T10:38:12",
            "title": "One of Italy's largest glaciers now too unstable for scientists to visit",
            "author": "Silvia Stellacci",
            "url": "https://www.independent.co.uk/news/world/europe/ventina-glacier-melt-lombardy-italy-b2810228.html",
            "url_media": "https://static.independent.co.uk/2025/08/19/06/Italy_Melting_Glacier_20171.jpg?width=1200&height=800&crop=1200:800",
            "country": "GB",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has receded significantly due to climate change. Geologists can no longer measure it using methods employed for the past 130 years. The glacier has already lost 1.7 km in length since the first measuring benchmarks were established in 1895. The melting has accelerated in recent years, with the glacier losing 431 metres in the last decade alone."
        },
        {
            "published_date": "2025-08-19T10:37:00",
            "title": "Depression hits India's south Odisha coast, maritime ports asked to maintain caution",
            "author": "Staff Correspondent",
            "url": "https://bdnews24.com/bangladesh/f7942a3a6d68",
            "url_media": "https://cdn.bdnews24.com/bdnews24/media/english/imgAll/2025August/PLATE/rain-mirpur-road-sobhanbagh-190825-03-1755578255.jpg",
            "country": "BD",
            "language": "en",
            "summary": "The weather system is lying over coastal Odisha and its adjoining area. It is likely to move further northwest as it weakens gradually. The north bay, Bangladesh's adjoining coastal areas and maritime posts may see gusty or squally weather. The maritime ports of Chattogram, Cox's Bazar, Mongla, and Payra have been instructed to keep local cautionary signal No. 3 hoisted. All fishing boats and trawlers in the north bay have been advised to stay close to the coast and proceed with caution."
        },
        {
            "published_date": "2025-08-19T10:33:01",
            "title": "Death Toll From Northern Pakistan Monsoon Floods Rises to Almost 400",
            "author": "Bias Comparison",
            "url": "https://ground.news/article/the-monsoon-rain-in-pakistan-is-about-400-dead",
            "url_media": "data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 width=%22280%22 height=%22280%22 viewBox=%220 0 280 280%22><path transform=%22translate(97.3,0)%22 d=%22M44,140.1h42.8V272H54.9c0-0.1,0-103.8,0-103.8H44V140.1z M44,1c28.4,0,42.6,16.2,42.6,42.2v66.1H54.9V43.8 c0-7.2-3.1-11.7-10.6-11.7c-7,0-10.6,4.2-10.6,11.7c0,0,0,228.1,0,228.2H0.2c0-0.5,0-228.8,0-228.8C0.1,16.8,14.8,1,44,1L44,1z%22/><style>path { fill: %23262626 } @media (prefers-color-scheme: dark) { path { fill: %23EEEFE9 } }</style></svg>",
            "country": "US",
            "language": "en",
            "summary": "Monsoon floods swept through northern Pakistan in August 2025, killing almost 400 people and submerging numerous villages including Dalori in Khyber Pakhtunkhwa. Over 700 people have been killed since late June and the monsoon is expected to last until mid-September."
        },
        {
            "published_date": "2025-08-19T10:25:35",
            "title": "AccuWeather: Unseasonably cool and cloudy today in the Philadelphia region",
            "author": "",
            "url": "https://6abc.com/videoClip/17584679",
            "url_media": "https://cdn.abcotvs.com/dip/images/17584678_081925-wpvi-accuweather-forecast-530a-video-vid.jpg?w=1600",
            "country": "US",
            "language": "en",
            "summary": "Temperatures will remain below average this week. There is a high risk of rip currents and seas becoming rougher over the next two days, with a risk of rough seas and high temperatures in the next few days. The weather is expected to stay below average."
        },
        {
            "published_date": "2025-08-19T10:21:40",
            "title": "Erin NC Impacts, MLB Team Hopes, Helene Rebuilds",
            "author": "Steve Anthony",
            "url": "https://wbt.com/1460322/erin-nc-impacts-mlb-team-hopes-helene-rebuilds",
            "url_media": "https://wbt.com/wp-content/uploads/sites/84/2024/09/17267529852336.jpg?quality=80&strip=all&w=700&crop=0,0,100,400px",
            "country": "US",
            "language": "en",
            "summary": "Both sides have agreed to pause a lawsuit challenging the state's ban on gender transition surgeries for minors. More than 1,000 applications have been submitted for rebuilding homes destroyed by Hurricane Helene. A study suggests Raleigh and Charlotte are strong contenders for a future Major League Baseball team."
        },
        {
            "published_date": "2025-08-19T10:12:41",
            "title": "Met Office: Summer 2025 on track to be one of UK's hottest on record",
            "author": "",
            "url": "https://www.businessgreen.com/news/4517851/met-office-summer-2025-track-uks-hottest-record",
            "url_media": "https://image.chitra.live/api/v1/wps/105b8a3/54ba5ca0-1d83-4099-bd8f-d9577512240e/4/iStock-1409856533-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "The summer of 2025 is set to be one of the UK's warmest on record. It could yet become the hottest overall, according to the Met Office's latest temperature forecast. It is still a few weeks to go before the end of the summer. It's forecast to be the warmest overall."
        },
        {
            "published_date": "2025-08-19T10:11:12",
            "title": "What Indigenous Communities Have Known About Climate for Generations",
            "author": "Ishwi Singh",
            "url": "https://newsable.asianetnews.com/webstories/international/climate-change/what-indigenous-communities-have-known-about-climate-for-generations-3m02cgu",
            "url_media": "https://static.asianetnews.com/images/w-720,h-1280,format-png,imgid-01k30qenmr6nsfzmgvf063dws7,imgname-forest-fire-2-1755592480408.png",
            "country": "IN",
            "language": "en",
            "summary": "Cultural burning is a traditional Indigenous practice where controlled, low-intensity fires are used to safely manage landscapes like forests and grasslands. In 2022, California reversed its ban on cultural burning, supporting Indigenous Tribes to reclaim and lead this practice.   "
        },
        {
            "published_date": "2025-08-19T10:01:00",
            "title": "Unprecedented Arctic heatwave melted 1 per cent of Svalbard's ice",
            "author": "New Scientist",
            "url": "https://article.wn.com/view/2025/08/19/Unprecedented_Arctic_heatwave_melted_1_per_cent_of_Svalbards",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A six-week period of extraordinary heat in 2024 melted 62 gigatonnes of ice on the Arctic archipelago of Svalbard, obliterating all previous record-breaking ice melt records. The heat was intense enough to melt all previous ice records in the Arctic."
        },
        {
            "published_date": "2025-08-19T10:01:00",
            "title": "Coastal Communities Restore Marshes, Dunes And Reefs",
            "author": "Class",
            "url": "https://www.civilbeat.org/2025/08/coastal-communities-restore-marshes-dunes-and-reefs-amid-climate-threats",
            "url_media": "https://d1l18ops95qbzp.cloudfront.net/wp-content/2025/08/17151353/AP25228784761777-scaled.jpg",
            "country": "US",
            "language": "en",
            "summary": "Coastal communities in Hawai'i and other states are ramping up efforts to restore and protect their shorelines as climate change causes more destructive storms. Louisiana has lost more than 2,000 square miles of coastline over the past century. Most of the almost $18 billion spent in the past 20 years was to shore up levees, flood walls and other structures."
        },
        {
            "published_date": "2025-08-19T10:00:29",
            "title": "Wrong about climate change",
            "author": "Dan Reidel",
            "url": "https://www.chicoer.com/2025/08/19/wrong-about-climate-change-your-opinions",
            "url_media": "https://www.chicoer.com/wp-content/uploads/2018/05/chico-site-icon-1.png",
            "country": "US",
            "language": "en",
            "summary": "Jack Mcwherter, from California, is sceptical about the current climate change predictions. He would like to keep the balmy summer weather, so he might buy a coal burning stove and cut down all the trees to keep up with the climate change. "
        },
        {
            "published_date": "2025-08-19T09:53:29",
            "title": "UK set to be hit by rain and wind as Hurricane Erin moves across Atlantic",
            "author": "Jordan Reynolds",
            "url": "https://www.standard.co.uk/news/environment/bahamas-atlantic-scotland-england-b1243553.html",
            "url_media": "https://static.standard.co.uk/2025/08/19/10/3a248e4647ede6377bcadad2eb26f320Y29udGVudHNlYXJjaGFwaSwxNzU1NjgxMzQ1-2.78973704.jpg?width=1200&auto=webp&quality=75",
            "country": "GB",
            "language": "en",
            "summary": "The meteorological summer could be among the warmest in UK records dating back to 1884. There's still two weeks to go until the end of the season, but the season's overall warmth and consistently above-average temperatures mean it could rank among the UK's warmest."
        },
        {
            "published_date": "2025-08-19T09:30:00",
            "title": "Fire service has attended seven bin fires this month",
            "author": "",
            "url": "https://guernseypress.com/news/2025/08/19/fire-service-has-attended-seven-bin-fires-this-month",
            "url_media": "https://assets.guernseypress.com/ff987483-748b-461f-a0b6-0a2aa062ec77?width=1200&height=630",
            "country": "US",
            "language": "en",
            "summary": "A public bin at Grandes Rocques was set alight on Sunday evening by a disposable barbecue. Firefighters have also attended four tree and undergrowth fires. The fire service asks people to be more careful with disposable barbecues. Barbecues are allowed on north and west coast beaches between 5 pm and midnight."
        },
        {
            "published_date": "2025-08-19T09:20:11",
            "title": "Stroud residents asked to check on vulnerable in heat",
            "author": "Chloe Turner",
            "url": "https://www.stroudnewsandjournal.co.uk/news/25400095.stroud-district-council-leader-chloe-turners-weekly-column",
            "url_media": "https://www.stroudnewsandjournal.co.uk/resources/images/19848829.jpg?type=og-image",
            "country": "GB",
            "language": "en",
            "summary": "This prolonged heatwave is dangerous for the elderly and very young, outdoor workers and those with health conditions. Thames Water has a hosepipe ban in place for all its customers in GL postcodes. Severn Trent is using its Drought Action Plan and has urged customers to be mindful of their usage. Stroud Council is consulting on its new Climate & Nature Strategy, which has adaptation as a key theme."
        },
        {
            "published_date": "2025-08-19T09:09:59",
            "title": "Mongolia issues bear warning after multiple reported sightings",
            "author": "Xinhua",
            "url": "https://article.wn.com/view/2025/08/19/Mongolia_issues_bear_warning_after_multiple_reported_sightin",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Mongolia's Ministry of Environment and Climate Change issued a brown bear warning on Tuesday. The warning came after multiple brown bear sightings were reported near Mongolia's capital, Ulaan Bator, and the warning came amid fear of potential harm to humans. "
        },
        {
            "published_date": "2025-08-19T09:02:00",
            "title": "Hurricane Erin 5 AM Update Tuesday",
            "author": "Mike Modrick",
            "url": "https://www.mysuncoast.com:443/2025/08/19/hurricane-erin-5-am-update-tuesday",
            "url_media": "https://gray-wwsb-prod.gtv-cdn.com/resizer/v2/JCP6OUY4WJBQHESD3O3K6EHBR4.jpg?auth=10aa29462d9dd7241ca92da2e54ca626464791c4ff111b14721f3cf0b0e2fa4f&width=1200&height=600&smart=true",
            "country": "US",
            "language": "en",
            "summary": "Erin is a Category 3 hurricane with hurricane-force winds. Erin is moving northwest at about seven miles per hour and is expected to turn northward on Wednesday before shifting northeast by Thursday. Erin will stay offshore as it tracks between the U.S. mainland and Bermuda."
        },
        {
            "published_date": "2025-08-19T09:01:40",
            "title": "Comet Impact 12,800 Years Ago: New Evidence Emerges",
            "author": "Sophie Lin",
            "url": "https://www.archyde.com/comet-impact-12800-years-ago-new-evidence-emerges",
            "url_media": "https://gizmodo.com/app/uploads/2025/08/Halleys-Comet-1200x675.jpg",
            "country": "US",
            "language": "en",
            "summary": "There was a 1,200-year-long deep freeze during the Younger Dryas period 12,800 years ago. The prevailing theory is that a massive influx of freshwater from melting North American ice sheets disrupted the Atlantic Meridional Overturning Circulation (AMOC), a crucial ocean current system responsible for distributing heat around the globe. New evidence suggests a comet impact could have caused this event. The research highlights the potential for abrupt climate shifts driven by extraterrestrial events."
        },
        {
            "published_date": "2025-08-19T09:00:42",
            "title": "At Europe's melting glaciers, signs of climate peril are everywhere",
            "author": "Molly Hunter",
            "url": "https://www.msn.com/en-us/weather/topstories/at-europe-s-melting-glaciers-signs-of-climate-peril-are-everywhere/ar-AA1KMVu6",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Europe's glaciers are shrinking faster than anywhere else on Earth due to climate change. Last year was the hottest on record, according to NASA. Austria's temperature has risen 3.1 degrees Celsius since 1900, more than twice the global average. The retreat of glaciers has left behind unstable landscapes that are rapidly shifting, causing landslides."
        },
        {
            "published_date": "2025-08-19T09:00:00",
            "title": "At Europe's melting glaciers, signs of climate peril are everywhere",
            "author": "Molly Hunter",
            "url": "https://www.nbcnews.com/science/climate-change/europes-melting-glaciers-signs-climate-peril-are-everywhere-rcna223824",
            "url_media": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-08/Morteratsch-glacier-3---Sara-Monetta-d24d7f.jpg",
            "country": "US",
            "language": "en",
            "summary": "Andrea Fischer, vice-director of the Austrian Academy of Sciences' Institute for Interdisciplinary Mountain Research, says one-third of Austria's glaciers will vanish in the next five years. Last year was the hottest on record, according to NASA. Europe is the fastest-warming continent on Earth and Austria's temperature has risen 3.1 degrees Celsius since 1900."
        },
        {
            "published_date": "2025-08-19T09:00:00",
            "title": "Letter to the editor: Proving research is not easy",
            "author": "Pittsburgh News",
            "url": "https://triblive.com/opinion/letter-to-the-editor-proving-research-is-not-easy",
            "url_media": "https://triblive.com/wp-content/themes/TribLIVE2/assets/visuals/images/icons/head/favicon.ico",
            "country": "US",
            "language": "en",
            "summary": "Bob Stein is an old chemistry graduate. He thinks that manmade waves have increased thousands of times in the last 70 years. The sun comes to Earth in the form of rays, a wave-type structure. Bob Stein needs to study more options about the sun's intensity."
        },
        {
            "published_date": "2025-08-19T09:00:00",
            "title": "'Locals are fed up': councillor demands state action on Lake seawall",
            "author": "Josh Leeson",
            "url": "https://www.maitlandmercury.com.au/story/9044662/lake-councillor-matt-schultz-demands-action-on-swansea-seawall",
            "url_media": "https://www.maitlandmercury.com.au/images/transform/v1/crop/frm/E9srhG6YCw3ZDt9UDADP4R/ffd9f753-6959-49f4-8dd9-9a60e421f9f8.jpg/r0_272_3748_2240_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Swansea residents are tired of the NSW government's inaction in repairing their damaged seawall. Lake Macquarie East Ward Liberal councillor Matt Schultz is concerned about the situation.    i.e. the repair of the seawall is a priority for the government. "
        },
        {
            "published_date": "2025-08-19T08:55:39",
            "title": "The Science That Shreds the 'Fossil Fuels Don't Cause Heat Waves' Myth",
            "author": "William Harrison",
            "url": "https://www.msn.com/en-us/weather/topstories/the-science-that-shreds-the-fossil-fuels-don-t-cause-heat-waves-myth/ar-AA1KNzUz",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Last year was the warmest since records began in 1850, with the global average surface temperature 1.46°C above pre-industrial levels. All ten of the hottest years ever recorded have happened since 2015. IPCC declares that extreme heatwaves have increased since the 1950s and human-induced climate change is the main driver. Renewable energy is set to become the biggest source of global electricity generation before early 2025."
        },
        {
            "published_date": "2025-08-19T08:46:41",
            "title": "Krishna and Godavari Rivers Swell Amid Torrential Downpours",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/science-environment/3545936-krishna-and-godavari-rivers-swell-amid-torrential-downpours",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/22_05_2025_06_29_06_3664565.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "Heavy rains have led to increased floodwater inflows in major rivers, including Krishna and Godavari, in Andhra Pradesh. Flood warnings have been issued at Prakasam Barrage in Vijayawada, with inflows documented at around 4 lakh cusecs. The depression over the Bay of Bengal is causing continuous heavy rainfalls in the region."
        },
        {
            "published_date": "2025-08-19T08:36:35",
            "title": "Dozens of neighbourhoods in Buckinghamshire at risk of dangerous heatwaves",
            "author": "Sonja Tutty",
            "url": "https://www.bucksherald.co.uk/news/environment/dozens-of-neighbourhoods-in-buckinghamshire-at-risk-of-dangerous-heatwaves-5277941",
            "url_media": "https://www.bucksherald.co.uk/webimg/b25lY21zOjg1YjNhYTcxLTA3NWQtNDY5MS1iYzdlLWY5MGNkNmRmMzAyZjplYjQzMGVmNC0wNDFiLTQyNTQtODJlOC03Y2Q5MjRhYTMzMmY=.jpg?width=640&auto=webp&quality=75&crop=3:2,smart&trim=",
            "country": "GB",
            "language": "en",
            "summary": "Friends of the Earth analysed 2022 heatwave data and data on the number of older people, young children, people with health issues and hospital patients to reveal which areas are at risk from future heatwaves. 55 of the 67 neighbourhoods in Buckinghamshire are considered \"high heat\" areas. 3 neighbourhoods had an enhanced risk of health impacts from heatwaves due to a lack of green space, an older population, and low income."
        },
        {
            "published_date": "2025-08-19T08:10:09",
            "title": "Geologists turn to remote tools as Italy's Ventina glacier melts fast",
            "author": "",
            "url": "https://www.euronews.com/green/2025/08/19/italys-ventina-glacier-has-melted-so-much-geologists-now-can-only-monitor-it-remotely",
            "url_media": "https://static.euronews.com/articles/stories/09/42/58/01/1200x675_cmsv2_39828592-3eef-5450-aea7-d08db98bfdd3-9425801.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has lost 1.7 km in length since the first measuring benchmarks were positioned at the front of the glacier in 1895. The glacier has lost 431 metres in the last 10 years. Global warming is melting Europe's glaciers."
        },
        {
            "published_date": "2025-08-19T07:22:00",
            "title": "North Pacific Subsurface Waters Acidifying Faster",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/north-pacific-subsurface-waters-acidifying-1517029",
            "url_media": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1615309661755-816dcd80bcd3%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D750%26amp%3Bq%3D80",
            "country": "US",
            "language": "en",
            "summary": "Carbon dioxide in the atmosphere has been increasing the acidity of Pacific waters since the beginning of the industrial revolution over 200 years ago. Oceanographers from the University of Hawai'i at Mānoa found that the ocean is acidifying even more rapidly below the surface in the open waters of the North Pacific near Hawai’i."
        },
        {
            "published_date": "2025-08-19T07:21:28",
            "title": "Delhi Braces as Yamuna River Nears Danger Levels",
            "author": "Devdiscourse News Desk",
            "url": "https://www.devdiscourse.com/article/law-order/3545834-delhi-braces-as-yamuna-river-nears-danger-levels",
            "url_media": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/10_04_2025_09_35_42_4044917.png?width=920&format=jpeg",
            "country": "IN",
            "language": "en",
            "summary": "The Yamuna River reached a critical level of 205.79 meters near Delhi's Old Railway Bridge on Tuesday. However, this rise in water level won't lead to severe flooding. Inundation is expected to be confined to the floodplains. Emergency provisions, including food, medical aid, and solar-powered lighting have been arranged to ensure safety during the night."
        },
        {
            "published_date": "2025-08-19T06:56:04",
            "title": "Wildfires rage across Spain and Portugal as record area of land burned",
            "author": "",
            "url": "https://saudi.shafaqna.com/EN/AL/1792978",
            "url_media": "https://saudi.shafaqna.com/images/newhub-blank-news.png",
            "country": "AU",
            "language": "en",
            "summary": "Wildfires rage across Spain and Portugal as record area of land burned. Heatwave and drought spur the flames. Evacuations are being forced as a result of the blazes.      Â   y   in Spain and in Portugal."
        },
        {
            "published_date": "2025-08-19T06:54:44",
            "title": "Government report blasted for ‘twisting science' as it questions link between CO₂ and warming",
            "author": "Krishna Pathak",
            "url": "https://www.msn.com/en-us/weather/topstories/government-report-blasted-for-twisting-science-as-it-questions-link-between-co-and-warming/ar-AA1KMA1A",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Department of Energy released a report that questions the link between human activity and global warming. The authors of the report want to build a network of scientists who share their views. They want to reframe the discussion to emphasize doubts about how dangerous global warming might be. Some scientists argue that the new push against mainstream climate science is about creating political cover."
        },
        {
            "published_date": "2025-08-19T06:52:49",
            "title": "Ventina glacier in Italy has melted so much that geologists can only 'monitor' it remotely, now",
            "author": "Associated Press",
            "url": "https://www.newindianexpress.com/world/2025/Aug/19/ventina-glacier-in-italy-has-melted-so-much-that-geologists-can-only-monitor-it-remotely-now",
            "url_media": "https://media.newindianexpress.com/newindianexpress%2F2025-08-19%2Fvfr0suy7%2Fperumal-murugan-fire-bird-23.jpg?rect=0%2C339%2C3264%2C1714&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "IN",
            "language": "en",
            "summary": "Ventina glacier in northern Italy has melted due to climate change and geologists can no longer measure it the way they have for the past 130 years. The stakes used as benchmarks to measure the glacier's retraction are buried under rockslides and debris. The Lombardy Glaciological Service will use drone imagery and remote sensing to keep track of the ongoing shrinkage of the glacier."
        },
        {
            "published_date": "2025-08-19T06:30:00",
            "title": "Libya Climate Change, Food Security, and Migration Report: IOM",
            "author": "Sami Zaptia",
            "url": "https://libyaherald.com/2025/08/libya-climate-change-food-security-and-migration-report-iom",
            "url_media": "https://libyaherald.com/wp-content/uploads/2016/08/281-11000-migrants-repatriated-from-Libya-3165-Med-deaths-IOM-270816.png",
            "country": "GB",
            "language": "en",
            "summary": "The International Organization for Migration (IOM) released its Libya – Climate Change, Food Security, and Migration Report (June 2025) yesterday. The report highlights the growing challenges at the intersection of climate change, food insecurity, and migration in Libya. Climate-induced environmental degradation, including rising temperatures, desertification, and declining agricultural productivity has emerged as a significant driver of food insecurity."
        },
        {
            "published_date": "2025-08-19T06:28:41",
            "title": "Karnataka Rain: Rivers Overflow, 4.85 Lakh Hectares of Crops Damaged, Monuments Submerged",
            "author": "Asianet Newsable English",
            "url": "https://newsable.asianetnews.com/karnataka-news/karnataka-rain-rivers-overflow-crop-damage-monuments-submerged-articleshow-n84rk9g",
            "url_media": "https://static.asianetnews.com/images/w-1280,h-720,format-jpg,imgid-01k2y7f4awtqrm4p3vksydk265,imgname-fotojet---2025-08-18t144404.022-1755508609372.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Heavy rains lash Karnataka, causing rivers to overflow and submerge historic sites in Hampi, Sringeri, and Srirangapatna. Over 4.85 lakh hectares of crops damaged, 150 houses collapsed, and schools shut across districts. The Meteorological Department forecast widespread heavy rain on August 19 and 20 across Karnataka. The last week of August is likely to see a decline in rainfall with sunny intervals."
        },
        {
            "published_date": "2025-08-19T06:22:11",
            "title": "Is Our Space Weather Changing Due to Rising CO₂? Scientists Say Yes",
            "author": "Ishwi Singh",
            "url": "https://newsable.asianetnews.com/international/climate-change/climate-changes-hidden-impact-on-space-storms-and-satellite-orbits-articleshow-omgg092",
            "url_media": "https://static.asianetnews.com/images/w-1280,h-720,format-jpg,imgid-01k30e2jmekbfn492erdyja8wh,imgname-space-2-1755582646926.png",
            "country": "IN",
            "language": "en",
            "summary": "In the future, the atmosphere will be 20 to 50% less dense at the peak of geomagnetic storms due to rising CO₂ levels. This could affect satellites, GPS, radio signals, and even power grids. More dramatic changes in atmospheric density during storms could increase the risk of satellite collisions."
        },
        {
            "published_date": "2025-08-19T06:06:00",
            "title": "Fire crews were kept busy in the Top End with a number of ‘suspicious' outbreaks",
            "author": "Camden Smith",
            "url": "https://www.geelongadvertiser.com.au/news/northern-territory/fire-ban-declared-for-darwin-palmerston-coomalie-and-litchfield-due-to-high-fire-danger/news-story/7ef8da5816928f014b7d3073eb8358bd",
            "url_media": "https://content.api.news/v3/images/bin/000a683ac345778ff775a99432c917ba",
            "country": "AU",
            "language": "en",
            "summary": "There is a 24-hour fire ban in place for Darwin, Palmerston, Coomalie and Litchfield due to high fire danger. Forecasters predict a minimum 22 degrees overnight on Saturday followed by a maximum 34 degrees during the day on Sunday. "
        },
        {
            "published_date": "2025-08-19T06:06:00",
            "title": "Fire crews were kept busy in the Top End with a number of ‘suspicious' outbreaks on Tuesday",
            "author": "Camden Smith",
            "url": "https://www.cairnspost.com.au/news/northern-territory/fire-ban-declared-for-darwin-palmerston-coomalie-and-litchfield-due-to-high-fire-danger/news-story/7ef8da5816928f014b7d3073eb8358bd",
            "url_media": "https://content.api.news/v3/images/bin/000a683ac345778ff775a99432c917ba",
            "country": "AU",
            "language": "en",
            "summary": "A 24-hour fire ban was declared for Darwin, Palmerston, Coomalie and Litchfield from 12am Tuesday, August 19, to 12am August 20. There were a number of grass fires in the Top End on Tuesday. South-easterly winds of up to 30 km/h were reported. Forecasters predict a minimum 22 degrees overnight on Saturday and a maximum 34 C during the day."
        },
        {
            "published_date": "2025-08-19T05:50:19",
            "title": "Italian glacier shrinking too fast to study",
            "author": "",
            "url": "https://www.perthnow.com.au/news/environment/italian-glacier-shrinking-too-fast-to-study-c-19733502",
            "url_media": "https://images.perthnow.com.au/publication/C-19733502/7b8a397a2858bfc2bf9545e95c35cac68ff02130-16x9-x0y0w1280h720.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has lost 1.7km in length since the first measuring benchmarks were positioned at the front of the glacier in 1895. The glacier has lost 431 metres in the past 10 years, nearly half of that since 2021. Global warming is melting Europe's glaciers."
        },
        {
            "published_date": "2025-08-19T05:50:00",
            "title": "‘A climate of unparalleled malevolence': are we on our way to the sixth major mass extinction?",
            "author": "The Guardian",
            "url": "https://article.wn.com/view/2025/08/19/A_climate_of_unparalleled_malevolence_are_we_on_our_way_to_t",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Churning carbon dioxide into the atmosphere at the rate we are going could lead the planet to another Great Dying, according to the scientists.    .   \"There will be a Great Dying\" if we don't change our current carbon dioxide emissions."
        },
        {
            "published_date": "2025-08-19T05:48:54",
            "title": "Italian glacier shrinking too fast to study",
            "author": "Silvia Stellacci",
            "url": "https://www.newcastleherald.com.au/story/9044801/italian-glacier-shrinking-too-fast-to-study",
            "url_media": "https://www.newcastleherald.com.au/images/transform/v1/crop/frm/silverstone-feed-data/974bcffc-f000-4017-a006-db823ceebe98.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has lost 1.7km in length since the first measuring benchmarks were positioned at the front of the glacier in 1895. The glacier has lost 431 metres in the past 10 years and half of that since 2021. The stakes used as benchmarks to measure the glacier's retraction each year are now buried under rockslides and debris. The Lombardy Glaciological Service will use drone imagery and remote sensing to keep track of the ongoing shrinkage."
        },
        {
            "published_date": "2025-08-19T05:48:54",
            "title": "Italian glacier shrinking too fast to study",
            "author": "Silvia Stellacci",
            "url": "https://www.dailyliberal.com.au/story/9044801/italian-glacier-shrinking-too-fast-to-study",
            "url_media": "https://www.dailyliberal.com.au/images/transform/v1/crop/frm/silverstone-feed-data/974bcffc-f000-4017-a006-db823ceebe98.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
            "country": "AU",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has melted due to climate change. Geologists can no longer measure it the way they have for the past 130 years due to melting glacier.      Â   in Italy's Ventina glacier has melted."
        },
        {
            "published_date": "2025-08-19T05:30:33",
            "title": "New Study: Corals Thrived In Warmer-Than-Today Temps And When Sea Levels Were Meters Higher",
            "author": "Kenneth Richard",
            "url": "https://notrickszone.com/2025/08/19/new-study-corals-thrived-in-warmer-than-today-temps-and-when-sea-levels-were-meters-higher",
            "url_media": "https://notrickszone.com/wp-content/uploads/2025/08/Corals-grow-rapidly-as-sea-levels-rise-to-2-m-above-present-and-experience-hiatus-periods-when-sea-levels-are-low-like-today-Hynes-2025.jpg",
            "country": "DE",
            "language": "en",
            "summary": "Coral reef growth was rapid from 10,000 to 6,000 years ago. Sea levels rose from the Early to Mid Holocene in this region up to 2 m higher than today. Today corals are only growing at rates of 1 mm per year, because the water depths are too low to accommodate reef expansion."
        },
        {
            "published_date": "2025-08-19T05:22:07",
            "title": "Italy's Ventina glacier has melted so much geologists now can only monitor it remotely",
            "author": "Silvia Stellacci",
            "url": "https://www.washingtonpost.com/world/2025/08/19/italy-ventina-glacier-melting/72c898e2-7cbc-11f0-971c-6c8e53bd2f21_story.html",
            "url_media": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHTQJLT4XQI7BFY4NSHFHPJPEE_size-normalized.jpg&w=1440",
            "country": "US",
            "language": "en",
            "summary": "Ventina glacier in northern Italy has melted due to climate change. Geologists can no longer measure it the way they have for the past 130 years. The stakes used to measure the glacier's retraction are buried under rockslides and debris. The terrain is too unsteady for future in-person visits."
        },
        {
            "published_date": "2025-08-19T05:18:27",
            "title": "Italy's Ventina Glacier Has Melted so Much Geologists Now Can only Monitor It Remotely",
            "author": "Ground AI",
            "url": "https://ground.news/article/italys-ventina-glacier-has-melted-so-much-geologists-now-can-only-monitor-it-remotely",
            "url_media": "https://web-api-cdn.ground.news/api/v04/images/story/rss_36772_1755582035375_7/webMetaImg?v=1",
            "country": "US",
            "language": "en",
            "summary": "Lombardy Glaciological Service will use drone imagery and remote sensing to monitor Italy's Ventina glacier. Since 1895, the glacier has lost 1.7 kilometers and shed 431 meters in the last 10 years. Glaciers lost 255 billion tons annually from 2000 to 2011 and 346 billion tons over the next decade."
        },
        {
            "published_date": "2025-08-19T05:18:26",
            "title": "Italy's Ventina glacier has melted so much geologists now can only monitor it remotely",
            "author": "SILVIA STELLACCI",
            "url": "https://www.yahoo.com/news/articles/italys-ventina-glacier-melted-much-051826852.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/EX6uCANjBU2tRIRmaxX3EQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Njk7Y2Y9d2VicA--/https://media.zenfs.com/en/ap.org/81d045417c09a03e58b7db9c142bc765",
            "country": "US",
            "language": "en",
            "summary": "Ventina glacier in northern Italy is melting due to climate change. Geologists can no longer measure it the way they have for the past 130 years. The glacier has already lost 1.7 kilometers in length since the first measuring benchmarks were positioned at the front of the glacier in 1895. Global warming is shrinking Europe's glaciers."
        },
        {
            "published_date": "2025-08-19T04:29:21",
            "title": "European Union Climate Service Records Hottest November",
            "author": "The Herald",
            "url": "https://www.latestnigeriannews.com/p/21210/delta-athletes-begin-camping-for-9th-nyg-as-bayelsa-shines-in-zonal-elimination.html",
            "url_media": "https://www.latestnigeriannews.com/favicon.ico",
            "country": "NG",
            "language": "en",
            "summary": "November 2020 was 0.8 degrees Celcius warmer than the average for 1981-2010's 0.1 degree Celcius, according to European Union's Copernicus Climate Change Service. November 2020 was the hottest November on record, the service managed by the European Commission said."
        },
        {
            "published_date": "2025-08-19T04:22:43",
            "title": "Climate change: Not my business",
            "author": "Emmanuel Onye-Amah",
            "url": "https://businessday.ng/opinion/article/climate-change-not-my-business",
            "url_media": "https://cdn.businessday.ng/2021/11/climate-change.jpg",
            "country": "NG",
            "language": "en",
            "summary": "Nigeria is facing the effects of climate change. Rising sea levels could displace millions of people in Nigeria in the next 30-50 years, as ocean surges swamp one of Africa's biggest cities, Lagos. The Thwaites Glacier, often referred to as the 'doomsday glacier', is in West Antarctica and covers an area larger than Florida, USA and a little less than Great Britain. It contributes four per cent to global sea level rise and continues to increase as the glaciers destabilise."
        },
        {
            "published_date": "2025-08-19T04:18:00",
            "title": "AI Aids Communities in Hurricane Season Prep",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/ai-aids-communities-in-hurricane-season-prep-1516950",
            "url_media": "https://news.rice.edu/sites/g/files/bxs2656/files/2025-08/featured109351264_l_copy.jpg",
            "country": "US",
            "language": "en",
            "summary": "Rice University researchers are at the forefront of using artificial intelligence (AI) to address climate challenges. The Advancing AI for Climate Risk and Urban Resilience (AI4UrbanResilience) research group unites climate scientists, engineers and AI experts to develop transformative solutions for extreme weather modeling and disaster response."
        },
        {
            "published_date": "2025-08-19T04:13:09",
            "title": "Waste dumps",
            "author": "The Newspaper",
            "url": "https://www.dawn.com/news/1931850/waste-dumps",
            "url_media": "https://www.dawn.com/_img/social-default.jpg",
            "country": "PK",
            "language": "en",
            "summary": "Murree and Galiyat are becoming a concrete jungle dotted by garbage dumps. Multi-storeyed buildings are the norm up in the mountains with no checks and balances on sewage and garbage disposal, parking spaces or basic building laws. Even Deosai plains, which were once considered inaccessible, have a deluge of tourists visiting. There is no waste disposal unit and there is no check on deforestation."
        },
        {
            "published_date": "2025-08-19T04:12:28",
            "title": "Hurricane Erin's massive waves threaten to isolate North Carolina's Outer Banks",
            "author": "Jf Bj",
            "url": "https://www.wellandtribune.ca/news/world/united-states/hurricane-erins-massive-waves-threaten-to-isolate-north-carolinas-outer-banks/article_bcbffedf-26dc-51b8-ba1e-6fd8956d9bfb.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/wellandtribune.ca/content/tncms/assets/v3/editorial/b/ad/bad5f76a-2328-589a-97ca-edf3d45ed849/68a3fb7a625f5.image.jpg?crop=1752%2C920%2C0%2C80&resize=1200%2C630&order=crop%2Cresize",
            "country": "CA",
            "language": "en",
            "summary": "The dunes on North Carolina's Outer Banks were destroyed by Hurricane Isabel in 2003. The dunes are now being rebuilt by bulldozer and bulldozer pushes sand along NC highway 12 in the Pea island National Wildlife Refuge, on the North Carolina Outer Banks."
        },
        {
            "published_date": "2025-08-19T04:00:08",
            "title": "Scarborough struggles with ‘gull muggings' as urban seabird population rises",
            "author": "Josh Halliday",
            "url": "https://www.theguardian.com/uk-news/2025/aug/19/scarborough-gull-muggings-urban-seabird-population",
            "url_media": "https://i.guim.co.uk/img/media/0760b87a3184faa3b5a096ec8e30bd54ecbb1f5c/958_0_7200_5760/master/7200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fc79637bd9ec94c2202b8506abfad260",
            "country": "GB",
            "language": "en",
            "summary": "There were 220 gull incidents on the Yorkshire coast between 2021 and June this year. Two-thirds of these related to 'attacks' and 'gull muggings'. The number of kittiwakes in Scarborough has risen from 1,527 in 2005 to 2,127 this year - a 39% increase. The most dramatic increase has been among those setting up nests on hotels, shopfronts."
        },
        {
            "published_date": "2025-08-19T03:50:00",
            "title": "Letter: We need a zero-emission power grid",
            "author": "",
            "url": "https://www.thedailynewsonline.com/opinion/letter-we-need-a-zero-emission-power-grid/article_386c57ea-1d36-4e62-9e2a-9752af49d826.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/thedailynewsonline.com/content/tncms/assets/v3/editorial/2/11/211cb628-b932-477f-889e-027344f7f340/641e59388ff85.image.jpg?crop=1764%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "New York State is experiencing one of the hottest summers on record. Scientists warned about the climate crisis 40 years ago, and it's clear we're suffering from it now.       in the article by the editor of this newspaper.  It's clear that we're in a climate crisis."
        },
        {
            "published_date": "2025-08-19T03:45:00",
            "title": "Deadly Nordic heat wave made 10 times worse by climate change: Study",
            "author": "",
            "url": "https://ground.news/article/deadly-nordic-heat-wave-made-10-times-worse-by-climate-change-study",
            "url_media": "https://web-api-cdn.ground.news/api/v04/images/story/rss_27321_1755578665598_5/webMetaImg?v=1",
            "country": "US",
            "language": "en",
            "summary": "A deadly heat wave in July left people and wildlife struggling in Norway, Sweden and Finland. It was made 10 times more likely because of human-induced climate change, according to the World Weather Attribution. The heat wave was unusual for its intensity and prolonicity."
        },
        {
            "published_date": "2025-08-19T03:13:27",
            "title": "Climate Scientists Grade Trump",
            "author": "부동산 부스트",
            "url": "https://n.news.naver.com/mnews/article/077/0006719916",
            "url_media": "https://imgnews.pstatic.net/image/077/2025/08/19/PAP20250819029401009_P2_20250819031327281.jpg?type=w800",
            "country": "KR",
            "language": "en",
            "summary": "Climate Scientists Grade Trump. Pieces of ice move through the sea in Qoornoq Island, near Nuuk, Greenland on Feb. 17, 2025, as seen in this photo taken by Emilio Morenatti, who is based in Italy and is an expert on climate change."
        },
        {
            "published_date": "2025-08-19T02:45:32",
            "title": "South Western Railway journeys disrupted - because the UK weather is too dry",
            "author": "Bradley Jolly",
            "url": "https://www.mirror.co.uk/news/uk-news/south-western-railway-journeys-disrupted-35753731",
            "url_media": "https://i2-prod.mirror.co.uk/article35753742.ece/ALTERNATES/s1200/1_Micheldever-Hampshire-England-UK-Woman-waving-from-platform-as-a-new-South-Western-Railway-passe.jpg",
            "country": "GB",
            "language": "en",
            "summary": "South Western Railway and C2C are among rail operators affected by the recent warm weather. Clay soil embankments on which some tracks sit have dried out and shrunk in the scorching heatwaves. Trains are being forced to run at 40mph instead of 85mph on sections of the route."
        },
        {
            "published_date": "2025-08-19T02:44:40",
            "title": "国家气候中心专家：高温正从单一极端事件演变为昼夜连续的复合灾害_手机网易网",
            "author": "每日经济新闻",
            "url": "https://m.163.com/news/article/K7ANQ73U0512B07B.html",
            "url_media": "https://nimg.ws.126.net/?url=https%3A%2F%2Fstatic.ws.126.net%2Ff2e%2Fwap%2Fcommon%2Fimages%2Fweixinfixed1200low.jpg&thumbnail=750x2147483647&quality=75&type=jpg",
            "country": "CN",
            "language": "en",
            "summary": "The content above is uploaded and posted by a user of NetEase Hao, which is a social media platform and only provides information storage services. The content above (including the pictures and videos if any) is 25% of the total content of the platform."
        },
        {
            "published_date": "2025-08-19T02:37:15",
            "title": "Extreme weather driving more event cancellations in recent years: study",
            "author": "",
            "url": "https://www.cbc.ca/player/play/video/9.6870170",
            "url_media": "https://i.cbc.ca/ais/486ffcf0-c0cb-4dfa-8c9d-d4433c242368,1755570996194/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3B",
            "country": "CA",
            "language": "en",
            "summary": "A recent study examined more than 2,100 events that had been disrupted by extreme weather, driven by global warming, over the last two decades. More events are being cancelled in recent years, and wildfires and air quality are among the top causes of event cancellation in Canada."
        },
        {
            "published_date": "2025-08-19T02:30:00",
            "title": "Melbourne weather: City freezes through coldest morning of the year, but there's warmth on the horizon",
            "author": "Grace Frost",
            "url": "https://www.news.com.au/national/victoria/melbourne-weather-city-freezes-through-coldest-morning-of-the-year-but-theres-sun-on-the-horizon/news-story/038c8066a1341d7dd47f3a7e66898dff",
            "url_media": "https://content.api.news/v3/images/bin/6c34c7df0481e16c2c7ee7499b96c079",
            "country": "AU",
            "language": "en",
            "summary": "Melbourne woke up to its coldest morning of the year, with the mercury dipping to a low of 1.6C at 7.30am. The last time it was this cold was back in August last year, when it dropped to 1.1C. The Bureau of Meteorology predicts another cold morning on Wednesday, followed by another sunny and mild day with a top of 20C on Thursday."
        },
        {
            "published_date": "2025-08-19T02:11:44",
            "title": "What to know about powerful Hurricane Erin as it heads past the US East Coast",
            "author": "San Francisco Chronicle",
            "url": "https://article.wn.com/view/2025/08/19/What_to_know_about_powerful_Hurricane_Erin_as_it_heads_past_",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "Island communities off the coast of North Carolina are bracing for flooding ahead of Hurricane Erin. The storm intensified to a Category 4 hurricane with 140 mph winds early Monday. Erin is the year's first Atlantic hurricane and is expected to be a Category 5 storm."
        },
        {
            "published_date": "2025-08-19T02:00:00",
            "title": "Greta Thunberg's Gaza stance ignites debate on protest and denial",
            "author": "Independent Australia",
            "url": "https://independentaustralia.net/politics/politics-display/greta-thunbergs-gaza-stance-ignites-debate-on-protest-and-denial,20061",
            "url_media": "https://independentaustralia.net/_lib/slir/w900-c4x3/i/article/img/article-20061-hero.jpg",
            "country": "AU",
            "language": "en",
            "summary": "As Greta Thunberg joins the Gaza flotilla, her activism forces a global reckoning with denial. Denial is one of several defence mechanisms elaborated upon by post-Freudians. It may save us from immediate anxiety, but its protection has a shelf life. Profiteers can engage the populace in complicity by casting doubt."
        },
        {
            "published_date": "2025-08-19T01:39:35",
            "title": "Indus Delta Crisis",
            "author": "",
            "url": "https://www.nation.com.pk/19-Aug-2025/indus-delta-crisis",
            "url_media": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
            "country": "PK",
            "language": "en",
            "summary": "The Indus River Delta, once a thriving ecological and economic lifeline for millions, is now facing an alarming decline. Over 1.2 million people have been displaced as farmland turns barren and fishing grounds are destroyed due to reduced freshwater flow and seawater intrusion. The deterioration of the delta is the result of multiple factors, including climate change, rising temperatures, and unsustainable upstream water usage."
        },
        {
            "published_date": "2025-08-19T01:32:02",
            "title": "Millions of Birds Are Migrating Across Wyoming This Season",
            "author": "Fedore",
            "url": "https://k2radio.com/wyoming-bird-migration-season",
            "url_media": "https://townsquare.media/site/101/files/2025/08/attachment-geese.jpg?w=1200&q=75&format=natural",
            "country": "US",
            "language": "en",
            "summary": "It's peak bird migration season in Wyoming from mid-August to mid-October. Over one million birds crossed the Cowboy State last night and about 269,000 crossed Natrona County. Birds migrate to find food and suitable nesting locations and return when conditions improve."
        },
        {
            "published_date": "2025-08-19T01:09:42",
            "title": "Storm drains connected to Ala Wai Canal could fail by 2050, UH researchers say",
            "author": "Catherine Cruz",
            "url": "https://www.hawaiipublicradio.org/the-conversation/2025-08-18/storm-drains-connected-to-the-ala-wai-canal-could-fail-by-2050",
            "url_media": "https://npr.brightspotcdn.com/dims4/default/aa7c615/2147483647/strip/true/crop/987x518+0+113/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F1a%2F3a1eb4a34e909ad209957b5a1c8e%2F060517-a-ad423-001.jpeg",
            "country": "US",
            "language": "en",
            "summary": "This week, University of Hawai'i researchers will meet with the mayor to discuss their research on sea level rise and flood risk. They found that by 2050 or between 2050 and 2060, we expect to see significant failure or flooding at a lot of the inlets in Waikīkī. "
        },
        {
            "published_date": "2025-08-19T00:52:34",
            "title": "What to know about powerful Hurricane Erin as it heads past the US East Coast",
            "author": "SAFIYAH RIDDLE",
            "url": "https://www.woonsocketcall.com/news/national_and_world_news/what-to-know-about-powerful-hurricane-erin-as-it-heads-past-the-us-east-coast/article_2a453d89-c958-5ce9-8e6f-b8cd236b4aca.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/woonsocketcall.com/content/tncms/custom/image/9c2d53b0-bba9-11ee-bab5-7f9eb3465271.png?resize=600%2C311",
            "country": "US",
            "language": "en",
            "summary": "Island communities off the coast of North Carolina are bracing for flooding ahead of the year's first Atlantic hurricane, Hurricane Erin, which is expected to make landfall on the east coast of the state on Friday.   Copyright 2025 The Associated Press. All rights reserved."
        },
        {
            "published_date": "2025-08-19T00:38:40",
            "title": "'Remain on alert': More wildfire activity expected across Canada, experts say",
            "author": "Kyle Duggan",
            "url": "https://www.cbc.ca/news/canada/british-columbia/canadian-widlfire-summer-activity-forecast-1.7612167",
            "url_media": "https://i.cbc.ca/1.7612192.1755556631!/cantoImage/httpImage/image.jpg_gen/derivatives/16x9_1180/mount-underwood-fire.jpg?im=Resize%3D620",
            "country": "CA",
            "language": "en",
            "summary": "Western provinces and the East Coast should remain on alert for the possibility of more wildfire activity throughout the rest of summer. Forecasters see above-average seasonal temperatures for most of the country over the next three months. The current wildfire season is Canada's second worst on record for how much land has burned in total. There are 707 active fires currently burning across the country, 68 of which are considered to be out of control. Since April, 165 emergency events have affected 134 First Nations communities."
        },
        {
            "published_date": "2025-08-19T00:38:03",
            "title": "Study: Climate change costing UK grassroots sport clubs £320m a year and rising",
            "author": "",
            "url": "https://www.businessgreen.com/news/4517842/study-climate-change-costing-uk-grassroots-sport-clubs-320m-rising",
            "url_media": "https://image.chitra.live/api/v1/wps/f902bc7/ce826532-bffb-4180-830a-e89c2fa52623/1/iStock-1208004218-370x229.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Extreme weather caused by climate change is causing damage and disruption to local sports facilities, clubs and competitions up and down the country to the tune of £320m a year and rising, according to the report.       .  . "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "I just moved to Australia from the UK. Why do they all keep a huge ...",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/08/19/I_just_moved_to_Australia_from_the_UK_Why_do_they_all_keep_a",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Since 2022, much of Australia has seen record-breaking downpours. For expats, the idea of moving to Australia conjures images of endless sunshine, golden beaches and barbecues by the ocean. For those who've actually made the move, they say Aussies don't warn you about the rain."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "2026 Taoxichuan Art Center Residency Open Call",
            "author": "Nasdaq Globe Newswire",
            "url": "https://article.wn.com/view/2025/08/19/2026_Taoxichuan_Art_Center_Residency_Open_Call",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Taoxichuan Art Center officially launches the 2026 \"Migratory Birds\" exhibition in Jeddah, China on August 19, 2025. Taoxichan Art Center is a Chinese art center based in Jiedezhhen, China. "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Deadly Nordic heat wave made 10 times worse by climate change: Study",
            "author": "Mongabay",
            "url": "https://article.wn.com/view/2025/08/19/Deadly_Nordic_heat_wave_made_10_times_worse_by_climate_chang",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A deadly heat wave in July left people and wildlife struggling in Norway, Sweden and Finland. It was made at least 10 times more likely because of human-induced climate change, according to scientists from the World Weather Attribution (WWA), a global research network analyzing extreme weather events."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Europe's heatwave not a sign of NZ summer trends, experts say",
            "author": "Newstalk ZB",
            "url": "https://article.wn.com/view/2025/08/19/europe_x27s_heatwave_not_a_sign_of_nz_summer_trends_experts_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Europe is experiencing another heatwave. Earth Sciences New Zealand says it won't be a precursor for New Zealand's summer. Europe is a long way away and the climate drivers that affect their weather are different from ours, according to the Earth Sciences.   "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Italy's Ventina glacier has melted so much geologists now can only monitor it remotely",
            "author": "SILVIA STELLACCI",
            "url": "https://article.wn.com/view/2025/08/19/italy_8217s_ventina_glacier_has_melted_so_much_geologists_no",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ventina glacier in northern Lombardy has melted due to climate change. Geologists can no longer measure it the way they have for the past 130 years. After this year's hot summer, geologists can't measure it any more as it's no longer normal."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Protect climate research, limit bike speed on bridges, prioritize SC, support food banks",
            "author": "File/Lynne Sladky/AP",
            "url": "https://www.postandcourier.com/opinion/letters_to_editor/opinion-letters-protect-research-funding-slow-bikes-prioritize-sc-food-banks/article_ca7a8d33-9b62-4ed3-ba62-fa9e416a387a.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/assets/v3/editorial/d/cb/dcb735fc-5f2f-4294-b1d8-4d05427d0699/689e6e49dca5d.image.jpg?crop=1762%2C926%2C0%2C124&resize=1200%2C631&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "The Trump administration's fiscal 2026 budget proposes gutting the programs that help us stay safe. The programs are vital to South Carolina's safety and economy. Rep. Mark Smith is running for the 1st Congressional District seat in South Carolina, but his top priorities are securing the U.S.-Mexico border, cutting wasteful spending, fixing the national debt and working with President Donald Trump to carry out his \"America First\" agenda."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "EDITORIAL: Port Charlotte complex will be a showplace",
            "author": "",
            "url": "https://www.yoursun.com/charlotte/opinion/editorials/editorial-port-charlotte-complex-will-be-a-showplace/article_1121f1d0-d339-4d6b-8c53-e0be7bff5073.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/yoursun.com/content/tncms/custom/image/4d8ebfa6-5831-11ec-a20e-ebb43d093524.jpg",
            "country": "US",
            "language": "en",
            "summary": "There are no cost overruns for the Port Charlotte Beach complex rebuild. Hurricanes Helene and Milton complicated things and drove up the costs. The replacement of the main building at the complex and a new pool were already planned, so the rumblings in the county are off base."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "What's Causing Intense Rain In Mumbai? 2 Reasons Behind The Current Downpour In The City",
            "author": "News18",
            "url": "https://article.wn.com/view/2025/08/19/Whats_Causing_Intense_Rain_In_Mumbai_2_Reasons_Behind_The_Cu",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A low-pressure system in the Bay of Bengal has pumped copious amounts of moisture westward into the Arabian Sea and further towards Mumbai, according to the weather forecasters.       in the area is expected to continue for a while. "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Life-threatening storm warnings issued as Hurricane Erin moves toward US East Coast",
            "author": "The Daily Mail",
            "url": "https://article.wn.com/view/2025/08/19/Lifethreatening_storm_warnings_issued_as_Hurricane_Erin_move",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Hurricane Erin has intensified and is bringing dangerous conditions to the US East Coast over the next several days. Storm Surge Warning has been issued for the North Carolina coastline from Cape Lookout to Duck, warning of life-threatening flooding.      "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "'Tropical Wave Train' Forms Behind Hurricane Erin in Atlantic",
            "author": "Newsweek",
            "url": "https://article.wn.com/view/2025/08/19/Tropical_Wave_Train_Forms_Behind_Hurricane_Erin_in_Atlantic",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The NHC is monitoring Hurricane Erin and two disturbances in the Atlantic. It is tracking Erin and monitoring the disturbances. It's also monitoring two other disturbances in that area as well. It will monitor these disturbances for the next few days. It has no immediate impact on Hurricane Erin."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "The Nonsense Narrative Of Climate Change As An Existential Crisis",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/08/19/The_Nonsense_Narrative_Of_Climate_Change_As_An_Existential_C",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The far left and mainstream media have created a Doomsday narrative about climate change. This is scientifically unwarranted and counterproductive to taking action on climate change, according to Dr. Andrew Hammond. He believes the media and left-wingers are creating a false and dangerous narrative."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "World Mosquito Day: ‘Rise in dengue cases fuelled by climate change, globalisation'",
            "author": "The Times",
            "url": "https://article.wn.com/view/2025/08/19/World_Mosquito_Day_Rise_in_dengue_cases_fuelled_by_climate_c",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There is a rise in dengue fever cases because of climate change and increasing globalisation. Other mosquito-borne diseases like malaria and chikungunya are also on the rise because of the same factors, according to health experts.    "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Coastal studies to combat erosion and climate risks",
            "author": "Cook Islands News",
            "url": "https://article.wn.com/view/2025/08/19/Coastal_studies_to_combat_erosion_and_climate_risks",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Coastal feasibility studies have commenced on Rarotonga and Aitutaki through the National Environment Service (NES) and international consultancy firm Beca International Consultants Ltd. NES says this work responds to growing concerns around shoreline erosion, climate risks and unregulated development in vulnerable areas."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "In Africa, heat waves are hotter and longer than 40 years ago, UIC researchers say (University of Illinois at Chicago)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/08/19/In_Africa_heat_waves_are_hotter_and_longer_than_40_years_ago",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In Africa, heat waves are hotter and longer than 40 years ago, according to UIC researchers. Heat waves in Africa have grown more intense and longer over the past decades, they say. Heat wave is a prolonged period of abnormally hot weather.  "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Scientists Find Evidence That You're a Hypocrite Who's Causing More Than Your Share of Climate Change",
            "author": "Futurism",
            "url": "https://article.wn.com/view/2025/08/19/Scientists_Find_Evidence_That_Youre_a_Hypocrite_Whos_Causing",
            "url_media": "https://article.wn.com/view/2025/08/19/[]",
            "country": "US",
            "language": "en",
            "summary": "According to a recent study, most Americans don't realize the impact of their individual actions on climate change. People over-assign the carbon impact of some of their actions to low-impact ones, like recycling and switching to more energy-efficient appliances, and under-estimate the carbon footprint of more intensive ones like flying or eating meat."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Hurricane Erin Threatens East Coast With Heavy Waves, Floods",
            "author": "Live Mint",
            "url": "https://article.wn.com/view/2025/08/19/Hurricane_Erin_Threatens_East_Coast_With_Heavy_Waves_Floods",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Erin is expected to grow larger as it churns past the Bahamas. Erin is raising the risk of high winds and flooding along North Carolina's beaches.   Â   in the Bahamas, avoiding land, but raising the chance of flooding hundreds of miles away."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Exploring the dynamic interactions between El Ni�o-Southern Oscillation and tropical basins",
            "author": "Phys Dot Org",
            "url": "https://article.wn.com/view/2025/08/19/Exploring_the_dynamic_interactions_between_El_Ni_oSouthern_O",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Earth's climate is a dynamic system of interconnected physical processes and events occurring around the globe. Many of these processes are coupled. Earth's climate has many interdependent physical processes, events, and processes. Earth is a part of this dynamic system, and many of them are related. "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "'It was 30 degrees inside the flat for two weeks': London's new-build heatwave nightmare",
            "author": "AOL",
            "url": "https://article.wn.com/view/2025/08/19/It_was_30_degrees_inside_the_flat_for_two_weeks_Londons_newb_c",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Gareth Humphreys moved into a shared ownership flat in Newham, east London, in November. It was 30 degrees inside the flat for two weeks during the last heatwave from June into July. Experts warn UK homes are unfit to deal with global warming. "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Israel Prime Minister Benjamin Netanyahu says Anthony Albanese ‘betrayed' Israel",
            "author": "Virtual Jerusalem",
            "url": "https://article.wn.com/view/2025/08/19/Israel_Prime_Minister_Benjamin_Netanyahu_says_Anthony_Albane",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Israeli PM has launched an extraordinary personal attack on the Australian PM Anthony Albanese, claiming he has 'betrayed' him. The PM claims that Albanese has betrayed him.   .    Google Alert – Israel is an official Google Alert."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "At Europe's melting glaciers, signs of climate peril are everywhere",
            "author": "NBC News",
            "url": "https://article.wn.com/view/2025/08/19/At_Europes_melting_glaciers_signs_of_climate_peril_are_every",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The trail leading up to Morteratsch glacier gets a little longer every month. It's almost 7,000 feet above sea level and leads to the glacier. It starts at 7,500 feet above the current level.      . "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "What to know about Hurricane Erin as it heads past the US East Coast",
            "author": "Cleveland",
            "url": "https://article.wn.com/view/2025/08/19/What_to_know_about_Hurricane_Erin_as_it_heads_past_the_US_Ea",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Island communities off the coast of North Carolina are bracing for flooding ahead of Hurricane Erin. Erin is the first Atlantic hurricane of the year and is expected to make landfall on the east coast of the U.S. later this week.    "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Somalia: Tensions Rise in Puntland As 18 Foreign Vessels Enter Local Waters",
            "author": "All Africa",
            "url": "https://article.wn.com/view/2025/08/19/Somalia_Tensions_Rise_in_Puntland_As_18_Foreign_Vessels_Ente",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Boosaaso, Puntland, is one of the coastal communities in Somalia's Bari region that are facing tensions due to ethnic tensions.    - i.e. because of the presence of ethnic groups from the north and south of Somalia."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Here's what Myrtle Beach can expect as Hurricane Erin roars through the Atlantic, forecasts say",
            "author": "The Sun News",
            "url": "https://article.wn.com/view/2025/08/19/Here_s_what_Myrtle_Beach_can_expect_as_Hurricane_Erin_roars_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Erin is a Category 4 hurricane heading across the Atlantic. It is expected to hit Myrtle Beach, South Carolina, on Monday.    Experts say the storm will impact the South Carolina coast, but it's still unclear how it will affect the area."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Hurricane Erin's clouds hide bright sights, but other wonders are visible: Sky Watch",
            "author": "Atlantic City",
            "url": "https://article.wn.com/view/2025/08/19/Hurricane_Erins_clouds_hide_bright_sights_but_other_wonders_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A surprising expansion of Hurricane Erin is throwing clouds along the coast for the next three days, changing what cosmic sights you'll get to behold.      Â   .   for this reason, the clouds will be moving along the coastline. "
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Twenty Years After Katrina: How Levee Failures Changed America (GeorgiaTech - Georgia Institute of Technology)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/08/19/Twenty_Years_After_Katrina_How_Levee_Failures_Changed_Americ",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Twenty years after Hurricane Katrina's landfall, its legacy of destruction, displacement and deepened inequality continues to shape communities and challenge disaster preparedness across the U.S. This is an article about the legacy of Hurricane Katrina and its impact on communities and preparedness."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Mayor calls for collective action to tackle increased wildfire risks (Greater London Authority)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/08/19/Mayor_calls_for_collective_action_to_tackle_increased_wildfi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "This summer the London Fire Brigade has responded to 64 wildfires, compared to 19 in the entire summer of 2020. This is because of climate change. London, across the country and parts of Europe are experiencing extreme weather conditions due to climate change, especially in the summer."
        },
        {
            "published_date": "2025-08-19T00:00:00",
            "title": "Safety Lapses and Human Mistakes Drive Surge in Kenya's Air Disasters",
            "author": "",
            "url": "https://www.mwakilishi.com/article/kenya-news/2025-08-19/safety-lapses-and-human-mistakes-drive-surge-in-kenyas-air-disasters",
            "url_media": "https://www.mwakilishi.com/sites/default/files/styles/large/public/2025-08/image-1200x600%20%2881%29%20%281%29.jpg?itok=521E3czh",
            "country": "KE",
            "language": "en",
            "summary": "Kenya's aviation sector is under scrutiny after a series of fatal air accidents. The most recent tragedy occurred in Mwihoko, Nairobi, where an AMREF Flying Doctors aircraft crashed, killing all those on board and innocent bystanders on the ground. This marks the third major air accident in Kenya within a year. Aviation experts warn that the core issue may not be mechanical failure alone."
        }
    ]
}